local map = {

['武馆武馆前厅'] = {
  id = '武馆武馆前厅',
  area = '武馆',
  name = '武馆前厅',
  desc =  [[这是一间完全用花岗岩砌成的房子，两旁的墙壁上插着松油火把，把大厅照的通亮，寂静的大厅中不时响起火把噼啪的燃烧声。大厅的正中摆放着一张太师椅，两旁分列着十几把椅子，正面的墙上挂着一面缕金的横匾(bian)。再往北去就是武馆的前院了。]],
  exit = {
    s = { to = '武馆门廊', },
    n = { to = '武馆武馆前院', },
  },
},

['武馆兵器库'] = {
  id = '武馆兵器库',
  area = '武馆',
  name = '兵器库',
  desc =  [[这里是武馆的兵器库，周围的兵器架上放着很多兵器，刀，剑，矛，戟等十八般兵器排列整齐。一群武馆弟子正站在架前挑选自己合手的兵刃。北面就是练武场了，里面很多人正练的热火朝天呢。]],
  exit = {
    n = { to = '武馆东练武场', },
  },
},

['武馆帐房'] = {
  id = '武馆帐房',
  area = '武馆',
  name = '帐房',
  desc =  [[这里是武馆的帐房，四壁雪白的墙，中间有个大柜台，柜台前上方挂着一块牌子（paizi）， 房里挤满了来存取钱款的武馆弟子，显得十分嘈杂。帐房先生是个五十多岁的老头，看见你走了进来，他笑嘻嘻地迎了上来。]],
  exit = {
    n = { to = '武馆东廊#2', },
  },
},

['武馆东廊#2'] = {
  id = '武馆东廊#2',
  area = '武馆',
  name = '东廊',
  desc =  [[这是一条走廊，廊顶描绘着江南秀美的风景。每两根翠绿色的柱子间相隔也就两三尺的距离，朱红色的琉璃瓦，嫩黄色的地砖。在走廊里面，丫鬟、奴仆们走来走去，都忙着自己的事情，不敢有一点怠慢。东西两边都是走廊，北面就是老馆主的书房了。]],
  exit = {
    e = { to = '武馆东廊#3', },
    w = { to = '武馆东廊#1', },
    s = { to = '武馆帐房', },
    n = { to = '武馆书房', },
  },
},

['武馆后院#C'] = {
  id = '武馆后院#C',
  area = '武馆',
  name = '后院',
  desc =  [[这里就是武馆的后院了，四周种满了各种蔬菜，往北是一块庄稼地，东面用篱笆围起的菜园，里面种着各样的菜，篱笆很破烂，摇摇欲坠。西面是间柴房，从窗户中可以见到松柴稻草堆得满满的。]],
  exit = {
    e = { to = '武馆菜园', },
    s = { to = '武馆白石路', },
    w = { to = '武馆柴房', },
    n = { to = '武馆菜地', },
  },
},

['武馆驿馆'] = {
  id = '武馆驿馆',
  area = '武馆',
  name = '驿馆',
  desc =  [[这是武馆的驿馆，房间很大，弥散着一股牲畜和人夹杂的气味。周围停着好几辆大车，马儿不停地嘶鸣着。一位老车夫，专门带武馆刚出门的弟子去江湖各大门派，他一见你走过来，不敢怠慢，带着笑脸连忙迎上前去。驿馆的中间有根木柱，柱子上挂着一块牌子（paizi）。]],
  exit = {
    e = { to = '武馆门廊', },
  },
},

['武馆西练武场'] = {
  id = '武馆西练武场',
  area = '武馆',
  name = '西练武场',
  desc =  [[这里是个露天练武场，门口写着一块牌子（paizi）。好多人在这里辛苦的练着，你走在场中，可是没有人回头看你一眼，都在聚精汇神的练着自己的功夫，墙角挂着一排大大的沙袋（shadai），一些人正在用沙袋练功。]],
  exit = {
    e = { to = '武馆小石路', },
    w = { to = '武馆西武场', },
    s = { to = '武馆小路', },
    n = { to = '武馆西廊#2', },
  },
},

['武馆马厩'] = {
  id = '武馆马厩',
  area = '武馆',
  name = '马厩',
  desc =  [[这是武馆的马厩，里面臭烘烘的，养了几十匹马，马夫们把马牵到这里好生照看，将它们喂饱饮足，再洗刷得干乾净净。马厩中堆放著几堆草料，正中有一口泔槽，里面有些清水。]],
  exit = {
    n = { to = '武馆小路', },
  },
},

['武馆回廊'] = {
  id = '武馆回廊',
  area = '武馆',
  name = '回廊',
  desc =  [[这是一条回廊，廊顶描绘着江南秀美的风景。每两根翠绿色的柱子间相隔也就两三尺的距离，朱红色的琉璃瓦，嫩黄色的地砖。在走廊里面，丫鬟、奴仆们走来走去，都忙着自己的事情，不敢有一点怠慢。往东能看见一条小径通向后花园的，西面是一条很长的走廊。 ]],
  exit = {
    w = { to = '武馆东廊#3', },
    e = { to = '武馆石径', },
  },
},

['武馆菜地'] = {
  id = '武馆菜地',
  area = '武馆',
  name = '菜地',
  desc =  [[这里是一座极大的菜园，种满了油菜，萝卜，茄子，丝瓜之类。周围的篱笆都破了，看来要整修了。由于长期得不到良好的照顾，菜地里杂草丛生，种的菜都长势不好，蔫蔫的，地都荒了。]],
  exit = {
    s = { to = '武馆后院#C', },
  },
},

['武馆小径'] = {
  id = '武馆小径',
  area = '武馆',
  name = '小径',
  desc =  [[一条曲曲折折用鹅卵石铺成的小径, 路两旁绿柳成荫, 一处处山石花木点缀在其中。你走在石地上，脚下啪嗒啪嗒地发出清脆的响声，前方有道小门，穿过门就能到后花园了。]],
  exit = {
    s = { to = '武馆石径', },
    n = { to = '武馆后花园', },
  },
},

['武馆女休息室'] = {
  id = '武馆女休息室',
  area = '武馆',
  name = '女休息室',
  desc =  [[这里是武馆内的休息室，由于经常打扫地非常干净，所以屋子透出一股清新的气息。一排床铺靠墙摆着，不断的有人进来休息或醒后离去，你也悄悄的找个空铺睡了起来。]],
	label = { sleep = true },
  exit = {
    n = { to = '武馆东廊#3', },
  },
},

['武馆男休息室'] = {
  id = '武馆男休息室',
  area = '武馆',
  name = '男休息室',
  desc =  [[这里是武馆内的休息室，由于经常打扫地非常干净，所以屋子透出一股清新的气息。一排床铺靠墙摆着，不断的有人进来休息或醒后离去，你也悄悄的找个空铺睡了起来。]],
	label = { sleep = true },
  exit = {
    s = { to = '武馆东廊#3', },
  },
},

['武馆柴房'] = {
  id = '武馆柴房',
  area = '武馆',
  name = '柴房',
  desc =  [[刚进屋就被屋里叮叮哐哐的声音所吸引，你仔细一看，里面堆满了松柴稻草。很多人忙碌地在墙边劈柴，屋子特别大，屋子一边堆满了已经锯短的木头，但是另一边劈好的柴却并不见多。]],
  exit = {
    e = { to = '武馆后院#C', },
  },
},

['武馆小路'] = {
  id = '武馆小路',
  area = '武馆',
  name = '小路',
  desc =  [[这是一条青石板铺成的小路，两边绿树成荫，不时有些仆人和丫鬟从你身边走来走去。往北就是西练武场了，南面传出马匹的嘶鸣声，而西面传来很吵杂的响声，东面却是静悄悄的。]],
  exit = {
    e = { to = '武馆水房', },
    w = { to = '武馆木房', },
    s = { to = '武馆马厩', },
    n = { to = '武馆西练武场', },
  },
},

['武馆破祠堂'] = {
  id = '武馆破祠堂',
  area = '武馆',
  name = '破祠堂',
  desc =  [[穿过后花园就来到破祠堂内。里面空荡荡的，地上满是灰尘，桌椅都是甚为残破，看来很长时间没人光顾了。屋角蜷缩着一个满身是灰，蓬头垢面的中年乞妇，一个人在那里喃喃自语。]],
  exit = {
    sw = { to = '武馆后花园', },
    hidden = { to = '武馆后院#E', cmd = 'zuan dong', },
  },
},

['武馆后院#E'] = {
  id = '武馆后院#E',
  area = '武馆',
  name = '后院',
  desc =  [[这里落脚似乎是一个大院了，四周堆满了杂物，似乎很久没有人来，远远望去是馆主冬暖阁的窗口。只是四周墙壁似乎有些奇怪。东面墙总感觉像新砌的一样；西面墙确是下面一小半陷落，似乎可以从洞口钻过去。]],
  exit = {
    hidden1 = { to = '武馆破祠堂', cmd = 'zuan dong', },
    hidden2 = { to = '武馆冬暖阁', cmd = 'tiao chuang', cond = 'player.enable.dodge and player.enable.dodge.level >= 100', },
  },
},

['武馆东厢房'] = {
  id = '武馆东厢房',
  area = '武馆',
  name = '东厢房',
  desc =  [[这里是馆主独子万圭和戚芳居住的东厢房，透着一股醉人的芳香，令你心旷神怡。在房间的一角摆放着一张梳妆台，台上摆着一些女人用的胭脂粉和用来涂抹嘴唇的香粉，以及一瓶玉露。往里走就是卧室了。]],
  exit = {
    e = { to = '武馆睡房', },
    w = { to = '武馆走廊#2', },
  },
},

['武馆东练武场'] = {
  id = '武馆东练武场',
  area = '武馆',
  name = '东练武场',
  desc =  [[这里是个露天练武场，门口写着一块牌子（paizi）。好多人在这里辛苦的练着，你走在场中，可是没有人回头看你一眼，都在聚精汇神的练着自己的功夫，场子的东角有一个沙坑(shakeng)。]],
  exit = {
    e = { to = '武馆东武场', },
    w = { to = '武馆碎石路', },
    s = { to = '武馆兵器库', },
  },
},

['武馆睡房'] = {
  id = '武馆睡房',
  area = '武馆',
  name = '睡房',
  desc =  [[蝴蝶粉贝双灯，静静地燃着，沁着淡淡一片粉红光色，宽敞的睡房，布置得可真雅致，尤其是临窗处的一溜菊花盆景，衬着轻轻挽起，薄如蝉翼的纱幔，整个卧室呈现出一派高洁清雅。。]],
  exit = {
    w = { to = '武馆东厢房', },
  },
},

['武馆走廊#1'] = {
  id = '武馆走廊#1',
  area = '武馆',
  name = '走廊',
  desc =  [[这是一条长廊，廊顶描绘着江南秀美的风景。每两根翠绿色的柱子间相隔也就两三尺的距离，朱红色的琉璃瓦，嫩黄色的地砖。在长廊里面，丫鬟、奴仆们走来走去，都忙着自己的事情，不敢有一点怠慢。往北面走就能到馆主的卧室了，南面是武馆的大厅。]],
  exit = {
    out = { to = '武馆武馆大厅', },
    n = { to = '武馆走廊#2', },
  },
},

['武馆东武场'] = {
  id = '武馆东武场',
  area = '武馆',
  name = '东武场',
  desc =  [[ 这里是个露天练武场，门口写着一块牌子（paizi）。好多人在这里辛苦的练着，你走在场中，可是没有人回头看你一眼，都在聚精汇神的练着自己的功夫，墙边放着几个练功用的木人（muren）。]],
  exit = {
    w = { to = '武馆东练武场', },
  },
},

['武馆书房'] = {
  id = '武馆书房',
  area = '武馆',
  name = '书房',
  desc =  [[这里是老馆主的书房，但馆主已经很久没来这里了。到是五弟子卜垣经常来这里，顺便指导一些喜欢读书的小孩们。书房周围的书架上整整齐齐地堆放着很多书籍。正对大门的那边墙上写了几个醒目的大字（dazi）。]],
  exit = {
    s = { to = '武馆东廊#2', },
  },
},

['武馆冬暖阁'] = {
  id = '武馆冬暖阁',
  area = '武馆',
  name = '冬暖阁',
  desc =  [[这里是武馆馆主万震山的卧室，房子并不大，很整洁简朴，被子叠的整整齐齐，帐子挂了起来，靠窗边摆了一盘盆景，一张小桌，放着几本书。几缕阳光透过窗外的绿荫中直射进来。]],
  exit = {
    s = { to = '武馆走廊#2', },
    hidden = { to = '武馆后院#E', cmd = 'tiao chuang', cond = 'player.enable.dodge and player.enable.dodge.level >= 100', },
  },
},

['武馆后花园'] = {
  id = '武馆后花园',
  area = '武馆',
  name = '后花园',
  desc =  [[这是是武馆的后花园，左侧方有个大池塘，池水甚清，还有一双白鹅，在水里来回嬉戏。池旁有几块太湖石，石边放着一张小几，小几上放着一个香炉，香炉中留着三柱残香，好象刚有人在此停留。]],
  exit = {
    s = { to = '武馆小径', },
    ne = { to = '武馆破祠堂', },
  },
},

['武馆白石路'] = {
  id = '武馆白石路',
  area = '武馆',
  name = '白石路',
  desc =  [[这是一条白石板铺成的小路，两边绿树成荫，不时有些仆人和丫鬟从你身边走来走去。往北走就是后院了，菜地，菜园和柴房都在那里。南面是一条走廊，能闻到阵阵传来的香气，你肚子不由的“咕咕”叫了起来。]],
  exit = {
    s = { to = '武馆西廊#2', },
    n = { to = '武馆后院#C', },
  },
},

['武馆水房'] = {
  id = '武馆水房',
  area = '武馆',
  name = '水房',
  desc =  [[一进屋，你看见屋内放着几口大缸（gang），好象是装水用的，不过缸似乎都是空的。一群武馆的弟子正在忙碌的挑着水，水房管事在一边吆喝着，督促众人不要偷懒。]],
  exit = {
    w = { to = '武馆小路', },
  },
},

['武馆东廊#3'] = {
  id = '武馆东廊#3',
  area = '武馆',
  name = '东廊',
  desc =  [[这是一条走廊，廊顶描绘着江南秀美的风景。每两根翠绿色的柱子间相隔也就两三尺的距离，朱红色的琉璃瓦，嫩黄色的地砖。在走廊里面，丫鬟、奴仆们走来走去，都忙着自己的事情，不敢有一点怠慢。往东过了回廊就能到后花园了，北面是男弟子的休息室，而南面是女弟子的休息室。]],
  exit = {
    e = { to = '武馆回廊', },
    w = { to = '武馆东廊#2', },
    s = { to = '武馆女休息室', cond = 'player.gender == "female"', },
    n = { to = '武馆男休息室', cond = 'player.gender == "male"', },
  },
},

['武馆文霞亭'] = {
  id = '武馆文霞亭',
  area = '武馆',
  name = '文霞亭',
  desc =  [[这是一个宝蓝色，琉璃顶盖儿的六角小亭。武馆里的内眷若是喜欢，闲着无事，总喜欢在这里坐坐。亭子周围，花叶扶疏，秀石耸峙，奇花异草，间以苍松翠柏，布置得甚为幽雅，透过一天星月，更似景致如画。南面有座假山。]],
  exit = {
    w = { to = '武馆石径', },
    s = { to = '武馆假山', },
  },
},

['武馆武馆大厅'] = {
  id = '武馆武馆大厅',
  area = '武馆',
  name = '武馆大厅',
  desc =  [[这里是武馆大厅，正中靠北摆着一张八仙桌，桌上供着关公的神位，旁边放着两个青瓷花瓶，插着几支孔雀翎，墙上写着大大的一个“武”字，武馆主人早些年在江湖上闯荡，现今洗手隐退，在襄阳开起了这间武馆，往北走有条走廊，一直通向馆主的卧室。西面通向厨房，往东走就可以到后花园了。]],
  exit = {
    ed = { to = '武馆东廊#1', },
    sd = { to = '武馆武馆前院', },
    se = { to = '武馆物品房', },
    wd = { to = '武馆西廊#1', },
    enter = { to = '武馆走廊#1', },
  },
},

['武馆菜园'] = {
  id = '武馆菜园',
  area = '武馆',
  name = '菜园',
  desc =  [[这里是一座极大的菜园，种满了油菜，萝卜，茄子，丝瓜之类。周围的篱笆都破了，看来要整修了。菜园旁有几口大缸，里面盛满了水，可是菜地看起来都干裂了，几棵菜蔫蔫的长着，是缺水太多了。]],
  exit = {
    w = { to = '武馆后院#C', },
  },
},

['武馆走廊#2'] = {
  id = '武馆走廊#2',
  area = '武馆',
  name = '走廊',
  desc =  [[这是一条长廊，廊顶描绘着江南秀美的风景。每两根翠绿色的柱子间相隔也就两三尺的距离，朱红色的琉璃瓦，嫩黄色的地砖。在长廊里面，丫鬟、奴仆们走来走去，都忙着自己的事情，不敢有一点怠慢。北面就是馆主的卧室了，东西两面各是东，西厢房。]],
  exit = {
    e = { to = '武馆东厢房', },
    s = { to = '武馆走廊#1', },
    n = { to = '武馆冬暖阁', },
  },
},

['武馆门廊'] = {
  id = '武馆门廊',
  area = '武馆',
  name = '门廊',
  desc =  [[武馆进大门后要往里走，必须穿过这个门廊。廊顶描绘着江南秀美的风景。每两根翠绿色的柱子间相隔也就两三尺的距离，朱红色的琉璃瓦，嫩黄色的地砖。门廊正中站着一个少年，看见你来了，他笑嘻嘻地迎了上来。往北走就进入武馆的前院了。]],
  exit = {
    n = { to = '武馆武馆前厅', },
    w = { to = '武馆驿馆', },
    out = { to = '襄阳城武馆大门', cond = 'player.exp >= 3000 and player.flag["asked 离馆"]', },
  },
},

['武馆西廊#2'] = {
  id = '武馆西廊#2',
  area = '武馆',
  name = '西廊',
  desc =  [[这是一条走廊，廊顶描绘着江南秀美的风景。每两根翠绿色的柱子间相隔也就两三尺的距离，朱红色的琉璃瓦，嫩黄色的地砖。在走廊里面，丫鬟、奴仆们走来走去，都忙着自己的事情，不敢有一点怠慢。西面传出阵阵诱人的香气，往北走就到了后院，南面是一个练武场。]],
  exit = {
    e = { to = '武馆西廊#1', },
    w = { to = '武馆厨房', },
    s = { to = '武馆西练武场', },
    n = { to = '武馆白石路', },
  },
},

['武馆假山'] = {
  id = '武馆假山',
  area = '武馆',
  name = '假山',
  desc =  [[这里属于武馆的后花园，里面奇石嶙峋，平时很少有人到这里来。花花草草有的也已经凋谢了。左首的一块假山上有一条缝隙（feng）大的可以藏下各把人。南面小路就是通向竹林的，路前挂了一块牌子（paizi）。]],
  exit = {
    s = { to = '武馆竹林#M', handler = 'simple_path_set_pos', },
    n = { to = '武馆文霞亭', },
  },
},

['武馆竹林#M'] = {
  id = '武馆竹林#M',
  area = '武馆',
  name = '竹林',
  desc =  [[这里是一大片密密的竹林，郁郁葱葱，一眼望不到尽头。微风吹拂着竹叶，令人尘心为之一涤，你在竹林里来回来去的走，想要找到出来的路，但是走了半天后发现还是没有找到出来的路。]],
  exit = {
    s = { to = '武馆竹林#M', },
    n = { to = '武馆竹林#M', },
    w = { to = '武馆竹林#M', },
    e = { to = '武馆竹林#M', },
    hidden = { to = '武馆竹林#E', cost = 3, handler = 'simple_path', },
  },
},

['武馆竹林#E'] = {
  id = '武馆竹林#E',
  area = '武馆',
  name = '竹林',
  desc =  [[这里是一大片密密的竹林，郁郁葱葱，一眼望不到尽头。微风吹拂着竹叶，令人尘心为之一涤，你在竹林里来回来去的走，想要找到出来的路，但是走了半天后发现还是没有找到出来的路。]],
  exit = {
    s = { to = '武馆竹林#M', },
    n = { to = '武馆竹林#M', },
    w = { to = '武馆假山', },
    e = { to = '武馆竹林#M', },
  },
},

['武馆碎石路'] = {
  id = '武馆碎石路',
  area = '武馆',
  name = '碎石路',
  desc =  [[这是一条青石板铺成的小路，两边绿树成荫，不时有些仆人和丫鬟从你身边走来走去。往西走就到了前院，一大群弟子围在那里，不知道在看什么。东边过去就能到练武场了，南面是一间偏厅。]],
  exit = {
    e = { to = '武馆东练武场', },
    w = { to = '武馆武馆前院', },
    s = { to = '武馆练功房', },
  },
},

['武馆木房'] = {
  id = '武馆木房',
  area = '武馆',
  name = '木房',
  desc =  [[刚进屋，你就被巨大的锯木声吵住了，这里堆了好多长的木头，准备要做柴火用的，但是在送去柴房前先得把长木头锯短成一截截的，才能用柴刀劈开。不少人正在费力的锯着木头。]],
  exit = {
    e = { to = '武馆小路', },
  },
},

['武馆西廊#1'] = {
  id = '武馆西廊#1',
  area = '武馆',
  name = '西廊',
  desc =  [[这是一条走廊，廊顶描绘着江南秀美的风景。每两根翠绿色的柱子间相隔也就两三尺的距离，朱红色的琉璃瓦，嫩黄色的地砖。在走廊里面，丫鬟、奴仆们走来走去，都忙着自己的事情，不敢有一点怠慢。往东面走就到了武馆的大厅，西面是走廊的延伸。]],
  exit = {
    w = { to = '武馆西廊#2', },
    eu = { to = '武馆武馆大厅', },
  },
},

['武馆石径'] = {
  id = '武馆石径',
  area = '武馆',
  name = '石径',
  desc =  [[一条曲曲折折用鹅卵石铺成的小径, 路两旁绿柳成荫, 一处处山石花木点缀在其中。你走在石地上，脚下啪嗒啪嗒地发出清脆的响声。西边连接着回廊，往北面去是这条小径的延伸，东面就是文霞亭了。]],
  exit = {
    e = { to = '武馆文霞亭', },
    w = { to = '武馆回廊', },
    n = { to = '武馆小径', },
  },
},

['武馆物品房'] = {
  id = '武馆物品房',
  area = '武馆',
  name = '物品房',
  desc =  [[这里是武馆的物品房。进屋就看见一个大架子，上面整整齐齐地放满了各种物品，看来这里的管家是很认真负责的，一些人正在和管物品工具的六弟子吴坎说着什么。]],
  exit = {
    nw = { to = '武馆武馆大厅', },
  },
},

['武馆武馆前院'] = {
  id = '武馆武馆前院',
  area = '武馆',
  name = '武馆前院',
  desc =  [[从前厅出来就看见这个大院子了，东西两边都是练武场，不少人在这里习武强身，这里很吵，乱烘烘的，你不时看见有扛着东西的，挑着水的匆匆而过，北面上了台阶就是武馆大厅了。]],
  exit = {
    e = { to = '武馆碎石路', },
    s = { to = '武馆武馆前厅', },
    w = { to = '武馆小石路', },
    nu = { to = '武馆武馆大厅', },
  },
},

['武馆西武场'] = {
  id = '武馆西武场',
  area = '武馆',
  name = '西武场',
  desc =  [[这里是个露天练武场，门口写着一块牌子（paizi）。好多人在这里辛苦的练着，你走在场中，可是没有人回头看你一眼，都在聚精汇神的练着自己的功夫。地上有一些练武用的工具，墙边摆着一排木桩（zhuang）和几个练功用的木人（muren）。]],
  exit = {
    e = { to = '武馆西练武场', },
  },
},

['武馆小石路'] = {
  id = '武馆小石路',
  area = '武馆',
  name = '小石路',
  desc =  [[这是一条青石板铺成的小路，两边绿树成荫，不时有些仆人和丫鬟从你身边走来走去。西面是练武场，很多武馆弟子正在那里发奋练功。往东走就到了前院，一群弟子围在那里，不知道在看什么。]],
  exit = {
    e = { to = '武馆武馆前院', },
    w = { to = '武馆西练武场', },
  },
},

['武馆东廊#1'] = {
  id = '武馆东廊#1',
  area = '武馆',
  name = '东廊',
  desc =  [[这是一条走廊，廊顶描绘着江南秀美的风景。每两根翠绿色的柱子间相隔也就两三尺的距离，朱红色的琉璃瓦，嫩黄色的地砖。在走廊里面，丫鬟、奴仆们走来走去，都忙着自己的事情，不敢有一点怠慢。往西走就是武馆的大厅，东面是走廊的延伸，北面是一间不小的偏厅。]],
  exit = {
    e = { to = '武馆东廊#2', },
    wu = { to = '武馆武馆大厅', },
    n = { to = '武馆偏厅', },
  },
},

['武馆练功房'] = {
  id = '武馆练功房',
  area = '武馆',
  name = '练功房',
  desc =  [[房间的四周墙上点满了火把。这里极为安静，仅能听到或悠长，或粗重的呼吸声。厅里零零落落地摆着几个蒲团，并无其他陈设。几个人正在沈城的指导下坐在蒲团上打坐（dazuo)，吐纳（tuna）。北面是一条石板路。]],
  exit = {
    n = { to = '武馆碎石路', },
  },
},

['武馆厨房'] = {
  id = '武馆厨房',
  area = '武馆',
  name = '厨房',
  desc =  [[这是武馆的厨房, 虽然不大, 但是锅碗瓢盆, 油盐酱醋, 都很齐全。灶台上堆满了新鲜瓜果蔬菜, 活鱼活虾, 满屋的果香和肉香，使你一走进这里，闻得阵阵的香气，就立即想饱餐一顿。有几个厨子正在忙碌着。]],
	label = { food = true, water = true, },
	object = { '王厨子', },
  exit = {
    e = { to = '武馆西廊#2', },
  },
},

['武馆偏厅'] = {
  id = '武馆偏厅',
  area = '武馆',
  name = '偏厅',
  desc =  [[房间的四周墙上点满了火把，把整个房间照了个通明。正中的墙上挂着一幅地图（tu），二弟子周圻正对着地图指指点点，口中咕哝个不停。看见你走了进来，他马上迎上前来。往南走是一条走廊。]],
  exit = {
    s = { to = '武馆东廊#1', },
  },
},

['南阳城聚贤庄后院'] = {
  id = '南阳城聚贤庄后院',
  area = '南阳城',
  name = '聚贤庄后院',
  desc =  [[这里是聚贤庄的后院，平常没有人来。院里堆放着几堆柴草。柴草垛旁边有几个小孩在玩耍。]],
  exit = {
    w = { to = '南阳城聚贤庄大厅', },
  },
},

['南阳城聚贤庄大门'] = {
  id = '南阳城聚贤庄大门',
  area = '南阳城',
  name = '聚贤庄大门',
  desc =  [[你走到一座高宅大院的门口，大门开着，门前左右有两个石狮子，四五级青石台阶上是两扇钉满铜钉的大门。看得出这里是一大户人家的住所。门口正中央高悬着一块黑底金字的大匾，匾上写有三个大字：【聚贤庄】。]],
  exit = {
    sw = { to = '南阳城小路#E', },
    n = { to = '南阳城聚贤庄大厅', },
  },
},

['南阳城城中心'] = {
  id = '南阳城城中心',
  area = '南阳城',
  name = '城中心',
  desc =  [[这里便是南阳城中心。当年诸葛先生就住在附近的隆中卧龙岗。南阳府地界不大，方圆不过数十里。但是因为地处南北的要道上，所以南来北往的各地客商旅人很多。西面是一家酒楼，本地人口甚少，所以生意不是很兴旺。北面有条大道直通汝州城。]],
  exit = {
    s = { to = '南阳城石板路', },
    w = { to = '南阳城迎宾楼', },
    n = { to = '南阳城大驿道', },
  },
},

['南阳城青石路#N'] = {
  id = '南阳城青石路#N',
  area = '南阳城',
  name = '青石路',
  desc =  [[这是许家集上的一条青石路，路面上铺着一层细碎的石子，路上的行人不多。南面是许家集的市集。东面有一条小路通往聚贤庄。]],
  exit = {
    e = { to = '南阳城小路#E', },
    w = { to = '南阳城小路#W', },
    s = { to = '南阳城许家集', },
  },
},

['南阳城许家集'] = {
  id = '南阳城许家集',
  area = '南阳城',
  name = '许家集',
  desc =  [[这是南阳附近的许家集，市集上很热闹，附近的农民经常到这里来交易自己辛苦劳动的成果。集市旁边有片空地，停着几辆马车。东面有家客栈，门口正对着这里。]],
  exit = {
    e = { to = '南阳城客栈', },
    sw = { to = '南阳城岔路', },
    s = { to = '南阳城青石路#S', },
    n = { to = '南阳城青石路#N', },
  },
},

['南阳城客栈'] = {
  id = '南阳城客栈',
  area = '南阳城',
  name = '客栈',
  desc =  [[这是附近远近闻名的悦来客栈，生意非常兴隆。外地游客多选择在这里落脚，你可以在这里打听到各地的风土人情。店小二里里外外忙得团团转，接待着南腔北调的客人。墙上挂着一个牌子(paizi)。]],
  exit = {
    u = { to = '南阳城客店二楼', },
    w = { to = '南阳城许家集', },
  },
},

['南阳城大驿道'] = {
  id = '南阳城大驿道',
  area = '南阳城',
  name = '大驿道',
  desc =  [[你走在一条尘土飞扬的大驿道上。四周人来人往。挑担子的行商，赶着大车的马夫，上京赶考的书生，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。道路两旁是整整齐齐的杨树林。东面有一条小路通向树林深处。]],
  exit = {
    e = { to = '南阳城密林', },
    s = { to = '南阳城城中心', },
    n = { to = '嵩山少林汝州城', },
  },
},

['南阳城迎宾楼'] = {
  id = '南阳城迎宾楼',
  area = '南阳城',
  name = '迎宾楼',
  desc =  [[方圆数百里内提起迎宾楼可以说是无人不知，无人不晓。当年苏学士云游到此，对迎宾楼的素齐赞不绝口，欣然为其题匾，留下了一段传遍海内的佳话，从此迎宾楼名声大震。楼下布置简易，顾客多是匆匆的行人，买点包子，鸡腿、米酒就赶路去了。楼上是雅座。]],
  exit = {
    u = { to = '南阳城迎宾楼二楼', },
    e = { to = '南阳城城中心', },
  },
},

['南阳城断崖'] = {
  id = '南阳城断崖',
  area = '南阳城',
  name = '断崖',
  desc =  { [[前面是一处十分陡峭的断崖，险峻异常，难以爬越。这里离黄河不远，黄河流淌到这里，河床宽阔。黄色的河水在静静地向东流去，使人忘记它发洪水时的狂威。]], [[前面是一处十分陡峭的断崖，险峻异常，难以爬越(pa)。这里离黄河不远，黄河流淌到这里，河床宽阔。黄色的河水在静静地向东流去，使人忘记它发洪水时的狂威。]], },
  exit = {
    n = { to = '南阳城密林', },
    hidden = { to = '南阳城崖顶', cmd = 'climb up', cond = 'player.flag["火烧草料场"] and player.skill["基本轻功"] and player.skill["基本轻功"].level >= 80', },
  },
},

['南阳城崖顶'] = {
  id = '南阳城崖顶',
  area = '南阳城',
  name = '崖顶',
  desc =  [[站在崖顶，隐约可以看到远处蒙古大军的草料场。这里人迹罕至，荒凉异常。]],
  exit = {
    sd = { to = '南阳城小路#GB', },
    d = { to = '南阳城断崖', },
  },
},

['南阳城小路#GB'] = {
  id = '南阳城小路#GB',
  area = '南阳城',
  name = '小路',
  desc =  [[这是一条林间小路，人迹罕至，非常荒凉。四下里不时传来野兽的叫声。]],
  exit = {
    nu = { to = '南阳城崖顶', },
    sd = { to = '南阳城后仓', },
  },
},

['南阳城后仓'] = {
  id = '南阳城后仓',
  area = '南阳城',
  name = '后仓',
  desc =  [[这是蒙古大军的囤粮之所，所谓兵马未动，粮草先行，这里的粮食和草料堆积如山。一队队巡逻兵来回守卫，戒备森严。]],
  exit = {
    nu = { to = '南阳城小路#GB', },
    s = { to = '南阳城中仓', },
  },
},

['南阳城中仓'] = {
  id = '南阳城中仓',
  area = '南阳城',
  name = '中仓',
  desc =  [[这是蒙古大军的囤粮之所，所谓兵马未动，粮草先行，这里的粮食和草料堆积如山。一队队巡逻兵来回守卫，戒备森严。]],
  exit = {
    n = { to = '南阳城后仓', },
    s = { to = '南阳城前仓', },
    e = { to = '南阳城左仓', },
    w = { to = '南阳城右仓', },
  },
},

['南阳城前仓'] = {
  id = '南阳城前仓',
  area = '南阳城',
  name = '前仓',
  desc =  [[这是蒙古大军的囤粮之所，所谓兵马未动，粮草先行，这里的粮食和草料堆积如山。一队队巡逻兵来回守卫，戒备森严。]],
  exit = {
    n = { to = '南阳城中仓', },
  },
},

['南阳城左仓'] = {
  id = '南阳城左仓',
  area = '南阳城',
  name = '左仓',
  desc =  [[这是蒙古大军的囤粮之所，所谓兵马未动，粮草先行，这里的粮食和草料堆积如山。一队队巡逻兵来回守卫，戒备森严。]],
  exit = {
    w = { to = '南阳城中仓', },
  },
},

['南阳城右仓'] = {
  id = '南阳城右仓',
  area = '南阳城',
  name = '右仓',
  desc =  [[这是蒙古大军的囤粮之所，所谓兵马未动，粮草先行，这里的粮食和草料堆积如山。一队队巡逻兵来回守卫，戒备森严。]],
  exit = {
    e = { to = '南阳城中仓', },
  },
},

['南阳城石板路'] = {
  id = '南阳城石板路',
  area = '南阳城',
  name = '石板路',
  desc =  [[这是南阳城中的一条石板路，街道不是很宽，两边栽着许多白杨树。路上往来的行人，有几个从装束来看似乎是武林中人。他们一个个行色匆匆从你身边经过，往东边的岔道而去。还有些赶着大车的马夫，行到这里后也纷纷拐上了向东的岔道，东边的岔道通往许家集。]],
  exit = {
    e = { to = '南阳城小路#W', },
    s = { to = '南阳城南门', },
    n = { to = '南阳城城中心', },
  },
},

['南阳城迎宾楼二楼'] = {
  id = '南阳城迎宾楼二楼',
  area = '南阳城',
  name = '迎宾楼二楼',
  desc =  [[这里是雅座，文人学士经常在这里吟诗作画，富商土豪也在这里边吃喝边作交易。这里也是城里举办喜宴的最佳场所。你站在楼上眺望，只觉得心旷神怡。东面是一池湖水，碧波荡漾。北面是崇山峻岭。墙上挂着块牌子(paizi)。]],
  exit = {
    d = { to = '南阳城迎宾楼', },
  },
},

['南阳城青石路#S'] = {
  id = '南阳城青石路#S',
  area = '南阳城',
  name = '青石路',
  desc =  [[这是许家集上的一条青石路，路面上铺着一层细碎的石子，路上的行人不多。北面是许家集的市集。]],
  exit = {
    n = { to = '南阳城许家集', },
  },
},

['南阳城驿道'] = {
  id = '南阳城驿道',
  area = '南阳城',
  name = '驿道',
  desc =  [[这是南阳府境内的一条驿道。路上人来人往，尘土飞扬。不时有两三骑快马飞驰而过，扬起一路尘埃。马上的人个个身着劲装，衣甲鲜明，有的还随身佩带着刀剑。看来都是些习武的江湖人。道路两旁是整整齐齐的杨树林。从这里向北一直走就是南阳城了。]],
  exit = {
    e = { to = '南阳城岔路', },
    s = { to = '襄阳城土路#2NE', },
    n = { to = '南阳城南门', },
  },
},

['南阳城小路#W'] = {
  id = '南阳城小路#W',
  area = '南阳城',
  name = '小路',
  desc =  [[这是一条僻静的小路，两旁是茂密的丛林。路上依稀可见车马走过留下的痕迹。偶尔有几个行人行色匆匆从你身边经过，往东边的许家集而去。西面方向是南阳城。]],
  exit = {
    w = { to = '南阳城石板路', },
    e = { to = '南阳城青石路#N', },
  },
},

['南阳城客店二楼'] = {
  id = '南阳城客店二楼',
  area = '南阳城',
  name = '客店二楼',
  desc =  [[这是一间很大的客房，陈设十分简陋。靠墙放了十几张小木床，不少客人正和衣而卧，满屋子都是呼呼的打酣声。西边有张床是空的，你蹑手蹑脚地走了过去。]],
  exit = {
    d = { to = '南阳城客栈', },
  },
},

['南阳城聚贤庄大厅'] = {
  id = '南阳城聚贤庄大厅',
  area = '南阳城',
  name = '聚贤庄大厅',
  desc =  [[这是聚贤庄的大厅，大厅内很宽敞，放着几十张桌子。东首主位的桌子旁放有三把黑色的太师椅，其中一个椅子上坐着一个中年男子。他身后的墙上挂有两副圆盾、一柄单刀，一杆短枪。]],
  exit = {
    e = { to = '南阳城聚贤庄后院', },
    s = { to = '南阳城聚贤庄大门', },
  },
},

['南阳城密林'] = {
  id = '南阳城密林',
  area = '南阳城',
  name = '密林',
  desc =  [[这是密林深处的一块空地，阳光很难透过来，四周昏暗，不时有鸟兽的叫声。你走在路上，不由有些紧张。]],
  exit = {
    ne = { to = '黄河流域渭汾流域', },
    w = { to = '南阳城大驿道', },
    s = { to = '南阳城断崖', },
  },
},

['南阳城岔路'] = {
  id = '南阳城岔路',
  area = '南阳城',
  name = '岔路',
  desc =  [[这是一条僻静的小路，两旁是茂密的丛林。路上依稀可见车马走过留下的痕迹。从这里往东北方向是南阳府许家集，西边方向走是通往襄阳和南阳之间的一条驿道。]],
  exit = {
    ne = { to = '南阳城许家集', },
    w = { to = '南阳城驿道', },
  },
},

['南阳城小路#E'] = {
  id = '南阳城小路#E',
  area = '南阳城',
  name = '小路',
  desc =  [[这是一条僻静的小路，两旁是茂密的丛林。路上依稀可见车马走过留下的痕迹。从这里往东北方向是附近远近闻名的聚贤庄，西面是通往许家集的青石路。这里平常没有什么人。]],
  exit = {
    ne = { to = '南阳城聚贤庄大门', },
    w = { to = '南阳城青石路#N', },
  },
},

['南阳城南门'] = {
  id = '南阳城南门',
  area = '南阳城',
  name = '南门',
  desc =  [[这里是南阳府的南城门，因为南阳地处于襄阳北去的要冲，所以路上往来的人很多。赶车的马夫、上京赶考的书生、挑担的脚夫、推车的小贩、熙熙攘攘，很是热闹。不时有两三骑快马从身边飞驰而过，扬起一路尘埃。]],
  exit = {
    s = { to = '南阳城驿道', },
    n = { to = '南阳城石板路', },
  },
},

['襄阳城青石大道#2N'] = {
  id = '襄阳城青石大道#2N',
  area = '襄阳城',
  name = '青石大道',
  desc =  [[你走在一条青石大道上，人来人往非常繁忙，不时有人骑着马匆匆而过。大道往北进入陕西、河南境内。南边通向襄阳城。]],
  exit = {
    ne = { to = '襄阳城蒙古军营', },
    s = { to = '襄阳城青石大道#1N', },
    n = { to = '襄阳城土路#1N', },
  },
},

['襄阳城东城巷#1'] = {
  id = '襄阳城东城巷#1',
  area = '襄阳城',
  name = '东城巷',
  desc =  [[这是由青龙门通往玄武门的一条小巷，地处襄阳城东。路面上铺满了大大小小的青石，两旁是郁郁葱葱的柳树，树下有几个行人在乘凉。远处的巷口有几个穷汉在躺着晒太阳，路东是一个荒废的院子。]],
  exit = {
    e = { to = '襄阳城废宅', },
    w = { to = '襄阳城玄武门内街', },
    s = { to = '襄阳城东城巷#2', },
  },
},

['襄阳城万金赌坊'] = {
  id = '襄阳城万金赌坊',
  area = '襄阳城',
  name = '万金赌坊',
  desc =  [[这是方圆百里远近闻名的一间大赌坊，平日里生意非常红火，经常是座无虚席。最近已经衰落，关门歇业了。]],
  exit = {
    w = { to = '襄阳城北街#3', },
  },
},

['襄阳城卧房#2'] = {
  id = '襄阳城卧房#2',
  area = '襄阳城',
  name = '卧房',
  desc =  [[你走进一间内室，屋内装饰的豪华富丽，靠里墙是一张大床，床上被褥描龙绣凤，金碧辉煌。床边一个大青铜香炉里正袅袅的熏着香，一阵浓香扑鼻，你只觉陶陶然，昏昏欲睡。]],
  exit = {
    w = { to = '襄阳城世德堂', },
  },
},

['襄阳城兵营'] = {
  id = '襄阳城兵营',
  area = '襄阳城',
  name = '兵营',
  desc =  [[这里是一个兵营，因为要防御蒙古铁骑的进攻，所以城里的兵大多都开到城外和城墙上守城去了，这里只有几个留守的官兵。两个武将面有忧色地凑在一起在谈论着什么。]],
  exit = {
    s = { to = '襄阳城南城巷#3', },
  },
},

['襄阳城山间小路#3'] = {
  id = '襄阳城山间小路#3',
  area = '襄阳城',
  name = '山间小路',
  desc =  [[你进入了一片小森林，走在林间小路上，密密麻麻的树林挡住了阳光，这里显得十分阴暗，树木交错纵横，这里没有什么出路了.]],
  exit = {
    ne = { to = '襄阳城山间小路#2', },
  },
},

['襄阳城豆腐坊'] = {
  id = '襄阳城豆腐坊',
  area = '襄阳城',
  name = '豆腐坊',
  desc =  [[这是一家豆腐坊，门口的树上栓了一头毛驴，地中间有一盘很大很平整的石磨。墙角有好几个大缸，缸上面漂浮着一层薄薄的豆皮。西首的地上堆着一堆麻袋，有个开口的露出了里面的黄豆。屋子里弥漫着一股豆花的味道。]],
  exit = {
    e = { to = '襄阳城西城巷#4', },
  },
},

['襄阳城私塾'] = {
  id = '襄阳城私塾',
  area = '襄阳城',
  name = '私塾',
  desc =  [[这是一间新开张的私塾，门上的对联看起来贴上去还没有多少日子。一位年轻的私塾先生，在地中央来回踱着步子。他原本是个秀才，因为上次秋试落弟，生活又没有着落，没办法才开始教书。]],
  exit = {
    n = { to = '襄阳城西城巷#1', },
  },
},

['襄阳城正厅#1'] = {
  id = '襄阳城正厅#1',
  area = '襄阳城',
  name = '正厅',
  desc =  [[这里是衙门的正厅，堂上东西有两根楹柱，挂有一幅对联，但是你无心细看。正面墙上悬挂一个横匾，上书“正大光明”四个金光闪闪的大字。两旁衙役们手持板子侧立在两旁，气氛庄严肃穆。]],
  exit = {
    s = { to = '襄阳城衙门', },
  },
},

['襄阳城西街'] = {
  id = '襄阳城西街',
  area = '襄阳城',
  name = '西街',
  desc =  [[这是襄阳城西门内的一条街道，路上的行人很多。举目望去，两旁的建筑似乎都很低矮凌乱，不成章法。行近了看去，却仿佛一个迷阵般格局别致，错落有序。走在这条街上，耳旁总会不时传来一阵阵喧闹嘈杂的人声。]],
  exit = {
    e = { to = '襄阳城北丁字街', },
    w = { to = '襄阳城白虎门内街', },
  },
},

['襄阳城南城巷#4'] = {
  id = '襄阳城南城巷#4',
  area = '襄阳城',
  name = '南城巷',
  desc =  [[这里是由朱雀门通往青龙门的一条小巷，地处襄阳城南。从这里一直往东走，可以通往青龙门。远处的巷口有几个穷汉在躺着晒太阳，路北是一家车马行。门口着挂一个木牌(pai)。]],
  exit = {
    e = { to = '襄阳城南城巷#3', },
    w = { to = '襄阳城南城巷#5', },
    n = { to = '襄阳城车马行', },
  },
},

['襄阳城南街#2'] = {
  id = '襄阳城南街#2',
  area = '襄阳城',
  name = '南街',
  desc =  [[这是由襄阳城中心通往南门的一条大街，路面很宽，两旁种满了郁郁葱葱的垂柳。地面上铺着大块的青石，平坦整洁。向南望去，隐约可以看见城门上的城楼和女儿墙。]],
  exit = {
    s = { to = '襄阳城南街#3', },
    n = { to = '襄阳城南街#1', },
  },
},

['襄阳城南街#3'] = {
  id = '襄阳城南街#3',
  area = '襄阳城',
  name = '南街',
  desc =  [[这是由襄阳城中心通往南门的一条大街，路面很宽，两旁种满了郁郁葱葱的垂柳。地面上铺着大块的青石，平坦整洁。向南望去，隐约可以看见城门上的城楼和女儿墙。路西面有一家铺子开着门，门上画着一个很大的铜钱，那是家钱庄。]],
  exit = {
    e = { to = '襄阳城南城巷#5', },
    w = { to = '襄阳城宝龙斋', },
    s = { to = '襄阳城朱雀门内街', },
    n = { to = '襄阳城南街#2', },
  },
},

['襄阳城山路#2'] = {
  id = '襄阳城山路#2',
  area = '襄阳城',
  name = '山路',
  desc =  [[这里的路面更加陡峭，地上的足迹越来越少。一阵阵腐朽的味从密林里面传出。偶尔比能看见一些猎户们捕捉野兽的陷阱。]],
  exit = {
    ed = { to = '襄阳城山路#1', },
    wu = { to = '襄阳城山路#3', },
  },
},

['襄阳城泸溪北'] = {
  id = '襄阳城泸溪北',
  area = '襄阳城',
  name = '泸溪北',
  desc =  [[你走在湘鄂交界的土路上，偶尔会有人骑着马匆匆而过。这里已经是湖南地界，往东北进入湖北境内。南边是小镇泸溪。]],
  exit = {
    ne = { to = '襄阳城湘鄂交界', },
    sw = { to = '苗疆山路#1', },
    s = { to = '铁掌山泸溪', },
  },
},

['襄阳城天香楼'] = {
  id = '襄阳城天香楼',
  area = '襄阳城',
  name = '天香楼',
  desc =  [[这是襄阳城里最大的一家茶楼。只见屋内几张长条桌排开，凳子上坐满了各种口音的茶客，或高声谈笑，或交头接耳，将来自天南海北的声音混杂在了一起。茶楼里飘散着一股淡淡的茶香，闻着格外舒服。]],
  exit = {
    w = { to = '襄阳城北街#2', },
    u = { to = '襄阳城茶楼二楼', },
  },
},

['襄阳城土路#2NW'] = {
  id = '襄阳城土路#2NW',
  area = '襄阳城',
  name = '土路',
  desc =  [[你走在一条土路上，偶尔会有人骑着马匆匆而过，搞得尘土飞扬。这里已经是陕西地界，往东南进入湖北境内。西边是丝绸古路，西北面是有名的出产美玉的蓝田，而北边是华山脚下的一个小村落。]],
  exit = {
    n = { to = '华山村黄土路', },
    nw = { to = '襄阳城蓝田', },
    se = { to = '襄阳城土路#1NW', },
  },
},

['襄阳城营帐中'] = {
  id = '襄阳城营帐中',
  area = '襄阳城',
  name = '营帐中',
  desc =  [[这是蒙古攻击襄阳的临时军营，营帐中几个披挂着盔甲的将军走来走去正在和一个看起来样子象谋士的人大声的谈论、争执着什么。营帐外有几个士兵在巡逻。]],
  exit = {
    out = { to = '襄阳城蒙古军营', },
  },
},

['襄阳城东街#1'] = {
  id = '襄阳城东街#1',
  area = '襄阳城',
  name = '东街',
  desc =  [[这里是军事重镇襄阳城东的一条街道，路面上铺满了青石，两旁是郁郁葱葱的柳树，树下有几个行人在乘凉。不时地有顶盔贯甲的士兵走过去。向东出城可以进入安徽、江苏境内。街北边是家当铺，门口坐着几个穷汉。]],
  exit = {
    e = { to = '襄阳城东街#2', },
    w = { to = '襄阳城南丁字街', },
    n = { to = '襄阳城当铺', },
  },
},

['襄阳城当铺'] = {
  id = '襄阳城当铺',
  area = '襄阳城',
  name = '当铺',
  desc =  [[这是一家素以买卖公平著称的老字号当铺，一个四尺高的柜台摆在你的面前，柜台上摆着一个牌子(paizi)， 柜台后坐着当铺的老板，一双鬼溜溜的眼睛上上下下打量着你。]],
  exit = {
    s = { to = '襄阳城东街#1', },
  },
},

['襄阳城北街#2'] = {
  id = '襄阳城北街#2',
  area = '襄阳城',
  name = '北街',
  desc =  [[这是由襄阳北门通往城中心的街道，路面很宽，两旁种着柳树。街道上人来人往，很是热闹。东面是一家老字号的茶楼，门口高高飘着对幌子，楼上人声嘈杂，看起来似乎生意不错。几个江湖打扮的汉子正行上楼去。]],
  exit = {
    e = { to = '襄阳城天香楼', },
    s = { to = '襄阳城北街#1', },
    n = { to = '襄阳城北街#3', },
  },
},

['襄阳城湘鄂土路'] = {
  id = '襄阳城湘鄂土路',
  area = '襄阳城',
  name = '湘鄂土路',
  desc =  [[你走在鄂湘交界的土路上，偶尔会有人骑着马匆匆而过。往南就是湖南境内了，北边通向襄阳城方向。]],
  exit = {
    n = { to = '襄阳城青石大道#1S', },
    s = { to = '襄阳城湘鄂交界', },
    wu = { to = '襄阳城山路#1', cond = 'player.jingli >= 200 and player.qi >= 100', },
  },
},

['襄阳城包子铺'] = {
  id = '襄阳城包子铺',
  area = '襄阳城',
  name = '包子铺',
  desc =  [[这是一家包子铺，附近的人们都喜欢吃这里的包子，老板包子王的手艺也是远近闻名。门口有个火炉，上面放了一摞笼屉，不断冒出一丝丝的热气。]],
  exit = {
    e = { to = '襄阳城西城巷#2', },
  },
},

['襄阳城车马行'] = {
  id = '襄阳城车马行',
  area = '襄阳城',
  name = '车马行',
  desc =  [[这是一个车马行，专门做拉脚的生意，院子里停了几辆大车，靠西墙的位置有个马厩，里面栓了几匹马。旁边堆有一堆干草。]],
  exit = {
    s = { to = '襄阳城南城巷#4', },
  },
},

['襄阳城后花园'] = {
  id = '襄阳城后花园',
  area = '襄阳城',
  name = '后花园',
  desc =  [[你缓步向后山走去。那山也不甚高，身周树木葱翠，四下里轻烟薄雾，出没于枝叶之间。你足踏软草，竟连脚步也是悄无声息。将到山顶，转了两个弯，一阵清风，四周全是花香。放眼望去，漫坡尽是红色、白色、黄色的玫瑰。]],
  exit = {
    n = { to = '襄阳城天井#1', },
  },
},

['襄阳城南城巷#5'] = {
  id = '襄阳城南城巷#5',
  area = '襄阳城',
  name = '南城巷',
  desc =  [[这里是由朱雀门通往青龙门的一条小巷，地处襄阳城南，巷口旁边立着一块石碑(bei)，上写着几个小字。远处的巷口有几个穷汉在躺着晒太阳，从这里一直往东走，可以通往青龙门。路北是家说书馆。]],
  exit = {
    e = { to = '襄阳城南城巷#4', },
    w = { to = '襄阳城南街#3', },
    n = { to = '襄阳城说书馆', },
  },
},

['襄阳城宝龙斋'] = {
  id = '襄阳城宝龙斋',
  area = '襄阳城',
  name = '宝龙斋',
  desc =  [[这是一家老字号的钱庄，已有几百年的历史，在全国各地都有分店。它发行的银票信誉非常好，通行全国。店内摆设十分简单，一个高高的柜台上面装了铁栅栏。]],
  exit = {
    e = { to = '襄阳城南街#3', },
  },
},

['襄阳城说书馆'] = {
  id = '襄阳城说书馆',
  area = '襄阳城',
  name = '说书馆',
  desc =  [[这是一家说书馆，地方不大，地中央几张放有两排长条桌，桌周围摆了几条长条凳子。北首放了一张八仙桌，墙上挂有一副对联，对联上的字写得龙飞凤舞。]],
  exit = {
    s = { to = '襄阳城南城巷#5', },
  },
},

['襄阳城东牌楼'] = {
  id = '襄阳城东牌楼',
  area = '襄阳城',
  name = '东牌楼',
  desc =  [[这里是襄阳城中心的一个广场，广场中央立有一座汉白玉的牌楼，牌楼很高，最上面镂刻着两条腾空飞舞的青龙，龙的中间雕有一头昂首挺胸的麒麟瑞兽，看起来威武神气，气势不凡。北边有一条青石大道，一直通往襄阳城的北大门：玄武门。南面是一条热闹的丁字街。]],
  exit = {
    s = { to = '襄阳城南丁字街', },
    n = { to = '襄阳城北街#1', },
  },
},

['襄阳城南城巷#2'] = {
  id = '襄阳城南城巷#2',
  area = '襄阳城',
  name = '南城巷',
  desc =  [[这是一条安静的小巷，两边种着许多大树。从这里一直往东走，可以通往青龙门内街。巷子东面是一家木匠铺，门板漆黑，窗户上镂着窗花。北面就是不远处就是青龙门了。]],
  exit = {
    e = { to = '襄阳城木匠铺', },
    w = { to = '襄阳城南城巷#3', },
    n = { to = '襄阳城南城巷#1', },
  },
},

['襄阳城西门外'] = {
  id = '襄阳城西门外',
  area = '襄阳城',
  name = '西门外',
  desc =  [[这是一条笔直的青石大道，路上人来人往非常繁忙，不时有人骑着马匆匆而过。路南有条小路通向一个山丘。从此往西是云贵川的方向，东面远远的可以望见一座城楼，那里就是襄阳城了。]],
  exit = {
    e = { to = '襄阳城白虎门', },
    s = { to = '襄阳城山间小路#1', },
    w = { to = '襄阳城檀溪', },
    n = { to = '绝情谷山间小路#1', },
  },
},

['襄阳城温府大门'] = {
  id = '襄阳城温府大门',
  area = '襄阳城',
  name = '温府大门',
  desc =  [[你走到一座高宅大院的门口，大门敞开，门口站着两个家丁，一个个腆胸叠肚，一副要找人麻烦的样子。门前左右有两个石狮子，四五级青石台阶上是两扇钉满铜钉的大门。看得出这里是当地大豪的住所。]],
  exit = {
    s = { to = '襄阳城世德堂', },
    n = { to = '襄阳城南城巷#3', },
  },
},

['襄阳城东街#2'] = {
  id = '襄阳城东街#2',
  area = '襄阳城',
  name = '东街',
  desc =  [[这里是军事重镇襄阳城东的一条街道，路面上铺满了青石，两旁是郁郁葱葱的柳树，树下有几个行人在乘凉。不时地有顶盔贯甲的士兵走过去。向东出城可以进入安徽、江苏境内。街北边是条巷子口，巷两边也种着许多大树。西面方向通往城中心。]],
  exit = {
    e = { to = '襄阳城青龙门内街', },
    w = { to = '襄阳城东街#1', },
    n = { to = '襄阳城东城巷#5', },
  },
},

['襄阳城西城巷#2'] = {
  id = '襄阳城西城巷#2',
  area = '襄阳城',
  name = '西城巷',
  desc =  [[这是一条安静的小巷，两边种着许多大树。地面上铺着一层白石子，踩上去发出沙沙的响声。从这里一直往南走，可以通往朱雀门内街。北面通往白虎门。巷子西面是一家包子铺，门口笼屉上的包子冒着热气。]],
  exit = {
    s = { to = '襄阳城西城巷#1', },
    w = { to = '襄阳城包子铺', },
    n = { to = '襄阳城西城巷#3', },
  },
},

['襄阳城檀溪'] = {
  id = '襄阳城檀溪',
  area = '襄阳城',
  name = '檀溪',
  desc =  [[这是一条湍急的小河，河水并不甚宽，清澈见底。几个赤脚经过这里的乡民告诉你，这里就是当年刘皇叔躲避追兵时马越檀溪的地方，这条小河就是鼎鼎有名的檀溪。西南边有条小路通往四川。]],
  exit = {
    e = { to = '襄阳城西门外', },
    sw = { to = '襄阳城小路#1', },
  },
},

['襄阳城青龙门'] = {
  id = '襄阳城青龙门',
  area = '襄阳城',
  name = '青龙门',
  desc =  [[这里是军事重镇襄阳城的东门，不时地有顶盔贯甲的士兵走来走去。向东边走可以进入安徽、江苏境内。城门的墙上张贴着一纸告示(gaoshi)。]],
  exit = {
    e = { to = '襄阳城东门外', },
    w = { to = '襄阳城青龙门内街', },
  },
},

['襄阳城北城巷#1'] = {
  id = '襄阳城北城巷#1',
  area = '襄阳城',
  name = '北城巷',
  desc =  [[这里是由西门通往北门的一条小巷，因为地处襄阳城北，所以人们把这里叫做北城巷。走在这条小街上举目望去，巷子两旁是各式各样的店铺，人来人往，很是热闹。西面有家店铺开着门，是个小吃店。]],
  exit = {
    w = { to = '襄阳城小吃店', },
    s = { to = '襄阳城白虎门内街', },
    n = { to = '襄阳城北城巷#2', },
  },
},

['襄阳城土路#2NE'] = {
  id = '襄阳城土路#2NE',
  area = '襄阳城',
  name = '土路',
  desc =  [[你走在一条土路上，偶尔会有人骑着马匆匆而过，搞得尘土飞扬。这里已经是河南地界，往西南进入湖北境内。向北边望可以看到嵩山横亘在远处。]],
  exit = {
    n = { to = '南阳城驿道', },
    sw = { to = '襄阳城土路#1NE', },
  },
},

['襄阳城卧房#1'] = {
  id = '襄阳城卧房#1',
  area = '襄阳城',
  name = '卧房',
  desc =  [[你走进一间内室，屋内装饰的豪华富丽，靠里墙是一张大床，床上被褥描龙绣凤，金碧辉煌。床边一个大青铜香炉里正袅袅的熏着香，一阵浓香扑鼻，你只觉陶陶然，昏昏欲睡。]],
  exit = {
    e = { to = '襄阳城世德堂', },
  },
},

['襄阳城东门外'] = {
  id = '襄阳城东门外',
  area = '襄阳城',
  name = '东门外',
  desc =  [[这是襄阳东门外的一条青石大道，人来人往非常繁忙，不时有人骑着马匆匆而过。大道往东进入安徽境内。西边通向襄阳城东面，青龙门。]],
  exit = {
    e = { to = '襄阳城土路#1E', },
    w = { to = '襄阳城青龙门', },
  },
},

['襄阳城药材铺'] = {
  id = '襄阳城药材铺',
  area = '襄阳城',
  name = '药材铺',
  desc =  [[这是一家历史悠久的药材铺，从前的老板因为经营不擅，加上做生意又赔了钱，所以卖给了别人经营。买下药铺的人说起来也是赫赫有名，他就是江湖上人称“杀人名医”的平一指。]],
  exit = {
    e = { to = '襄阳城西城巷#1', },
  },
},

['襄阳城猪肉店'] = {
  id = '襄阳城猪肉店',
  area = '襄阳城',
  name = '猪肉店',
  desc =  [[这是一家卖猪肉的小铺子，店面不算很大，一张油腻腻的肉案子横在地当中，案子后面站了一位胖乎乎的年轻人，他身上扎了个围裙，围裙上一圈圈的油印。他正站在案子后面向街上望着。]],
  exit = {
    s = { to = '襄阳城北城巷#3', },
  },
},

['襄阳城东城巷#2'] = {
  id = '襄阳城东城巷#2',
  area = '襄阳城',
  name = '东城巷',
  desc =  [[这是由青龙门通往玄武门的一条小巷，地处襄阳城东。路面上铺满了大大小小的青石，两旁是郁郁葱葱的柳树，树下有几个行人在乘凉。远处的巷口有几个穷汉在躺着晒太阳，路东是一家杂货铺。]],
  exit = {
    e = { to = '襄阳城杂货铺', },
    s = { to = '襄阳城东城巷#3', },
    n = { to = '襄阳城东城巷#1', },
  },
},

['襄阳城东城巷#4'] = {
  id = '襄阳城东城巷#4',
  area = '襄阳城',
  name = '东城巷',
  desc =  [[这里是由青龙门通往玄武门的一条小巷，地处襄阳城东，巷子两旁种着低矮的树墙，间或点缀着一丛丛鲜花。街道上的行人都很悠闲，几个姑娘结伴在前面边走边说笑着。路东有扇大门敞开着，门边挂着一个牌子(paizi)。]],
  exit = {
    e = { to = '襄阳城戏院', },
    s = { to = '襄阳城东城巷#5', },
    n = { to = '襄阳城东城巷#3', },
  },
},

['襄阳城练武场'] = {
  id = '襄阳城练武场',
  area = '襄阳城',
  name = '练武场',
  desc =  [[你走进一座三开间的大厅，打通了成为一个大场子。场子两边的兵器架上摆满了各种兵刃。]],
  exit = {
    e = { to = '襄阳城天井#1', },
  },
},

['襄阳城戏院'] = {
  id = '襄阳城戏院',
  area = '襄阳城',
  name = '戏院',
  desc =  [[这里是一家戏院，场子里摆了很多凳子，正前方的看台上有一个戏子正在咿咿呀呀地吊嗓子。看台的一角摆有一个方桌，上面放有一个大茶壶。现在不是营业时间，没有人来。]],
  exit = {
    w = { to = '襄阳城东城巷#4', },
  },
},

['襄阳城山路#1'] = {
  id = '襄阳城山路#1',
  area = '襄阳城',
  name = '山路',
  desc =  [[这里是山麓上唯一的一条土路，山势虽然并不算太高，但是极为陡峭，四周丛林密部，不时传来野兽的鸣叫。只有很有经验的猎户才敢来这里捕猎，据说这里的毒蛇怪蟒异常凶狠。所以这里少有人迹。]],
  exit = {
    ed = { to = '襄阳城湘鄂土路', },
    wu = { to = '襄阳城山路#2', },
  },
},

['襄阳城土路#1NW'] = {
  id = '襄阳城土路#1NW',
  area = '襄阳城',
  name = '土路',
  desc =  [[你走在陕鄂交界的土路上，偶尔会有人骑着马匆匆而过。这里已经是陕西地界，往东南进入湖北境内，往西走不远就是终南山脚下的樊川了。]],
  exit = {
    nw = { to = '襄阳城土路#2NW', },
    w = { to = '终南山樊川', },
    se = { to = '襄阳城土路#1N', },
  },
},

['襄阳城渡船'] = {
  id = '襄阳城渡船',
  area = '襄阳城',
  name = '渡船',
  desc =  [[一叶小舟，最多也就能载七、八个人。一名六十多岁的老艄公手持一根长竹篙，正在船尾吃力地撑着船。]],
  exit = {
    out2 = { to = '襄阳城汉水西岸', cost = 50, unstable = true, handler = 'disembark', },
    out = { to = '襄阳城汉水东岸', cost = 50, unstable = true, handler = 'disembark', },
  },
},

['襄阳城南城巷#1'] = {
  id = '襄阳城南城巷#1',
  area = '襄阳城',
  name = '南城巷',
  desc =  [[这是一条安静的小巷，两边种着许多大树。从这里一直往东走，可以通往青龙门内街。巷子东面是一家打铁铺，两扇大门敞开着。里面传出叮叮当当的打铁声。]],
  exit = {
    e = { to = '襄阳城打铁铺', },
    s = { to = '襄阳城南城巷#2', },
    n = { to = '襄阳城青龙门内街', },
  },
},

['襄阳城江湖客栈'] = {
  id = '襄阳城江湖客栈',
  area = '襄阳城',
  name = '江湖客栈',
  desc =  [[这里是襄阳城内最大的一家客栈，店里的生意看起来很红火。很多南北往来的客人在这里投宿。客栈门口旁边的拴马桩上拴着几匹马，一个年纪不大的店小二正在招呼客人。见你走了过来，店小二急忙迎上来打着招呼。客栈南面的墙上挂有一块牌子(paizi)。]],
  exit = {
    u = { to = '襄阳城客栈二楼', },
    s = { to = '襄阳城北城巷#2', },
  },
},

['襄阳城茶楼二楼'] = {
  id = '襄阳城茶楼二楼',
  area = '襄阳城',
  name = '茶楼二楼',
  desc =  [[这是茶楼的二楼，屋内摆着几排长条桌，旁边凳子上坐了几位茶客，或高声谈笑，或交头接耳，来自各地的口音混杂在一起，听起来很是热闹。室内飘散着一股淡淡的茶香。]],
  exit = {
    d = { to = '襄阳城天香楼', },
  },
},

['襄阳城西城巷#3'] = {
  id = '襄阳城西城巷#3',
  area = '襄阳城',
  name = '西城巷',
  desc =  [[这是一条安静的小巷，两边种着许多大树。地面上铺着一层白石子，踩上去发出沙沙的响声。从这里一直往南走，可以通往朱雀门内街。北面通往白虎门。巷子西面有一家烧饼铺子，里面传来一阵阵烧饼的香味。]],
  exit = {
    s = { to = '襄阳城西城巷#2', },
    w = { to = '襄阳城烧饼铺', },
    n = { to = '襄阳城西城巷#4', },
  },
},

['襄阳城烧饼铺'] = {
  id = '襄阳城烧饼铺',
  area = '襄阳城',
  name = '烧饼铺',
  desc =  [[这是一家烧饼铺，墙壁的颜色很黑，铺子里的火炉上有口大锅，锅里整齐的摆了一圈烙好的烧饼，散发出一股特有的烧饼香味。这家铺子的烧饼在附近很有名，不时有人进屋来买上一个两个烧饼。]],
  exit = {
    e = { to = '襄阳城西城巷#3', },
  },
},

['襄阳城杂货铺'] = {
  id = '襄阳城杂货铺',
  area = '襄阳城',
  name = '杂货铺',
  desc =  [[这是一家小小的杂货铺，大箱小箱堆满了一地，都是一些日常用品。掌柜懒洋洋地躺在一只躺椅上，招呼着过往行人。据说私底下他也卖一些贵重的东西。摊上立着一块招牌(zhaopai)。    门前立了个牌子(sign)。]],
  exit = {
    w = { to = '襄阳城东城巷#2', },
  },
},

['襄阳城山路#3'] = {
  id = '襄阳城山路#3',
  area = '襄阳城',
  name = '山路',
  desc =  [[这里已经看不见人的足迹了，只有一些纷杂的野兽脚印。路越发陡峭，一般人来到这里就不感再前行了。]],
  exit = {
    ed = { to = '襄阳城山路#2', },
    wu = { to = '襄阳城山间空地', },
  },
},

['襄阳城打铁铺'] = {
  id = '襄阳城打铁铺',
  area = '襄阳城',
  name = '打铁铺',
  desc =  [[这是一家打铁铺，地当中摆着一个火炉，炉火把四周照得一片通红，火炉旁边有个很大的风箱，这里空气都是火热的。东面的架子上放了几把未完工的刀具，地上扔着一个大锤，旁边的桌子上有杯茶冒着热气，看来铁匠好像刚离开不久，]],
  exit = {
    w = { to = '襄阳城南城巷#1', },
  },
},

['襄阳城木匠铺'] = {
  id = '襄阳城木匠铺',
  area = '襄阳城',
  name = '木匠铺',
  desc =  [[这是一家简陋的木匠铺，一个中年木匠正蹲在地上钉东西。值此乱世，木匠们也只好制作些刀枪棍棒什么的以养家糊口。地上和墙角凌乱地堆放着一些木剑，木刀，木棍什么的，还有几件象锯子，刨子一类的木匠工具。]],
  exit = {
    w = { to = '襄阳城南城巷#2', },
  },
},

['襄阳城朱雀门内街'] = {
  id = '襄阳城朱雀门内街',
  area = '襄阳城',
  name = '朱雀门内街',
  desc =  [[这是襄阳城的南门朱雀门的内街，这条路向北通往城中心，向西可以通往西城，南面就是高大的城门了，出门是往湘赣方向去的大道，城门边的城墙上长满了青苔，显示着岁月斑驳的痕迹。]],
  exit = {
    w = { to = '襄阳城西城巷#1', },
    s = { to = '襄阳城朱雀门', },
    n = { to = '襄阳城南街#3', },
  },
},

['襄阳城蒙古军营'] = {
  id = '襄阳城蒙古军营',
  area = '襄阳城',
  name = '蒙古军营',
  desc =  [[这里是蒙古攻击襄阳的临时军营，时时有士兵来回巡逻。往西南便能到达襄阳。]],
  exit = {
    enter = { to = '襄阳城营帐中', },
    sw = { to = '襄阳城青石大道#2N', },
  },
},

['襄阳城世德堂'] = {
  id = '襄阳城世德堂',
  area = '襄阳城',
  name = '世德堂',
  desc =  [[你走进一座两开间的大厅，当中一块大匾，写着三个大字：“世德堂”。厅上中堂条幅，云板花瓶，陈设的甚是考究，一派豪绅大宅的气派。]],
  exit = {
    e = { to = '襄阳城卧房#2', },
    s = { to = '襄阳城天井#1', },
    w = { to = '襄阳城卧房#1', },
    n = { to = '襄阳城温府大门', },
  },
},

['襄阳城北城巷#4'] = {
  id = '襄阳城北城巷#4',
  area = '襄阳城',
  name = '北城巷',
  desc =  [[这里是由西门通往北门的一条小巷，因为地处襄阳城北，所以人们把这里叫做北城巷。走在这条小街上举目望去，巷子两旁是各式各样的店铺，人来人往，很是热闹。]],
  exit = {
    e = { to = '襄阳城北街#3', },
    w = { to = '襄阳城北城巷#3', },
  },
},

['襄阳城玄武门'] = {
  id = '襄阳城玄武门',
  area = '襄阳城',
  name = '玄武门',
  desc =  [[这里是军事重镇襄阳城的北门，不时地有顶盔贯甲的士兵走来走去。向北可以进入陕西、河南境内，还能去参观著名的武当山。城门的墙上张贴着一纸告示(gaoshi)。]],
  exit = {
    s = { to = '襄阳城玄武门内街', },
    n = { to = '襄阳城青石大道#1N', },
  },
},

['襄阳城山间空地'] = {
  id = '襄阳城山间空地',
  area = '襄阳城',
  name = '山间空地',
  desc =  [[这里是山麓上的一块空地，路旁的杂草和树木被人休整过了。路旁有一个用树木搭起的小屋，小屋的门口有一些猎人在休息。一些弓箭和绳索挂在路旁的树上。西北方向有一片树林，史家五兄弟正在这里好象要抓什么动物。]],
  exit = {
    ed = { to = '襄阳城山路#3', },
    nw = { to = '襄阳郊外山路#1', },
  },
},

['襄阳城山间小路#1'] = {
  id = '襄阳城山间小路#1',
  area = '襄阳城',
  name = '山间小路',
  desc =  [[你走在一条蜿蜒而上的山间小路上，这里十分荒凉，偶尔听见几声鸟鸣。你的心不由的绷紧了。]],
  exit = {
    su = { to = '襄阳城山间小路#2', },
    n = { to = '襄阳城西门外', },
  },
},

['襄阳城北城巷#2'] = {
  id = '襄阳城北城巷#2',
  area = '襄阳城',
  name = '北城巷',
  desc =  [[这里是由西门通往北门的一条小巷，因为地处襄阳城北，所以人们把这里叫做北城巷。走在这条小街上举目望去，巷子两旁是各式各样的店铺，人来人往，很是热闹。北面是一家客栈，西面有家店铺，门口挂有一幅幌子，上面画着一条鱼。]],
  exit = {
    e = { to = '襄阳城北城巷#3', },
    w = { to = '襄阳城鲜鱼店', },
    s = { to = '襄阳城北城巷#1', },
    n = { to = '襄阳城江湖客栈', },
  },
},

['襄阳城客栈二楼'] = {
  id = '襄阳城客栈二楼',
  area = '襄阳城',
  name = '客栈二楼',
  desc =  [[这是一间很大的客房，陈设十分简陋。靠墙放了十几张小木床，不少客人正和衣而卧，满屋子都是呼呼的打酣声。西边有张床是空的，你蹑手蹑脚地走了过去。]],
  exit = {
    d = { to = '襄阳城江湖客栈', },
  },
},

['襄阳城土路#1N'] = {
  id = '襄阳城土路#1N',
  area = '襄阳城',
  name = '土路',
  desc =  [[你走在鄂陕豫交界的土路上，偶尔会有人骑着马匆匆而过。往西北进入陕西境内，东北进入河南境内。南边通向襄阳城，西边远处就是老河口了。]],
  exit = {
    ne = { to = '襄阳城土路#1NE', },
    s = { to = '襄阳城青石大道#2N', },
    nw = { to = '襄阳城土路#1NW', },
    w = { to = '襄阳城汉水东岸', },
  },
},

['襄阳城青石大道#1N'] = {
  id = '襄阳城青石大道#1N',
  area = '襄阳城',
  name = '青石大道',
  desc =  [[你走在一条青石大道上，人来人往非常繁忙，不时有人骑着马匆匆而过。大道往北进入陕西、河南境内。南边通向襄阳城。]],
  exit = {
    s = { to = '襄阳城玄武门', },
    n = { to = '襄阳城青石大道#2N', },
  },
},

['襄阳城北丁字街'] = {
  id = '襄阳城北丁字街',
  area = '襄阳城',
  name = '北丁字街',
  desc =  [[这里是军事重镇襄阳城中通往北门和西门的丁字路口，不时地有顶盔贯甲的士兵走来走去。向东转走北街出城可以进入陕西、河南境内，还能去参观著名的武当山。西面直走出城是四川方向，南面方向隐约有一座牌楼。]],
  exit = {
    e = { to = '襄阳城北街#1', },
    s = { to = '襄阳城西牌楼', },
    w = { to = '襄阳城西街', },
  },
},

['襄阳城汉水西岸'] = {
  id = '襄阳城汉水西岸',
  area = '襄阳城',
  name = '汉水西岸',
  desc =  [[汉水西岸也是相当热闹，自西岸渡口往西，一条笔直的土路直通武当山。此地民风淳朴，路旁夹柳成阴，酒厮林立，且都有一面大大的「酒」旗迎风飘扬，蔚为壮观。也有不少小贩沿路叫买，语多难辨，却也令人盛情难却。]],
  exit = {
    enter = { to = '襄阳城渡船', unstable = true, handler = 'embark', no_wander = true, },
    hidden = { to = '襄阳城汉水东岸', cmd = 'dujiang', cond = 'player.enable.dodge and player.enable.dodge.level >= 80', },
    w = { to = '武当山黄土路#1', },
  },
},

['襄阳城武馆大门'] = {
  id = '襄阳城武馆大门',
  area = '襄阳城',
  name = '武馆大门',
  desc =  [[这里是襄阳武馆的大门，两扇黑漆漆的木门向左右敞开着，门口的正上方高悬着一块黑底金字的大匾，匾上写着四个大字：「襄陽武舘」。大门两边立柱上竖着一副对联：	  「幾多離合兩行帛絹難綉盡」	  「千古恩怨三尺青鋒一斬空」门前的台阶两旁各立着一个石狮，从大门口向里面瞧去，武馆的院子里人来人往，忙忙碌碌。而门口更是车水马龙，人来人往川流不息。大门旁边站着一个门卫，脸上神情威严却又饱含岁月沧桑。]],
  exit = {
    enter = { to = '武馆门廊', cond = 'player.exp < 3000 or player.flag["story 连城诀-武馆探秘"]', },
    s = { to = '襄阳城青龙门内街', },
  },
},

['襄阳城蓝田'] = {
  id = '襄阳城蓝田',
  area = '襄阳城',
  name = '蓝田',
  desc =  [[蓝田自古出产美玉，不仅玉质好，也可已入药。这里已是长安附近，东南边是去湖北的正路。]],
  exit = {
    se = { to = '襄阳城土路#2NW', },
    n = { to = '长安城官道#3S', },
  },
},

['襄阳城南城巷#3'] = {
  id = '襄阳城南城巷#3',
  area = '襄阳城',
  name = '南城巷',
  desc =  [[这是一条安静的小巷，两边种着许多大树。从这里一直往东走，可以通往青龙门内街。巷子南面是一家大宅院，两扇大门敞开着。大门旁边站有两个家丁。路北面是个兵营，一些兵丁进进出出。]],
  exit = {
    e = { to = '襄阳城南城巷#2', },
    w = { to = '襄阳城南城巷#4', },
    s = { to = '襄阳城温府大门', },
    n = { to = '襄阳城兵营', },
  },
},

['襄阳城北街#3'] = {
  id = '襄阳城北街#3',
  area = '襄阳城',
  name = '北街',
  desc =  [[这是由襄阳北门通往城中心的街道，路面很宽，两旁种着柳树。街道上人来人往，很是热闹。经常有衣帽光鲜的少年，骑马向北门而去。东面是一家生意惨淡的赌场，门口挂有一张旗，上面画个硕大的骰子。]],
  exit = {
    e = { to = '襄阳城万金赌坊', },
    s = { to = '襄阳城北街#2', },
    w = { to = '襄阳城北城巷#4', },
    n = { to = '襄阳城玄武门内街', },
  },
},

['襄阳城擂台前广场'] = {
  id = '襄阳城擂台前广场',
  area = '襄阳城',
  name = '擂台前广场',
  desc =  [[这里是襄阳擂台前面的一个大型广场，有许多人正在擂台上比武，到处是人山人海，如果你也想试试身手，那么就请上擂台比试比试吧。]],
  exit = {
    n = { to = '襄阳城北城巷#3', },
  },
},

['襄阳城成衣铺'] = {
  id = '襄阳城成衣铺',
  area = '襄阳城',
  name = '成衣铺',
  desc =  [[这里是一家成衣铺，店面很小，门前的树墙上晾着一件对襟小褂。屋子里也不是很宽敞，进门对面的架上挂着几件长袍。几个唧唧喳喳的姑娘围着一件旗袍在议论着什么。墙上挂着一个木牌(paizi)。]],
  exit = {
    w = { to = '襄阳城东城巷#3', },
  },
},

['襄阳城白虎门内街'] = {
  id = '襄阳城白虎门内街',
  area = '襄阳城',
  name = '白虎门内街',
  desc =  [[这里是襄阳城的西门——白虎门内的一条街道。举目望去，道路两旁的建筑都很低矮凌乱，不成章法。但是却很热闹。走在这条小街上，耳旁总会不时传来一阵阵喧闹嘈杂的人声。]],
  exit = {
    e = { to = '襄阳城西街', },
    w = { to = '襄阳城白虎门', },
    s = { to = '襄阳城西城巷#5', },
    n = { to = '襄阳城北城巷#1', },
  },
},

['襄阳城南街#1'] = {
  id = '襄阳城南街#1',
  area = '襄阳城',
  name = '南街',
  desc =  [[这是由襄阳城中心通往南门的一条大街，路面很宽，两旁种满了郁郁葱葱的垂柳。行人很多，街上的人群中，偶尔可以看到几个年少英俊的公子哥腰里佩着宝剑，招摇过市。道西有对红木大门，门前左右摆有一对石狮子。那里是襄阳府衙的所在。]],
  exit = {
    e = { to = '襄阳城南丁字街', },
    w = { to = '襄阳城衙门', },
    s = { to = '襄阳城南街#2', },
    n = { to = '襄阳城西牌楼', },
  },
},

['襄阳城西城巷#4'] = {
  id = '襄阳城西城巷#4',
  area = '襄阳城',
  name = '西城巷',
  desc =  [[这是一条安静的小巷，两边种着许多大树。地面上铺着一层白石子，踩上去发出沙沙的响声。从这里一直往南走，可以通往朱雀门内街。北面通往白虎门。巷子西面是一家豆腐坊。]],
  exit = {
    s = { to = '襄阳城西城巷#3', },
    w = { to = '襄阳城豆腐坊', },
    n = { to = '襄阳城西城巷#5', },
  },
},

['襄阳城玄武门内街'] = {
  id = '襄阳城玄武门内街',
  area = '襄阳城',
  name = '玄武门内街',
  desc =  [[这里是军事重镇襄阳城的北门内，不时地有顶盔贯甲的士兵走来走去。向北出城可以进入陕西、河南境内，还能去参观著名的武当山。]],
  exit = {
    e = { to = '襄阳城东城巷#1', },
    s = { to = '襄阳城北街#3', },
    n = { to = '襄阳城玄武门', },
  },
},

['襄阳城西城巷#1'] = {
  id = '襄阳城西城巷#1',
  area = '襄阳城',
  name = '西城巷',
  desc =  [[这是一条安静的小巷，两边种着许多大树。地面上铺着一层白石子，踩上去发出沙沙的响声。从这里一直往东走，可以通往朱雀门内街。北面通往白虎门。巷子西面是一家药材铺，南面是一家私塾，传来一阵阵读书声。]],
  exit = {
    e = { to = '襄阳城朱雀门内街', },
    w = { to = '襄阳城药材铺', },
    s = { to = '襄阳城私塾', },
    n = { to = '襄阳城西城巷#2', },
  },
},

['襄阳城天井#1'] = {
  id = '襄阳城天井#1',
  area = '襄阳城',
  name = '天井',
  desc =  [[你走进一个小天井，青石板铺路，路周围种着四季花草，两边有月亮门通向别的院落，纵是一个小小的天井，布置的也是精巧细致，别具匠心。]],
  exit = {
    e = { to = '襄阳城吟淼阁', },
    w = { to = '襄阳城练武场', },
    s = { to = '襄阳城后花园', },
    n = { to = '襄阳城世德堂', },
  },
},

['襄阳城东城巷#3'] = {
  id = '襄阳城东城巷#3',
  area = '襄阳城',
  name = '东城巷',
  desc =  [[这是由青龙门通往玄武门的一条小巷，地处襄阳城东。路面上铺满了大大小小的青石，两旁是郁郁葱葱的柳树，树下有几个行人在乘凉。远处的巷口有几个穷汉在躺着晒太阳，路东有家成衣铺，半开着门。]],
  exit = {
    e = { to = '襄阳城成衣铺', },
    s = { to = '襄阳城东城巷#4', },
    n = { to = '襄阳城东城巷#2', },
  },
},

['襄阳城茶叶店'] = {
  id = '襄阳城茶叶店',
  area = '襄阳城',
  name = '茶叶店',
  desc =  [[这是一家生意兴隆的茶叶店，人们进进出出地很是热闹，柜台外面摆着好几个大个的簸箕，里面平铺着一层茶叶在晾晒。柜台上面则是几个黑色的木头匣子，里面飘出一股淡淡的茶叶清香。]],
  exit = {
    e = { to = '襄阳城西城巷#5', },
  },
},

['襄阳城南丁字街'] = {
  id = '襄阳城南丁字街',
  area = '襄阳城',
  name = '南丁字街',
  desc =  [[这里是军事重镇襄阳城中通往南门和东门的丁字路口，不时地有顶盔贯甲的士兵走来走去。向南出城可以去湖南，向东出城可以去安徽、江苏。北面方向有一座高大的牌楼。]],
  exit = {
    e = { to = '襄阳城东街#1', },
    w = { to = '襄阳城南街#1', },
    n = { to = '襄阳城东牌楼', },
  },
},

['襄阳城山间小路#2'] = {
  id = '襄阳城山间小路#2',
  area = '襄阳城',
  name = '山间小路',
  desc =  [[你走在一条蜿蜒而上的山间小路上，这里十分荒凉，前面不远处就是一些小树林，南面有条小路通向树林深处。]],
  exit = {
    nd = { to = '襄阳城山间小路#1', },
    sw = { to = '襄阳城山间小路#3', },
  },
},

['襄阳城小路#2'] = {
  id = '襄阳城小路#2',
  area = '襄阳城',
  name = '小路',
  desc =  [[你来到了鄂川交界的小路上，偶尔会有人骑着马匆匆而过，卷起飞扬的尘土。东北边通向襄阳城，往西则进入四川的大道。]],
  exit = {
    w = { to = '成都城大道#4E', },
    ne = { to = '襄阳城小路#1', },
  },
},

['襄阳城西牌楼'] = {
  id = '襄阳城西牌楼',
  area = '襄阳城',
  name = '西牌楼',
  desc =  [[这里是襄阳城中心的一个广场，广场中央立有一座汉白玉的牌楼，牌楼很高，最上面镂刻着两条腾空飞舞的青龙，龙的中间雕有一头昂首挺胸的麒麟瑞兽，看起来威武神气，气势不凡。南边有一条青石大道，一直通往襄阳城的南大门：朱雀门。北面是一条热闹的街道。]],
  exit = {
    s = { to = '襄阳城南街#1', },
    n = { to = '襄阳城北丁字街', },
  },
},

['襄阳城汉水东岸'] = {
  id = '襄阳城汉水东岸',
  area = '襄阳城',
  name = '汉水东岸',
  desc =  [[面前是一条波涛翻滚的大江(river)。 浊流滚滚，万舟竞发。两岸渡船来来往往，江边一长溜摆满了鱼摊，渔家就将船泊在岸边，几个破萝上面支一块木板，板上摆满了活蹦乱跳的汉江鲤鱼。过去不远，是有名的老河口，不少过江客都在这里等待渡船摆渡。]],
  exit = {
    e = { to = '襄阳城土路#1N', },
    hidden = { to = '襄阳城汉水西岸', cmd = 'dujiang', cond = 'player.enable.dodge and player.enable.dodge.level >= 80', },
    enter = { to = '襄阳城渡船', unstable = true, handler = 'embark', no_wander = true, },
  },
},

['襄阳城湘鄂交界'] = {
  id = '襄阳城湘鄂交界',
  area = '襄阳城',
  name = '湘鄂交界',
  desc =  [[你走在湘鄂交界的土路上，偶尔会有人骑着马匆匆而过。这里已经是湖南地界，往北进入湖北境内。]],
  exit = {
    n = { to = '襄阳城湘鄂土路', },
    sw = { to = '襄阳城泸溪北', },
  },
},

['襄阳城衙门'] = {
  id = '襄阳城衙门',
  area = '襄阳城',
  name = '衙门',
  desc =  [[这里是衙门大门，两扇朱木大门紧紧关闭着。“肃静”“回避”的牌子分放两头石狮子的旁边。前面有一个大鼓，显然是供小民鸣冤用的。几名衙役在门前巡逻。]],
  exit = {
    e = { to = '襄阳城南街#1', },
    s = { to = '襄阳城储藏室', },
    n = { to = '襄阳城正厅#1', },
  },
},

['襄阳城废宅'] = {
  id = '襄阳城废宅',
  area = '襄阳城',
  name = '废宅',
  desc =  [[这是一个荒废的宅院，院子里长满了青草和不知名的各种低矮灌木丛。崩塌的黄土墙破败不堪，和外面繁华热闹的街道形成鲜明的对比。这里平常没有什么人来，成了叫化子们休息的地方。这里是丐帮的大义分舵。]],
  exit = {
    w = { to = '襄阳城东城巷#1', },
  },
},

['襄阳城南门外'] = {
  id = '襄阳城南门外',
  area = '襄阳城',
  name = '南门外',
  desc =  [[这是襄阳南门外的一条青石大道，路上人来人往非常繁忙，不时有人骑着马匆匆而过。这里往南进入湖南境内。北边通向襄阳城的南门朱雀门。]],
  exit = {
    s = { to = '襄阳城青石大道#1S', },
    n = { to = '襄阳城朱雀门', },
  },
},

['襄阳城青石大道#1E'] = {
  id = '襄阳城青石大道#1E',
  area = '襄阳城',
  name = '青石大道',
  desc =  [[你走在一条青石大道上，人来人往非常繁忙，不时有人骑着马匆匆而过。大道往西进入安徽境内。东边通向扬州城。]],
  exit = {
    w = { to = '襄阳城土路#1E', },
    e = { to = '扬州城西郊', },
  },
},

['襄阳城朱雀门'] = {
  id = '襄阳城朱雀门',
  area = '襄阳城',
  name = '朱雀门',
  desc =  [[这里是军事重镇襄阳城的南门，因为这边离战场较远，所以显得繁华热闹得多。向南出城可以去湖南。城门的墙上张贴着一纸告示(gaoshi)。]],
  exit = {
    s = { to = '襄阳城南门外', },
    n = { to = '襄阳城朱雀门内街', },
  },
},

['襄阳城东城巷#5'] = {
  id = '襄阳城东城巷#5',
  area = '襄阳城',
  name = '东城巷',
  desc =  [[这里是由青龙门通往玄武门的一条小巷，地处襄阳城东，巷口旁边立着一块石碑(bei)，上写着几个小字。远处的巷口有几个穷汉在躺着晒太阳，从这里一直往北走，可以通往玄武门。]],
  exit = {
    s = { to = '襄阳城东街#2', },
    n = { to = '襄阳城东城巷#4', },
  },
},

['襄阳城土路#1E'] = {
  id = '襄阳城土路#1E',
  area = '襄阳城',
  name = '土路',
  desc =  [[你走在一条土路上，偶尔有马匹经过，搞得尘土飞扬。因为地近安徽，所以可能会有山贼出没。往西就进入安徽境内了。东边通向扬州城。]],
  exit = {
    e = { to = '襄阳城青石大道#1E', },
    w = { to = '襄阳城东门外', },
    n = { to = '蝴蝶谷山壁', },
  },
},

['襄阳城小路#1'] = {
  id = '襄阳城小路#1',
  area = '襄阳城',
  name = '小路',
  desc =  [[你走在一条小路上，偶尔会有人骑着马匆匆而过，卷起飞扬的尘土。东北边通向襄阳城，西南通向四川。]],
  exit = {
    ne = { to = '襄阳城檀溪', },
    sw = { to = '襄阳城小路#2', },
    n = { to = '柳宗镇小路', },
  },
},

['襄阳城白虎门'] = {
  id = '襄阳城白虎门',
  area = '襄阳城',
  name = '白虎门',
  desc =  [[这里是军事重镇襄阳城的西门，由此向西可往四川、云贵。不时地有顶盔贯甲的士兵走来走去。城外由于连年的战争，百姓流离失所，造成了大片的荒地，人烟稀少。城门的墙上张贴着一纸告示(gaoshi)。]],
  exit = {
    e = { to = '襄阳城白虎门内街', },
    w = { to = '襄阳城西门外', },
  },
},

['襄阳城鲜鱼店'] = {
  id = '襄阳城鲜鱼店',
  area = '襄阳城',
  name = '鲜鱼店',
  desc =  [[这是一家卖鲜鱼的铺子，店里到处摆放着大大小小的鱼篓，水淋淋的。靠门边放着一口大水缸，里面有很多活蹦乱跳的鲜鱼。一个身上扎围裙的中年女子，站在那里，眼光望向屋外。]],
  exit = {
    e = { to = '襄阳城北城巷#2', },
  },
},

['襄阳城北城巷#3'] = {
  id = '襄阳城北城巷#3',
  area = '襄阳城',
  name = '北城巷',
  desc =  [[这里是由西门通往北门的一条小巷，因为地处襄阳城北，所以人们把这里叫做北城巷。走在这条小街上举目望去，巷子两旁是各式各样的店铺，人来人往，很是热闹。这里的北面有一家猪肉铺子，南面是个小广场，广场上人声鼎沸，远远看去可以看见一个擂台。]],
  exit = {
    e = { to = '襄阳城北城巷#4', },
    s = { to = '襄阳城擂台前广场', },
    w = { to = '襄阳城北城巷#2', },
    n = { to = '襄阳城猪肉店', },
  },
},

['襄阳城储藏室'] = {
  id = '襄阳城储藏室',
  area = '襄阳城',
  name = '储藏室',
  desc =  [[这里以前是衙门里的一间客厅，后来被改成了储藏室，房间里乱七八糟堆满了东西，角落里有几只老鼠蹿来蹿去。西首的墙上挂着一幅对联，因为年代久远，已经无法分辨出那上面的字迹。]],
  exit = {
    n = { to = '襄阳城衙门', },
  },
},

['襄阳城北街#1'] = {
  id = '襄阳城北街#1',
  area = '襄阳城',
  name = '北街',
  desc =  [[这是由北门通往城中心的街道，路面很宽，两旁种着柳树。街道上人来人往，很是热闹。人群里面好象还有不少武林中人，偶尔有几个衣帽光鲜的少年人牵马结伴穿闹市而过。站在这里向南面望去，可以看见一座牌楼，西面是一条青石路，通往城西。]],
  exit = {
    w = { to = '襄阳城北丁字街', },
    s = { to = '襄阳城东牌楼', },
    n = { to = '襄阳城北街#2', },
  },
},

['襄阳城小吃店'] = {
  id = '襄阳城小吃店',
  area = '襄阳城',
  name = '小吃店',
  desc =  [[这是一家生意兴隆的小吃店，人来人往很是热闹，为数不多的长条板凳上都坐得满满的，还有些过路人站在外面等着。角落里有几个江湖豪客在大声谈论着什么，好象是最近武林的传闻。]],
  exit = {
    e = { to = '襄阳城北城巷#1', },
  },
},

['襄阳城青石大道#1S'] = {
  id = '襄阳城青石大道#1S',
  area = '襄阳城',
  name = '青石大道',
  desc =  [[你走在一条青石大道上，人来人往非常繁忙，不时有人骑着马匆匆而过。大道往南进入湖南境内。北边通向襄阳城。]],
  exit = {
    s = { to = '襄阳城湘鄂土路', },
    n = { to = '襄阳城南门外', },
  },
},

['襄阳城青龙门内街'] = {
  id = '襄阳城青龙门内街',
  area = '襄阳城',
  name = '青龙门内街',
  desc =  [[这里是军事重镇襄阳城的东门内，不时地有顶盔贯甲的士兵走来走去。向东出城可以进入安徽、江苏境内。南边有条小巷，小巷两边种着许多大树。北面是襄阳武馆。]],
  exit = {
    e = { to = '襄阳城青龙门', },
    s = { to = '襄阳城南城巷#1', },
    w = { to = '襄阳城东街#2', },
    n = { to = '襄阳城武馆大门', },
  },
},

['襄阳城西城巷#5'] = {
  id = '襄阳城西城巷#5',
  area = '襄阳城',
  name = '西城巷',
  desc =  [[这是一条安静的小巷，两边种着许多大树。地面上铺着一层白石子，踩上去发出沙沙的响声。从这里一直往南走，可以通往朱雀门内街。北面通往白虎门。巷子西面是一家店铺，两扇门敞开着。]],
  exit = {
    s = { to = '襄阳城西城巷#4', },
    w = { to = '襄阳城茶叶店', },
    n = { to = '襄阳城白虎门内街', },
  },
},

['襄阳城土路#1NE'] = {
  id = '襄阳城土路#1NE',
  area = '襄阳城',
  name = '土路',
  desc =  [[你走在豫鄂交界的土路上，偶尔会有人骑着马匆匆而过。这里已经是河南地界，往西南进入湖北境内。]],
  exit = {
    ne = { to = '襄阳城土路#2NE', },
    sw = { to = '襄阳城土路#1N', },
  },
},

['襄阳城吟淼阁'] = {
  id = '襄阳城吟淼阁',
  area = '襄阳城',
  name = '吟淼阁',
  desc =  [[你上得楼来，眼前一耀，先闻到一阵幽幽的香气，只见房中点了一支大红烛，照得满室生春，床上珠罗纱的帐子，白色缎被上绣着一只黄色的凤凰，壁上挂着一幅工笔仕女图。床前桌上放着一张雕花端砚，几件碧玉玩物。笔筒中插了大大小小六七支笔，西首一张几上供着一盆兰花，架上停着一只白鹦鹉。满室锦绣，连椅披上也绣了花。]],
  exit = {
    w = { to = '襄阳城天井#1', },
  },
},

['蝴蝶谷山壁'] = {
  id = '蝴蝶谷山壁',
  area = '蝴蝶谷',
  name = '山壁',
  desc =  [[这里嫣红姹紫，遍山遍野都是鲜花，春光浪漫已极，转了几个弯，却见迎面一块山壁，路途已尽。旁边是一排花丛(huacong)。]],
  exit = {
    s = { to = '襄阳城土路#1E', },
    right = { to = '蝴蝶谷花丛中', door = 'bo huacong', cond = 'player.party == "明教"', },
  },
},

['蝴蝶谷花丛中'] = {
  id = '蝴蝶谷花丛中',
  area = '蝴蝶谷',
  name = '花丛中',
  desc = [[这里周围都是嫣红姹紫的鲜花，各种奇花异草，份外芬香。眼前有一条小径夹杂在鲜花丛中。]],
  exit = {
    out = { to = '蝴蝶谷山壁', },
    n = { to = '蝴蝶谷小径#1', },
  },
},

['蝴蝶谷小径#1'] = {
  id = '蝴蝶谷小径#1',
  area = '蝴蝶谷',
  name = '小径',
  desc = [[你走了一阵，突然发现几只蝴蝶向前飞去，你心里不由一喜，向着蝴蝶飞的方向走了过去。]],
  exit = {
    s = { to = '蝴蝶谷花丛中', },
    n = { to = '蝴蝶谷小径#2', },
  },
},

['蝴蝶谷小径#2'] = {
  id = '蝴蝶谷小径#2',
  area = '蝴蝶谷',
  name = '小径',
  desc = [[你沿着小路行了一程，蝴蝶逐渐多了起来，你更加加快脚步向前走去。]],
  exit = {
    s = { to = '蝴蝶谷小径#1', },
    n = { to = '蝴蝶谷小径#3', },
  },
},

['蝴蝶谷小径#3'] = {
  id = '蝴蝶谷小径#3',
  area = '蝴蝶谷',
  name = '小径',
  desc = [[你走着走着，眼前的蝴蝶越来越多，或花或白，或黑或紫，翩翩起舞。蝴蝶也不畏人，飞近的时候便在你的头上、肩上、手上停留。看来已经到了蝴蝶谷了。]],
  exit = {
    ne = { to = '蝴蝶谷空地', },
    s = { to = '蝴蝶谷小径#2', },
  },
},

['蝴蝶谷空地'] = {
  id = '蝴蝶谷空地',
  area = '蝴蝶谷',
  name = '空地',
  desc = [[这里是一片大的空地，据说当年蝴蝶谷誓师大会便是在这里进行的，空地右边有一条小溪，弯弯曲曲不知通往何方。]],
  exit = {
    ne = { to = '蝴蝶谷山路#1E', },
    sw = { to = '蝴蝶谷小径#3', },
    nw = { to = '蝴蝶谷山路#1W', },
    n = { to = '蝴蝶谷牛棚', },
  },
},

['蝴蝶谷山路#1W'] = {
  id = '蝴蝶谷山路#1W',
  area = '蝴蝶谷',
  name = '山路',
  desc = [[这是一条弯弯曲曲的山路，不知通向何方。]],
  exit = {
    nu = { to = '蝴蝶谷山路#2W', },
    se = { to = '蝴蝶谷空地', },
  },
},

['蝴蝶谷山路#2W'] = {
  id = '蝴蝶谷山路#2W',
  area = '蝴蝶谷',
  name = '山路',
  desc = [[这是一条弯弯曲曲的山路，西面传来阵阵清香，你循着清香走了过去。]],
  exit = {
    wd = { to = '蝴蝶谷花圃#M', },
    sd = { to = '蝴蝶谷山路#1W', },
  },
},

['蝴蝶谷山路#1E'] = {
  id = '蝴蝶谷山路#1E',
  area = '蝴蝶谷',
  name = '山路',
  desc = [[这是一条弯弯曲曲的山路，不知通向何方。]],
  exit = {
    nu = { to = '蝴蝶谷山路#2E', },
    sw = { to = '蝴蝶谷空地', },
  },
},

['蝴蝶谷山路#2E'] = {
  id = '蝴蝶谷山路#2E',
  area = '蝴蝶谷',
  name = '山路',
  desc = [[这是一条弯弯曲曲的山路，东面传来阵阵清香，你循着清香走了过去。]],
  exit = {
    ed = { to = '蝴蝶谷花圃#M', },
    sd = { to = '蝴蝶谷山路#1E', },
  },
},

['蝴蝶谷牛棚'] = {
  id = '蝴蝶谷牛棚',
  area = '蝴蝶谷',
  name = '牛棚',
  desc = [[这里是蝴蝶谷的牛棚，据说因倒毙在这里的人不计其数，使得“见死不救”胡青牛的大名天下闻名。]],
  exit = {
    s = { to = '蝴蝶谷空地', },
    nd = { to = '蝴蝶谷草径', cond = 'player.master == "张无忌"', },
    hidden = { to = '蝴蝶谷花圃#M', cmd = 'nd', cond = 'player.master ~= "张无忌" and player.jing > 500', },
  },
},

['蝴蝶谷花圃#M'] = {
  id = '蝴蝶谷花圃#M',
  area = '蝴蝶谷',
  name = '花圃',
  desc = [[这里是蝴蝶谷的花圃，是“见死不救”胡青牛用来种各种各样药材的，里面种满了诸般花草。]],
  exit = {
    e = { to = '蝴蝶谷花圃#M', },
    s = { to = '蝴蝶谷花圃#M', },
    w = { to = '蝴蝶谷花圃#M', },
    n = { to = '蝴蝶谷花圃#M', },
    hidden1 = { to = '蝴蝶谷草径', cost = 15, handler = 'hdg_huapu', },
    hidden2 = { to = '蝴蝶谷牛棚', cost = 15, handler = 'hdg_huapu', },
  },
},

['蝴蝶谷草径'] = {
  id = '蝴蝶谷草径',
  area = '蝴蝶谷',
  name = '草径',
  desc = [[这是一片草地，过了这片草地有七八间茅屋，茅屋的前后左右都是花圃，看来已经到了蝶谷医仙胡青牛的住处了。]],
  exit = {
    e = { to = '蝴蝶谷厢房#SE', },
    w = { to = '蝴蝶谷茅棚', },
    n = { to = '蝴蝶谷茅屋', },
    s = { to = '蝴蝶谷牛棚', cond = 'player.master == "张无忌"', },
    hidden = { to = '蝴蝶谷花圃#M', cmd = 's', cond = 'player.master ~= "张无忌" and player.jing > 500', },
  },
},

['蝴蝶谷茅棚'] = {
  id = '蝴蝶谷茅棚',
  area = '蝴蝶谷',
  name = '茅棚',
  desc = [[这里是一间简陋的茅棚，里面堆放着一些干柴和茅草，看来是用来生火用的，墙边靠着一些花锄和浇水用的水壶。]],
  exit = {
    e = { to = '蝴蝶谷草径', },
    w = { to = '蝴蝶谷花圃#W', },
    n = { to = '蝴蝶谷厢房#W', },
  },
},

['蝴蝶谷花圃#W'] = {
  id = '蝴蝶谷花圃#W',
  area = '蝴蝶谷',
  name = '花圃',
  desc = [[这里是蝴蝶谷的花圃，是“见死不救”胡青牛用来种各种各样药材的，里面种满了诸般花草。]],
  exit = {
    e = { to = '蝴蝶谷茅棚', },
  },
},

['蝴蝶谷厢房#W'] = {
  id = '蝴蝶谷厢房#W',
  area = '蝴蝶谷',
  name = '厢房',
  desc = [[这里是一间很大的厢房，陈设虽然比较简陋，但是十分干净，摆放十分别致，靠近墙边的地方放了一些木床，看来是给求医的病人住宿用的。]],
  exit = {
    e = { to = '蝴蝶谷茅屋', },
    s = { to = '蝴蝶谷茅棚', },
    n = { to = '蝴蝶谷厨房', },
  },
},

['蝴蝶谷厨房'] = {
  id = '蝴蝶谷厨房',
  area = '蝴蝶谷',
  name = '厨房',
  desc = [[这是一间宽敞的厨房，一个小童正在忙碌着作饭，整个房间弥漫着令人垂涎欲滴的菜香，看来这个小童的手艺还不错。你走了半天本来就饿的肚子不由地咕咕交了起来。]],
  exit = {
    e = { to = '蝴蝶谷草堂', },
    s = { to = '蝴蝶谷厢房#W', },
    n = { to = '蝴蝶谷花圃#N', },
  },
},

['蝴蝶谷花圃#N'] = {
  id = '蝴蝶谷花圃#N',
  area = '蝴蝶谷',
  name = '花圃',
  desc = [[这里是蝴蝶谷的花圃，是“见死不救”胡青牛用来种各种各样药材的，里面种满了诸般花草。]],
  exit = {
    s = { to = '蝴蝶谷厨房', },
    n = { to = '蝴蝶谷后山', },
  },
},

['蝴蝶谷后山'] = {
  id = '蝴蝶谷后山',
  area = '蝴蝶谷',
  name = '后山',
  desc = [[这里是蝴蝶谷的后山，非常空旷，显得很安静，三面都是悬崖峭壁，犹如世外桃源一般。]],
  exit = {
    s = { to = '蝴蝶谷花圃#N', },
  },
},

['蝴蝶谷厢房#SE'] = {
  id = '蝴蝶谷厢房#SE',
  area = '蝴蝶谷',
  name = '厢房',
  desc = [[这里是一间很大的厢房，陈设虽然比较简陋，但是十分干净，摆放十分别致，靠近墙边的地方放了一些木床，看来是给求医的病人住宿用的。]],
  exit = {
    e = { to = '蝴蝶谷花圃#E', },
    w = { to = '蝴蝶谷草径', },
    n = { to = '蝴蝶谷药房', },
  },
},

['蝴蝶谷花圃#E'] = {
  id = '蝴蝶谷花圃#E',
  area = '蝴蝶谷',
  name = '花圃',
  desc = [[这里是蝴蝶谷的花圃，是“见死不救”胡青牛用来种各种各样药材的，里面种满了诸般花草。]],
  exit = {
    w = { to = '蝴蝶谷厢房#SE', },
  },
},

['蝴蝶谷药房'] = {
  id = '蝴蝶谷药房',
  area = '蝴蝶谷',
  name = '药房',
  desc = [[这里是胡青牛的药房，靠墙边都是一排一排的药柜，每个药柜上都有一张白纸，上面写满了对药材的注释。屋的正中央，有一个小炉子，一个小童正蹲在炉子旁，拿着一把扇子，不停地煽着火，整个屋子一股中药的气息。南北听起来都很安静。]],
  exit = {
    s = { to = '蝴蝶谷厢房#SE', },
    w = { to = '蝴蝶谷茅屋', },
    n = { to = '蝴蝶谷厢房#NE', },
  },
},

['蝴蝶谷厢房#NE'] = {
  id = '蝴蝶谷厢房#NE',
  area = '蝴蝶谷',
  name = '厢房',
  desc = [[这是一间不大的厢房，陈设摆放十分整齐，靠左右墙边的地方各有一张小床，看来是熬药、作饭的两个小童休息的地方。]],
  exit = {
    e = { to = '蝴蝶谷书房', },
    w = { to = '蝴蝶谷草堂', },
    s = { to = '蝴蝶谷药房', },
  },
},

['蝴蝶谷书房'] = {
  id = '蝴蝶谷书房',
  area = '蝴蝶谷',
  name = '书房',
  desc = [[这里是胡青牛的书房，靠墙边有个大书柜，一排一排的书架上分门别类地摆放着各种各样的医学书籍，连失传已久的《黄帝虾嫫经》、《西方子明堂灸经》、《太平圣惠方》、《灸甲乙经》、《千金方》、《此事难知》也在其中，书柜正对着一个书桌，上面摆放着一个笔筒，笔筒旁边搁着一本打开的书。]],
  exit = {
    w = { to = '蝴蝶谷厢房#NE', },
  },
},

['蝴蝶谷茅屋'] = {
  id = '蝴蝶谷茅屋',
  area = '蝴蝶谷',
  name = '茅屋',
  desc = [[这里是一间简陋的茅屋，正中摆放着一张木桌，周围整齐地放着几张凳子，一个小童正坐在那里打瞌睡，看到有人来了，赶忙热情地迎了上来。西面很安静，东面一阵药气传了过来，北面一道帘子，不知道是什么地方。]],
  exit = {
    e = { to = '蝴蝶谷药房', },
    s = { to = '蝴蝶谷草径', },
    w = { to = '蝴蝶谷厢房#W', },
    n = { to = '蝴蝶谷草堂', },
  },
},

['蝴蝶谷草堂'] = {
  id = '蝴蝶谷草堂',
  area = '蝴蝶谷',
  name = '草堂',
  desc = [[这是一个草堂，由于光线充足，显得很明亮，草堂正中有一个檀木桌，桌下面整齐地摆放着四个凳子。正门正对的墙上挂着一幅画，画中是一个神清骨秀的中年人，左右有一副对联，画的正下方有个香案，上面的香炉中插着几根檀香，正冉冉地燃着。正对侧面有一扇竹门(door)虚掩着。]],
  exit = {
    enter = { to = '蝴蝶谷厢房#N', },
    s = { to = '蝴蝶谷茅屋', },
    w = { to = '蝴蝶谷厨房', },
    e = { to = '蝴蝶谷厢房#NE', },
  },
},

['蝴蝶谷厢房#N'] = {
  id = '蝴蝶谷厢房#N',
  area = '蝴蝶谷',
  name = '厢房',
  desc = [[这是一间别致的厢房，推开房门，揭开门帘，但见房内黑沉沉的宛似夜晚，房间内所有的窗户都用毡子遮住了，床上的帐帘也关得严严实实。看来这里就是「见死不救」胡青牛休息的地方了。]],
  exit = {
    out = { to = '蝴蝶谷草堂', },
  },
},

['牛家村村中小路#1'] = {
  id = '牛家村村中小路#1',
  area = '牛家村',
  name = '村中小路',
  desc =  [[一条村中的小路。路边是一家破旧的小酒店，好象已经很久没人来过了的样子。]],
  exit = {
    e = { to = '牛家村村中小路#2', },
    w = { to = '牛家村村口#1', },
    s = { to = '牛家村小酒店', },
  },
},

['牛家村村中小路#5'] = {
  id = '牛家村村中小路#5',
  area = '牛家村',
  name = '村中小路',
  desc =  [[一条村中的小路。南边就是钱塘江了，那边的树下聚集着一些村民。]],
  exit = {
    s = { to = '牛家村江畔#1', },
    n = { to = '牛家村村中小路#4', },
  },
},

['牛家村江畔#3'] = {
  id = '牛家村江畔#3',
  area = '牛家村',
  name = '江畔',
  desc =  [[一条大江横亘在面前，江水浩浩，日日夜夜无穷无休地奔向大海。]],
  exit = {
    w = { to = '牛家村江畔#2', },
    e = { to = '桃花岛海滨', handler = 'prepare_coin', },
  },
},

['牛家村土路#1SE'] = {
  id = '牛家村土路#1SE',
  area = '牛家村',
  name = '土路',
  desc =  [[一条郊外的土路，远处似乎有座村落。]],
  exit = {
    nw = { to = '杭州城青石大道#7', },
    s = { to = '牛家村土路#2SE', handler = 'prepare_coin', },
  },
},

['牛家村归来客栈'] = {
  id = '牛家村归来客栈',
  area = '牛家村',
  name = '归来客栈',
  desc =  [[这是一家靠海的小客栈，本来是为想出海游玩的旅人准备的，可是由于经营不善，生意相当地冷清，柜台旁边放着一个牌子(paizi)。 南面是一条小土路。]],
  exit = {
    u = { to = '牛家村二楼', no_wander = true, },
    s = { to = '牛家村土路#1E', },
  },
},

['牛家村江畔#1'] = {
  id = '牛家村江畔#1',
  area = '牛家村',
  name = '江畔',
  desc =  [[一条大江横亘在面前，江水浩浩，日日夜夜无穷无休地奔向大海。这里有一排乌柏树，叶子似火烧般红。两棵大松树下正围着一堆村民，聚精会神地听着一个瘦削的老者说话。]],
  exit = {
    se = { to = '牛家村江畔#2', },
    n = { to = '牛家村村中小路#5', },
  },
},

['牛家村土路#3SE'] = {
  id = '牛家村土路#3SE',
  area = '牛家村',
  name = '土路',
  desc =  [[一条郊外的土路，东南方有着一座小小的村落。]],
  exit = {
    nw = { to = '牛家村土路#2SE', },
    se = { to = '牛家村村口#1', },
  },
},

['牛家村村中小路#3'] = {
  id = '牛家村村中小路#3',
  area = '牛家村',
  name = '村中小路',
  desc =  [[一条村中的小路。路边是一家民房，好象很久没有人住的样子。南边有条小路通向江边。]],
  exit = {
    e = { to = '牛家村村口#2', },
    s = { to = '牛家村村中小路#4', },
    w = { to = '牛家村村中小路#2', },
    n = { to = '牛家村民房#2', },
  },
},

['牛家村二楼'] = {
  id = '牛家村二楼',
  area = '牛家村',
  name = '二楼',
  desc =  [[这是客栈的二楼，竟然只有两间房子。东厢房的门敞开着，而西厢房的门(men)却是关着的。]],
  exit = {
    e = { to = '牛家村东厢房', },
    d = { to = '牛家村归来客栈', },
    hidden = { to = '牛家村西厢房', cmd = 'kai men', cond = 'player.flag["客栈钥匙"]', },
  },
},

['牛家村西厢房'] = {
  id = '牛家村西厢房',
  area = '牛家村',
  name = '西厢房',
  desc = [[你一走进西厢房，就把门反锁了。环顾四周，只有一张床和一张残破的桌子(zhuozi)。]],
  exit = {
    e = { to = '牛家村二楼', },
  },
},

['牛家村东厢房'] = {
  id = '牛家村东厢房',
  area = '牛家村',
  name = '东厢房',
  desc =  [[一间普通的客房，只有一张床和一张残破的桌子。]],
  exit = {
    w = { to = '牛家村二楼', },
  },
},

['牛家村民房#2'] = {
  id = '牛家村民房#2',
  area = '牛家村',
  name = '民房',
  desc =  [[这是一座废弃已久的民房，家具摆设一应俱全，只是都附着一层灰土。屋子中间是一张小桌，桌上的杯碗还都没有撤去，看来主人去的很匆忙。墙上挂着一杆铁枪。]],
  exit = {
    s = { to = '牛家村村中小路#3', },
  },
},

['牛家村村口#2'] = {
  id = '牛家村村口#2',
  area = '牛家村',
  name = '村口',
  desc =  [[这是一座小村落的东村口。村子很小，笼罩在一片寂静中。南边隐约可以看到一条大江。东北方是条通向海边的小路。]],
  exit = {
    ne = { to = '牛家村土路#1E', },
    w = { to = '牛家村村中小路#3', },
  },
},

['牛家村小渔港'] = {
  id = '牛家村小渔港',
  area = '牛家村',
  name = '小渔港',
  desc =  [[这里是海边的一个小渔港，附近唯一可以出海的地方就是这里了。正要出海的渔民忙碌地来来往往，一个船老大摸样的人正在拼命呼喝着在船上做帮工的渔家孩子。]],
  exit = {
    w = { to = '牛家村土路#1E', },
    hidden = { to = '牛家村船上', handler = 'thd_onboard', },
  },
},

['牛家村船上'] = {
  id = '牛家村船上',
  area = '牛家村',
  name = '船上',
  desc = [[小船已经来到了茫茫大海上。四周除了偶尔掠过头顶的海鸟外，就只剩下你所乘坐的这艘小船和正在聚精会神地摇着橹的梢公了。海风阵阵袭来，你不禁感到一丝凉意。]],
  exit = {
    hidden = { to = '桃花岛岸边', handler = 'thd_sail', cost = 500, },
  },
},

['牛家村小酒店'] = {
  id = '牛家村小酒店',
  area = '牛家村',
  name = '小酒店',
  desc =  [[这是一家已经废弃了的小酒店，柜台上积满了灰，一个角落里堆着一大堆干草，旁边斜躺着一个大铁叉；柜台后的橱架上凌乱地放着几摞破旧的青花瓷碗(wan)。在门前坐着一个梳着朝天辫的小姑娘。]],
  exit = {
    n = { to = '牛家村村中小路#1', },
    hidden = { to = '牛家村密室', cmd = 'move bowl;#3 turn tiewan left;#3 turn tiewan right', },
  },
},

['牛家村密室'] = {
  id = '牛家村密室',
  area = '牛家村',
  name = '密室',
  desc = [[这是一间设计精巧的密室，并不很大，但是却不让人觉得拥挤。地下有一具干枯的骸骨(haigu)，旁边则是一口生锈了的大铁箱(xiang)。墙上有一个小小的圆孔(kong)，通过它能看到外面的情况。]],
  exit = {
    out = { to = '牛家村小酒店', },
  },
},

['牛家村民房#1'] = {
  id = '牛家村民房#1',
  area = '牛家村',
  name = '民房',
  desc =  [[这是一座废弃已久的民房，家具摆设一应俱全，只是都附着一层灰土。屋子中间是一张小桌，桌上的杯碗还都没有撤去，看来主人去的很匆忙。]],
  exit = {
    s = { to = '牛家村村中小路#2', },
  },
},

['牛家村村中小路#4'] = {
  id = '牛家村村中小路#4',
  area = '牛家村',
  name = '村中小路',
  desc =  [[一条村中的小路。往南边看已经可以看到大江了，江水的咆哮声不时地敲击着你的耳鼓。]],
  exit = {
    s = { to = '牛家村村中小路#5', },
    n = { to = '牛家村村中小路#3', },
  },
},

['牛家村村中小路#2'] = {
  id = '牛家村村中小路#2',
  area = '牛家村',
  name = '村中小路',
  desc =  [[一条村中的小路。路边是一家民房，好象很久没有人住的样子了。]],
  exit = {
    e = { to = '牛家村村中小路#3', },
    w = { to = '牛家村村中小路#1', },
    n = { to = '牛家村民房#1', },
  },
},

['牛家村村口#1'] = {
  id = '牛家村村口#1',
  area = '牛家村',
  name = '村口',
  desc =  [[这是一座小村落的西村口。村子很小，笼罩在一片寂静中。南边隐约可以看到一条大江。]],
  exit = {
    nw = { to = '牛家村土路#3SE', },
    e = { to = '牛家村村中小路#1', },
  },
},

['牛家村江畔#2'] = {
  id = '牛家村江畔#2',
  area = '牛家村',
  name = '江畔',
  desc =  [[一条大江横亘在面前，江水浩浩，日日夜夜无穷无休地奔向大海。]],
  exit = {
    nw = { to = '牛家村江畔#1', },
    e = { to = '牛家村江畔#3', },
  },
},

['牛家村土路#1E'] = {
  id = '牛家村土路#1E',
  area = '牛家村',
  name = '土路',
  desc =  [[一条通往海边的土路，东边就是海边的小渔港了，不时从那边传来喧闹声。路的北边有一座老旧的客栈，掉了金的招牌上写着'归来客栈'几个字。]],
  exit = {
    e = { to = '牛家村小渔港', },
    sw = { to = '牛家村村口#2', },
    n = { to = '牛家村归来客栈', },
  },
},

['牛家村土路#2SE'] = {
  id = '牛家村土路#2SE',
  area = '牛家村',
  name = '土路',
  desc =  [[一条郊外的土路，远处似乎有座村落。]],
  exit = {
    se = { to = '牛家村土路#3SE', },
    n = { to = '牛家村土路#1SE', },
  },
},

['大草原草海#3'] = {
  id = '大草原草海#3',
  area = '大草原',
  name = '草海',
  desc =  [[之所以称为草海，就是说四周都是一望无际的草原，它辽阔的程度就好象海洋一样。在草海中行走是很容易迷路的，因为四周地面都被草覆盖了，没有路可以辨认，只能凭借日月星辰辨别方向，草海中还有很多危险的沼泽地。]],
  exit = {
    e = { to = '大草原草海#3', },
    s = { to = '大草原草海#3', ignore = true, },
    w = { to = '大草原沼泽#1', ignore = true, },
    n = { to = '大草原草海#4', },
  },
},

['大草原营门'] = {
  id = '大草原营门',
  area = '大草原',
  name = '营门',
  desc =  [[眼前草原上出现一片蒙古帐篷，四周用鹿角丫杈围成了营寨，耳边传来隐隐的号角声。不远处有个营门，一队队的蒙古骑兵进进出出。看来营门守卫已经注意到你了，你最好还是赶快离开为妙。]],
  exit = {
    s = { to = '大草原草海#1', },
    n = { to = '大草原疾风营', },
  },
},

['大草原沼泽#3'] = {
  id = '大草原沼泽#3',
  area = '大草原',
  name = '沼泽',
  desc =  [[脚下是零零散散的杂草和一些小水坑，水坑里的水平静而污浊。四周死一般的寂静，连虫蚁的声音都没有，这寂静隐含着无尽的杀机。落脚之处全是烂泥，丝毫也不受力，陷在里面无论你有通天彻底的武功也是无济于事，越挣扎就陷得越快。]],
  exit = {
    e = { to = '大草原沼泽#3', ignore = true, },
    s = { to = '大草原沼泽#3', ignore = true, },
    w = { to = '大草原沼泽#2', },
    n = { to = '大草原草海#1', ignore = true, },
  },
},

['大草原草海#1'] = {
  id = '大草原草海#1',
  area = '大草原',
  name = '草海',
  desc =  [[之所以称为草海，就是说四周都是一望无际的草原，它辽阔的程度就好象海洋一样。在草海中行走是很容易迷路的，因为四周地面都被草覆盖了，没有路可以辨认，只能凭借日月星辰辨别方向，草海中还有很多危险的沼泽地。]],
  exit = {
    e = { to = '大草原草海#1', ignore = true, },
    s = { to = '回疆草原', },
    w = { to = '大草原草海#2', },
    n = { to = '大草原草海#1', ignore = true, },
  },
},

['大草原草海#6'] = {
  id = '大草原草海#6',
  area = '大草原',
  name = '草海',
  desc =  [[之所以称为草海，就是说四周都是一望无际的草原，它辽阔的程度就好象海洋一样。在草海中行走是很容易迷路的，因为四周地面都被草覆盖了，没有路可以辨认，只能凭借日月星辰辨别方向，草海中还有很多危险的沼泽地。]],
  exit = {
    e = { to = '大草原营门', },
    s = { to = '大草原草海#6', ignore = true, },
    w = { to = '大草原沼泽#1', ignore = true, },
    n = { to = '大草原草海#6', ignore = true, },
  },
},

['大草原沼泽#1'] = {
  id = '大草原沼泽#1',
  area = '大草原',
  name = '沼泽',
  desc =  [[脚下是零零散散的杂草和一些小水坑，水坑里的水平静而污浊。四周死一般的寂静，连虫蚁的声音都没有，这寂静隐含着无尽的杀机。落脚之处全是烂泥，丝毫也不受力，陷在里面无论你有通天彻底的武功也是无济于事，越挣扎就陷得越快。]],
  exit = {
    e = { to = '大草原草海#1', ignore = true, },
    s = { to = '大草原草海#3', },
    w = { to = '大草原沼泽#2', },
    n = { to = '大草原沼泽#1', ignore = true, },
  },
},

['大草原疾风营'] = {
  id = '大草原疾风营',
  area = '大草原',
  name = '疾风营',
  desc =  [[这里是蒙古军骑兵疾风营，共有五个千人队，面前方圆数里内支起了几百座帐篷。不时有蒙古骑兵小队纵马弛过，看蒙古兵将衣甲鲜明，刀枪耀眼，而骑乘之术更是甲于天下。更难得的是这数千兵将除了马蹄声和偶尔刀枪甲胄的碰撞声以外，竟无任何嘈杂，不由得令人佩服统率的将领治军有方。]],
  exit = {
    s = { to = '大草原营门', },
    n = { to = '大草原神风营', },
  },
},

['大草原牛皮大帐'] = {
  id = '大草原牛皮大帐',
  area = '大草原',
  name = '牛皮大帐',
  desc =  [[这是座以数十张牛皮缝就的蒙古帐篷，大约方圆四五十丈，比平常的帐篷大了几逾一倍。帐内陈设甚为简朴，正中一张矮几，后面坐着个青年，拿着本书正向旁边站着的一个僧人和一个天竺人请教着什么。]],
  exit = {
    s = { to = '大草原神风营', },
  },
},

['大草原沼泽#2'] = {
  id = '大草原沼泽#2',
  area = '大草原',
  name = '沼泽',
  desc =  [[脚下是零零散散的杂草和一些小水坑，水坑里的水平静而污浊。四周死一般的寂静，连虫蚁的声音都没有，这寂静隐含着无尽的杀机。落脚之处全是烂泥，丝毫也不受力，陷在里面无论你有通天彻底的武功也是无济于事，越挣扎就陷得越快。]],
  exit = {
    e = { to = '大草原草海#1', ignore = true, },
    s = { to = '大草原沼泽#2', ignore = true, },
    w = { to = '大草原沼泽#2', },
    n = { to = '大草原草海#5', },
  },
},

['大草原草海#4'] = {
  id = '大草原草海#4',
  area = '大草原',
  name = '草海',
  desc =  [[之所以称为草海，就是说四周都是一望无际的草原，它辽阔的程度就好象海洋一样。在草海中行走是很容易迷路的，因为四周地面都被草覆盖了，没有路可以辨认，只能凭借日月星辰辨别方向，草海中还有很多危险的沼泽地。]],
  exit = {
    e = { to = '大草原草海#4', ignore = true, },
    s = { to = '大草原沼泽#1', ignore = true, },
    w = { to = '大草原沼泽#1', ignore = true, },
    n = { to = '大草原草海#5', },
  },
},

['大草原草海#2'] = {
  id = '大草原草海#2',
  area = '大草原',
  name = '草海',
  desc =  [[之所以称为草海，就是说四周都是一望无际的草原，它辽阔的程度就好象海洋一样。在草海中行走是很容易迷路的，因为四周地面都被草覆盖了，没有路可以辨认，只能凭借日月星辰辨别方向，草海中还有很多危险的沼泽地。]],
  exit = {
    e = { to = '大草原草海#3', },
    s = { to = '大草原草海#2', ignore = true, },
    w = { to = '大草原沼泽#1', cost = 5, cond = 'player.enable.dodge and player.enable.dodge.level >= 100' },
    n = { to = '大草原草海#2', ignore = true, },
  },
},

['大草原草海#5'] = {
  id = '大草原草海#5',
  area = '大草原',
  name = '草海',
  desc =  [[之所以称为草海，就是说四周都是一望无际的草原，它辽阔的程度就好象海洋一样。在草海中行走是很容易迷路的，因为四周地面都被草覆盖了，没有路可以辨认，只能凭借日月星辰辨别方向，草海中还有很多危险的沼泽地。]],
  exit = {
    e = { to = '大草原草海#5', ignore = true, },
    s = { to = '大草原沼泽#1', ignore = true, },
    w = { to = '大草原草海#6', },
    n = { to = '大草原草海#5', ignore = true, },
  },
},

['大草原神风营'] = {
  id = '大草原神风营',
  area = '大草原',
  name = '神风营',
  desc =  [[这里是蒙古军骑兵神风营，共有五个千人队，面前方圆数里内支起了几百座帐篷。不时有蒙古骑兵小队纵马弛过，看蒙古兵将衣甲鲜明，刀枪耀眼，而骑乘之术更是甲于天下。更难得的是这数千兵将除了马蹄声和偶尔刀枪甲胄的碰撞声以外，竟无任何嘈杂，不由得令人佩服统率的将领治军有方。]],
  exit = {
    s = { to = '大草原疾风营', },
    n = { to = '大草原牛皮大帐', },
  },
},

['嵩山少林天王殿'] = {
  id = '嵩山少林天王殿',
  area = '嵩山少林',
  name = '天王殿',
  desc =  [[这里是少林寺的中殿天王殿。殿内香烟燎绕，幔角叮咚。香火比前殿要旺盛的多。正前方供着个大肚子，似乎永远都笑咪咪的弥勒佛。四大天王分列两旁，分执“风调雨顺”。两侧香桌上摆满了四季果蔬，弥勒的身后站立的是韦驮。只见他金盔金甲，年轻英俊，威风凛凛，双手合十，金刚杵横放腕上。]],
  exit = {
    s = { to = '嵩山少林前殿', },
    n = { to = '嵩山少林石板路#S', },
  },
},

['嵩山少林武僧堂#2'] = {
  id = '嵩山少林武僧堂#2',
  area = '嵩山少林',
  name = '武僧堂',
  desc =  [[这是少林寺护寺武僧练武及居住之所，室内光线明亮，不时听到呼喝练功之声。一个身强体壮的武僧正自苦练少林武学之秘奥。]],
  exit = {
    s = { to = '嵩山少林武僧堂#3', },
    n = { to = '嵩山少林武僧堂#1', },
  },
},

['嵩山少林西侧廊#2'] = {
  id = '嵩山少林西侧廊#2',
  area = '嵩山少林',
  name = '西侧廊',
  desc =  [[这里是天王殿旁的侧廊。彩梁画栋，连顶棚也用彩漆绘满了各种飞天的图形，每幅画似乎都在诉说一个娓娓动人的佛经故事。左面传来阵阵木鱼的敲击声和轻轻的梵唱。]],
  exit = {
    ne = { to = '嵩山少林石板路#S', },
    w = { to = '嵩山少林证道院', },
    s = { to = '嵩山少林西侧廊#1', },
  },
},

['嵩山少林香积厨#2'] = {
  id = '嵩山少林香积厨#2',
  area = '嵩山少林',
  name = '香积厨',
  desc =  [[炊烟缭绕，蒸汽腾腾，香味扑鼻而来。靠墙是一排数丈长的灶台，支着十来口大锅，最大的一口饭锅上方竟有人从梁上悬空而下，手持木棍在搅拌。除了烧饭的僧人外，几位火工头陀忙着劈柴运薪，灶下炉火熊熊。一位中年僧人正来回催促着。]],
  exit = {
    s = { to = '嵩山少林小路#1SE', },
    w = { to = '嵩山少林饭厅#S', },
    n = { to = '嵩山少林香积厨#1', },
  },
},

['嵩山少林猪舍'] = {
  id = '嵩山少林猪舍',
  area = '嵩山少林',
  name = '猪舍',
  desc =  [[这是间破烂的农家猪舍。圈里养着几头瘦猪，泔槽已经干涸了，草料也开始发霉腐烂。由于好多天没人清理牲口的粪便，满屋子弥漫着一股恶臭。屋角堆了一大堆石块(stone)，足有半人高。]],
  exit = {
    se = { to = '嵩山少林小院', },
  },
},

['嵩山少林石阶#8'] = {
  id = '嵩山少林石阶#8',
  area = '嵩山少林',
  name = '石阶',
  desc =  [[这里看来是半山腰了。不远的前面有一座小石亭，几位游客在这里歇息。山路到这里变得十分平坦，东边的山壁上提满了名人即兴题下的诗句。远望山林间层峦迭嶂，满目滴翠。]],
  exit = {
    nu = { to = '嵩山少林迎客亭', },
    ed = { to = '嵩山少林石阶#7', },
  },
},

['嵩山少林药王院'] = {
  id = '嵩山少林药王院',
  area = '嵩山少林',
  name = '药王院',
  desc =  [[一进药王院，扑鼻而来的是浓郁的药香。房间内排满了装满各类药材的大药柜，每个药柜都有上百个装药的抽屉贴满了各类药名。西边是一个巨大红杉木柜，柜上贴着方丈印的封条。一位中年僧人正来回忙碌着指点众执役僧称量药品，熬药煎汤。]],
  exit = {
    w = { to = '嵩山少林松树林#N', },
  },
},

['嵩山少林戒坛#SW'] = {
  id = '嵩山少林戒坛#SW',
  area = '嵩山少林',
  name = '戒坛',
  desc =  [[这是一个正方形，四角攒尖顶的亭台式建筑。是寺中僧徒受戒的地方。坛上正中放有佛身相连，向背而坐的双面铜铸佛像，面北的是药师佛，面南的为阿弥陀佛。坛上空无一人，寂静无声，越发显得此处的庄严肃穆。]],
  exit = {
    e = { to = '嵩山少林戒坛#SE', },
    se = { to = '嵩山少林石板路#3N', },
    n = { to = '嵩山少林戒坛#NW', },
  },
},

['嵩山少林台阶#S'] = {
  id = '嵩山少林台阶#S',
  area = '嵩山少林',
  name = '台阶',
  desc =  [[大雄宝殿前的石阶，三道平行的青石阶展向前方。北面是一条石板路，隐隐飘来阵阵清烟。香客们大都在此屏息默祷，然后一步一拜到大雄宝殿去。]],
  exit = {
    nu = { to = '嵩山少林平台', },
    s = { to = '嵩山少林石板路#C', },
  },
},

['嵩山少林石阶#9'] = {
  id = '嵩山少林石阶#9',
  area = '嵩山少林',
  name = '石阶',
  desc =  [[眼前遽然出现一大片松林。松林长得极密，石阶上铺满了厚厚的朽黄的松针。踩在脚下，发出察察的响声。一只小松鼠吱地在眼前闪过，消失在林海里。]],
  exit = {
    eu = { to = '嵩山少林佛心井', },
    sd = { to = '嵩山少林迎客亭', },
    wu = { to = '嵩山少林石阶#10', },
  },
},

['嵩山少林证道院'] = {
  id = '嵩山少林证道院',
  area = '嵩山少林',
  name = '证道院',
  desc =  [[穿过侧廊，前面出现一片宽阔的院落。院门的匾额上写着“证道院”三个大字，这里乃是僧人们日常念经诵佛，参禅打坐的地方。院中种满了翠竹，显得极是幽静。从周围的禅房中不断传出阵阵的梵唱和木鱼敲击的声音。]],
  exit = {
    w = { to = '嵩山少林禅房#C', cond = 'player.party == "少林派"', },
    e = { to = '嵩山少林西侧廊#2', },
  },
},

['嵩山少林饭厅#N'] = {
  id = '嵩山少林饭厅#N',
  area = '嵩山少林',
  name = '饭厅',
  desc =  [[这里便是少林全寺寺僧用斋的地方。饭厅极大，足可容纳上千人同时进膳。从东到西一排排摆满了长长的餐桌和长凳，几位小和尚正来回忙碌着布置素斋。桌上摆了几盆豆腐，花生，青菜以及素鸭等美味素食。在桌子的一端有一面很小的铜锣(luo)。]],
  exit = {
    s = { to = '嵩山少林饭厅#C', },
  },
},

['嵩山少林迎客亭'] = {
  id = '嵩山少林迎客亭',
  area = '嵩山少林',
  name = '迎客亭',
  desc =  [[苍松掩映之中，一座石亭赫然眼中。只见亭上匾额中龙飞凤舞的题着『迎客亭』三个大字。凡江湖人士，在此需放下随身所带的兵器，才可进入寺内。亭内有两名知客僧正在忙碌的招待来往的香客。]],
  exit = {
    nu = { to = '嵩山少林石阶#9', handler = 'unwield_weapon', },
    sd = { to = '嵩山少林石阶#8', },
  },
},

['嵩山少林饭厅#C'] = {
  id = '嵩山少林饭厅#C',
  area = '嵩山少林',
  name = '饭厅',
  desc =  [[这里便是少林全寺寺僧用斋的地方。饭厅极大，足可容纳上千人同时进膳。从东到西一排排摆满了长长的餐桌和长凳，几位小和尚正来回忙碌着布置素斋。桌上摆了几盆豆腐，花生，青菜以及素鸭等美味素食。在桌子的一端有一面很小的铜锣(luo)。东面是个厨房。]],
  exit = {
    e = { to = '嵩山少林香积厨#1', },
    s = { to = '嵩山少林饭厅#S', },
    w = { to = '嵩山少林斋堂', },
    n = { to = '嵩山少林饭厅#N', },
  },
},

['嵩山少林石阶#10'] = {
  id = '嵩山少林石阶#10',
  area = '嵩山少林',
  name = '石阶',
  desc =  [[松树与松树似乎都挤在一块生长，阳光到这里变得格外黯淡只在地上留下斑驳的碎影。静听不远处格的一声，象是松枝断落的声音。]],
  exit = {
    nu = { to = '嵩山少林石阶#11', },
    ed = { to = '嵩山少林石阶#9', },
  },
},

['嵩山少林防具库'] = {
  id = '嵩山少林防具库',
  area = '嵩山少林',
  name = '防具库',
  desc =  [[这是一间很大的房间，靠墙整齐地放着一个个大柜子，不少柜子门敞开着，露出里面的各种防具，品种之多，是你生平仅见。一位灰衣僧人正埋头整理一堆破损的护具。连你进来也没有注意。]],
  exit = {
    n = { to = '嵩山少林龙树院', },
  },
},

['嵩山少林广场东侧'] = {
  id = '嵩山少林广场东侧',
  area = '嵩山少林',
  name = '广场东侧',
  desc =  [[这里是天王殿前的一个广场。广场正中放着个二人高的青铜大香炉，前面摆着个香台，几位香客正在虔诚谟拜。自此向右有一间偏殿，供比丘们打坐诵经之用。北面有一个长廊，通向天王殿后。]],
  exit = {
    e = { to = '嵩山少林东侧殿', },
    w = { to = '嵩山少林广场#2', },
    n = { to = '嵩山少林东侧廊#1', },
  },
},

['嵩山少林地藏殿'] = {
  id = '嵩山少林地藏殿',
  area = '嵩山少林',
  name = '地藏殿',
  desc =  [[这是地藏殿。供奉地藏王菩萨。地藏王主宰阴间，手下自然有不少鬼兵鬼卒，罗列帐前。菩萨眉横煞气，手断阴阳。令人一见之下，顿觉心惊胆战，惶恐不已。]],
  exit = {
    e = { to = '嵩山少林空场', },
  },
},

['嵩山少林武僧堂#6'] = {
  id = '嵩山少林武僧堂#6',
  area = '嵩山少林',
  name = '武僧堂',
  desc =  [[这是少林寺护寺武僧练武及居住之所，室内光线明亮，不时听到呼喝练功之声。一个身强体壮的武僧正自苦练少林武学之秘奥。]],
  exit = {
    n = { to = '嵩山少林武僧堂#5', },
  },
},

['嵩山少林监狱'] = {
  id = '嵩山少林监狱',
  area = '嵩山少林',
  name = '监狱',
  desc =  [[这里黑沉沉的，即无一丝光亮，也无半分声息。黑暗中依稀可以看到身边似乎有几个人影，看到你转过头去，他们立刻屏住呼吸，紧张地瞪着你。四壁摸上去冰凉，且极硬，似乎都是钢铁铸成，只有南北面各有一道小门，门上开了个巴掌大的洞，象是送饭用的。脚边有一堆东西踢上去克剌剌地散了开来，细看却是一具白得发亮的枯骨。]],
  exit = {
    hidden = { to = '嵩山少林广场#1', handler = 'prison', },
  },
},

['嵩山少林松树林#2'] = {
  id = '嵩山少林松树林#2',
  area = '嵩山少林',
  name = '松树林',
  desc =  [[你眼前骤然一黑，朦胧中，只见左右前后，到处都是铺天盖地的松树林。几十丈高的大松树簇在一块，密实的枝叶象一蓬蓬巨伞般伸向天空，把阳光遮得丝毫也无。尺把厚的松针积在地上，一脚踩下去，半天拔不出来。你似乎迷失了方向，象没头苍蝇般到处乱闯。]],
  exit = {
    e = { to = '嵩山少林松树林#M', ignore = true, },
    w = { to = '嵩山少林松树林#M', handler = 'simple_path_set_pos', },
    s = { to = '嵩山少林青云坪', },
    n = { to = '嵩山少林松树林#M', ignore = true, },
  },
},

['嵩山少林练武场#W-NW'] = {
  id = '嵩山少林练武场#W-NW',
  area = '嵩山少林',
  name = '练武场',
  desc =  [[这里是少林寺的练武场。由无数块巨大的花岗岩石板铺就。上千年的踩踏已使得这些石板如同镜子般平整光滑。武场中央竖立着一个制作精巧的练功铜人，一些壮年僧人正狠辣的向它出招。]],
  exit = {
    e = { to = '嵩山少林练武场#W-N', },
    s = { to = '嵩山少林练武场#W-W', },
  },
},

['嵩山少林罗汉堂二部'] = {
  id = '嵩山少林罗汉堂二部',
  area = '嵩山少林',
  name = '罗汉堂二部',
  desc =  [[这是一间极为简陋的禅房。环视四周，除了几幅佛竭外，室内空荡荡地别无他物。地上整齐的摆放着几个破烂且发黑的黄布蒲团，几位须发花白的老僧正在坐在上面闭目入定。这里是本寺十八罗汉参禅修行的地方，不少绝世武功便是在此悟出。]],
  exit = {
    s = { to = '嵩山少林罗汉堂一部', },
    n = { to = '嵩山少林罗汉堂三部', },
  },
},

['嵩山少林舍利院'] = {
  id = '嵩山少林舍利院',
  area = '嵩山少林',
  name = '舍利院',
  desc =  [[这是一座寂静的小院，院中堆满的劈好的木柴，几名身穿白布僧衣的僧人正在往来忙碌着。这里是寺中僧人圆寂后，焚化归西的场所。院落的西面有一道小门。]],
  exit = {
    w = { to = '嵩山少林塔林#S', door = 'open door', },
    e = { to = '嵩山少林槐树林#C', },
  },
},

['嵩山少林归元谷'] = {
  id = '嵩山少林归元谷',
  area = '嵩山少林',
  name = '归元谷',
  desc =  [[走出石室，只见在一深谷之内。前面一座高峰阻路，拔地而起,直矗天半。四周峰峦都似向它躬揖，谷面内不过十亩方圆地面，怪松奇石，株株不同。苍皮铁磷，虬干龙枝，似欲临风飞去。]],
  exit = {
    se = { to = '嵩山少林石廊', },
  },
},

['嵩山少林鼓楼六层'] = {
  id = '嵩山少林鼓楼六层',
  area = '嵩山少林',
  name = '鼓楼六层',
  desc =  [[沿窗洞吹进一阵阵凌厉的山风，寒意浸人。北望可见松林的尽头，少室山的顶峰处，有一片小小的平地，正中植着三棵巨松；中间又似乎有什么东西正闪闪发光。楼上传来一阵阵沉闷的鼓声。]],
  exit = {
    u = { to = '嵩山少林鼓楼七层', },
    d = { to = '嵩山少林鼓楼五层', },
  },
},

['嵩山少林练武场#W-SE'] = {
  id = '嵩山少林练武场#W-SE',
  area = '嵩山少林',
  name = '练武场',
  desc =  [[这里是少林寺的练武场。由无数块巨大的花岗岩石板铺就。上千年的踩踏已使得这些石板如同镜子般平整光滑。武场中央竖立着一个制作精巧的练功铜人，一些壮年僧人正狠辣的向它出招。]],
  exit = {
    w = { to = '嵩山少林练武场#W-S', },
    n = { to = '嵩山少林练武场#W-E', },
  },
},

['嵩山少林山门殿'] = {
  id = '嵩山少林山门殿',
  area = '嵩山少林',
  name = '山门殿',
  desc =  [[这里是少林寺的前殿山门殿。殿内青砖铺地，两侧分列哼、哈二将。身躯雄伟，面相忿怒，头带宝冠，上半身裸露，手执金刚杵，一鼓鼻，一张口，露牙睁目，凶猛可畏。两边各放一红木供桌，陈列香烛，以供僧俗叩拜。北面是一片广场。南面是一道三丈来高的朱红杉木包铜大门(gate)。]],
  exit = {
    s = { to = '嵩山少林广场#1', door = 'open gate', },
    n = { to = '嵩山少林广场#2', },
  },
},

['嵩山少林练武场#E-E'] = {
  id = '嵩山少林练武场#E-E',
  area = '嵩山少林',
  name = '练武场',
  desc =  [[这里是少林寺的练武场。由无数块巨大的花岗岩石板铺就。上千年的踩踏已使得这些石板如同镜子般平整光滑。十来个僧人正在练习武技。南北西三面各有一练武场。]],
  exit = {
    e = { to = '嵩山少林般若堂五部', },
    s = { to = '嵩山少林练武场#E-SE', },
    w = { to = '嵩山少林中心武场#E', },
    n = { to = '嵩山少林练武场#E-NE', },
  },
},

['嵩山少林广场西侧'] = {
  id = '嵩山少林广场西侧',
  area = '嵩山少林',
  name = '广场西侧',
  desc =  [[这里是天王殿前的一个广场。广场正中放着个二人高的青铜大香炉，前面摆着个香台，几位香客正在虔诚谟拜。自此向左有一间偏殿，供比丘们打坐诵经之用。北面有一个长廊，通向天王殿后。]],
  exit = {
    e = { to = '嵩山少林广场#2', },
    w = { to = '嵩山少林西侧殿', },
    n = { to = '嵩山少林西侧廊#1', },
  },
},

['嵩山少林戒律院'] = {
  id = '嵩山少林戒律院',
  area = '嵩山少林',
  name = '戒律院',
  desc =  [[整个大殿门户紧闭，密不透风。即便是在白昼，也犹如黑夜一般，每隔几步的墙上，点燃着几枝牛油巨烛。殿上供奉着降魔韦陀下方摆着一排排水牛皮鞭、穿孔竹板及狼牙棒等执法刑杖。四周站满了怀抱戒刀的执法僧兵。他们正用威严的眼神打量着你，令你不禁心生惧意。]],
  exit = {
    w = { to = '嵩山少林松树林#E', },
  },
},

['嵩山少林练武场#W-S'] = {
  id = '嵩山少林练武场#W-S',
  area = '嵩山少林',
  name = '练武场',
  desc =  [[这里是少林寺的练武场。由无数块巨大的花岗岩石板铺就。上千年的踩踏已使得这些石板如同镜子般平整光滑。十来个僧人正在练习武技。东西北三面各有一练武场。]],
  exit = {
    e = { to = '嵩山少林练武场#W-SE', },
    w = { to = '嵩山少林练武场#W-SW', },
    n = { to = '嵩山少林中心武场#W', },
  },
},

['嵩山少林山路#1'] = {
  id = '嵩山少林山路#1',
  area = '嵩山少林',
  name = '山路',
  desc =  [[这是少室山五乳峰下的一条小路，路旁长满的青草。黄土铺就的小路看起来很齐整，似乎有人经常打扫。不远处就是五乳峰，山势挺拔，景秀境幽，峰上种满了松树，随着微风拂过，传来阵阵滔声。南面是少林寺，北面可至初祖庵。]],
  exit = {
    s = { to = '嵩山少林千佛殿', },
    n = { to = '嵩山少林山路#2', },
  },
},

['嵩山少林寺前广场#E'] = {
  id = '嵩山少林寺前广场#E',
  area = '嵩山少林',
  name = '寺前广场',
  desc =  [[这里是少林寺前的广场，整个广场由大块的青石铺成，极为平坦。但因年代久远，都有些破损。丛丛小草从石板的缝隙中长了出来。广场周围都是密密的松树林，四角上各放了几块石碑，字迹都甚为模糊。寺前三三两两的站着几个僧人。]],
  exit = {
    w = { to = '嵩山少林广场#1', },
  },
},

['嵩山少林菩提院'] = {
  id = '嵩山少林菩提院',
  area = '嵩山少林',
  name = '菩提院',
  desc =  [[一座偏僻阴暗的佛殿，殿上并排排列着三尊佛像，佛像前装着一座屏风，屏风上镶嵌着一块极大的铜镜（mirror)。擦的晶光净亮。 佛像下是一个神座（zuo)，摆着两盏发出豆黄光晕的油灯。昏黄的灯光下，依稀见到镜上镌有几句佛偈(jie)。屏风前有几个蒲团，几个青年僧人正在闭目打坐，东面是一片槐树林。]],
  exit = {
    e = { to = '嵩山少林槐树林#W', },
  },
},

['嵩山少林钟楼七层'] = {
  id = '嵩山少林钟楼七层',
  area = '嵩山少林',
  name = '钟楼七层',
  desc =  [[这里就是钟楼之顶。直入眼帘的便是那口大钟和一根悬挂空中的巨杵。细看大钟，整整有两丈来高，直径也有丈许。钟身似由青铜浇铸，上面满是密密麻麻的印文古篆，估计重逾数千斤。巨杵粗可合抱，丈把来长，一头裹以厚皮，正对着钟腰。尽管山风吹人欲倒，谁都禁不住想撞一下钟(bell)试试。往外看，有个很大的汉白玉窗台(out)，上面足可站一个人。]],
  exit = {
    d = { to = '嵩山少林钟楼六层', },
  },
},

['嵩山少林山坡'] = {
  id = '嵩山少林山坡',
  area = '嵩山少林',
  name = '山坡',
  desc =  [[这里是少室山之阳的一座山坡山坡上长满了艳红色的不知名的野花采密的蜂蝶们簇成一团团忙碌着。不时有几只好奇的小密蜂飞近来似乎对你这个不速之客感到极大的惊奇。]],
  exit = {
    nu = { to = '嵩山少林田埂边', },
    e = { to = '嵩山少林石阶#1', },
  },
},

['嵩山少林演武堂'] = {
  id = '嵩山少林演武堂',
  area = '嵩山少林',
  name = '演武堂',
  desc =  [[这是一间偏殿，地上零乱摆着一些，石锁，木桩等练功工具。几位僧侣正在扎马练功，地上凹凸不平，似是大力僧侣踏出的痕迹，里面就是少林名震当世的武僧练功的所在。]],
  exit = {
    w = { to = '嵩山少林武僧堂#1', cond = 'player.party == "少林派" and ( string.find( player.name, "^澄" ) or string.find( player.name, "^玄" ) or string.find( player.name, "^渡" ) )', },
    e = { to = '嵩山少林罗汉堂五部', },
  },
},

['嵩山少林山路#8'] = {
  id = '嵩山少林山路#8',
  area = '嵩山少林',
  name = '山路',
  desc =  [[这是少室山五乳峰下的一条小路，路旁长满的青草。黄土铺就的小路看起来很齐整，似乎有人经常打扫。不远处就是五乳峰，山势挺拔，景秀境幽，峰上种满了松树，随着微风拂过，传来阵阵滔声。东面是一片松林，林外竖着一块木牌(mupai)。]],
  exit = {
    e = { to = '嵩山少林松树林#1', },
    sw = { to = '嵩山少林山路#7', },
  },
},

['嵩山少林练武场#E-NW'] = {
  id = '嵩山少林练武场#E-NW',
  area = '嵩山少林',
  name = '练武场',
  desc =  [[这里是少林寺的练武场。由无数块巨大的花岗岩石板铺就。上千年的踩踏已使得这些石板如同镜子般平整光滑。武场中央竖立着一个制作精巧的练功铜人，一些壮年僧人正狠辣的向它出招。]],
  exit = {
    e = { to = '嵩山少林练武场#E-N', },
    s = { to = '嵩山少林练武场#E-W', },
  },
},

['嵩山少林广场#1'] = {
  id = '嵩山少林广场#1',
  area = '嵩山少林',
  name = '广场',
  desc =  [[这里是少林寺前的广场，整个广场由大块的青石铺成，极为平坦。但因年代久远，都有些破损。丛丛小草从石板的缝隙中长了出来。广场周围都是密密的松树林，四角上各放了几块石碑，字迹都甚为模糊。正前方黄墙碧瓦，飞檐翘檩，正中一道二丈来宽，三丈来高的朱红杉木包铜大门(gate)。上方一块大匾，龙飞凤舞地书着『少林寺』三个大字。寺前三三两两的站着几个僧人。]],
  exit = {
    e = { to = '嵩山少林寺前广场#E', },
    s = { to = '嵩山少林石坊', },
    w = { to = '嵩山少林寺前广场#W', },
    n = { to = '嵩山少林山门殿', door = 'knock gate', },
  },
},

['嵩山少林藏经阁二楼'] = {
  id = '嵩山少林藏经阁二楼',
  area = '嵩山少林',
  name = '藏经阁二楼',
  desc =  [[千余年来少林寺执中原武林之牛耳，自达摩老祖以下，历代人材辈出。其中有不少高僧遗著留存，汇集至今，终成名震天下的少林七十二绝艺。少林精华，尽集于此。二楼四面开窗，确保通风。中间排列着五排大书架。四周则陈列矮几，以供阅读。几位老僧手执经卷，正在闭目凝思。]],
  exit = {
    hidden = { to = '嵩山少林小径', cmd = 'tui chuang;jump chuang', },
    d = { to = '嵩山少林藏经阁一楼', },
  },
},

['嵩山少林断崖坪'] = {
  id = '嵩山少林断崖坪',
  area = '嵩山少林',
  name = '断崖坪',
  desc =  [[出得屋来，对面便是危崖一片。左面是一座孤峰刺天，右面是绝壑无地。只中央一片平地。对崖看去去险峻已极，难以攀援。且壁间遍生青苔，其滑如油，竟似无路可上。]],
  exit = {
    s = { to = '嵩山少林心禅堂', },
    hidden = { to = '嵩山少林崖顶', handler = 'sl_yading', cond = 'player.flag["quest 无相劫指"]', },
  },
},

['嵩山少林崖顶'] = {
  id = '嵩山少林崖顶',
  area = '嵩山少林',
  name = '崖顶',
  desc =  [[崖顶是一片松林，遮天蔽日，光线阴暗。你发现左边的石壁上似乎有个小小的山洞，有几个老和尚坐在里面，面向石壁，闭目参禅，对你的到来似乎没有任何反映。]],
  exit = {
    d = { to = '嵩山少林断崖坪', },
    enter = { to = '嵩山少林山洞', },
  },
},

['嵩山少林山洞'] = {
  id = '嵩山少林山洞',
  area = '嵩山少林',
  name = '山洞',
  desc =  [[这是一个小小的山洞，洞里没有任何物品。几个老和尚分坐左右，面向石壁，闭目参禅。这里空空荡荡，奇怪的是地上居然放着一小堆木屑，不知道有什么用途。]],
  exit = {
    out = { to = '嵩山少林崖顶', },
  },
},

['嵩山少林练武场#W-E'] = {
  id = '嵩山少林练武场#W-E',
  area = '嵩山少林',
  name = '练武场',
  desc =  [[这里是少林寺的练武场。由无数块巨大的花岗岩石板铺就。上千年的踩踏已使得这些石板如同镜子般平整光滑。十来个僧人正在练习武技。南北西三面各有一练武场。]],
  exit = {
    e = { to = '嵩山少林罗汉堂', },
    s = { to = '嵩山少林练武场#W-SE', },
    w = { to = '嵩山少林中心武场#W', },
    n = { to = '嵩山少林练武场#W-NE', },
  },
},

['嵩山少林般若堂'] = {
  id = '嵩山少林般若堂',
  area = '嵩山少林',
  name = '般若堂',
  desc =  [[你面前是一座很大的院落，周围用高墙围住，院门匾额上写着『般若堂』三个大字。这里是少林弟子精研天下各家各派武功的所在。有很多年轻的僧人进进出出，院内传来阵阵呼喝练功的声音。]],
  exit = {
    w = { to = '嵩山少林石板路#E', },
    e = { to = '嵩山少林练武场#E-W', },
  },
},

['嵩山少林戒坛#SE'] = {
  id = '嵩山少林戒坛#SE',
  area = '嵩山少林',
  name = '戒坛',
  desc =  [[这是一个正方形，四角攒尖顶的亭台式建筑。是寺中僧徒受戒的地方。坛上正中放有佛身相连，向背而坐的双面铜铸佛像，面北的是药师佛，面南的为阿弥陀佛。坛上空无一人，寂静无声，越发显得此处的庄严肃穆。]],
  exit = {
    sw = { to = '嵩山少林石板路#3N', },
    w = { to = '嵩山少林戒坛#SW', },
    n = { to = '嵩山少林戒坛#NE', },
  },
},

['嵩山少林槐树林#C'] = {
  id = '嵩山少林槐树林#C',
  area = '嵩山少林',
  name = '槐树林',
  desc =  [[眼前一暗你走进一片槐树林，枝头鸟语轻鸣，荫下清风荡漾。好一个清净禅修之所在。林中一 条小径曲折伸向前方。]],
  exit = {
    e = { to = '嵩山少林石板路#N', },
    s = { to = '嵩山少林槐树林#S', },
    w = { to = '嵩山少林舍利院', },
    n = { to = '嵩山少林槐树林#N', },
  },
},

['嵩山少林石阶#5'] = {
  id = '嵩山少林石阶#5',
  area = '嵩山少林',
  name = '石阶',
  desc =  [[一挂巨大的瀑布白龙出霄般横越山间，水气已浓得仿佛可以滴下水珠儿来。山峦间升起薄薄的青雾，凝聚不散。哗哗的水声震耳欲聋。石阶上满是水渍，走上去滑得可以让人打跌。。]],
  exit = {
    nu = { to = '嵩山少林石阶#6', },
    sd = { to = '嵩山少林石阶#4', },
  },
},

['嵩山少林白衣殿'] = {
  id = '嵩山少林白衣殿',
  area = '嵩山少林',
  name = '白衣殿',
  desc =  [[这是白衣殿，供奉白衣观音大士。大士高居须弥座上，手托净瓶，眉含微愁，唇绽浅笑，仿佛对人间疾苦既存忧心，又觉释怀。殿中放了红木大香案，香案上供品齐备，香火十分旺盛。]],
  exit = {
    w = { to = '嵩山少林空场', },
  },
},

['嵩山少林林中小路#2E'] = {
  id = '嵩山少林林中小路#2E',
  area = '嵩山少林',
  name = '林中小路',
  desc =  [[这是一片密密的竹林。这里人迹罕至，惟闻足底叩击路面，有僧敲木鱼声；微风吹拂竹叶，又如簌簌禅唱。令人尘心为之一涤，真是绝佳的禅修所在。]],
  exit = {
    ne = { to = '嵩山少林林中小路#3E', },
    w = { to = '嵩山少林林中小路#1E', },
  },
},

['嵩山少林台阶#N'] = {
  id = '嵩山少林台阶#N',
  area = '嵩山少林',
  name = '台阶',
  desc =  [[这里是一段向上的台阶，全部用整条的青石铺设而成，台阶两侧的扶栏上雕刻着佛经上的名言警句。这里一个人也没有，显得很寂静，看来寺中的僧人也不常到这里来。]],
  exit = {
    nu = { to = '嵩山少林立雪亭', },
    s = { to = '嵩山少林后殿', },
  },
},

['嵩山少林塔林#M'] = {
  id = '嵩山少林塔林#M',
  area = '嵩山少林',
  name = '塔林',
  desc =  [[这里是少林历代僧侣的墓地，上百座墓塔式样繁多，造型各异。你置身其中，只看得眼花缭乱，不知该往哪个方向走，你似乎迷路了。]],
  exit = {
    ne = { to = '嵩山少林塔林#M', },
    w = { to = '嵩山少林塔林#M', },
    s = { to = '嵩山少林塔林#M', },
    se = { to = '嵩山少林塔林#M', },
    e = { to = '嵩山少林塔林#M', },
    sw = { to = '嵩山少林塔林#M', },
    nw = { to = '嵩山少林塔林#M', },
    n = { to = '嵩山少林塔林#M', },
    hidden1 = { to = '嵩山少林塔林#S', cost = 12, handler = 'simple_path', },
    hidden2 = { to = '嵩山少林塔林#N', cost = 12, handler = 'simple_path', },
  },
},

['嵩山少林塔林#S'] = {
  id = '嵩山少林塔林#S',
  area = '嵩山少林',
  name = '塔林',
  desc =  [[这里是少林历代僧侣的墓地，上百座墓塔式样繁多，造型各异。你置身其中，只看得眼花缭乱，不知该往哪个方向走，你似乎迷路了。]],
  exit = {
    ne = { to = '嵩山少林塔林#M', handler = 'simple_path_set_pos', },
    w = { to = '嵩山少林塔林#M', ignore = true, },
    s = { to = '嵩山少林塔林#M', ignore = true, },
    se = { to = '嵩山少林塔林#M', ignore = true, },
    e = { to = '嵩山少林舍利院' },
    sw = { to = '嵩山少林塔林#M', ignore = true, },
    nw = { to = '嵩山少林塔林#M', ignore = true, },
    n = { to = '嵩山少林塔林#M', ignore = true, },
  },
},

['嵩山少林塔林#N'] = {
  id = '嵩山少林塔林#N',
  area = '嵩山少林',
  name = '塔林',
  desc =  [[这里是少林历代僧侣的墓地，上百座墓塔式样繁多，造型各异。你置身其中，只看得眼花缭乱，不知该往哪个方向走，你似乎迷路了。]],
  exit = {
    ne = { to = '嵩山少林塔林#M', handler = 'simple_path_set_pos', },
    w = { to = '嵩山少林塔林#M', ignore = true, },
    s = { to = '嵩山少林塔林#M', ignore = true, },
    se = { to = '嵩山少林塔林#M', ignore = true, },
    e = { to = '嵩山少林塔林#M', ignore = true, },
    sw = { to = '嵩山少林塔林#M', ignore = true, },
    nw = { to = '嵩山少林塔林#M', ignore = true, },
    n = { to = '嵩山少林古佛舍利塔', },
  },
},

['嵩山少林后殿广场#NW'] = {
  id = '嵩山少林后殿广场#NW',
  area = '嵩山少林',
  name = '后殿广场',
  desc =  [[这里是后殿广场，由整块大青石板拼成的地面上有几处凹凸的踏痕，似是以前有高手施展内功所遗留的印记，东面是后殿。]],
  exit = {
    e = { to = '嵩山少林后殿', },
    s = { to = '嵩山少林后殿广场#SW', },
  },
},

['嵩山少林石坊'] = {
  id = '嵩山少林石坊',
  area = '嵩山少林',
  name = '石坊',
  desc =  [[一个巨大的牌坊横架在两片山壁之间，牌坊正上方刻着六个斗大的金字：			『天下第一名刹』字迹有些剥落，看上去年代颇为久远了。前方是一偏很大的广场，站满了前来进香的香客和一些江湖上的豪士。象征着少林寺的山门殿，就矗立在广场的另一侧。]],
  exit = {
    s = { to = '嵩山少林石阶#11', },
    n = { to = '嵩山少林广场#1', },
  },
},

['嵩山少林后殿广场#SE'] = {
  id = '嵩山少林后殿广场#SE',
  area = '嵩山少林',
  name = '后殿广场',
  desc =  [[这里是后殿广场，由整块大青石板拼成的地面上有几处凹凸的踏痕，似是以前有高手施展内功所遗留的印记。西南是一片松树林。]],
  exit = {
    se = { to = '嵩山少林松树林#N', },
    w = { to = '嵩山少林后殿广场#C', },
    n = { to = '嵩山少林后殿广场#NE', },
  },
},

['嵩山少林小路#2SE'] = {
  id = '嵩山少林小路#2SE',
  area = '嵩山少林',
  name = '小路',
  desc =  [[你走在一条碎石铺成的小路上，两侧青草茵茵，山花烂漫。空气中夹带着泥土的芳香，扑面而来。]],
  exit = {
    nw = { to = '嵩山少林小路#1SE', },
    s = { to = '嵩山少林小路#3SE', },
  },
},

['嵩山少林钟楼五层'] = {
  id = '嵩山少林钟楼五层',
  area = '嵩山少林',
  name = '钟楼五层',
  desc =  [[一眼望去，只见蓝天白云，青山列列，令人将尘俗之气，顿为一一扫。南至前三殿，北到方丈楼，整个少林寺尽在眼底。北面竹林随风起伏，犹如一片竹海。东面围绕全寺的是密密匝匝的松林，一眼往不到边。]],
  exit = {
    u = { to = '嵩山少林钟楼六层', },
    d = { to = '嵩山少林钟楼四层', },
  },
},

['嵩山少林林中小路#2W'] = {
  id = '嵩山少林林中小路#2W',
  area = '嵩山少林',
  name = '林中小路',
  desc =  [[这是一片密密的竹林。这里人迹罕至，惟闻足底叩击路面，有僧敲木鱼声；微风吹拂竹叶，又如簌簌禅唱。令人尘心为之一涤，真是绝佳的禅修所在。]],
  exit = {
    w = { to = '嵩山少林林中小路#3W', },
    e = { to = '嵩山少林林中小路#1W', },
  },
},

['嵩山少林鼓楼二层'] = {
  id = '嵩山少林鼓楼二层',
  area = '嵩山少林',
  name = '鼓楼二层',
  desc =  [[每个楼层上都铺设了结实的木楼板，八角形的墙身上则开了四扇大窗。从窗孔看，墙体也是极为厚实。从这里往外眺望，可以看到围绕塔周的小园以及北边的竹林，随风飘来阵阵竹叶的清香。]],
  exit = {
    u = { to = '嵩山少林鼓楼三层', },
    d = { to = '嵩山少林鼓楼一层', },
  },
},

['嵩山少林般若堂二部'] = {
  id = '嵩山少林般若堂二部',
  area = '嵩山少林',
  name = '般若堂二部',
  desc =  [[这是一间极为简陋的禅房。环视四周，除了几幅佛竭外，室内空荡荡地别无他物。地上整齐的摆放着几个破烂且发黑的黄布蒲团，几位须发花白的老僧正在坐在上面闭目入定。这里是本寺十八罗汉参禅修行的地方，不少绝世武功便是在此悟出。]],
  exit = {
    s = { to = '嵩山少林般若堂一部', },
    n = { to = '嵩山少林般若堂三部', },
  },
},

['嵩山少林练武场#E-N'] = {
  id = '嵩山少林练武场#E-N',
  area = '嵩山少林',
  name = '练武场',
  desc =  [[这里是少林寺的练武场。由无数块巨大的花岗岩石板铺就。上千年的踩踏已使得这些石板如同镜子般平整光滑。十来个僧人正在练习武技。武场的一角有一组练功用的梅花桩。东南西三面各有一练武场。]],
  exit = {
    e = { to = '嵩山少林练武场#E-NE', },
    w = { to = '嵩山少林练武场#E-NW', },
    s = { to = '嵩山少林中心武场#E', },
  },
},

['嵩山少林僧舍#EN'] = {
  id = '嵩山少林僧舍#EN',
  area = '嵩山少林',
  name = '僧舍',
  desc =  [[这里是僧众们饮食起居的地方。靠墙一溜摆着几张木床，床上铺的是篾席。床头叠着床薄被，冬天想必很冷，僧侣们全靠扎实的内功根基御寒。地上整齐的放着几个蒲团和木鱼。]],
	use_cond = 'player.party == "少林派"',
  exit = {
    s = { to = '嵩山少林僧舍#E', },
  },
},

['嵩山少林般若堂一部'] = {
  id = '嵩山少林般若堂一部',
  area = '嵩山少林',
  name = '般若堂一部',
  desc =  [[这是一间极为简陋的禅房。环视四周，除了几幅佛竭外，室内空荡荡地别无他物。地上整齐的摆放着几个破烂且发黑的黄布蒲团，几位须发花白的老僧正在坐在上面闭目入定。这里是本寺十八罗汉参禅修行的地方，不少绝世武功便是在此悟出。]],
  exit = {
    n = { to = '嵩山少林般若堂二部', },
  },
},

['嵩山少林松树林#N'] = {
  id = '嵩山少林松树林#N',
  area = '嵩山少林',
  name = '松树林',
  desc =  [[这是一片松树林。高高的大松树簇在一块，密实的枝叶象一蓬蓬巨伞般伸向天空，把阳光遮得丝毫也无。一条洁净的青石小径蜿蜒林中。]],
  exit = {
    e = { to = '嵩山少林药王院', },
    nw = { to = '嵩山少林后殿广场#SE', },
    s = { to = '嵩山少林松树林#C', },
  },
},

['嵩山少林鼓楼七层'] = {
  id = '嵩山少林鼓楼七层',
  area = '嵩山少林',
  name = '鼓楼七层',
  desc =  [[这里就是鼓楼之顶。直入眼帘的便是一只大鼓。大鼓鼓身通红，似由白杨木箍成。两头包以水牛皮，用一匝大铜钉钉在鼓身边缘。鼓心有一圈白渍，看来是因为多次击打形成的。整个大鼓放在一个一人高的架子上，架子底层搁着两根大鼓槌。尽管山风吹人欲倒，谁都禁不住想击一下鼓(drum)试试。往外看，有个很大的汉白玉窗台(out)，上面足可站一个人。]],
  exit = {
    d = { to = '嵩山少林鼓楼六层', },
  },
},

['嵩山少林钟楼六层'] = {
  id = '嵩山少林钟楼六层',
  area = '嵩山少林',
  name = '钟楼六层',
  desc =  [[沿窗洞吹进一阵阵凌厉的山风，寒意浸人。北望可见松林的尽头，少室山的顶峰处，有一片小小的平地，正中植着三棵巨松；又似乎有什么东西正闪闪发光。头顶上的楼板开了个大洞，挂下一口大钟。从这里只能看到巨钟的下边缘，内里黑洞洞的，什么也看不见。]],
  exit = {
    u = { to = '嵩山少林钟楼七层', },
    d = { to = '嵩山少林钟楼五层', },
  },
},

['嵩山少林罗汉堂'] = {
  id = '嵩山少林罗汉堂',
  area = '嵩山少林',
  name = '罗汉堂',
  desc =  [[你面前是一座很大的院落，周围用高墙围住，院门匾额上写着『罗汉堂』三个大字。这里是少林弟子练习本门基本武功的所在。有很多年轻的僧人进进出出，院内传来阵阵呼喝练功的声音。]],
  exit = {
    w = { to = '嵩山少林练武场#W-E', },
    e = { to = '嵩山少林石板路#W', },
    hidden = { to = '嵩山少林匾后', cmd = 'zong bian', cond = 'player.skill["基本轻功"] and player.skill["基本轻功"].level >= 130', },
  },
},

['嵩山少林匾后'] = {
  id = '嵩山少林匾后',
  area = '嵩山少林',
  name = '匾后',
  desc =  [[这里就是罗汉堂匾额之后，黑漆漆的什么都看不清楚。]],
  exit = {
    hidden = { to = '嵩山少林罗汉堂', cmd = 'jump down', },
  },
},

['嵩山少林鼓楼一层'] = {
  id = '嵩山少林鼓楼一层',
  area = '嵩山少林',
  name = '鼓楼一层',
  desc =  [[这里是塔楼的底层，一缕缕阳光从墙上的花砖缝隙里透射进来，在青砖地上投下别致的光影，如同一格格棋盘相似。往上看，长长的木楼梯盘绕而上，似乎永无尽头。墙角，梯级都相当洁净，看来经常有僧人打扫。]],
  exit = {
    u = { to = '嵩山少林鼓楼二层', },
    out = { to = '嵩山少林鼓楼小院', },
  },
},

['嵩山少林练武场#E-SE'] = {
  id = '嵩山少林练武场#E-SE',
  area = '嵩山少林',
  name = '练武场',
  desc =  [[这里是少林寺的练武场。由无数块巨大的花岗岩石板铺就。上千年的踩踏已使得这些石板如同镜子般平整光滑。武场中央竖立着一个制作精巧的练功铜人，一些壮年僧人正狠辣的向它出招。]],
  exit = {
    w = { to = '嵩山少林练武场#E-S', },
    n = { to = '嵩山少林练武场#E-E', },
  },
},

['嵩山少林初祖庵'] = {
  id = '嵩山少林初祖庵',
  area = '嵩山少林',
  name = '初祖庵',
  desc =  [[这里是初祖庵，乃是北宋末年少林寺中的僧人为了纪念达摩而修建的。庵内山门，大殿及各式庭院齐全，正中的大殿内供奉着达摩初祖，二祖，三祖，四祖及五祖的塑像。院内有几名老迈的僧人接待着前来敬香的香客。]],
  exit = {
    s = { to = '嵩山少林山路#4', },
    n = { to = '嵩山少林山路#5', },
  },
},

['嵩山少林达摩院'] = {
  id = '嵩山少林达摩院',
  area = '嵩山少林',
  name = '达摩院',
  desc =  [[这是一座古朴的殿堂。西首的墙上挂满了各类武功图谱，不少白须白眉的老僧们正端坐在图谱画轴之前，似乎在苦苦思索。南北山墙是高及屋顶的大书架，走近细看，它们是各门各派的武功秘笈，屋正中摆着几张矮几诃和几个蒲团，几位老僧正在入定中。北面有个小门通向后殿。]],
  exit = {
    s = { to = '嵩山少林回廊#4', },
    n = { to = '嵩山少林达摩院后殿', },
  },
},

['嵩山少林石板路#C'] = {
  id = '嵩山少林石板路#C',
  area = '嵩山少林',
  name = '石板路',
  desc =  [[一条平整宽阔的石路，路边是两长溜僧棚，可供大家休息之用。香客们手执线香，缓步通过。一些忙碌的僧侣，急匆匆的奔驰而去，似乎有什么要事在身。一队护寺僧兵手执戒刀，正自来往巡视。]],
  exit = {
    e = { to = '嵩山少林石板路#E', },
    s = { to = '嵩山少林香炉', },
    w = { to = '嵩山少林石板路#W', },
    n = { to = '嵩山少林台阶#S', },
  },
},

['嵩山少林槐树林#S'] = {
  id = '嵩山少林槐树林#S',
  area = '嵩山少林',
  name = '槐树林',
  desc =  [[眼前一暗你走进一片槐树林，枝头鸟语轻鸣，荫下清风荡漾。好一个清净禅修之所在。林中一 条小径曲折伸向前方。]],
  exit = {
    se = { to = '嵩山少林侧廊#W', },
    w = { to = '嵩山少林槐树林#W', },
    n = { to = '嵩山少林槐树林#C', },
  },
},

['嵩山少林槐树林#N'] = {
  id = '嵩山少林槐树林#N',
  area = '嵩山少林',
  name = '槐树林',
  desc =  [[眼前一暗你走进一片槐树林，枝头鸟语轻鸣，荫下清风荡漾。好一个清净禅修之所在。林中一 条小径曲折伸向前方。]],
  exit = {
    ne = { to = '嵩山少林后殿广场#SW', },
    w = { to = '嵩山少林龙树院', },
    s = { to = '嵩山少林槐树林#C', },
  },
},

['嵩山少林般若堂五部'] = {
  id = '嵩山少林般若堂五部',
  area = '嵩山少林',
  name = '般若堂五部',
  desc =  [[这是一间极为简陋的禅房。环视四周，除了几幅佛竭外，室内空荡荡地别无他物。地上整齐的摆放着几个破烂且发黑的黄布蒲团，几位须发花白的老僧正在坐在上面闭目入定。这里是本寺十八罗汉参禅修行的地方，不少绝世武功便是在此悟出。]],
  exit = {
    s = { to = '嵩山少林般若堂四部', },
    w = { to = '嵩山少林练武场#E-E', },
    n = { to = '嵩山少林般若堂六部', },
  },
},

['嵩山少林罗汉堂五部'] = {
  id = '嵩山少林罗汉堂五部',
  area = '嵩山少林',
  name = '罗汉堂五部',
  desc =  [[这是一间极为简陋的禅房。环视四周，除了几幅佛竭外，室内空荡荡地别无他物。地上整齐的摆放着几个破烂且发黑的黄布蒲团，几位须发花白的老僧正在坐在上面闭目入定。这里是本寺十八罗汉参禅修行的地方，不少绝世武功便是在此悟出。]],
  exit = {
    e = { to = '嵩山少林练武场#W-W', },
    s = { to = '嵩山少林罗汉堂四部', },
    w = { to = '嵩山少林演武堂', },
    n = { to = '嵩山少林罗汉堂六部', },
  },
},

['嵩山少林戒坛#NW'] = {
  id = '嵩山少林戒坛#NW',
  area = '嵩山少林',
  name = '戒坛',
  desc =  [[这是一个正方形，四角攒尖顶的亭台式建筑。是寺中僧徒受戒的地方。坛上正中放有佛身相连，向背而坐的双面铜铸佛像，面北的是药师佛，面南的为阿弥陀佛。坛上空无一人，寂静无声，越发显得此处的庄严肃穆。]],
  exit = {
    e = { to = '嵩山少林戒坛#NE', },
    s = { to = '嵩山少林戒坛#SW', },
    ne = { to = '嵩山少林法堂', },
  },
},

['嵩山少林里屋'] = {
  id = '嵩山少林里屋',
  area = '嵩山少林',
  name = '里屋',
  desc =  [[里屋的陈设就更加简单，一把拂尘，一张坐垫，别无它物。一名老僧正在闭目入定。]],
  exit = {
    out = { to = '嵩山少林小屋', },
  },
},

['嵩山少林林中小路#1W'] = {
  id = '嵩山少林林中小路#1W',
  area = '嵩山少林',
  name = '林中小路',
  desc =  [[这是一片密密的竹林。这里人迹罕至，惟闻足底叩击路面，有僧敲木鱼声；微风吹拂竹叶，又如簌簌禅唱。令人尘心为之一涤，真是绝佳的禅修所在。]],
  exit = {
    w = { to = '嵩山少林林中小路#2W', },
    e = { to = '嵩山少林石板路#2N', },
  },
},

['嵩山少林中心武场#W'] = {
  id = '嵩山少林中心武场#W',
  area = '嵩山少林',
  name = '中心武场',
  desc =  [[这里是少林寺的练武场。由无数块巨大的花岗岩石板铺就。上千年的踩踏已使得这些石板如同镜子般平整光滑。武场中央竖立着一个金光闪闪的金人，几位老僧神色庄严，脚踏八卦方位围绕，缓缓发招。]],
  exit = {
    e = { to = '嵩山少林练武场#W-E', },
    s = { to = '嵩山少林练武场#W-S', },
    w = { to = '嵩山少林练武场#W-W', },
    n = { to = '嵩山少林练武场#W-N', },
  },
},

['嵩山少林回廊#2'] = {
  id = '嵩山少林回廊#2',
  area = '嵩山少林',
  name = '回廊',
  desc =  [[这里是法堂西侧的回廊。彩梁画栋，连顶棚也用彩漆绘满了各种飞天的图形，每幅画似乎都在诉说一个娓娓动人的佛经故事。廊外两侧是翠绿的青竹，在微风中沙沙做响。四周静悄悄的，只有你自己的脚步声在耳边回荡。]],
  exit = {
    e = { to = '嵩山少林回廊#2', },
    s = { to = '嵩山少林回廊#1', },
    w = { to = '嵩山少林回廊#3', },
    n = { to = '嵩山少林回廊#2', },
  },
},

['嵩山少林小径'] = {
  id = '嵩山少林小径',
  area = '嵩山少林',
  name = '小径',
  desc =  [[这里是一条寂静的小径，路面一尘不染。两旁是青草，有几只蝴蝶在上面飞舞。再往前，好象有一所小院。]],
  exit = {
    s = { to = '嵩山少林小屋', },
    hidden = { to = '嵩山少林藏经阁二楼', cmd = 'jump out', },
  },
},

['嵩山少林武器库'] = {
  id = '嵩山少林武器库',
  area = '嵩山少林',
  name = '武器库',
  desc =  [[少林寺的武器库可称天下第一，十八般兵器，这里可谓应有尽有。四面一望，令你顿感眼花缭乱。墙上砌了一个个小格子，每个都插满了各种各样的兵器。墙角一个健壮的僧人正乒乒乓乓地在打造一根禅杖。另一位灰衣僧人正在墙角拂拭一把戒刀。看到你进来，他缓缓起身，向你迎了过来。]],
  exit = {
    s = { to = '嵩山少林龙树院', },
  },
},

['嵩山少林钟楼小院'] = {
  id = '嵩山少林钟楼小院',
  area = '嵩山少林',
  name = '钟楼小院',
  desc =  [[这是一座砖木结构的宝塔，塔高七层，塔身作八角形，飞檐翘翎，檐角上挂满了一串串小铜铃，随风叮叮作响。塔身墙上镂空雕绘着无数佛陀们的坐像。一个个形态维肖，看来出自名匠之手。塔底入口处开了一扇拱形的小木门，门扇两侧用彩漆涂绘，画的是释祖在灵山对诸天众佛讲经时的情形。]],
  exit = {
    w = { to = '嵩山少林东侧廊#1', },
    enter = { to = '嵩山少林钟楼一层', },
  },
},

['嵩山少林禅房#N'] = {
  id = '嵩山少林禅房#N',
  area = '嵩山少林',
  name = '禅房',
  desc =  [[这里是诵经的禅房。房中有一座小香炉，淡淡的清烟从中散出，弥漫在整间房内。阳光透过窗格照在青石地上，在青烟中形成根根耀眼的光柱。屋中的地上散放着几个蒲团，几个年青的僧人正闭目打坐于其上。]],
  exit = {
    s = { to = '嵩山少林禅房#C', },
  },
},

['嵩山少林茶室'] = {
  id = '嵩山少林茶室',
  area = '嵩山少林',
  name = '茶室',
  desc =  [[这里是方丈待客的地方，靠墙左右两侧摆着一溜太师椅。北面墙上挂了一付对联。墙角一几，放着几个茶壶。有个茶壶壶身上题了“碧螺春”三个篆字，壶嘴热气腾腾，似乎是刚沏的新茶。往北是方丈室。]],
  exit = {
    d = { to = '嵩山少林方丈精舍', },
    n = { to = '嵩山少林方丈室', },
  },
},

['嵩山少林小路#3SE'] = {
  id = '嵩山少林小路#3SE',
  area = '嵩山少林',
  name = '小路',
  desc =  [[你走在一条碎石铺成的小路上，两侧青草茵茵，山花烂漫。空气中夹带着泥土的芳香，扑面而来。南面有一片很大的菜园子。]],
  exit = {
    s = { to = '嵩山少林菜园子#NW', },
    n = { to = '嵩山少林小路#2SE', },
  },
},

['嵩山少林藏经阁一楼'] = {
  id = '嵩山少林藏经阁一楼',
  area = '嵩山少林',
  name = '藏经阁一楼',
  desc =  [[这里就是名满江湖的--少林藏经阁。不愧为中原佛法的总源，少林寺此处藏经之富，天下罕有其匹。这里都是密密麻麻，高及顶棚的书架，书架间仅有容身一人通行的空隙。几排大书架中间，间隔地放着数丈长的书桌。目光及处，你看到桌上放了几本佛经。]],
  exit = {
    u = { to = '嵩山少林藏经阁二楼', },
    out = { to = '嵩山少林溪旁空地', },
  },
},

['嵩山少林小土屋'] = {
  id = '嵩山少林小土屋',
  area = '嵩山少林',
  name = '小土屋',
  desc =  [[土屋中间挂着一张大竹席，将后边的那半间隔作了卧房。地上放了架木制的纺车，上面已经积满了灰尘，看来是好久没人用了。地面上的尘土上留有几行散乱的足迹，通向席后的卧房。]],
  exit = {
    s = { to = '嵩山少林小院', },
    n = { to = '嵩山少林卧室', },
  },
},

['嵩山少林练武场#W-W'] = {
  id = '嵩山少林练武场#W-W',
  area = '嵩山少林',
  name = '练武场',
  desc =  [[这里是少林寺的练武场。由无数块巨大的花岗岩石板铺就。上千年的踩踏已使得这些石板如同镜子般平整光滑。十来个僧人正在练习武技。南北东三面各有一个练武场。西面是研习武功用的罗汉九部。]],
  exit = {
    e = { to = '嵩山少林中心武场#W', },
    s = { to = '嵩山少林练武场#W-SW', },
    w = { to = '嵩山少林罗汉堂五部', },
    n = { to = '嵩山少林练武场#W-NW', },
  },
},

['嵩山少林石阶#1'] = {
  id = '嵩山少林石阶#1',
  area = '嵩山少林',
  name = '石阶',
  desc =  [[这里是嵩山南麓的少室山山脚。一条长长的石阶如同巨龙般蜿蜒而上，直没云端。嵩山群峰壁立，翠色满山，令人俯仰间顿生渺小之意。边上有几个叫卖的小贩和挑夫，似乎在嚷嚷着争吵些什么。]],
  exit = {
    nu = { to = '嵩山少林石阶#2', },
    w = { to = '嵩山少林山坡', },
    e = { to = '嵩山少林汝州城', },
  },
},

['嵩山少林回廊#4'] = {
  id = '嵩山少林回廊#4',
  area = '嵩山少林',
  name = '回廊',
  desc =  [[这里是法堂西侧的回廊。彩梁画栋，连顶棚也用彩漆绘满了各种飞天的图形，每幅画似乎都在诉说一个娓娓动人的佛经故事。廊外两侧是翠绿的青竹，在微风中沙沙做响。四周静悄悄的，只有你自己的脚步声在耳边回荡。]],
  exit = {
    e = { to = '嵩山少林回廊#3', },
    s = { to = '嵩山少林回廊#4', },
    w = { to = '嵩山少林回廊#4', },
    n = { to = '嵩山少林达摩院', },
  },
},

['嵩山少林香积厨#1'] = {
  id = '嵩山少林香积厨#1',
  area = '嵩山少林',
  name = '香积厨',
  desc =  [[炊烟缭绕，蒸汽腾腾，香味扑鼻而来。靠墙是一排数丈长的灶台，支着十来口大锅，最大的一口饭锅上方竟有人从梁上悬空而下，手持木棍在搅拌。除了烧饭的僧人外，几位火工头陀忙着劈柴运薪，灶下炉火熊熊。一位中年僧人正来回催促着。]],
  exit = {
    w = { to = '嵩山少林饭厅#C', },
    s = { to = '嵩山少林香积厨#2', },
  },
},

['嵩山少林罗汉堂七部'] = {
  id = '嵩山少林罗汉堂七部',
  area = '嵩山少林',
  name = '罗汉堂七部',
  desc =  [[这是一间极为简陋的禅房。环视四周，除了几幅佛竭外，室内空荡荡地别无他物。地上整齐的摆放着几个破烂且发黑的黄布蒲团，几位须发花白的老僧正在坐在上面闭目入定。这里是本寺十八罗汉参禅修行的地方，不少绝世武功便是在此悟出。]],
  exit = {
    s = { to = '嵩山少林罗汉堂六部', },
    n = { to = '嵩山少林罗汉堂八部', },
  },
},

['嵩山少林大悲殿'] = {
  id = '嵩山少林大悲殿',
  area = '嵩山少林',
  name = '大悲殿',
  desc =  [[大悲殿系取佛家大慈大悲之意，殿堂上四壁绘满了佛家十忍等大慈大悲之事。系我佛弟子冥想领悟禅理增进佛法专有所在，地上摆着几个蒲团，几本经卷，几个木鱼。几位僧人正在瞑目讼经，看来颇得禅悟。]],
  exit = {
    s = { to = '嵩山少林石板路#N', },
    w = { to = '嵩山少林须弥殿', },
    n = { to = '嵩山少林后殿广场#C', },
  },
},

['嵩山少林鼓楼四层'] = {
  id = '嵩山少林鼓楼四层',
  area = '嵩山少林',
  name = '鼓楼四层',
  desc =  [[到这里楼梯大概只能容一人上下，墙身也略薄了些。视线越过窗棂，北边的练武场，罗汉堂，般若堂历历在目，不少僧人正汇集在练武场上习武，吆喝声一阵阵传进耳鼓。东边的天王殿，山门殿也尽露全貌。]],
  exit = {
    u = { to = '嵩山少林鼓楼五层', },
    d = { to = '嵩山少林鼓楼三层', },
  },
},

['嵩山少林林中小路#3W'] = {
  id = '嵩山少林林中小路#3W',
  area = '嵩山少林',
  name = '林中小路',
  desc =  [[这是一片密密的竹林。这里人迹罕至，惟闻足底叩击路面，有僧敲木鱼声；微风吹拂竹叶，又如簌簌禅唱。令人尘心为之一涤，真是绝佳的禅修所在。]],
  exit = {
    w = { to = '嵩山少林方丈精舍', },
    e = { to = '嵩山少林林中小路#2W', },
  },
},

['嵩山少林菜园子#SE'] = {
  id = '嵩山少林菜园子#SE',
  area = '嵩山少林',
  name = '菜园子',
  desc =  [[这里是少林寺的菜园子，方圆有两百来亩地，寺内所需的蔬菜，大多数都是这里产的。对于犯戒的僧人，也常被罚到这里，做些劈柴，浇地的苦役，已赎其过。园内正有十几名僧人忙碌的耕做着，其中有几人身上居然带着镣铐。]],
  exit = {
    w = { to = '嵩山少林菜园子#S', },
    n = { to = '嵩山少林菜园子#E', },
  },
},

['嵩山少林练武场#E-W'] = {
  id = '嵩山少林练武场#E-W',
  area = '嵩山少林',
  name = '练武场',
  desc =  [[这里是少林寺的练武场。由无数块巨大的花岗岩石板铺就。上千年的踩踏已使得这些石板如同镜子般平整光滑。十来个僧人正在练习武技。南北东三面各有一个练武场。西面是研习武功用的罗汉九部。]],
  exit = {
    e = { to = '嵩山少林中心武场#E', },
    s = { to = '嵩山少林练武场#E-SW', },
    w = { to = '嵩山少林般若堂', },
    n = { to = '嵩山少林练武场#E-NW', },
  },
},

['嵩山少林禅房#S'] = {
  id = '嵩山少林禅房#S',
  area = '嵩山少林',
  name = '禅房',
  desc =  [[这里是诵经的禅房。房中有一座小香炉，淡淡的清烟从中散出，弥漫在整间房内。阳光透过窗格照在青石地上，在青烟中形成根根耀眼的光柱。屋中的地上散放着几个蒲团，几个年青的僧人正闭目打坐于其上。]],
  exit = {
    n = { to = '嵩山少林禅房#C', },
  },
},

['嵩山少林鼓楼小院'] = {
  id = '嵩山少林鼓楼小院',
  area = '嵩山少林',
  name = '鼓楼小院',
  desc =  [[这是一座砖木结构的宝塔，塔高七层，塔身作八角形，飞檐翘翎，檐角上挂满了一串串小铜铃，随风叮叮作响。塔身墙上镂空雕绘着无数佛陀们的坐像。一个个形态维肖，看来出自名匠之手。塔底入口处开了一扇拱形的小木门，门扇两侧用彩漆涂绘，画的是释祖在灵山对诸天众佛讲经时的情形。]],
  exit = {
    e = { to = '嵩山少林西侧廊#1', },
    enter = { to = '嵩山少林鼓楼一层', },
  },
},

['嵩山少林石板路#N'] = {
  id = '嵩山少林石板路#N',
  area = '嵩山少林',
  name = '石板路',
  desc =  [[一条整齐四通八达的石板路。这里是全寺的正中央，亦是寺中交通最繁忙的地方，由此向南可达大雄宝殿。向北是大悲殿。向东向西辗转可达龙树院戒律院等寺中要地。]],
  exit = {
    e = { to = '嵩山少林松树林#C', },
    s = { to = '嵩山少林大雄宝殿', },
    w = { to = '嵩山少林槐树林#C', },
    n = { to = '嵩山少林大悲殿', },
  },
},

['嵩山少林钟楼二层'] = {
  id = '嵩山少林钟楼二层',
  area = '嵩山少林',
  name = '钟楼二层',
  desc =  [[每个楼层上都铺设了结实的木楼板，八角形的墙身上则开了四扇大窗。从窗孔看，墙体也是极为厚实。从这里往外眺望，可以看到围绕塔周的小园以及北边的竹林，随风飘来阵阵竹叶的清香。]],
  exit = {
    u = { to = '嵩山少林钟楼三层', },
    d = { to = '嵩山少林钟楼一层', },
  },
},

['嵩山少林山路#6'] = {
  id = '嵩山少林山路#6',
  area = '嵩山少林',
  name = '山路',
  desc =  [[这是少室山五乳峰下的一条小路，路旁长满的青草。黄土铺就的小路看起来很齐整，似乎有人经常打扫。不远处就是五乳峰，山势挺拔，景秀境幽，峰上种满了松树，随着微风拂过，传来阵阵滔声。前面西北方向有一片很大的竹林，一条小径直通林内。]],
  exit = {
    nu = { to = '嵩山少林山路#7', },
    nw = { to = '嵩山少林竹林#1', },
    sd = { to = '嵩山少林山路#5', },
  },
},

['嵩山少林练武场#W-SW'] = {
  id = '嵩山少林练武场#W-SW',
  area = '嵩山少林',
  name = '练武场',
  desc =  [[这里是少林寺的练武场。由无数块巨大的花岗岩石板铺就。上千年的踩踏已使得这些石板如同镜子般平整光滑。武场中央竖立着一个制作精巧的木人，一些年青僧人正自围着它练功。]],
  exit = {
    e = { to = '嵩山少林练武场#W-S', },
    n = { to = '嵩山少林练武场#W-W', },
  },
},

['嵩山少林古佛舍利塔'] = {
  id = '嵩山少林古佛舍利塔',
  area = '嵩山少林',
  name = '古佛舍利塔',
  desc =  [[这座佛塔通体饰成淡黄色，高三层，八角密檐，以沟纹大砖建造。塔基以花岗石须弥座和三层砖雕仰覆莲花组成，塔身正面设有一个半人高的拱型小门。]],
  exit = {
    s = { to = '嵩山少林塔林#N', },
    enter = { to = '嵩山少林佛塔一层', },
  },
},

['嵩山少林后殿'] = {
  id = '嵩山少林后殿',
  area = '嵩山少林',
  name = '后殿',
  desc =  [[后殿规模不大。两边都是水磨石壁，镂刻着佛门各位先贤大德的肖像及慧心妙语，正中有一口大水缸(gang)，以济寺内僧人练武口渴及日常饮用之需。每日都有专职僧侣从寺前佛心井中担水来此。]],
  exit = {
    e = { to = '嵩山少林后殿广场#NE', },
    w = { to = '嵩山少林后殿广场#NW', },
    n = { to = '嵩山少林台阶#N', },
  },
},

['嵩山少林立雪亭'] = {
  id = '嵩山少林立雪亭',
  area = '嵩山少林',
  name = '立雪亭',
  desc =  [[你沿台阶拾阶而上，眼前出现一座亭子一般的殿堂。殿前横匾上写着『立雪亭』三个大字。这里又名达摩亭。殿内佛龛供奉达摩铜像和二祖，三祖，四祖，五祖的立像。相传这是神光立雪断臂得授达摩真传衣钵的地方。殿内正中的蒲团上坐着一位白眉白须的老僧。]],
  exit = {
    sd = { to = '嵩山少林台阶#N', },
    n = { to = '嵩山少林石板路#2N', },
  },
},

['嵩山少林须弥殿'] = {
  id = '嵩山少林须弥殿',
  area = '嵩山少林',
  name = '须弥殿',
  desc =  [[一间宽敞的佛殿四壁空荡荡的，正中是一张青石屏风，绘有一座高耸入云的险峰，白云缭绕，峰脚下则是一枚芥子。想是取佛家须弥芥子之典故，佛法修为可将须弥之巨容入芥子之中。屏风前摆着几个蒲团，几位僧人正自对着屏风反睛内视，勤修内功。]],
  exit = {
    e = { to = '嵩山少林大悲殿', },
  },
},

['嵩山少林心禅坪'] = {
  id = '嵩山少林心禅坪',
  area = '嵩山少林',
  name = '心禅坪',
  desc =  [[这里是一片林间空地，三面环绕着千年古衫，生长的郁郁葱葱好不茂盛。地面是一块正方大青石，与寺内石径颇为不类，疑是寺外移来。不知前辈僧人劳心劳力，运来此物何用。石坪清扫的颇为洁净，只是在林边有一块小尖石，颇为醒目。北面有一座石坊，上书心禅堂三个大字。一位老僧斜倚着石坊，似乎半梦半醒。]],
  exit = {
    w = { to = '嵩山少林法堂', },
    n = { to = '嵩山少林心禅堂', cond = 'player.party == "少林派" and ( string.find( player.name, "^玄" ) or string.find( player.name, "^渡" ) or player.flag["got 拜帖"] ) ', },
  },
},

['嵩山少林回廊#3'] = {
  id = '嵩山少林回廊#3',
  area = '嵩山少林',
  name = '回廊',
  desc =  [[这里是法堂西侧的回廊。彩梁画栋，连顶棚也用彩漆绘满了各种飞天的图形，每幅画似乎都在诉说一个娓娓动人的佛经故事。廊外两侧是翠绿的青竹，在微风中沙沙做响。四周静悄悄的，只有你自己的脚步声在耳边回荡。]],
  exit = {
    e = { to = '嵩山少林回廊#2', },
    s = { to = '嵩山少林回廊#3', },
    w = { to = '嵩山少林回廊#4', },
    n = { to = '嵩山少林回廊#3', },
  },
},

['嵩山少林松树林#E'] = {
  id = '嵩山少林松树林#E',
  area = '嵩山少林',
  name = '松树林',
  desc =  [[这是一片松树林。高高的大松树簇在一块，密实的枝叶象一蓬蓬巨伞般伸向天空，把阳光遮得丝毫也无。一条洁净的青石小径蜿蜒林中。东面的院落就是戒律院。院外站着两名僧人严密的守护着。]],
  exit = {
    w = { to = '嵩山少林松树林#S', },
    e = { to = '嵩山少林戒律院', cond = 'player.flag["罪僧"]', no_wander = true },
  },
},

['嵩山少林松树林#C'] = {
  id = '嵩山少林松树林#C',
  area = '嵩山少林',
  name = '松树林',
  desc =  [[这是一片松树林。高高的大松树簇在一块，密实的枝叶象一蓬蓬巨伞般伸向天空，把阳光遮得丝毫也无。一条洁净的青石小径蜿蜒林中。]],
  exit = {
    s = { to = '嵩山少林松树林#S', },
    w = { to = '嵩山少林石板路#N', },
    n = { to = '嵩山少林松树林#N', },
  },
},

['嵩山少林武僧堂#3'] = {
  id = '嵩山少林武僧堂#3',
  area = '嵩山少林',
  name = '武僧堂',
  desc =  [[这是少林寺护寺武僧练武及居住之所，室内光线明亮，不时听到呼喝练功之声。一个身强体壮的武僧正自苦练少林武学之秘奥。]],
  exit = {
    s = { to = '嵩山少林武僧堂#4', },
    n = { to = '嵩山少林武僧堂#2', },
  },
},

['嵩山少林六祖殿'] = {
  id = '嵩山少林六祖殿',
  area = '嵩山少林',
  name = '六祖殿',
  desc =  [[这里是供奉少林六祖的地方。正面是观音，文殊，菩贤，地藏，大势至等菩萨的玉雕像。两山安放着初祖达摩，二祖惠可，三祖僧璨，四祖道信，五祖弘忍，六祖慧能的塑像。 ]],
  exit = {
    e = { to = '嵩山少林平台', },
  },
},

['嵩山少林罗汉堂一部'] = {
  id = '嵩山少林罗汉堂一部',
  area = '嵩山少林',
  name = '罗汉堂一部',
  desc =  [[这是一间极为简陋的禅房。环视四周，除了几幅佛竭外，室内空荡荡地别无他物。地上整齐的摆放着几个破烂且发黑的黄布蒲团，几位须发花白的老僧正在坐在上面闭目入定。这里是本寺十八罗汉参禅修行的地方，不少绝世武功便是在此悟出。]],
  exit = {
    n = { to = '嵩山少林罗汉堂二部', },
  },
},

['嵩山少林侧廊#E'] = {
  id = '嵩山少林侧廊#E',
  area = '嵩山少林',
  name = '侧廊',
  desc =  [[这里是禅房侧廊。彩梁画栋，连顶棚也用彩漆绘满了各种飞天的图形，出自名家手笔，端的壮丽不凡。北望是一片槐树林，鸟语花香隐隐传来令人心旷神怡。东面是僧人们休息用的僧舍。   ]],
  exit = {
    e = { to = '嵩山少林僧舍#E', },
    s = { to = '嵩山少林石板路#E', },
    ne = { to = '嵩山少林松树林#S', },
  },
},

['嵩山少林菜园子#NW'] = {
  id = '嵩山少林菜园子#NW',
  area = '嵩山少林',
  name = '菜园子',
  desc =  [[这里是少林寺的菜园子，方圆有两百来亩地，寺内所需的蔬菜，大多数都是这里产的。对于犯戒的僧人，也常被罚到这里，做些劈柴，浇地的苦役，已赎其过。园内正有十几名僧人忙碌的耕做着，其中有几人身上居然带着镣铐。]],
  exit = {
    e = { to = '嵩山少林菜园子#E', },
    s = { to = '嵩山少林菜园子#S', },
    n = { to = '嵩山少林小路#3SE', },
  },
},

['嵩山少林小院'] = {
  id = '嵩山少林小院',
  area = '嵩山少林',
  name = '小院',
  desc =  [[你站在最中间的土屋前。土屋似乎是用本地的山岭土夯筑的，结实而且耐水。屋顶是茅草铺的，角上露出几个被风吹开的破洞。左边的屋子好象是间猪舍，右边的土屋门边挂着几串晒干的辣椒。正中间土屋的门是开着的。]],
  exit = {
    e = { to = '嵩山少林田埂边', },
    nw = { to = '嵩山少林猪舍', },
    n = { to = '嵩山少林小土屋', },
  },
},

['嵩山少林僧舍#WS'] = {
  id = '嵩山少林僧舍#WS',
  area = '嵩山少林',
  name = '僧舍',
  desc =  [[这里是僧众们饮食起居的地方。靠墙一溜摆着几张木床，床上铺的是篾席。床头叠着床薄被，冬天想必很冷，僧侣们全靠扎实的内功根基御寒。地上整齐的放着几个蒲团和木鱼。]],
	use_cond = 'player.party == "少林派"',
  exit = {
    n = { to = '嵩山少林僧舍#W', },
  },
},

['嵩山少林法堂'] = {
  id = '嵩山少林法堂',
  area = '嵩山少林',
  name = '法堂',
  desc =  [[这是一座极大的殿堂，可以同时容纳几百人而绝无问题。这里是寺中演说佛经，佛法和阪戒集会的场所。殿内整齐的放着一排排的蒲团，以供听经者打坐之用。]],
  exit = {
    se = { to = '嵩山少林戒坛#NE', },
    e = { to = '嵩山少林心禅坪', },
    sw = { to = '嵩山少林戒坛#NW', },
    w = { to = '嵩山少林回廊#1', },
    n = { to = '嵩山少林空场', },
  },
},

['嵩山少林罗汉堂六部'] = {
  id = '嵩山少林罗汉堂六部',
  area = '嵩山少林',
  name = '罗汉堂六部',
  desc =  [[这是一间极为简陋的禅房。环视四周，除了几幅佛竭外，室内空荡荡地别无他物。地上整齐的摆放着几个破烂且发黑的黄布蒲团，几位须发花白的老僧正在坐在上面闭目入定。这里是本寺十八罗汉参禅修行的地方，不少绝世武功便是在此悟出。]],
  exit = {
    s = { to = '嵩山少林罗汉堂五部', },
    n = { to = '嵩山少林罗汉堂七部', },
  },
},

['嵩山少林罗汉堂九部'] = {
  id = '嵩山少林罗汉堂九部',
  area = '嵩山少林',
  name = '罗汉堂九部',
  desc =  [[这是一间极为简陋的禅房。环视四周，除了几幅佛竭外，室内空荡荡地别无他物。地上整齐的摆放着几个破烂且发黑的黄布蒲团，几位须发花白的老僧正在坐在上面闭目入定。这里是本寺十八罗汉参禅修行的地方，不少绝世武功便是在此悟出。]],
  exit = {
    s = { to = '嵩山少林罗汉堂八部', },
  },
},

['嵩山少林佛心井'] = {
  id = '嵩山少林佛心井',
  area = '嵩山少林',
  name = '佛心井',
  desc =  [[这是一口千年古井，井旁是用青石砌成的井台，上面是用生铁铸就的一个高一尺的井缘。井内深达十几米，黑漆漆的望不到底。井口处有一个木制的辘轳，用来打水。相传这里曾是达摩老祖洗刷餐具之处。]],
  exit = {
    wd = { to = '嵩山少林石阶#9', },
  },
},

['嵩山少林寺前广场#W'] = {
  id = '嵩山少林寺前广场#W',
  area = '嵩山少林',
  name = '寺前广场',
  desc =  [[这里是少林寺前的广场，整个广场由大块的青石铺成，极为平坦。但因年代久远，都有些破损。丛丛小草从石板的缝隙中长了出来。广场周围都是密密的松树林，四角上各放了几块石碑，字迹都甚为模糊。寺前三三两两的站着几个僧人。]],
  exit = {
    e = { to = '嵩山少林广场#1', },
  },
},

['嵩山少林竹林#1'] = {
  id = '嵩山少林竹林#1',
  area = '嵩山少林',
  name = '竹林',
  desc =  [[这是一片密密的竹林。这里人迹罕至，惟闻足底叩击路面，有僧敲木鱼声；微风吹拂竹叶，又如簌簌禅唱。令人尘心为之一涤，真是绝佳的禅修所在。]],
  exit = {
    ne = { to = '嵩山少林竹林#1', },
    s = { to = '嵩山少林山路#6', },
    se = { to = '嵩山少林竹林#1', },
    sw = { to = '嵩山少林竹林#2', },
    nw = { to = '嵩山少林竹林#1', },
  },
},

['嵩山少林竹林#2'] = {
  id = '嵩山少林竹林#2',
  area = '嵩山少林',
  name = '竹林',
  desc =  [[这是一片密密的竹林。这里人迹罕至，惟闻足底叩击路面，有僧敲木鱼声；微风吹拂竹叶，又如簌簌禅唱。令人尘心为之一涤，真是绝佳的禅修所在。]],
  exit = {
    ne = { to = '嵩山少林竹林#2', },
    sw = { to = '嵩山少林竹林#2', },
    nw = { to = '嵩山少林竹林#2', },
    se = { to = '嵩山少林竹林#3', handler = 'simple_path_set_pos', },
  },
},

['嵩山少林竹林#3'] = {
  id = '嵩山少林竹林#3',
  area = '嵩山少林',
  name = '竹林',
  desc =  [[这是一片密密的竹林。这里人迹罕至，惟闻足底叩击路面，有僧敲木鱼声；微风吹拂竹叶，又如簌簌禅唱。令人尘心为之一涤，真是绝佳的禅修所在。]],
  exit = {
    e = { to = '嵩山少林竹林#3', },
    s = { to = '嵩山少林竹林#3', },
    w = { to = '嵩山少林竹林#3', },
    n = { to = '嵩山少林竹林#3', },
    hidden = { to = '嵩山少林竹林#4', cost = 10, handler = 'simple_path', },
  },
},

['嵩山少林竹林#4'] = {
  id = '嵩山少林竹林#4',
  area = '嵩山少林',
  name = '竹林',
  desc =  [[这是一片密密的竹林。这里人迹罕至，惟闻足底叩击路面，有僧敲木鱼声；微风吹拂竹叶，又如簌簌禅唱。令人尘心为之一涤，真是绝佳的禅修所在。]],
  exit = {
    ne = { to = '嵩山少林竹林#4', },
    sw = { to = '嵩山少林竹林#4', },
    nw = { to = '嵩山少林竹林#5', },
    se = { to = '嵩山少林竹林#4', },
  },
},

['嵩山少林竹林#5'] = {
  id = '嵩山少林竹林#5',
  area = '嵩山少林',
  name = '竹林',
  desc =  [[这是一片密密的竹林。这里人迹罕至，惟闻足底叩击路面，有僧敲木鱼声；微风吹拂竹叶，又如簌簌禅唱。令人尘心为之一涤，真是绝佳的禅修所在。]],
  exit = {
    e = { to = '嵩山少林竹林#5', },
    s = { to = '嵩山少林竹林#5', },
    w = { to = '嵩山少林竹林#5', },
    n = { to = '嵩山少林达摩洞', },
  },
},

['嵩山少林山路#7'] = {
  id = '嵩山少林山路#7',
  area = '嵩山少林',
  name = '山路',
  desc =  [[这是少室山五乳峰下的一条小路，路旁长满的青草。黄土铺就的小路看起来很齐整，似乎有人经常打扫。不远处就是五乳峰，山势挺拔，景秀境幽，峰上种满了松树，随着微风拂过，传来阵阵滔声。]],
  exit = {
    ne = { to = '嵩山少林山路#8', },
    sd = { to = '嵩山少林山路#6', },
  },
},

['嵩山少林练武场#W-NE'] = {
  id = '嵩山少林练武场#W-NE',
  area = '嵩山少林',
  name = '练武场',
  desc =  [[这里是少林寺的练武场。由无数块巨大的花岗岩石板铺就。上千年的踩踏已使得这些石板如同镜子般平整光滑。武场中央竖立着一个制作精巧的木人，一些年青僧人正自围着它练功。]],
  exit = {
    w = { to = '嵩山少林练武场#W-N', },
    s = { to = '嵩山少林练武场#W-E', },
  },
},

['嵩山少林石阶#6'] = {
  id = '嵩山少林石阶#6',
  area = '嵩山少林',
  name = '石阶',
  desc =  [[这里是瀑布上方一道窄窄的山梁，浑然天成。石梁上面人工凿出一格格阶梯。边上钉了几棵木桩，绕上粗长的麻绳作为扶手。瀑布在脚下奔腾而过，在不远的山脚下汇成一个深潭。]],
  exit = {
    u = { to = '嵩山山路#1', },
    sd = { to = '嵩山少林石阶#5', },
    wu = { to = '嵩山少林石阶#7', },
  },
},

['嵩山少林后殿广场#SW'] = {
  id = '嵩山少林后殿广场#SW',
  area = '嵩山少林',
  name = '后殿广场',
  desc =  [[这里是后殿广场，由大青石板拼成的地面上有几处凹凸的踏痕，似是以前有高手施展内功所遗留的印记。几位执役僧正认真的进行清扫。]],
  exit = {
    e = { to = '嵩山少林后殿广场#C', },
    sw = { to = '嵩山少林槐树林#N', },
    n = { to = '嵩山少林后殿广场#NW', },
  },
},

['嵩山少林林中小路#3E'] = {
  id = '嵩山少林林中小路#3E',
  area = '嵩山少林',
  name = '林中小路',
  desc =  [[这是一片密密的竹林。这里人迹罕至，惟闻足底叩击路面，有僧敲木鱼声；微风吹拂竹叶，又如簌簌禅唱。令人尘心为之一涤，真是绝佳的禅修所在。]],
  exit = {
    se = { to = '嵩山少林林中小路#4E', },
    sw = { to = '嵩山少林林中小路#2E', },
  },
},

['嵩山少林金刚伏魔圈'] = {
  id = '嵩山少林金刚伏魔圈',
  area = '嵩山少林',
  name = '金刚伏魔圈',
  desc =  [[三棵大松树的树干上各挖了个可容身一人的大洞，有个洞口露出黑色僧袍一角，似乎住得有人。中央是一片大草坪，中心处光秃秃的，似乎经常受大力击打，以致寸草不生。]],
  exit = {
    out = { to = '嵩山少林青云坪', },
  },
},

['嵩山少林僧舍#ES'] = {
  id = '嵩山少林僧舍#ES',
  area = '嵩山少林',
  name = '僧舍',
  desc =  [[这里是僧众们饮食起居的地方。靠墙一溜摆着几张木床，床上铺的是篾席。床头叠着床薄被，冬天想必很冷，僧侣们全靠扎实的内功根基御寒。地上整齐的放着几个蒲团和木鱼。]],
	use_cond = 'player.party == "少林派"',
  exit = {
    n = { to = '嵩山少林僧舍#E', },
  },
},

['嵩山少林菜园子#E'] = {
  id = '嵩山少林菜园子#E',
  area = '嵩山少林',
  name = '菜园子',
  desc =  [[这里是少林寺的菜园子，方圆有两百来亩地，寺内所需的蔬菜，大多数都是这里产的。对于犯戒的僧人，也常被罚到这里，做些劈柴，浇地的苦役，已赎其过。园内正有十几名僧人忙碌的耕做着，其中有几人身上居然带着镣铐。]],
  exit = {
    w = { to = '嵩山少林菜园子#NW', },
    s = { to = '嵩山少林菜园子#SE', },
  },
},

['嵩山少林山路#2'] = {
  id = '嵩山少林山路#2',
  area = '嵩山少林',
  name = '山路',
  desc =  [[这是少室山五乳峰下的一条小路，路旁长满的青草。黄土铺就的小路看起来很齐整，似乎有人经常打扫。不远处就是五乳峰，山势挺拔，景秀境幽，峰上种满了松树，随着微风拂过，传来阵阵滔声。]],
  exit = {
    nu = { to = '嵩山少林山路#3', },
    s = { to = '嵩山少林山路#1', },
  },
},

['嵩山少林石阶#4'] = {
  id = '嵩山少林石阶#4',
  area = '嵩山少林',
  name = '石阶',
  desc =  [[水声越来越大，山间充满了浓浓的水气。石阶上，断裂的山隙中，都流出一道道细细的泉水，汇成一股澄碧的小溪，向山下蜿蜒流去。周围绿意荡漾，鸟语鹦声，如置身仙境。]],
  exit = {
    nu = { to = '嵩山少林石阶#5', },
    sd = { to = '嵩山少林石阶#3', },
  },
},

['嵩山少林菜园子#S'] = {
  id = '嵩山少林菜园子#S',
  area = '嵩山少林',
  name = '菜园子',
  desc =  [[这里是少林寺的菜园子，方圆有两百来亩地，寺内所需的蔬菜，大多数都是这里产的。对于犯戒的僧人，也常被罚到这里，做些劈柴，浇地的苦役，已赎其过。园内正有十几名僧人忙碌的耕做着，其中有几人身上居然带着镣铐。]],
  exit = {
    e = { to = '嵩山少林菜园子#SE', },
    n = { to = '嵩山少林菜园子#NW', },
  },
},

['嵩山少林石阶#2'] = {
  id = '嵩山少林石阶#2',
  area = '嵩山少林',
  name = '石阶',
  desc =  [[长长的石阶往上依然看不到尽头。身边的山壁受着长年风雨的浸润，长出了薄薄的青苔。上面依稀有些刻凿的痕迹。有一行字特别清晰：“金刚伏邪魔，宝塔镇群妖”]],
  exit = {
    sd = { to = '嵩山少林石阶#1', },
    wu = { to = '嵩山少林石阶#3', },
  },
},

['嵩山少林紧那罗王殿'] = {
  id = '嵩山少林紧那罗王殿',
  area = '嵩山少林',
  name = '紧那罗王殿',
  desc =  [[大殿正中供奉着紧那罗王的三座塑像。四周的墙壁上绘满了西方胜境，四十八愿，二十四尊天的壁画，构图宏伟，色彩绚丽，线条流畅，画工精细。殿中有几名香客正在顶礼膜拜。]],
  exit = {
    w = { to = '嵩山少林平台', },
  },
},

['嵩山少林东侧廊#2'] = {
  id = '嵩山少林东侧廊#2',
  area = '嵩山少林',
  name = '东侧廊',
  desc =  [[这里是天王殿旁的侧廊。彩梁画栋，连顶棚也用彩漆绘满了各种飞天的图形，每幅画似乎都在诉说一个娓娓动人的佛经故事。东面飘来阵阵米饭的清香，乃是僧人们用膳的斋堂。]],
  exit = {
    e = { to = '嵩山少林斋堂', },
    nw = { to = '嵩山少林石板路#S', },
    s = { to = '嵩山少林东侧廊#1', },
  },
},

['嵩山少林后殿广场#NE'] = {
  id = '嵩山少林后殿广场#NE',
  area = '嵩山少林',
  name = '后殿广场',
  desc =  [[这里是后殿广场，由整块大青石板拼成的地面上有几处凹凸的踏痕，似是以前有高手施展内功所遗留的印记。西面是后殿。]],
  exit = {
    w = { to = '嵩山少林后殿', },
    s = { to = '嵩山少林后殿广场#SE', },
  },
},

['嵩山少林石板路#E'] = {
  id = '嵩山少林石板路#E',
  area = '嵩山少林',
  name = '石板路',
  desc =  [[一条平整宽阔的石路，路边是两长溜僧棚，可供大家休息之用。香客们手执线香，缓步通过。一些忙碌的僧侣，急匆匆的奔驰而去，似乎有什么要事在身。一队护寺僧兵手执戒刀，正自来往巡视。]],
  exit = {
    e = { to = '嵩山少林般若堂', },
    w = { to = '嵩山少林石板路#C', },
    n = { to = '嵩山少林侧廊#E', },
  },
},

['嵩山少林圣僧塔'] = {
  id = '嵩山少林圣僧塔',
  area = '嵩山少林',
  name = '圣僧塔',
  desc =  [[本层供奉着少林上代几位有德高僧的灵体法台，塔做六角之形，分六个方位，分别乃是无色台(wuse),无相牌（wuxiang)，天鸣禅台  (tianming),苦智灵碑(kuzhi)，苦慧屏(kuhui)，晦智圣座(huizhi)。  几缕天光透过塔窗洒在塔内，似乎为千年古塔增添了一点活力。   ]],
  exit = {
    u = { to = '嵩山少林佛塔三层', },
    d = { to = '嵩山少林佛塔一层', },
    hidden1 = { to = '嵩山少林无色台', no_wander = true, handler = 'sl_fota', cond = 'player.skill["禅宗心法"] and player.skill["禅宗心法"].level >= 30', },
    hidden2 = { to = '嵩山少林无相牌', no_wander = true, handler = 'sl_fota', cond = 'player.neili > 100', },
    hidden3 = { to = '嵩山少林天鸣禅台', no_wander = true, handler = 'sl_fota', cond = 'player.skill["基本爪法"] and player.skill["基本爪法"].level >= 30', },
    hidden4 = { to = '嵩山少林苦慧坪', no_wander = true, handler = 'sl_fota', cond = 'player.skill["基本腿法"] and player.skill["基本腿法"].level >= 30', },
    hidden5 = { to = '嵩山少林晦智圣座', no_wander = true, handler = 'sl_fota', cond = 'player.skill["基本手法"] and player.skill["基本手法"].level >= 30', },
  },
},

['嵩山少林无色台'] = {
  id = '嵩山少林无色台',
  area = '嵩山少林',
  name = '无色台',
  desc =  [[这里是无色禅师的灵台内部，灵室十分空旷。正中有一张灵案(lingan)，上书“洛钟东应”四个大字，乃是无色大师生前亲手所书。笔势遒劲，大舒大展如同一套极高明的拳法。虽然置身暗室，你却觉的灵台一片空明，似有光芒自心底发出。]],
  exit = {
    out = { to = '嵩山少林圣僧塔', },
  },
},

['嵩山少林无相牌'] = {
  id = '嵩山少林无相牌',
  area = '嵩山少林',
  name = '无相牌',
  desc =  [[通过无相牌进入无相禅师生前修真的密室，室内颇为灰暗，密不透光。密室中摆着一个大铜缸，缸中盛满净水，波光粼粼。为室内添加一点光亮据说无相大师当年受挫于昆仑高人之后，又寻张君宝不遇，愤懑归寺，既隐居于此练掌(strike)，将掌法练到登峰造极之地步。其一生武学秘奥尽藏于此斗室之中。]],
  exit = {
    out = { to = '嵩山少林圣僧塔', },
  },
},

['嵩山少林天鸣禅台'] = {
  id = '嵩山少林天鸣禅台',
  area = '嵩山少林',
  name = '天鸣禅台',
  desc =  [[一间宽敞空旷的石室，室中只有一张石床，四壁如素。抬头望去，梁上雕着一只石鹰，振翅欲飞。鹰爪间垂下几条粗如儿臂的大绳。大师是无色无相等的师叔。前辈高僧当年执掌少林佛法渊深，名震天下。天鸣大师晚年修为更为精进，为重新修订少林爪法(claw)绝技。于此石室内闭关经年，坐化于此。其绝世武功湮没于空室之中。]],
  exit = {
    out = { to = '嵩山少林圣僧塔', },
  },
},

['嵩山少林苦慧坪'] = {
  id = '嵩山少林苦慧坪',
  area = '嵩山少林',
  name = '苦慧坪',
  desc =  [[你心智一清原发现自己竟在一座崖壁之上，两面高岩中藏广壑，壑底云气蒙蒙，其深无际。岩壁间横着几条羊肠野径，素无人踪。岩壁上满生杂草藤蔓，地势异常险峻。苦慧禅师当年负气私自离寺出走，想是自此密径离去，创下了西域少林一派。据说后世高僧已将密径堵绝，从此处再无出路，只余当年苦慧攀过的蔓藤野径，留待后人。]],
  exit = {
    out = { to = '嵩山少林圣僧塔', },
  },
},

['嵩山少林晦智圣座'] = {
  id = '嵩山少林晦智圣座',
  area = '嵩山少林',
  name = '晦智圣座',
  desc =  [[晦智禅师圣座内修真之处原是一间石洞，入得洞来只见青石铺地竟是颇为宽敞，几处钟乳珠缨金络，晶壁玉障。不但合洞通明亮入白昼；玉床碧几，不染纤尘。而且石室修整，门户井然，到处光华灿烂，目迷五色。想是禅师有意于世俗富贵眩目之气内修真，更增禅心。四壁各雕了一座千手如来佛像姿态各不相同，栩栩如生，凝望之下令人忘俗。]],
  exit = {
    out = { to = '嵩山少林圣僧塔', },
  },
},

['嵩山少林戒坛#NE'] = {
  id = '嵩山少林戒坛#NE',
  area = '嵩山少林',
  name = '戒坛',
  desc =  [[这是一个正方形，四角攒尖顶的亭台式建筑。是寺中僧徒受戒的地方。坛上正中放有佛身相连，向背而坐的双面铜铸佛像，面北的是药师佛，面南的为阿弥陀佛。坛上空无一人，寂静无声，越发显得此处的庄严肃穆。]],
  exit = {
    w = { to = '嵩山少林戒坛#NW', },
    nw = { to = '嵩山少林法堂', },
    s = { to = '嵩山少林戒坛#SE', },
  },
},

['嵩山少林达摩院后殿'] = {
  id = '嵩山少林达摩院后殿',
  area = '嵩山少林',
  name = '达摩院后殿',
  desc =  [[这是一座古朴的殿堂。西首的墙上挂满了各类武功图谱，不少白须白眉的老僧们正端坐在图谱画轴之前，似乎在苦苦思索。南北山墙是高及屋顶的大书架，走近细看，它们是各门各派的武功秘笈，屋正中摆着几张矮几诃和几个蒲团，几位老僧正在入定中。]],
  exit = {
    s = { to = '嵩山少林达摩院', },
  },
},

['嵩山少林山路#5'] = {
  id = '嵩山少林山路#5',
  area = '嵩山少林',
  name = '山路',
  desc =  [[这是少室山五乳峰下的一条小路，路旁长满的青草。黄土铺就的小路看起来很齐整，似乎有人经常打扫。不远处就是五乳峰，山势挺拔，景秀境幽，峰上种满了松树，随着微风拂过，传来阵阵滔声。南面是初祖庵，南面可至五乳峰上。]],
  exit = {
    nu = { to = '嵩山少林山路#6', },
    s = { to = '嵩山少林初祖庵', },
  },
},

['嵩山少林小溪'] = {
  id = '嵩山少林小溪',
  area = '嵩山少林',
  name = '小溪',
  desc =  [[这是一条由后山流下来的溪流，小溪并不宽，纵身一跃似乎就可蹦到对岸。溪旁两岸的青草长得极是茂盛，且无杂乱之感，好象经人整理过。溪流的水质清澈，可以清晰的看到水底的鹅卵石和来回游动的小鱼。小溪对面的空地上有一座两层的小楼。]],
  exit = {
    w = { to = '嵩山少林林中小路#4E', },
    hidden = { to = '嵩山少林溪旁空地', cmd = 'jump xiaoxi', },
  },
},

['嵩山少林练武场#E-SW'] = {
  id = '嵩山少林练武场#E-SW',
  area = '嵩山少林',
  name = '练武场',
  desc =  [[这里是少林寺的练武场。由无数块巨大的花岗岩石板铺就。上千年的踩踏已使得这些石板如同镜子般平整光滑。武场中央竖立着一个制作精巧的木人，一些年青僧人正自围着它练功。]],
  exit = {
    e = { to = '嵩山少林练武场#E-S', },
    n = { to = '嵩山少林练武场#E-W', },
  },
},

['嵩山少林禅房#C'] = {
  id = '嵩山少林禅房#C',
  area = '嵩山少林',
  name = '禅房',
  desc =  [[这里是诵经的禅房。房中有一座小香炉，淡淡的清烟从中散出，弥漫在整间房内。阳光透过窗格照在青石地上，在青烟中形成根根耀眼的光柱。屋中的地上散放着几个蒲团，几个年青的僧人正闭目打坐于其上。]],
  exit = {
    e = { to = '嵩山少林证道院', },
    s = { to = '嵩山少林禅房#S', },
    n = { to = '嵩山少林禅房#N', },
  },
},

['嵩山少林侧廊#W'] = {
  id = '嵩山少林侧廊#W',
  area = '嵩山少林',
  name = '侧廊',
  desc =  [[这里是禅房侧廊。彩梁画栋，连顶棚也用彩漆绘满了各种飞天的图形，出自名家手笔，端的壮丽不凡。北望是一片槐树林，鸟语花香隐隐传来令人心旷神怡。西面是僧人们休息用的僧舍。  ]],
  exit = {
    w = { to = '嵩山少林僧舍#W', },
    nw = { to = '嵩山少林槐树林#S', },
    s = { to = '嵩山少林石板路#W', },
  },
},

['嵩山少林石板路#3N'] = {
  id = '嵩山少林石板路#3N',
  area = '嵩山少林',
  name = '石板路',
  desc =  [[一条青石铺成的小路向西，北，东三个方向蜿蜒而去。石路上绝无半点尘土，看来经常有人来打扫。路的两旁满是翠绿的青竹，在微风中左右摇曳，沙沙做响。北面是受戒的戒坛。]],
  exit = {
    ne = { to = '嵩山少林戒坛#SE', },
    nw = { to = '嵩山少林戒坛#SW', },
    s = { to = '嵩山少林石板路#2N', },
  },
},

['嵩山少林般若堂七部'] = {
  id = '嵩山少林般若堂七部',
  area = '嵩山少林',
  name = '般若堂七部',
  desc =  [[这是一间极为简陋的禅房。环视四周，除了几幅佛竭外，室内空荡荡地别无他物。地上整齐的摆放着几个破烂且发黑的黄布蒲团，几位须发花白的老僧正在坐在上面闭目入定。这里是本寺十八罗汉参禅修行的地方，不少绝世武功便是在此悟出。]],
  exit = {
    s = { to = '嵩山少林般若堂六部', },
    n = { to = '嵩山少林般若堂八部', },
  },
},

['嵩山少林小路#1SE'] = {
  id = '嵩山少林小路#1SE',
  area = '嵩山少林',
  name = '小路',
  desc =  [[你走在一条碎石铺成的小路上，两侧青草茵茵，山花烂漫。空气中夹带着泥土的芳香，扑面而来。]],
  exit = {
    se = { to = '嵩山少林小路#2SE', },
    n = { to = '嵩山少林香积厨#2', },
  },
},

['嵩山少林武僧堂#1'] = {
  id = '嵩山少林武僧堂#1',
  area = '嵩山少林',
  name = '武僧堂',
  desc =  [[这是少林寺护寺武僧练武及居住之所，室内光线明亮，不时听到呼喝练功之声。一个身强体壮的武僧正自苦练少林武学之秘奥。]],
  exit = {
    e = { to = '嵩山少林演武堂', },
    s = { to = '嵩山少林武僧堂#2', },
  },
},

['嵩山少林般若堂八部'] = {
  id = '嵩山少林般若堂八部',
  area = '嵩山少林',
  name = '般若堂八部',
  desc =  [[这是一间极为简陋的禅房。环视四周，除了几幅佛竭外，室内空荡荡地别无他物。地上整齐的摆放着几个破烂且发黑的黄布蒲团，几位须发花白的老僧正在坐在上面闭目入定。这里是本寺十八罗汉参禅修行的地方，不少绝世武功便是在此悟出。]],
  exit = {
    s = { to = '嵩山少林般若堂七部', },
    n = { to = '嵩山少林般若堂九部', },
  },
},

['嵩山少林平台'] = {
  id = '嵩山少林平台',
  area = '嵩山少林',
  name = '平台',
  desc =  [[这里是大雄宝殿前的一处平台，乃是全寺的中心点，寺中的重大活动多在此举行。东面是紧那罗王殿，西面是六祖殿。]],
  exit = {
    e = { to = '嵩山少林紧那罗王殿', },
    sd = { to = '嵩山少林台阶#S', },
    w = { to = '嵩山少林六祖殿', },
    n = { to = '嵩山少林大雄宝殿', },
  },
},

['嵩山少林空场'] = {
  id = '嵩山少林空场',
  area = '嵩山少林',
  name = '空场',
  desc =  [[这是法堂后面的一片空场，亦是少林寺的最后部分。因为这里地处偏僻，亦是寺中重地，所以平常很少有僧人来这里。北面是千佛殿，东面是白衣殿，西面是地藏殿。]],
  exit = {
    e = { to = '嵩山少林白衣殿', },
    s = { to = '嵩山少林法堂', },
    w = { to = '嵩山少林地藏殿', },
    n = { to = '嵩山少林千佛殿', },
  },
},

['嵩山少林回廊#1'] = {
  id = '嵩山少林回廊#1',
  area = '嵩山少林',
  name = '回廊',
  desc =  [[这里是法堂西侧的回廊。彩梁画栋，连顶棚也用彩漆绘满了各种飞天的图形，每幅画似乎都在诉说一个娓娓动人的佛经故事。廊外两侧是翠绿的青竹，在微风中沙沙做响。四周静悄悄的，只有你自己的脚步声在耳边回荡。]],
  exit = {
    e = { to = '嵩山少林法堂', },
    s = { to = '嵩山少林回廊#1', },
    w = { to = '嵩山少林回廊#1', },
    n = { to = '嵩山少林回廊#2', },
  },
},

['嵩山少林松树林#1'] = {
  id = '嵩山少林松树林#1',
  area = '嵩山少林',
  name = '松树林',
  desc =  [[这是一片松树林。几十丈高的大松树簇在一块，密实的枝叶象一蓬蓬巨伞般伸向天空，把阳光遮得丝毫也无。尺把厚的松针积在地上，一脚踩下去，半天拔不出来。]],
  exit = {
    e = { to = '嵩山少林松树林#M', ignore = true, },
    w = { to = '嵩山少林松树林#M', handler = 'simple_path_set_pos', },
    s = { to = '嵩山少林山路#8', },
    n = { to = '嵩山少林松树林#M', ignore = true, },
  },
},

['嵩山少林千佛殿'] = {
  id = '嵩山少林千佛殿',
  area = '嵩山少林',
  name = '千佛殿',
  desc =  [[这是千佛殿。大殿入口是朱红格扇，七宝玲珑。内里供奉的西天诸佛，计有八菩萨，四金刚，五百阿罗，三千揭谛，十一大曜，十八伽蓝，以及众优婆塞，优婆夷等。直看得你眼花缭乱。边上有道小木门。]],
  exit = {
    s = { to = '嵩山少林空场', },
    n = { to = '嵩山少林山路#1', },
  },
},

['嵩山少林石阶#11'] = {
  id = '嵩山少林石阶#11',
  area = '嵩山少林',
  name = '石阶',
  desc =  [[松林渐渐开阔，面前出现了一条宽广的石板道，笔直通向前方。沿道稀稀落落地种着几棵柏树，却显得高大挺拔，蝤龙般的枝干向天空高高伸展着。]],
  exit = {
    sd = { to = '嵩山少林石阶#10', },
    n = { to = '嵩山少林石坊', },
  },
},

['嵩山少林松树林#M'] = {
  id = '嵩山少林松树林#M',
  area = '嵩山少林',
  name = '松树林',
  desc =  [[你眼前骤然一黑，朦胧中，只见左右前后，到处都是铺天盖地的松树林。几十丈高的大松树簇在一块，密实的枝叶象一蓬蓬巨伞般伸向天空，把阳光遮得丝毫也无。尺把厚的松针积在地上，一脚踩下去，半天拔不出来。你似乎迷失了方向，象没头苍蝇般到处乱闯。]],
  exit = {
    e = { to = '嵩山少林松树林#M', },
    s = { to = '嵩山少林松树林#M', },
    w = { to = '嵩山少林松树林#M', },
    n = { to = '嵩山少林松树林#M', },
    hidden1 = { to = '嵩山少林松树林#2', cost = 7, handler = 'simple_path', },
    hidden2 = { to = '嵩山少林松树林#1', cost = 7, handler = 'simple_path', },
 },
},

['嵩山少林练武场#E-NE'] = {
  id = '嵩山少林练武场#E-NE',
  area = '嵩山少林',
  name = '练武场',
  desc =  [[这里是少林寺的练武场。由无数块巨大的花岗岩石板铺就。上千年的踩踏已使得这些石板如同镜子般平整光滑。武场中央竖立着一个制作精巧的木人，一些年青僧人正自围着它练功。]],
  exit = {
    w = { to = '嵩山少林练武场#E-N', },
    s = { to = '嵩山少林练武场#E-E', },
  },
},

['嵩山少林广场#2'] = {
  id = '嵩山少林广场#2',
  area = '嵩山少林',
  name = '广场',
  desc =  [[穿过山门殿，面前三道平行的青石台阶通向前方的一个广场。台阶上精工镂刻着麒麟，玄龟，松鹤等瑞兽，形态逼真动人。广场正中放着个二人高的青铜大香炉，前面摆着个香台，几位香客正在虔诚谟拜。再往前就是天王殿。]],
  exit = {
    e = { to = '嵩山少林广场东侧', },
    s = { to = '嵩山少林山门殿', },
    w = { to = '嵩山少林广场西侧', },
    n = { to = '嵩山少林前殿', },
  },
},

['嵩山少林斋堂'] = {
  id = '嵩山少林斋堂',
  area = '嵩山少林',
  name = '斋堂',
  desc =  [[你面前是一座硕大无比的房屋，这里便是少林全寺寺僧用斋的斋堂。它由十几间房屋相连而成，可以容纳全寺的僧人一同用斋。堂前的院内栽着两个垂柳，每棵树下都有一个巨大的铁缸，里面盛满了清水。几个僧人正往来忙碌着，将院内打扫得十分干净。]],
  exit = {
    e = { to = '嵩山少林饭厅#C', },
    w = { to = '嵩山少林东侧廊#2', },
    n = { to = '嵩山少林粥室', },
  },
},

['嵩山少林钟楼三层'] = {
  id = '嵩山少林钟楼三层',
  area = '嵩山少林',
  name = '钟楼三层',
  desc =  [[塔身往上似乎越来越窄，楼梯也渐为挤仄。扶手上不少朽坏处续接了新木，漆色也是新旧不同。从窗孔往外望，往北可以看到竹林中的藏经楼和方丈楼露出飞檐一角，往西则是前殿的屋顶，屋脊上塑了个大大的“佛”字。]],
  exit = {
    u = { to = '嵩山少林钟楼四层', },
    d = { to = '嵩山少林钟楼二层', },
  },
},

['嵩山少林石板路#S'] = {
  id = '嵩山少林石板路#S',
  area = '嵩山少林',
  name = '石板路',
  desc =  [[你走在一条宽阔的石板路上。这是用一米见方的巨大石板铺设而成的，可以并行十来个人也绝无问题。两侧是参天古柏，直耸入天，上端树冠相叠，遮天蔽日。几个僧人与香客来往于其间。路的尽头，矗立着金壁辉煌的大雄宝殿。]],
  exit = {
    se = { to = '嵩山少林东侧廊#2', },
    sw = { to = '嵩山少林西侧廊#2', },
    s = { to = '嵩山少林天王殿', },
    n = { to = '嵩山少林香炉', },
  },
},

['嵩山少林方丈精舍'] = {
  id = '嵩山少林方丈精舍',
  area = '嵩山少林',
  name = '方丈精舍',
  desc =  [[这里的地上整整齐齐的排放着数十个黄布蒲团，北首有一个红木讲坛，讲坛上放着个竹制的木鱼。东西边各放着一对美轮美奂的大花瓶，上插檀香数枝，香烟缭绕，氤氲芬芳，室内一片祥和之气。看来这里是方丈对僧众讲经说法的地方。]],
  exit = {
    u = { to = '嵩山少林茶室', },
    e = { to = '嵩山少林林中小路#3W', },
  },
},

['嵩山少林前殿'] = {
  id = '嵩山少林前殿',
  area = '嵩山少林',
  name = '前殿',
  desc =  [[这里是天王殿前的一处前殿。规模很小，殿内亦无很多摆设。只有几个小沙祢在接待着来往的香客。透过洞开的大门，可以看到前面规模雄伟的天王殿。]],
  exit = {
    s = { to = '嵩山少林广场#2', },
    n = { to = '嵩山少林天王殿', },
  },
},

['嵩山少林石板路#W'] = {
  id = '嵩山少林石板路#W',
  area = '嵩山少林',
  name = '石板路',
  desc =  [[一条平整宽阔的石路，路边是两长溜僧棚，可供大家休息之用。香客们手执线香，缓步通过。一些忙碌的僧侣，急匆匆的奔驰而去，似乎有什么要事在身。一队护寺僧兵手执戒刀，正自来往巡视。]],
  exit = {
    e = { to = '嵩山少林石板路#C', },
    w = { to = '嵩山少林罗汉堂', },
    n = { to = '嵩山少林侧廊#W', },
  },
},

['嵩山少林达摩洞'] = {
  id = '嵩山少林达摩洞',
  area = '嵩山少林',
  name = '达摩洞',
  desc =  [[这里是达摩古洞。五百年前南天竺僧人菩提达摩来到少林寺，见此风水宝地，就住下来广罗弟子，传授禅宗，开创少林寺佛教禅宗千年不败之基。达摩祖师常在此面壁悟道，一坐十年，壁间隐隐似仍可看到他面壁时的打坐姿态。除地上的几块竹片外，洞中空无一物。]],
  exit = {
    out = { to = '嵩山少林竹林#1', },
  },
},

['嵩山少林饭厅#S'] = {
  id = '嵩山少林饭厅#S',
  area = '嵩山少林',
  name = '饭厅',
  desc =  [[这里便是少林全寺寺僧用斋的地方。饭厅极大，足可容纳上千人同时进膳。从东到西一排排摆满了长长的餐桌和长凳，几位小和尚正来回忙碌着布置素斋。桌上摆了几盆豆腐，花生，青菜以及素鸭等美味素食。在桌子的一端有一面很小的铜锣(luo)。东面是个厨房。]],
  exit = {
    e = { to = '嵩山少林香积厨#2', },
    n = { to = '嵩山少林饭厅#C', },
  },
},

['嵩山少林钟楼一层'] = {
  id = '嵩山少林钟楼一层',
  area = '嵩山少林',
  name = '钟楼一层',
  desc =  [[这里是塔楼的底层，一缕缕阳光从墙上的花砖缝隙里透射进来，在青砖地上投下别致的光影，如同一格格棋盘相似。往上看，长长的木楼梯盘绕而上，似乎永无尽头。墙角，梯级都相当洁净，看来经常有僧人打扫。]],
  exit = {
    u = { to = '嵩山少林钟楼二层', },
    out = { to = '嵩山少林钟楼小院', },
  },
},

['嵩山少林后殿广场#C'] = {
  id = '嵩山少林后殿广场#C',
  area = '嵩山少林',
  name = '后殿广场',
  desc =  [[这里是后殿广场，由大青石板拼成的地面上有几处凹凸的踏痕，似是以前有高手施展内功所遗留的印记。南面通往大悲殿。]],
  exit = {
    e = { to = '嵩山少林后殿广场#SE', },
    w = { to = '嵩山少林后殿广场#SW', },
    s = { to = '嵩山少林大悲殿', },
  },
},

['嵩山少林溪旁空地'] = {
  id = '嵩山少林溪旁空地',
  area = '嵩山少林',
  name = '溪旁空地',
  desc =  [[这是溪旁的一块空地，地上绿草茵茵，间或点缀着一些叫不出名子的野山花。远处树林中隐隐露出一片红墙，看来这里已经是寺中边缘地带了。前面较为宽敞的地方，有一栋歇山重檐，高二层，建筑古朴的楼阁，楼中悬一方横匾，上书『藏经阁』三个字。]],
  exit = {
    enter = { to = '嵩山少林藏经阁一楼', },
    hidden = { to = '嵩山少林小溪', cmd = 'jump xiaoxi', },
  },
},

['嵩山少林青云坪'] = {
  id = '嵩山少林青云坪',
  area = '嵩山少林',
  name = '青云坪',
  desc =  [[这里便是少室绝顶。极目望去，只见白云缕缕，如苍龙绕岭；嵩山拔翠，似金刚擎天。山腰五道瀑布飞泻而下，石级蜿延曲折，宛若一条长虫，游人纷纷其上，已如蚁蛭。面前的平地上寸草不生，正中三棵巨松围成一圈，圈中央似乎有什么东西在闪闪发光。]],
  exit = {
    sd = { to = '嵩山少林松树林#2', },
    enter = { to = '嵩山少林金刚伏魔圈', },
  },
},

['嵩山少林山路#3'] = {
  id = '嵩山少林山路#3',
  area = '嵩山少林',
  name = '山路',
  desc =  [[这是少室山五乳峰下的一条小路，路旁长满的青草。黄土铺就的小路看起来很齐整，似乎有人经常打扫。不远处就是五乳峰，山势挺拔，景秀境幽，峰上种满了松树，随着微风拂过，传来阵阵滔声。]],
  exit = {
    sd = { to = '嵩山少林山路#2', },
    n = { to = '嵩山少林山路#4', },
  },
},

['嵩山少林石廊'] = {
  id = '嵩山少林石廊',
  area = '嵩山少林',
  name = '石廊',
  desc =  [[一条青石砌成的走廊，周围并无半分饰物，但石色天青，石壁清凉。踏在石面之上，空谷足音，令人暇想不已。清风送爽，传来阵阵幽香，不由使人尘俗皆忘。]],
  exit = {
    nw = { to = '嵩山少林归元谷', },
    e = { to = '嵩山少林心禅堂', },
  },
},

['嵩山少林小屋'] = {
  id = '嵩山少林小屋',
  area = '嵩山少林',
  name = '小屋',
  desc =  [[这是一间很简单大房屋，只有一桌一椅，桌子上面放着几本经书，旁边的一盏油灯散发着昏暗的光亮。椅子上坐着一个老者正在认真的观看经书。]],
  exit = {
    enter = { to = '嵩山少林里屋', },
    n = { to = '嵩山少林小径', },
  },
},

['嵩山少林卧室'] = {
  id = '嵩山少林卧室',
  area = '嵩山少林',
  name = '卧室',
  desc =  [[卧房里只有一张竹制的矮床上面铺了半破烂的篾席。席子上的一角耷拉到地上。席腿边有一把断了的单刀。地上斑斑点点似乎是好多天前留下的血迹。]],
  exit = {
    s = { to = '嵩山少林小土屋', },
  },
},

['嵩山少林僧舍#E'] = {
  id = '嵩山少林僧舍#E',
  area = '嵩山少林',
  name = '僧舍',
  desc =  [[这里是僧舍待客的地方，靠墙左右两侧摆着一溜太师椅。墙角一几，放着几个茶壶。有个茶壶壶身上题了“碧螺春”三个篆字，壶嘴热气腾腾，似乎是刚沏的新茶。一位小沙弥在一边垂手站立。]],
  exit = {
    s = { to = '嵩山少林僧舍#ES', },
    w = { to = '嵩山少林侧廊#E', },
    n = { to = '嵩山少林僧舍#EN', },
  },
},

['嵩山少林佛塔三层'] = {
  id = '嵩山少林佛塔三层',
  area = '嵩山少林',
  name = '佛塔三层',
  desc =  [[你进到佛塔里面，四周阴暗，寂静无声，隐约看到正中有一尊积满灰尘，蛛网密布的佛龛。忽然一阵冷风不知从哪吹了过来，你不禁打了个寒蝉。]],
  exit = {
    d = { to = '嵩山少林圣僧塔', },
  },
},

['嵩山少林方丈室'] = {
  id = '嵩山少林方丈室',
  area = '嵩山少林',
  name = '方丈室',
  desc =  [[方丈室陈设简洁，正中一几，一蒲团，一矮床。北面墙上写着大大的一个『禅』字。一位慈眉善目的灰衣老僧正端坐于蒲团上打坐。]],
  exit = {
    s = { to = '嵩山少林茶室', },
  },
},

['嵩山少林粥室'] = {
  id = '嵩山少林粥室',
  area = '嵩山少林',
  name = '粥室',
  desc =  [[一间不大的小屋，正中摆着一口大铁锅，正冒着腾腾的热气，一股粥香弥漫在室内。几个火工正在忙着加柴，煽火，全寺弟子做完早课都要喝粥。一位侍粥僧挥舞着沉重的大铁勺，正在吃力的搅动着粥汤。]],
  exit = {
    s = { to = '嵩山少林斋堂', },
  },
},

['嵩山少林林中小路#4E'] = {
  id = '嵩山少林林中小路#4E',
  area = '嵩山少林',
  name = '林中小路',
  desc =  [[这是一片密密的竹林。这里人迹罕至，惟闻足底叩击路面，有僧敲木鱼声；微风吹拂竹叶，又如簌簌禅唱。令人尘心为之一涤，真是绝佳的禅修所在。]],
  exit = {
    nw = { to = '嵩山少林林中小路#3E', },
    e = { to = '嵩山少林小溪', },
  },
},

['嵩山少林大雄宝殿'] = {
  id = '嵩山少林大雄宝殿',
  area = '嵩山少林',
  name = '大雄宝殿',
  desc =  [[这里是少林寺的大雄宝殿。面阔五间，进深四间。正中供奉着如来三宝，左右各是文殊、普贤诸位菩萨。一群僧侣正自焚香诵经，仰观我佛拈花微笑的神态，令人顿感肃然起敬。这里殿堂宽大，亦是方丈大师召集阖寺群僧议事之所。]],
  exit = {
    s = { to = '嵩山少林平台', },
    n = { to = '嵩山少林石板路#N', },
  },
},

['嵩山少林心禅堂'] = {
  id = '嵩山少林心禅堂',
  area = '嵩山少林',
  name = '心禅堂',
  desc =  [[一座宽敞的禅室，并非用土木建成，而是依山而建，四壁如仞，都是石壁。如此山间石室，若非浑然天成，定是有前辈高僧，以禅心智慧，绝大佛力开山而致了。室内烛火通明，终年不息，正中供奉着我佛的法像，与大殿不同的是做千手如来收万宝势。职事僧在殿内四处巡视，以备所需。一位老僧瞑目跌坐，内视参禅。]],
  exit = {
    s = { to = '嵩山少林心禅坪', },
    w = { to = '嵩山少林石廊', },
    n = { to = '嵩山少林断崖坪', },
  },
},

['嵩山少林东侧廊#1'] = {
  id = '嵩山少林东侧廊#1',
  area = '嵩山少林',
  name = '东侧廊',
  desc =  [[这里是天王殿旁的侧廊。彩梁画栋，连顶棚也用彩漆绘满了各种飞天的图形，每幅画似乎都在诉说一个娓娓动人的佛经故事。由此向东通向钟楼。南面是一片广场。]],
  exit = {
    e = { to = '嵩山少林钟楼小院', },
    s = { to = '嵩山少林广场东侧', },
    n = { to = '嵩山少林东侧廊#2', },
  },
},

['嵩山少林鼓楼五层'] = {
  id = '嵩山少林鼓楼五层',
  area = '嵩山少林',
  name = '鼓楼五层',
  desc =  [[一眼望去，只见蓝天白云，青山列列，令人将尘俗之气，顿为一一扫。南至前三殿，北到戒台，整个少林寺尽在眼底。北面竹林随风起伏，犹如一片竹海。东西面围绕全寺的是密密匝匝的松林，一眼往不到边。]],
  exit = {
    u = { to = '嵩山少林鼓楼六层', },
    d = { to = '嵩山少林鼓楼四层', },
  },
},

['嵩山少林石板路#2N'] = {
  id = '嵩山少林石板路#2N',
  area = '嵩山少林',
  name = '石板路',
  desc =  [[一条青石铺成的小路向西，北，东三个方向蜿蜒而去。石路上绝无半点尘土，看来经常有人来打扫。路的两旁满是翠绿的青竹，在微风中左右摇曳，沙沙做响。东面似乎有轻微的水流声传到你的耳中。]],
  exit = {
    e = { to = '嵩山少林林中小路#1E', },
    s = { to = '嵩山少林立雪亭', },
    w = { to = '嵩山少林林中小路#1W', },
    n = { to = '嵩山少林石板路#3N', },
  },
},

['嵩山少林僧舍#W'] = {
  id = '嵩山少林僧舍#W',
  area = '嵩山少林',
  name = '僧舍',
  desc =  [[这里是僧舍中待客的地方，靠墙左右两侧摆着一溜太师椅。墙角一几，放着几个茶壶。有个茶壶壶身上题了“碧螺春”三个篆字，壶嘴热气腾腾，似乎是刚沏的新茶。]],
  exit = {
    e = { to = '嵩山少林侧廊#W', },
    s = { to = '嵩山少林僧舍#WS', },
    n = { to = '嵩山少林僧舍#WN', },
  },
},

['嵩山少林般若堂九部'] = {
  id = '嵩山少林般若堂九部',
  area = '嵩山少林',
  name = '般若堂九部',
  desc =  [[这是一间极为简陋的禅房。环视四周，除了几幅佛竭外，室内空荡荡地别无他物。地上整齐的摆放着几个破烂且发黑的黄布蒲团，几位须发花白的老僧正在坐在上面闭目入定。这里是本寺十八罗汉参禅修行的地方，不少绝世武功便是在此悟出。]],
  exit = {
    s = { to = '嵩山少林般若堂八部', },
  },
},

['嵩山少林般若堂六部'] = {
  id = '嵩山少林般若堂六部',
  area = '嵩山少林',
  name = '般若堂六部',
  desc =  [[这是一间极为简陋的禅房。环视四周，除了几幅佛竭外，室内空荡荡地别无他物。地上整齐的摆放着几个破烂且发黑的黄布蒲团，几位须发花白的老僧正在坐在上面闭目入定。这里是本寺十八罗汉参禅修行的地方，不少绝世武功便是在此悟出。]],
  exit = {
    s = { to = '嵩山少林般若堂五部', },
    n = { to = '嵩山少林般若堂七部', },
  },
},

['嵩山少林练武场#W-N'] = {
  id = '嵩山少林练武场#W-N',
  area = '嵩山少林',
  name = '练武场',
  desc =  [[这里是少林寺的练武场。由无数块巨大的花岗岩石板铺就。上千年的踩踏已使得这些石板如同镜子般平整光滑。十来个僧人正在练习武技。东南西三面各有一练武场。]],
  exit = {
    e = { to = '嵩山少林练武场#W-NE', },
    w = { to = '嵩山少林练武场#W-NW', },
    s = { to = '嵩山少林中心武场#W', },
  },
},

['嵩山少林田埂边'] = {
  id = '嵩山少林田埂边',
  area = '嵩山少林',
  name = '田埂边',
  desc =  [[转过山坡只见几棵果实累累的大枣树孤零零地栽在田埂边，上面挂满了红熟的枣子，使人忍不住想摘下几颗尝尝。田里种着半熟的青稞麦。西首有三间简陋的土屋。]],
  exit = {
    w = { to = '嵩山少林小院', },
    sd = { to = '嵩山少林山坡', },
  },
},

['嵩山少林武僧堂#4'] = {
  id = '嵩山少林武僧堂#4',
  area = '嵩山少林',
  name = '武僧堂',
  desc =  [[这是少林寺护寺武僧练武及居住之所，室内光线明亮，不时听到呼喝练功之声。一个身强体壮的武僧正自苦练少林武学之秘奥。]],
  exit = {
    s = { to = '嵩山少林武僧堂#5', },
    n = { to = '嵩山少林武僧堂#3', },
  },
},

['嵩山少林汝州城'] = {
  id = '嵩山少林汝州城',
  area = '嵩山少林',
  name = '汝州城',
  desc =  [[汝州城是本府的大城，立来是兵家必争之地。故州治在此驻扎重兵，盘查南来北往的行人，并负责翦灭附近山上的草寇。城内一队队官兵来来去去，一派森严气象。再折向西，就是五岳之一的嵩山。]],
  exit = {
    w = { to = '嵩山少林石阶#1', },
    s = { to = '南阳城大驿道', },
  },
},

['嵩山少林鼓楼三层'] = {
  id = '嵩山少林鼓楼三层',
  area = '嵩山少林',
  name = '鼓楼三层',
  desc =  [[塔身往上似乎越来越窄，楼梯也渐为挤仄。扶手上不少朽坏处续接了新木，漆色也是新旧不同。从窗孔往外望，往北可以看到竹林中的藏经楼和方丈楼露出飞檐一角，往东则是前殿的屋顶，屋脊上塑了个大大的“佛”字。]],
  exit = {
    u = { to = '嵩山少林鼓楼四层', },
    d = { to = '嵩山少林鼓楼二层', },
  },
},

['嵩山少林山路#4'] = {
  id = '嵩山少林山路#4',
  area = '嵩山少林',
  name = '山路',
  desc =  [[这是少室山五乳峰下的一条小路，路旁长满的青草。黄土铺就的小路看起来很齐整，似乎有人经常打扫。不远处就是五乳峰，山势挺拔，景秀境幽，峰上种满了松树，随着微风拂过，传来阵阵滔声。北面是初祖庵，南面可至少林寺。]],
  exit = {
    s = { to = '嵩山少林山路#3', },
    n = { to = '嵩山少林初祖庵', },
  },
},

['嵩山少林佛塔一层'] = {
  id = '嵩山少林佛塔一层',
  area = '嵩山少林',
  name = '佛塔一层',
  desc =  [[你进到佛塔里面，四周阴暗，寂静无声，隐约看到正中有一尊积满灰尘，蛛网密布的佛龛。忽然一阵冷风不知从哪吹了过来，你不禁打了个寒蝉。]],
  exit = {
    u = { to = '嵩山少林圣僧塔', },
    out = { to = '嵩山少林古佛舍利塔', },
  },
},

['嵩山少林武僧堂#5'] = {
  id = '嵩山少林武僧堂#5',
  area = '嵩山少林',
  name = '武僧堂',
  desc =  [[这是少林寺护寺武僧练武及居住之所，室内光线明亮，不时听到呼喝练功之声。一个身强体壮的武僧正自苦练少林武学之秘奥。]],
  exit = {
    s = { to = '嵩山少林武僧堂#6', },
    n = { to = '嵩山少林武僧堂#4', },
  },
},

['嵩山少林罗汉堂四部'] = {
  id = '嵩山少林罗汉堂四部',
  area = '嵩山少林',
  name = '罗汉堂四部',
  desc =  [[这是一间极为简陋的禅房。环视四周，除了几幅佛竭外，室内空荡荡地别无他物。地上整齐的摆放着几个破烂且发黑的黄布蒲团，几位须发花白的老僧正在坐在上面闭目入定。这里是本寺十八罗汉参禅修行的地方，不少绝世武功便是在此悟出。]],
  exit = {
    s = { to = '嵩山少林罗汉堂三部', },
    n = { to = '嵩山少林罗汉堂五部', },
  },
},

['嵩山少林罗汉堂八部'] = {
  id = '嵩山少林罗汉堂八部',
  area = '嵩山少林',
  name = '罗汉堂八部',
  desc =  [[这是一间极为简陋的禅房。环视四周，除了几幅佛竭外，室内空荡荡地别无他物。地上整齐的摆放着几个破烂且发黑的黄布蒲团，几位须发花白的老僧正在坐在上面闭目入定。这里是本寺十八罗汉参禅修行的地方，不少绝世武功便是在此悟出。]],
  exit = {
    s = { to = '嵩山少林罗汉堂七部', },
    n = { to = '嵩山少林罗汉堂九部', },
  },
},

['嵩山少林罗汉堂三部'] = {
  id = '嵩山少林罗汉堂三部',
  area = '嵩山少林',
  name = '罗汉堂三部',
  desc =  [[这是一间极为简陋的禅房。环视四周，除了几幅佛竭外，室内空荡荡地别无他物。地上整齐的摆放着几个破烂且发黑的黄布蒲团，几位须发花白的老僧正在坐在上面闭目入定。这里是本寺十八罗汉参禅修行的地方，不少绝世武功便是在此悟出。]],
  exit = {
    s = { to = '嵩山少林罗汉堂二部', },
    n = { to = '嵩山少林罗汉堂四部', },
  },
},

['嵩山少林练武场#E-S'] = {
  id = '嵩山少林练武场#E-S',
  area = '嵩山少林',
  name = '练武场',
  desc =  [[这里是少林寺的练武场。由无数块巨大的花岗岩石板铺就。上千年的踩踏已使得这些石板如同镜子般平整光滑。十来个僧人正在练习武技。东西北三面各有一练武场。]],
  exit = {
    e = { to = '嵩山少林练武场#E-SE', },
    w = { to = '嵩山少林练武场#E-SW', },
    n = { to = '嵩山少林中心武场#E', },
  },
},

['嵩山少林般若堂三部'] = {
  id = '嵩山少林般若堂三部',
  area = '嵩山少林',
  name = '般若堂三部',
  desc =  [[这是一间极为简陋的禅房。环视四周，除了几幅佛竭外，室内空荡荡地别无他物。地上整齐的摆放着几个破烂且发黑的黄布蒲团，几位须发花白的老僧正在坐在上面闭目入定。这里是本寺十八罗汉参禅修行的地方，不少绝世武功便是在此悟出。]],
  exit = {
    s = { to = '嵩山少林般若堂二部', },
    n = { to = '嵩山少林般若堂四部', },
  },
},

['嵩山少林西侧殿'] = {
  id = '嵩山少林西侧殿',
  area = '嵩山少林',
  name = '西侧殿',
  desc =  [[这里是西侧殿。房间四周悬挂着达摩祖师、观音大士的画像，以及一些寺内元老的字画。地下散乱地放着许多蒲团，木鱼等。看来此处是本派弟子打坐修行之所。几位年轻僧人正肃容入定，看来已颇得禅宗三昧。]],
  exit = {
    e = { to = '嵩山少林广场西侧', },
  },
},

['嵩山少林林中小路#1E'] = {
  id = '嵩山少林林中小路#1E',
  area = '嵩山少林',
  name = '林中小路',
  desc =  [[这是一片密密的竹林。这里人迹罕至，惟闻足底叩击路面，有僧敲木鱼声；微风吹拂竹叶，又如簌簌禅唱。令人尘心为之一涤，真是绝佳的禅修所在。]],
  exit = {
    w = { to = '嵩山少林石板路#2N', },
    e = { to = '嵩山少林林中小路#2E', },
  },
},

['嵩山少林般若堂四部'] = {
  id = '嵩山少林般若堂四部',
  area = '嵩山少林',
  name = '般若堂四部',
  desc =  [[这是一间极为简陋的禅房。环视四周，除了几幅佛竭外，室内空荡荡地别无他物。地上整齐的摆放着几个破烂且发黑的黄布蒲团，几位须发花白的老僧正在坐在上面闭目入定。这里是本寺十八罗汉参禅修行的地方，不少绝世武功便是在此悟出。]],
  exit = {
    s = { to = '嵩山少林般若堂三部', },
    n = { to = '嵩山少林般若堂五部', },
  },
},

['嵩山少林西侧廊#1'] = {
  id = '嵩山少林西侧廊#1',
  area = '嵩山少林',
  name = '西侧廊',
  desc =  [[这里是天王殿旁的侧廊。彩梁画栋，连顶棚也用彩漆绘满了各种飞天的图形，每幅画似乎都在诉说一个娓娓动人的佛经故事。由此向西通向鼓楼。南面是一片广场。]],
  exit = {
    s = { to = '嵩山少林广场西侧', },
    w = { to = '嵩山少林鼓楼小院', },
    n = { to = '嵩山少林西侧廊#2', },
  },
},

['嵩山少林香炉'] = {
  id = '嵩山少林香炉',
  area = '嵩山少林',
  name = '香炉',
  desc =  [[走过石板路就到了寺内最大的香炉旁，此香炉由青铜铸就，有两人多高炉鼎上精工镂刻了多种瑞兽及代表祥和超脱的佛家典故。炉内青烟袅袅端的是佛家无上之宝。炉前香案前，几位香客正自顶礼膜拜。]],
  exit = {
    s = { to = '嵩山少林石板路#S', },
    n = { to = '嵩山少林石板路#C', },
  },
},

['嵩山少林石阶#7'] = {
  id = '嵩山少林石阶#7',
  area = '嵩山少林',
  name = '石阶',
  desc =  [[石级继续向上延伸，瀑布在脚下越来越小，水声也渐行远去几位身着灰黄色僧衣的僧人擦肩而过，看他们下山的时後脚步沉稳，好象是个会家子。往上远眺，似乎可以看到石檐一角。]],
  exit = {
    ed = { to = '嵩山少林石阶#6', },
    wu = { to = '嵩山少林石阶#8', },
  },
},

['嵩山少林槐树林#W'] = {
  id = '嵩山少林槐树林#W',
  area = '嵩山少林',
  name = '槐树林',
  desc =  [[眼前一暗你走进一片槐树林，枝头鸟语轻鸣，荫下清风荡漾。好一个清净禅修之所在。林中一 条小径曲折伸向前方。]],
  exit = {
    w = { to = '嵩山少林菩提院', },
    e = { to = '嵩山少林槐树林#S', },
  },
},

['嵩山少林石阶#3'] = {
  id = '嵩山少林石阶#3',
  area = '嵩山少林',
  name = '石阶',
  desc =  [[石级到这里似乎变得宽阔了些。清新的山风扑面而来，令人精神顿为一爽。远处传来淙淙水声，渐行渐远。山壁上挂满了厚密的藤萝，随风轻轻摇弋。]],
  exit = {
    nu = { to = '嵩山少林石阶#4', },
    ed = { to = '嵩山少林石阶#2', },
  },
},

['嵩山少林东侧殿'] = {
  id = '嵩山少林东侧殿',
  area = '嵩山少林',
  name = '东侧殿',
  desc =  [[这里是东侧殿。房间四周悬挂着达摩祖师、观音大士的画像，以及一些寺内元老的字画。地下散乱地放着许多蒲团，木鱼等。看来此处是本派弟子打坐修行之所。几位年轻僧人正肃容入定，看来已颇得禅宗三昧。]],
  exit = {
    w = { to = '嵩山少林广场东侧', },
  },
},

['嵩山少林钟楼四层'] = {
  id = '嵩山少林钟楼四层',
  area = '嵩山少林',
  name = '钟楼四层',
  desc =  [[到这里楼梯大概只能容一人上下，墙身也略薄了些。视线越过窗棂，北边的练武场，罗汉堂，般若堂历历在目，不少僧人正汇集在练武场上习武，吆喝声一阵阵传进耳鼓。西边的天王殿，山门殿也尽露全貌。]],
  exit = {
    u = { to = '嵩山少林钟楼五层', },
    d = { to = '嵩山少林钟楼三层', },
  },
},

['嵩山少林松树林#S'] = {
  id = '嵩山少林松树林#S',
  area = '嵩山少林',
  name = '松树林',
  desc =  [[这是一片松树林。高高的大松树簇在一块，密实的枝叶象一蓬蓬巨伞般伸向天空，把阳光遮得丝毫也无。一条洁净的青石小径蜿蜒林中。]],
  exit = {
    e = { to = '嵩山少林松树林#E', },
    sw = { to = '嵩山少林侧廊#E', },
    n = { to = '嵩山少林松树林#C', },
  },
},

['嵩山少林僧舍#WN'] = {
  id = '嵩山少林僧舍#WN',
  area = '嵩山少林',
  name = '僧舍',
  desc =  [[这里是僧众们饮食起居的地方。靠墙一溜摆着几张木床，床上铺的是篾席。床头叠着床薄被，冬天想必很冷，僧侣们全靠扎实的内功根基御寒。地上整齐的放着几个蒲团和木鱼。]],
	use_cond = 'player.party == "少林派"',
  exit = {
    s = { to = '嵩山少林僧舍#W', },
  },
},

['嵩山少林龙树院'] = {
  id = '嵩山少林龙树院',
  area = '嵩山少林',
  name = '龙树院',
  desc =  [[这是一处偏僻的小院，院中栽着两株高大的槐树，显得极是宁静幽深。这里是少林武僧们领取武器和防具之地，汇集了天下各派惯用的各类兵刃。少林武技天下驰名，为防止练功受伤，这里也一并供给各类防具。院门口站着两名僧兵，手持戒刀，严密的守护着这里。  ]],
  exit = {
    e = { to = '嵩山少林槐树林#N', },
    s = { to = '嵩山少林防具库', },
    n = { to = '嵩山少林武器库', },
  },
},

['嵩山少林中心武场#E'] = {
  id = '嵩山少林中心武场#E',
  area = '嵩山少林',
  name = '中心武场',
  desc =  [[这里是少林寺的练武场。由无数块巨大的花岗岩石板铺就。上千年的踩踏已使得这些石板如同镜子般平整光滑。武场中央竖立着一个金光闪闪的金人，几位老僧神色庄严，脚踏八卦方位围绕，缓缓发招。]],
  exit = {
    e = { to = '嵩山少林练武场#E-E', },
    s = { to = '嵩山少林练武场#E-S', },
    w = { to = '嵩山少林练武场#E-W', },
    n = { to = '嵩山少林练武场#E-N', },
  },
},

['铁掌山山路#4N'] = {
  id = '铁掌山山路#4N',
  area = '铁掌山',
  name = '山路',
  desc =  [[你走在一条崎岖的山路上，道旁山峰壁立，长草过腰，中间一条羊肠小路，仅容一人勉强过去。前面有一片茂密的松林。路旁的石壁上刻着几个大字(dazi)。]],
  exit = {
    sd = { to = '铁掌山山路#3N', },
    n = { to = '铁掌山松树林#1', },
  },
},

['铁掌山瀑布'] = {
  id = '铁掌山瀑布',
  area = '铁掌山',
  name = '瀑布',
  desc =  [[山路行到这里，忽听远处传来隐隐水声，转过一道山梁，只见一道白龙似的大瀑布从对面双峰之间奔腾而下，空山寂寂，那水声在山谷中激荡回想，声势甚是惊人。]],
  exit = {
    nu = { to = '铁掌山小指峰', },
    ed = { to = '铁掌山石板路#2', },
  },
},

['铁掌山寨沟#2E'] = {
  id = '铁掌山寨沟#2E',
  area = '铁掌山',
  name = '寨沟',
  desc =  [[这是山门二边的寨栏，前面有一条深沟，寨栏是有一排粗木桩用粗麻绳捆起来的，由于很长时间没有江湖门派和官府对铁掌帮的清剿或寻仇，所以寨栏的木头有些已经腐烂了，有些已经松动了。]],
  exit = {
    w = { to = '铁掌山寨沟#1E', },
  },
},

['铁掌山松树林#1'] = {
  id = '铁掌山松树林#1',
  area = '铁掌山',
  name = '松树林',
  desc =  [[你走进一片黑压压的松树林，这里的松树枝繁叶茂，树冠相叠，遮天蔽日。几素阳光从树梢间照射下来，在淡淡的雾气中，形成条条白色的光柱，煞是好看。你走着走着，忽然发现自己已迷失在这片松林中，找不到出去的路了。]],
  exit = {
    e = { to = '铁掌山松树林#M', handler = 'simple_path_set_pos', },
    s = { to = '铁掌山山路#4N', },
    w = { to = '铁掌山松树林#1', },
    n = { to = '铁掌山松树林#1', },
  },
},

['铁掌山松树林#M'] = {
  id = '铁掌山松树林#M',
  area = '铁掌山',
  name = '松树林',
  desc =  [[你走进一片黑压压的松树林，这里的松树枝繁叶茂，树冠相叠，遮天蔽日。几素阳光从树梢间照射下来，在淡淡的雾气中，形成条条白色的光柱，煞是好看。你走着走着，忽然发现自己已迷失在这片松林中，找不到出去的路了。]],
  exit = {
    e = { to = '铁掌山松树林#M', },
    s = { to = '铁掌山松树林#M', },
    w = { to = '铁掌山松树林#M', },
    n = { to = '铁掌山松树林#M', },
    hidden1 = { to = '铁掌山松树林#1', handler = 'simple_path', cost = 3, },
    hidden2 = { to = '铁掌山松树林#2', handler = 'simple_path', cost = 3, },
  },
},

['铁掌山松树林#2'] = {
  id = '铁掌山松树林#2',
  area = '铁掌山',
  name = '松树林',
  desc =  [[你走进一片黑压压的松树林，这里的松树枝繁叶茂，树冠相叠，遮天蔽日。几素阳光从树梢间照射下来，在淡淡的雾气中，形成条条白色的光柱，煞是好看。你走着走着，忽然发现自己已迷失在这片松林中，找不到出去的路了。]],
  exit = {
    e = { to = '铁掌山松树林#2', },
    s = { to = '铁掌山松树林#M', handler = 'simple_path_set_pos', },
    w = { to = '铁掌山松树林#2', },
    n = { to = '铁掌山第二指节', },
  },
},

['铁掌山拇指峰'] = {
  id = '铁掌山拇指峰',
  area = '铁掌山',
  name = '拇指峰',
  desc =  [[    拇指峰是铁掌五峰中最为低矮的一峰，名为峰，实则只是一座较高的石山罢了。峰顶到处是又大又圆的岩石，在日晒雨淋下，被风蚀得十分光滑。在岩石的缝隙中，长出许多松树，其中一棵尤其引人注目。这棵松名为--并蒂松(song)，乃同根而生，于距地一米高处，忽分为二。这两根树干同粗同高，均长得高大挺拔，枝叶茂盛，尤如兄弟一般，因此又名--兄弟松。]],
  exit = {
    sd = { to = '铁掌山碎石路#3', },
  },
},

['铁掌山后厢房'] = {
  id = '铁掌山后厢房',
  area = '铁掌山',
  name = '后厢房',
  desc =  [[这是大厅后面的一个小房间，虽然也是岩石砌成，但布置的非常舒适。四壁用挂毯遮住，不露一点石壁的痕迹。屋内转圈摆放了一些椅子，上面铺着厚厚的软垫，坐上去一定很舒适。这里是帮主处理帮中日常事务的地方。后面通向后花院。]],
  exit = {
    s = { to = '铁掌山五指堂', },
    n = { to = '铁掌山后花园', },
  },
},

['铁掌山中指峰'] = {
  id = '铁掌山中指峰',
  area = '铁掌山',
  name = '中指峰',
  desc =  [[这里就是铁掌山的最高峰--中指峰。由于山势太高，峰顶仍存有大量的积雪，白雪皑皑，在阳光的照射下，泛起一片耀眼的银光。纵目远眺，湘西几百里景色尽收眼底，泸溪，辰溪如两条玉带，从山下缓缓流过。远处那条白色的亮线，就是湘西的大江--沅江。]],
  exit = {
    sd = { to = '铁掌山山路#6N', },
  },
},

['铁掌山走廊#1E'] = {
  id = '铁掌山走廊#1E',
  area = '铁掌山',
  name = '走廊',
  desc =  [[你走在一条走廊上。北面的屋内传来阵阵金属的声音。]],
  exit = {
    e = { to = '铁掌山走廊#2E', },
    w = { to = '铁掌山五指堂', },
    n = { to = '铁掌山兵器室', },
  },
},

['铁掌山女休息室'] = {
  id = '铁掌山女休息室',
  area = '铁掌山',
  name = '女休息室',
  desc =  [[这是一个黑暗的大房间。窗户用厚厚的帘子遮住，不露丝毫光亮。屋内整齐的排列着十几张木板搭成的床铺，可以让练功后的帮众及时得到休息。这里静悄悄的，黑暗中偶尔传来清微的鼾声。屋内淡淡的飘着一股幽幽的香气。]],
  exit = {
    n = { to = '铁掌山走廊#2E', },
  },
},

['铁掌山石阶#1'] = {
  id = '铁掌山石阶#1',
  area = '铁掌山',
  name = '石阶',
  desc =  [[一排石阶盘旋而下，消失在浓浓的黑暗中。石阶上长满的绿色的青苔，滑不留脚。远处黑暗的尽头似乎有点昏黄的光亮。]],
  exit = {
    ed = { to = '铁掌山石阶#2', },
    out = { to = '铁掌山无名峰', },
  },
},

['铁掌山蝴蝶泉'] = {
  id = '铁掌山蝴蝶泉',
  area = '铁掌山',
  name = '蝴蝶泉',
  desc =  [[在向前行，一路上嫣红姹紫，遍山遍野都是鲜花。春光烂漫已极。转过一树花丛，眼前出现一眼泉水，泉水清澈见底，散发出一种沁人心脾的清凉。泉水的旁边，飞舞一群群的蝴蝶，或花或白，或黑或紫，翩翩起舞。蝴蝶并不畏人，飞近时便在人们的身上停留。]],
  exit = {
    nw = { to = '铁掌山瓜架', },
  },
},

['铁掌山寨沟#1E'] = {
  id = '铁掌山寨沟#1E',
  area = '铁掌山',
  name = '寨沟',
  desc =  [[这是山门二边的寨栏，前面有一条深沟，寨栏是有一排粗木桩用粗麻绳捆起来的，由于很长时间没有江湖门派和官府对铁掌帮的清剿或寻仇，所以寨栏的木头有些已经腐烂了，有些已经松动了。]],
  exit = {
    w = { to = '铁掌山山门', },
    e = { to = '铁掌山寨沟#2E', },
  },
},

['铁掌山石室'] = {
  id = '铁掌山石室',
  area = '铁掌山',
  name = '石室',
  desc =  [[这是一间在山腹中凿成的小石屋，中间有一座石桌，桌上摆放着一盏油灯，散发出暗淡昏黄的光亮。屋内一角的地上，铺着很多干草，上面坐着一个人。长发垂下，遮去面容，看不出多大年纪，身上穿着一件又脏又破的黑衣，说不出的诡异神秘。]],
  exit = {
    eu = { to = '铁掌山石阶#3', },
  },
},

['铁掌山走廊#2E'] = {
  id = '铁掌山走廊#2E',
  area = '铁掌山',
  name = '走廊',
  desc =  [[你走在一条走廊上。南面北面都有个黑暗的小屋，还隐隐传来一些酣声。]],
  exit = {
    e = { to = '铁掌山工具房', },
    s = { to = '铁掌山女休息室', cond = 'player.gender == "female"', },
    w = { to = '铁掌山走廊#1E', },
    n = { to = '铁掌山男休息室', cond = 'player.gender ~= "female"', },
  },
},

['铁掌山泸溪'] = {
  id = '铁掌山泸溪',
  area = '铁掌山',
  name = '泸溪',
  desc =  [[这里是湘西的一个小镇。虽然地处偏僻，但这里来往的行人仍然很多。西面是一间供人休息打尖的小客店。西南方四十里处，就是此处有名的猴爪山。]],
  exit = {
    sw = { to = '铁掌山黄土路#1', },
    w = { to = '铁掌山客店', },
    n = { to = '襄阳城泸溪北', },
  },
},

['铁掌山山脚下'] = {
  id = '铁掌山山脚下',
  area = '铁掌山',
  name = '山脚下',
  desc =  [[这里已到了山脚下，此处近看，但见五座山峰峭兀突怒，确似五根手指竖立在半空之中。居中一峰尤见挺拔，笔立指天，耸入云表，下临深涧。山侧生着一片松林，松梢留雪，树身尽皆向南弯曲，想见北风极烈。]],
  exit = {
    nu = { to = '铁掌山山门', },
    se = { to = '铁掌山黄土路#3', },
  },
},

['铁掌山二楼走廊'] = {
  id = '铁掌山二楼走廊',
  area = '铁掌山',
  name = '二楼走廊',
  desc =  [[你正走在客店二楼的走廊上，可以听到从客房里不时地呼呼的打酣声，一阵高过一阵。不时有睡意朦胧的旅客进进出出，到楼下的掌柜处付了钱再上来睡觉。]],
  exit = {
    enter = { to = '铁掌山客房', },
    d = { to = '铁掌山客店', },
  },
},

['铁掌山瓜架'] = {
  id = '铁掌山瓜架',
  area = '铁掌山',
  name = '瓜架',
  desc =  [[转过一个小弯，忽然眼前一绿，面前是一片很大的瓜架。在高大的木架旁，种植着一些蔬菜和瓜类，架子上已爬满了各种植物，从茂密的叶子中，垂下各种已经成熟的果实，丝瓜，苦瓜，葫芦....还有一些叫不出名称的瓜果也缠杂在其中。]],
  exit = {
    w = { to = '铁掌山广场', },
    se = { to = '铁掌山蝴蝶泉', },
  },
},

['铁掌山广场'] = {
  id = '铁掌山广场',
  area = '铁掌山',
  name = '广场',
  desc =  [[山路行到这里，忽然变得开阔，你眼前出现了一片很大的广场。一些铁掌帮的弟子来回穿梭于其间，显得很忙碌。在广场的周围有很多岩石建的房子。正面的这间尤其显得高大雄伟。左面的房子中不时的涌出阵阵热气，其间还加杂着鼓风的声音。]],
  exit = {
    nu = { to = '铁掌山五指堂', },
    w = { to = '铁掌山练功房', },
    s = { to = '铁掌山山路#1S', },
    e = { to = '铁掌山瓜架', },
  },
},

['铁掌山山路#1N'] = {
  id = '铁掌山山路#1N',
  area = '铁掌山',
  name = '山路',
  desc =  [[你走在一条崎岖的山路上，道旁山峰壁立，长草过腰，中间一条羊肠小路，仅容一人勉强过去。]],
  exit = {
    nu = { to = '铁掌山山路#2N', },
    s = { to = '铁掌山后花园', },
  },
},

['铁掌山山路#2N'] = {
  id = '铁掌山山路#2N',
  area = '铁掌山',
  name = '山路',
  desc =  [[你走在一条崎岖的山路上，道旁山峰壁立，长草过腰，中间一条羊肠小路，仅容一人勉强过去。]],
  exit = {
    nu = { to = '铁掌山山间平台', },
    sd = { to = '铁掌山山路#1N', },
  },
},

['铁掌山天然洞穴'] = {
  id = '铁掌山天然洞穴',
  area = '铁掌山',
  name = '天然洞穴',
  desc =  [[这石洞系天然生成，较之外面人工开凿的石室大了十来倍。放眼望去，洞内共有十余具骸骨，或做或卧，神态各有不同，有的骸骨散开在地，有的却仍具完好人形，更有些骨坛灵位之属。每具骸骨之旁都放着兵刃，暗器，用具，珍宝等物。洞口处立着一座石碑(bei)。]],
  exit = {
    out = { to = '铁掌山山洞#3', },
    enter = { to = '铁掌山石阶#1C', door = 'move bei', cond = 'player.str >= 30 and player.master == "上官剑南"', handler = 'tz_baowu', },
  },
},

['铁掌山石阶#1C'] = {
  id = '铁掌山石阶#1C',
  area = '铁掌山',
  name = '石阶',
  desc =  [[一排石阶笔直而下，消失在浓浓的黑暗中。石阶上长满的绿色的青苔，滑不留脚。你用足目力，还是看不清远处的情景。]],
  exit = {
    wd = { to = '铁掌山石阶#2C', },
    out = { to = '铁掌山天然洞穴', },
  },
},

['铁掌山石阶#2C'] = {
  id = '铁掌山石阶#2C',
  area = '铁掌山',
  name = '石阶',
  desc =  [[石阶到了这里就没有了，突然四周一片光明，周围石壁上的火把燃烧起来，你看到面前二扇铜皮包着的大门(gate)紧闭着。?]],
  exit = {
    hidden = { to = '铁掌山大石室', cmd = 'tui gate', },
    eu = { to = '铁掌山石阶#1C', },
  },
},

['铁掌山大石室'] = {
  id = '铁掌山大石室',
  area = '铁掌山',
  name = '大石室',
  desc =  [[四周石壁上火把在燃烧着，墙角四周放满了大铁箱，打开一看，都是珠宝黄金。中间架子上供着二件宝兵器，其一宛如一条金龙盘旋着，其二宛如一片火红的云朵飘浮在空中。]],
  exit = {
    out = { to = '铁掌山石阶#2C', },
  },
},

['铁掌山工具房'] = {
  id = '铁掌山工具房',
  area = '铁掌山',
  name = '工具房',
  desc =  [[这是一间工具房，房内显得有些破旧，墙的四角堆满了杂物，墙的一边放着个工具架，工具架上放着各种工具，有些已经有些生锈了。房内弥漫着一股难闻的气味，使你不仅微微皱了皱眉头。]],
  exit = {
    w = { to = '铁掌山走廊#2E', },
  },
},

['铁掌山荒草路#1'] = {
  id = '铁掌山荒草路#1',
  area = '铁掌山',
  name = '荒草路',
  desc =  [[你走一条荒芜的小路上，两旁荒草齐膝，荆棘遍地，似乎罕有人至。山石壁立，遮天蔽日，鸟兽全无，四周笼罩在一片阴暗之中，使这里看起来格外深隧幽静。]],
  exit = {
    nu = { to = '铁掌山荒草路#2', },
    se = { to = '铁掌山山间平台', },
  },
},

['铁掌山山谷#1'] = {
  id = '铁掌山山谷#1',
  area = '铁掌山',
  name = '山谷',
  desc =  [[你走在一条狭窄的山谷之中，两旁山峰壁立，直插云霄。鸟鸣猿啼之声，回荡在寂静的空谷之中。]],
  exit = {
    ne = { to = '铁掌山山谷#2', },
    sw = { to = '铁掌山山间平台', },
  },
},

['铁掌山荒草路#3'] = {
  id = '铁掌山荒草路#3',
  area = '铁掌山',
  name = '荒草路',
  desc =  [[你走一条荒芜的小路上，两旁荒草齐膝，荆棘遍地，似乎罕有人至。山石壁立，遮天蔽日，鸟兽全无，四周笼罩在一片阴暗之中，使这里看起来格外深隧幽静。]],
  exit = {
    nu = { to = '铁掌山荒草路#4', },
    se = { to = '铁掌山荒草路#2', },
  },
},

['铁掌山兵器室'] = {
  id = '铁掌山兵器室',
  area = '铁掌山',
  name = '兵器室',
  desc =  [[铁掌帮虽是以掌法、轻功著称，但帮中仍存有大量的兵器。以供武功不够的帮众使用。屋内两侧排列的都是兵器架，上面刀、枪、剑、戟、斧、钺、钩、叉应有尽有。]],
  exit = {
    s = { to = '铁掌山走廊#1E', },
  },
},

['铁掌山客店'] = {
  id = '铁掌山客店',
  area = '铁掌山',
  name = '客店',
  desc =  [[这是一家价钱低廉的客栈，生意非常兴隆。外地游客多选择这里落脚，你可以在这里打听到各地的风土人情。店小二里里外外忙得团团转，接待着南腔北调的客人。]],
  exit = {
    u = { to = '铁掌山二楼走廊', },
    e = { to = '铁掌山泸溪', },
  },
},

['铁掌山山谷#2'] = {
  id = '铁掌山山谷#2',
  area = '铁掌山',
  name = '山谷',
  desc =  [[你走在一条狭窄的山谷之中，两旁山峰壁立，直插云霄。鸟鸣猿啼之声，回荡在寂静的空谷之中。]],
  exit = {
    ne = { to = '铁掌山绝壁#1', },
    sw = { to = '铁掌山山谷#1', },
  },
},

['铁掌山石板路#2'] = {
  id = '铁掌山石板路#2',
  area = '铁掌山',
  name = '石板路',
  desc =  [[你走在一条石板铺成的小路上，两旁是高大的垂柳，虽在骄阳似火的夏日，依旧凉爽怡人。因为小指峰风光秀美，游人较多，因此这里的路也修砌的很好。]],
  exit = {
    ed = { to = '铁掌山石板路#1', },
    wu = { to = '铁掌山瀑布', },
  },
},

['铁掌山练功房'] = {
  id = '铁掌山练功房',
  area = '铁掌山',
  name = '练功房',
  desc =  [[这是一间用花岗岩砌成的石屋。室内一个大炉中燃了木炭，煮着热气腾腾的一镬东西，镬旁有两个黑衣小童，一个在使劲地推拉着风箱，另一个在用铁铲翻炒镬中之物，听这沙沙之声，所炒的似是铁沙。几名帮中弟子闭目盘膝坐在锅前，或对着腾上的热气吐呐，或插指于镬中苦练。]],
  exit = {
    e = { to = '铁掌山广场', },
  },
},

['铁掌山寨沟#2W'] = {
  id = '铁掌山寨沟#2W',
  area = '铁掌山',
  name = '寨沟',
  desc =  [[这是山门二边的寨栏，前面有一条深沟，寨栏是有一排粗木桩用粗麻绳捆起来的，由于很长时间没有江湖门派和官府对铁掌帮的清剿或寻仇，所以寨栏的木头有些已经腐烂了，有些已经松动了。]],
  exit = {
    e = { to = '铁掌山寨沟#1W', },
  },
},

['铁掌山假山'] = {
  id = '铁掌山假山',
  area = '铁掌山',
  name = '假山',
  desc =  [[你面前矗立着一座巨大的假山，一道片练也似的银瀑从假山边泻将下来，注入前面的一座大池塘中，池塘底下想是另有泻水通道，是以塘水却不见满溢。铁掌帮为建这个花园，也不知花费了多少人力、物力。瀑布的后面似乎隐约有个小门。]],
  exit = {
    e = { to = '铁掌山后花园', },
    hidden = { to = '铁掌山密室', cmd = 'jump 瀑布', cond = 'player.skill["基本轻功"] and player.skill["基本轻功"].level > 30', },
  },
},

['铁掌山密室'] = {
  id = '铁掌山密室',
  area = '铁掌山',
  name = '密室',
  desc = [[这是瀑布后面的一间密室，地下尘土堆积，显是长时间无人到来，正中孤零零的摆着一张石几(table)，几上有一只两尺见方的石盒(he)，盒口贴了封条，此外再无别物。]],
  exit = {
    out = { to = '铁掌山假山', },
  },
},

['铁掌山寨沟#1W'] = {
  id = '铁掌山寨沟#1W',
  area = '铁掌山',
  name = '寨沟',
  desc =  [[这是山门二边的寨栏，前面有一条深沟，寨栏是有一排粗木桩用粗麻绳捆起来的，由于很长时间没有江湖门派和官府对铁掌帮的清剿或寻仇，所以寨栏的木头有些已经腐烂了，有些已经松动了。]],
  exit = {
    w = { to = '铁掌山寨沟#2W', },
    e = { to = '铁掌山山门', },
  },
},

['铁掌山荒草路#2'] = {
  id = '铁掌山荒草路#2',
  area = '铁掌山',
  name = '荒草路',
  desc =  [[你走一条荒芜的小路上，两旁荒草齐膝，荆棘遍地，似乎罕有人至。山石壁立，遮天蔽日，鸟兽全无，四周笼罩在一片阴暗之中，使这里看起来格外深隧幽静。]],
  exit = {
    nw = { to = '铁掌山荒草路#3', },
    sd = { to = '铁掌山荒草路#1', },
  },
},

['铁掌山山洞#1'] = {
  id = '铁掌山山洞#1',
  area = '铁掌山',
  name = '山洞',
  desc =  [[一个黑漆漆的山洞，黑沉沉的一眼望不到底。两侧的石壁上生满的苔藓，摸起来又湿又滑。这石洞似乎是人工开凿的，从四周的石壁上仍能看出斧凿的痕迹。你站在这里，一股恐惧由然而生，似乎身体随时都会被这片黑暗吞噬掉。]],
  exit = {
    enter = { to = '铁掌山山洞#2', },
    out = { to = '铁掌山第二指节', },
  },
},

['铁掌山山路#6N'] = {
  id = '铁掌山山路#6N',
  area = '铁掌山',
  name = '山路',
  desc =  [[你走在一条崎岖的山路上，道旁山峰壁立，长草过腰，中间一条羊肠小路，仅容一人勉强过去。]],
  exit = {
    nu = { to = '铁掌山中指峰', },
    sd = { to = '铁掌山山路#5N', },
  },
},

['铁掌山无名峰'] = {
  id = '铁掌山无名峰',
  area = '铁掌山',
  name = '无名峰',
  desc =  [[跨过路上的荆棘和荒草，你终于登上了无名峰的峰顶。由于这里地处五峰之中，四周有其它山峰阻挡，因此风势很小，常年笼罩在一片云雾之中。峰顶长满了齐腰的荒草，怪石嶙峋，一片荒凉景色。在峰顶的正中，赫然矗立着一座岩石砌就的坟墓，坟墓的前面立着一块一人多高的花岗岩的墓碑(bei)。]],
  exit = {
    sd = { to = '铁掌山荒草路#6', },
    enter = { to = '铁掌山石阶#1', door = 'move bei', cond = 'player.str >= 30', handler = 'tz_cave', },
  },
},

['铁掌山石阶#3'] = {
  id = '铁掌山石阶#3',
  area = '铁掌山',
  name = '石阶',
  desc =  [[一排石阶盘旋而下，消失在浓浓的黑暗中。石阶上长满的绿色的青苔，滑不留脚。远处黑暗的尽头似乎有点昏黄的光亮。]],
  exit = {
    wd = { to = '铁掌山石室', },
    su = { to = '铁掌山石阶#2', },
  },
},

['铁掌山客房'] = {
  id = '铁掌山客房',
  area = '铁掌山',
  name = '客房',
  desc =  [[这是一间很大的客房，陈设十分简陋。靠墙放了十几张小木床，不少客人正和衣而卧，满屋子都是呼呼的打酣声。西边有张床是空的，你蹑手蹑脚地走了过去。]],
  exit = {
    out = { to = '铁掌山二楼走廊', },
  },
},

['铁掌山花圃'] = {
  id = '铁掌山花圃',
  area = '铁掌山',
  name = '花圃',
  desc =  [[只见这里摆满了茉莉、素馨、麝香藤、朱槿、玉桂、红蕉，都是夏日盛开的香花。院墙上又挂了枷木兰、真腊龙诞等香珠，但觉馨意袭人，清芬满园。园中桌上放着几盆新藕、甜瓜、枇杷、等鲜果，椅子上丢着一把蒲扇，看来是帮主休息的地方。]],
  exit = {
    w = { to = '铁掌山后花园', },
  },
},

['铁掌山山洞#3'] = {
  id = '铁掌山山洞#3',
  area = '铁掌山',
  name = '山洞',
  desc =  [[一个黑漆漆的山洞，黑沉沉的一眼望不到底。两侧的石壁上生满的苔藓，摸起来又湿又滑。这石洞似乎是人工开凿的，从四周的石壁上仍能看出斧凿的痕迹。你站在这里，一股恐惧由然而生，似乎身体随时都会被这片黑暗吞噬掉。]],
  exit = {
    enter = { to = '铁掌山天然洞穴', },
    out = { to = '铁掌山山洞#2', },
  },
},

['铁掌山荒草路#6'] = {
  id = '铁掌山荒草路#6',
  area = '铁掌山',
  name = '荒草路',
  desc =  [[你走一条荒芜的小路上，两旁荒草齐膝，荆棘遍地，似乎罕有人至。山石壁立，遮天蔽日，鸟兽全无，四周笼罩在一片阴暗之中，使这里看起来格外深隧幽静。]],
  exit = {
    nu = { to = '铁掌山无名峰', },
    se = { to = '铁掌山荒草路#5', },
  },
},

['铁掌山黄土路#1'] = {
  id = '铁掌山黄土路#1',
  area = '铁掌山',
  name = '黄土路',
  desc =  [[你走在一条尘土飞扬的黄土路上，两旁是阴森森的树林。这里是川湘交界，据说经常有土匪出没，不可久留。]],
  exit = {
    ne = { to = '铁掌山泸溪', },
    sw = { to = '铁掌山黄土路#2', },
  },
},

['铁掌山碎石路#2'] = {
  id = '铁掌山碎石路#2',
  area = '铁掌山',
  name = '碎石路',
  desc =  [[你走在一条用碎石铺成的小路上。两旁山势低缓，长满了翠绿的毛竹，阵阵微风吹过，耳旁便响起一片沙沙声。]],
  exit = {
    wd = { to = '铁掌山碎石路#1', },
    eu = { to = '铁掌山碎石路#3', },
  },
},

['铁掌山山门'] = {
  id = '铁掌山山门',
  area = '铁掌山',
  name = '山门',
  desc =  [[这里就是江湖上闻风丧胆的“铁掌帮”。自从“铁掌歼衡山”一役将衡山派打得一蹶不振之后，帮主铁掌水上漂的名头威震江湖。这里是进山的必经之路，曲的小路通向山里。路的一侧立着一块牌子(paizi)。两旁的树林内不时传出一些响声，似乎有人在暗中监视。]],
  exit = {
    nu = { to = '铁掌山山路#2S', },
    w = { to = '铁掌山寨沟#1W', },
    sd = { to = '铁掌山山脚下', },
    e = { to = '铁掌山寨沟#1E', },
  },
},

['铁掌山后花园'] = {
  id = '铁掌山后花园',
  area = '铁掌山',
  name = '后花园',
  desc =  [[这是一处环境优雅的花园。只见乔松修竹，苍翠蔽天，层峦奇岫，静窈幽深。西面有一座假山，东面是大片的花圃。北面是通往山上的路。]],
  exit = {
    e = { to = '铁掌山花圃', },
    s = { to = '铁掌山后厢房', },
    w = { to = '铁掌山假山', },
    n = { to = '铁掌山山路#1N', },
  },
},

['铁掌山黄土路#3'] = {
  id = '铁掌山黄土路#3',
  area = '铁掌山',
  name = '黄土路',
  desc =  [[你走在一条尘土飞扬的黄土路上，两旁是阴森森的树林。这里是川湘交界，据说经常有土匪出没，不可久留。]],
  exit = {
    nw = { to = '铁掌山山脚下', },
    e = { to = '铁掌山黄土路#2', },
  },
},

['铁掌山绝壁#1'] = {
  id = '铁掌山绝壁#1',
  area = '铁掌山',
  name = '绝壁',
  desc =  [[你走到这里，发现前面已经没有路了。你面前是一座立陡的山峰，高耸入云，看不到尽头。石壁上生长着很多松树，疾风吹来，沙沙作响。看来想上峰顶，只能爬上去了。]],
  exit = {
    sw = { to = '铁掌山山谷#2', },
    hidden = { to = '铁掌山绝壁#2', cmd = 'zhua 松树;climb up', cond = 'player.party == "铁掌帮" and player.skill["基本轻功"] and player.skill["基本轻功"].level >= 30', },
  },
},

['铁掌山绝壁#2'] = {
  id = '铁掌山绝壁#2',
  area = '铁掌山',
  name = '绝壁',
  desc =  [[光突突的石壁。你只听见耳旁忽忽的风声。]],
  exit = {
    hidden1 = { to = '铁掌山食指峰', cmd = 'climb up', handler = 'go_straight', },
    hidden2 = { to = '铁掌山绝壁#1', cmd = 'climb down', handler = 'go_straight', },
  },
},

['铁掌山食指峰'] = {
  id = '铁掌山食指峰',
  area = '铁掌山',
  name = '食指峰',
  desc =  [[你终于爬上了峰顶，已经累得气喘吁吁了。这里只有丈许方圆的地方，却长着些茂盛的树木(tree)，站在崖边，一阵狂风呼啸而过，吹得你一个趔趄，差点摔倒，看来还是赶快离开这里的好。]],
  exit = {
    hidden = { to = '铁掌山绝壁#2', cmd = 'climb down', },
  },
},

['铁掌山荒草路#5'] = {
  id = '铁掌山荒草路#5',
  area = '铁掌山',
  name = '荒草路',
  desc =  [[你走一条荒芜的小路上，两旁荒草齐膝，荆棘遍地，似乎罕有人至。山石壁立，遮天蔽日，鸟兽全无，四周笼罩在一片阴暗之中，使这里看起来格外深隧幽静。]],
  exit = {
    nw = { to = '铁掌山荒草路#6', },
    sd = { to = '铁掌山荒草路#4', },
  },
},

['铁掌山小指峰'] = {
  id = '铁掌山小指峰',
  area = '铁掌山',
  name = '小指峰',
  desc =  [[你已登上了小指峰的峰顶。纵目远眺，但见远处四峰已淹没在浓浓的迷雾之中。这里的高度恰在云雾之中，你只能看清身前几米的景物。渐渐的，你的衣服已被水气沁湿，凉风袭来，冻得你瑟瑟发抖。]],
  exit = {
    sd = { to = '铁掌山瀑布', },
  },
},

['铁掌山山路#3N'] = {
  id = '铁掌山山路#3N',
  area = '铁掌山',
  name = '山路',
  desc =  [[你走在一条崎岖的山路上，道旁山峰壁立，长草过腰，中间一条羊肠小路，仅容一人勉强过去。]],
  exit = {
    nu = { to = '铁掌山山路#4N', },
    sd = { to = '铁掌山山间平台', },
  },
},

['铁掌山书房'] = {
  id = '铁掌山书房',
  area = '铁掌山',
  name = '书房',
  desc =  [[这是一间书房，房内陈列着众多四书五经，还有一些基本武功书籍，以供铁掌帮弟子阅读。]],
  exit = {
    s = { to = '铁掌山走廊#1W', },
  },
},

['铁掌山五指堂'] = {
  id = '铁掌山五指堂',
  area = '铁掌山',
  name = '五指堂',
  desc =  [[这是一间完全用花岗岩砌成的大厅，透出阵阵逼人的寒气。整座房屋没有窗户，显得阴森黑暗。两旁的墙壁上插着松油火把，散发出昏黄的光亮，寂静的大厅中不时响起火把噼啪的燃烧声。大厅的正中摆放着帮主的宝座，两旁分列着十几把椅子，只有遇到帮中大事时，帮主才会在这里与部下商议。在正面的墙上挂着一面缕金的横匾(bian)。北面有一扇小门通向后面。]],
  exit = {
    e = { to = '铁掌山走廊#1E', },
    sd = { to = '铁掌山广场', },
    w = { to = '铁掌山走廊#1W', },
    n = { to = '铁掌山后厢房', },
  },
},

['铁掌山石阶#2'] = {
  id = '铁掌山石阶#2',
  area = '铁掌山',
  name = '石阶',
  desc =  [[一排石阶盘旋而下，消失在浓浓的黑暗中。石阶上长满的绿色的青苔，滑不留脚。远处黑暗的尽头似乎有点昏黄的光亮。]],
  exit = {
    wu = { to = '铁掌山石阶#1', },
    nd = { to = '铁掌山石阶#3', },
  },
},

['铁掌山厨房'] = {
  id = '铁掌山厨房',
  area = '铁掌山',
  name = '厨房',
  desc =  [[这里是铁掌帮的厨房。正面是一个大炉灶，几乎占去了一半的房间。灶上留有很多火眼，可同时做很多种菜。几位帮中高薪聘来的厨子正在来回忙碌着。整间屋内弥漫着各种饭菜的香味，闻了让人垂涎欲滴。]],
  exit = {
    s = { to = '铁掌山走廊#2W', },
  },
},

['铁掌山碎石路#1'] = {
  id = '铁掌山碎石路#1',
  area = '铁掌山',
  name = '碎石路',
  desc =  [[你走在一条用碎石铺成的小路上。两旁山势低缓，长满了翠绿的毛竹，阵阵微风吹过，耳旁便响起一片沙沙声。]],
  exit = {
    wd = { to = '铁掌山山间平台', },
    eu = { to = '铁掌山碎石路#2', },
  },
},

['铁掌山山间平台'] = {
  id = '铁掌山山间平台',
  area = '铁掌山',
  name = '山间平台',
  desc =  [[这里是山间的一块平地。山势在这里开始分支，矗立在面前的有五座高耸入云的山峰，行似人的五指，“铁掌山”之名由此而得。五峰虽同 处此山，但拇指峰之雄伟，食指峰之险峻，中指峰之高耸，无名峰之奇丽，小指峰之秀美，则各有特色，各擅胜场。在平台一侧的大石上，刻着一副地图(ditu)。]],
  exit = {
    ne = { to = '铁掌山山谷#1', },
    sd = { to = '铁掌山山路#2N', },
    wu = { to = '铁掌山石板路#1', },
    nu = { to = '铁掌山山路#3N', },
    eu = { to = '铁掌山碎石路#1', },
    nw = { to = '铁掌山荒草路#1', cond = 'player.qi >= 1200', },
  },
},

['铁掌山荒草路#4'] = {
  id = '铁掌山荒草路#4',
  area = '铁掌山',
  name = '荒草路',
  desc =  [[你走一条荒芜的小路上，两旁荒草齐膝，荆棘遍地，似乎罕有人至。山石壁立，遮天蔽日，鸟兽全无，四周笼罩在一片阴暗之中，使这里看起来格外深隧幽静。]],
  exit = {
    nu = { to = '铁掌山荒草路#5', },
    sd = { to = '铁掌山荒草路#3', },
  },
},

['铁掌山第二指节'] = {
  id = '铁掌山第二指节',
  area = '铁掌山',
  name = '第二指节',
  desc =  [[这里已到了中指峰的半山腰了，由于铁掌山排列得象手指一样，每座山峰又分三截，就如手指的指节一般，因此这里正是位于第二指节的位置。这里离峰顶已近，透过淡淡的云雾，似已可以看到山路的尽头了。左前方二十于丈处，黑黝黝的似有一个洞穴(dong)，洞口砌以玉石，修建得极是齐整。]],
  exit = {
    nu = { to = '铁掌山山路#5N', },
    s = { to = '铁掌山松树林#2', },
    enter = { to = '铁掌山山洞#1', },
  },
},

['铁掌山走廊#2W'] = {
  id = '铁掌山走廊#2W',
  area = '铁掌山',
  name = '走廊',
  desc =  [[你走在一条走廊上。北面传来阵阵饭菜的香味。]],
  exit = {
    e = { to = '铁掌山走廊#1W', },
    n = { to = '铁掌山厨房', },
  },
},

['铁掌山山路#2S'] = {
  id = '铁掌山山路#2S',
  area = '铁掌山',
  name = '山路',
  desc =  [[你走在一条崎岖的山路上，道旁山峰壁立，长草过腰，中间一条羊肠小路，仅容一人勉强过去。]],
  exit = {
    sd = { to = '铁掌山山门', },
    n = { to = '铁掌山山路#1S', handler = 'pre_ask_ghost', },
  },
},

['铁掌山山路#1S'] = {
  id = '铁掌山山路#1S',
  area = '铁掌山',
  name = '山路',
  desc =  [[你走在一条崎岖的山路上，道旁山峰壁立，长草过腰，中间一条羊肠小路，仅容一人勉强过去。]],
  exit = {
    s = { to = '铁掌山山路#2S', },
    n = { to = '铁掌山广场', },
  },
},

['铁掌山走廊#1W'] = {
  id = '铁掌山走廊#1W',
  area = '铁掌山',
  name = '走廊',
  desc =  [[这里是一条走廊，走廊上很静，北面似乎传来一阵阵翻书的哗哗声，那里是一个书房。铁掌帮的弟子平日在那里读书用功。]],
  exit = {
    e = { to = '铁掌山五指堂', },
    w = { to = '铁掌山走廊#2W', },
    n = { to = '铁掌山书房', },
  },
},

['铁掌山石板路#1'] = {
  id = '铁掌山石板路#1',
  area = '铁掌山',
  name = '石板路',
  desc =  [[你走在一条石板铺成的小路上，两旁是高大的垂柳，虽在骄阳似火的夏日，依旧凉爽怡人。因为小指峰风光秀美，游人较多，因此这里的路也修砌的很好。]],
  exit = {
    ed = { to = '铁掌山山间平台', },
    wu = { to = '铁掌山石板路#2', },
  },
},

['铁掌山碎石路#3'] = {
  id = '铁掌山碎石路#3',
  area = '铁掌山',
  name = '碎石路',
  desc =  [[你走在一条用碎石铺成的小路上。两旁山势低缓，长满了翠绿的毛竹，阵阵微风吹过，耳旁便响起一片沙沙声。]],
  exit = {
    nu = { to = '铁掌山拇指峰', },
    wd = { to = '铁掌山碎石路#2', },
  },
},

['铁掌山山洞#2'] = {
  id = '铁掌山山洞#2',
  area = '铁掌山',
  name = '山洞',
  desc =  [[一个黑漆漆的山洞，黑沉沉的一眼望不到底。两侧的石壁上生满的苔藓，摸起来又湿又滑。这石洞似乎是人工开凿的，从四周的石壁上仍能看出斧凿的痕迹。你站在这里，一股恐惧由然而生，似乎身体随时都会被这片黑暗吞噬掉。]],
  exit = {
    enter = { to = '铁掌山山洞#3', },
    out = { to = '铁掌山山洞#1', },
  },
},

['铁掌山山路#5N'] = {
  id = '铁掌山山路#5N',
  area = '铁掌山',
  name = '山路',
  desc =  [[你走在一条崎岖的山路上，道旁山峰壁立，长草过腰，中间一条羊肠小路，仅容一人勉强过去。]],
  exit = {
    nu = { to = '铁掌山山路#6N', },
    sd = { to = '铁掌山第二指节', },
  },
},

['铁掌山男休息室'] = {
  id = '铁掌山男休息室',
  area = '铁掌山',
  name = '男休息室',
  desc =  [[这是一个黑暗的大房间。窗户用厚厚的帘子遮住，不露丝毫光亮。屋内整齐的排列着十几张木板搭成的床铺，可以让练功后的帮众及时得到休息。这里静悄悄的，黑暗中偶尔传来清微的鼾声。]],
  exit = {
    s = { to = '铁掌山走廊#2E', },
  },
},

['铁掌山黄土路#2'] = {
  id = '铁掌山黄土路#2',
  area = '铁掌山',
  name = '黄土路',
  desc =  [[你走在一条尘土飞扬的黄土路上，两旁是阴森森的树林。这里是川湘交界，据说经常有土匪出没，不可久留。]],
  exit = {
    ne = { to = '铁掌山黄土路#1', },
    w = { to = '铁掌山黄土路#3', },
  },
},

['归云庄湖滨小路#E'] = {
  id = '归云庄湖滨小路#E',
  area = '归云庄',
  name = '湖滨小路',
  desc =  [[一条湖滨的小路，往远处看似乎横着一条小河。]],
  exit = {
    w = { to = '归云庄小河东岸', },
    e = { to = '苏州城湖边大道', },
  },
},

['归云庄中厅'] = {
  id = '归云庄中厅',
  area = '归云庄',
  name = '中厅',
  desc =  [[这是归云庄的中厅。庄中的大事以及召集弟子训话都是在这里进行的。靠里面是一张太师椅，椅后的墙上挂着一幅画(hua)。]],
  exit = {
    e = { to = '归云庄前厅', },
    s = { to = '归云庄走廊#1S', },
    n = { to = '归云庄走廊#1N', },
  },
},

['归云庄大石桥'] = {
  id = '归云庄大石桥',
  area = '归云庄',
  name = '大石桥',
  desc =  [[这是归云庄前的石桥，再向西就进庄了。向庄子里望去，但见楼阁纡连，竟是好大一座庄院。]],
  exit = {
    w = { to = '归云庄前厅', },
    e = { to = '归云庄归云庄前', cond = 'player.party == "桃花岛" and player.skill["奇门八卦"] and player.skill["奇门八卦"].level >= 15 or ( player.skill["奇门八卦"] and player.skill["奇门八卦"].level >= 40 )', },
    hidden = { to = '归云庄九宫桃花阵', cmd = 'e', cond = 'player.party == "桃花岛" and ( not player.skill["奇门八卦"] or player.skill["奇门八卦"].level < 15 ) or ( player.party ~= "桃花岛" and ( not player.skill["奇门八卦"] or player.skill["奇门八卦"].level < 40 ) )', },
  },
},

['归云庄树林深处#E'] = {
  id = '归云庄树林深处#E',
  area = '归云庄',
  name = '树林深处',
  desc =  [[这是一片小树林。地面上绿草如荫，茂密地生长着。树叶的缝隙间偶尔会有一只小鸟被惊起，四周十分静寂。]],
  exit = {
    w = { to = '归云庄树林深处#C', },
  },
},

['归云庄练武场'] = {
  id = '归云庄练武场',
  area = '归云庄',
  name = '练武场',
  desc =  [[这是供归云庄内弟子们练功的场子。场边摆了两排兵器架，上面插着各种兵器，最多的还是各式各样的剑。在场子的一个角落里并排竖着两根半高的木桩(zhuang)，相距约一米，看起来是练功用的。西边是男弟子休息室，而东边则是女弟子休息室。南边是吃饭和喝茶的地方。]],
  exit = {
    e = { to = '归云庄女休息室', cond = 'player.gender == "female"', },
    s = { to = '归云庄饭厅', },
    w = { to = '归云庄男休息室', cond = 'player.gender == "male"', },
    n = { to = '归云庄走廊#3S', },
  },
},

['归云庄饭厅'] = {
  id = '归云庄饭厅',
  area = '归云庄',
  name = '饭厅',
  desc =  [[这是归云庄弟子们每日吃饭的地方，饭菜的香味充溢着整个房间。屋里摆着一张大桌子(table)和一些椅子(chair)。屋中站着几个仆役。]],
  exit = {
    e = { to = '归云庄厨房', },
    w = { to = '归云庄茶房', },
    n = { to = '归云庄练武场', },
  },
},

['归云庄树林深处#1N'] = {
  id = '归云庄树林深处#1N',
  area = '归云庄',
  name = '树林深处',
  desc =  [[这是一片小树林的深处。地面上绿草如荫，茂密地生长着。四周安静得令人毛骨悚然，看来还是赶紧离开这里为妙。树丛中有一棵老树(tree)，相对于其它树显得十分的粗壮，树上的树叶(leaf)非常茂密，有几只不知名的小鸟在其中窜来窜去。]],
  exit = {
    se = { to = '归云庄树林深处#C', },
    n = { to = '归云庄树林深处#2N', },
  },
},

['归云庄小河东岸'] = {
  id = '归云庄小河东岸',
  area = '归云庄',
  name = '小河东岸',
  desc =  [[这里是一条小河之滨，四下都是乱坟。往周围看去，并无桥梁可以过河(he)。]],
  exit = {
    e = { to = '归云庄湖滨小路#E', },
    hidden = { to = '归云庄小河西岸', cmd = 'ask lao zhe about 裘千丈;jump river', handler = 'gyz_river', },
  },
},

['归云庄书房'] = {
  id = '归云庄书房',
  area = '归云庄',
  name = '书房',
  desc = { [[这里是庄主平日读书的地方。屋中琳琅满目，全是诗文典籍；几上桌上摆着许多铜器玉器，看来尽是古物。壁上挂着一幅水墨画(hua)。 房内另有一张竹榻，一位身材高大的中年人正坐在榻上。]],  [[这里是庄主平日读书的地方。屋中琳琅满目，全是诗文典籍；几上桌上摆着许多铜器玉器，看来尽是古物。壁上挂着一幅水墨画(hua)。 房内另有一张竹榻，一位身材高大的中年人正坐在榻上。你猛一抬头，忽见书房门楣之上钉着八片铁片，排作八卦形状，却又不似寻常的八卦(bagua)那么排得整齐，疏疏落落，歪斜不称。]], },
  exit = {
    w = { to = '归云庄后厅', },
  },
},

['归云庄走廊#3N'] = {
  id = '归云庄走廊#3N',
  area = '归云庄',
  name = '走廊',
  desc =  [[这是连接中厅与后厅的走廊。走廊曲曲折折，两旁种满了花树。]],
  exit = {
    e = { to = '归云庄走廊#2N', },
    s = { to = '归云庄后厅', },
    n = { to = '归云庄卧房#1', },
  },
},

['归云庄湖滨小路#S'] = {
  id = '归云庄湖滨小路#S',
  area = '归云庄',
  name = '湖滨小路',
  desc = { [[一条湖滨的小路，往东面看远处似乎横着一条小河。往北面看是一条不知有多长的小路。南面是一家开着的小酒馆。]], [[一条湖滨的小路，往东面看远处似乎横着一条小河。往北面看是一条不知有多长的小路。南面是一家打烊了的小酒馆。]] },
  exit = {
    e = { to = '归云庄小河西岸', },
    s = { to = '归云庄小酒馆', unstable = true, cond = 'time.get_current_hour() >= 6 and time.get_current_hour() < 21', },
    n = { to = '归云庄湖滨小路#M', },
  },
},

['归云庄女休息室'] = {
  id = '归云庄女休息室',
  area = '归云庄',
  name = '女休息室',
  desc =  [[这是归云庄内女弟子们的休息室，房内有几张大床，供女弟子们临时休息用。]],
  exit = {
    w = { to = '归云庄练武场', },
  },
},

['归云庄走廊#1S'] = {
  id = '归云庄走廊#1S',
  area = '归云庄',
  name = '走廊',
  desc =  [[这是从中厅通向练武场的走廊。走廊曲曲折折，两旁种满了花树。]],
  exit = {
    w = { to = '归云庄走廊#2S', },
    n = { to = '归云庄中厅', },
  },
},

['归云庄走廊#2S'] = {
  id = '归云庄走廊#2S',
  area = '归云庄',
  name = '走廊',
  desc =  [[这是从中厅通向练武场的走廊。走廊曲曲折折，两旁种满了花树。]],
  exit = {
    e = { to = '归云庄走廊#1S', },
    s = { to = '归云庄走廊#3S', },
  },
},

['归云庄后厅'] = {
  id = '归云庄后厅',
  area = '归云庄',
  name = '后厅',
  desc =  [[这是归云庄的后厅。是庄主处理家中私事的地方。东边是一间书房，入口处放着一扇大屏风；西面则是主人的卧房。]],
  exit = {
    e = { to = '归云庄书房', },
    w = { to = '归云庄卧房#2', },
    n = { to = '归云庄走廊#3N', },
  },
},

['归云庄湖滨小路#M'] = {
  id = '归云庄湖滨小路#M',
  area = '归云庄',
  name = '湖滨小路',
  desc =  [[一条湖滨的小路，往南面看远处似乎有一家小酒馆。往北面看远处似乎有一座庄园。]],
  exit = {
    s = { to = '归云庄湖滨小路#S', cost = 3, handler = 'go_straight', },
    n = { to = '归云庄归云庄前', cost = 3, handler = 'go_straight', },
    n2 = { to = '归云庄湖滨小路#M', },
  },
},

['归云庄客房'] = {
  id = '归云庄客房',
  area = '归云庄',
  name = '客房',
  desc =  [[这是招待客人住宿的房间。室内陈设精雅，两床相对，枕衾雅洁。]],
  exit = {
    s = { to = '归云庄走廊#2N', },
  },
},

['归云庄小酒馆'] = {
  id = '归云庄小酒馆',
  area = '归云庄',
  name = '小酒馆',
  desc =  [[这是太湖边的一家小酒馆。你一走进来，就闻到一股酒菜的香味，勾人食涎。厅内摆着几张八仙桌(table)， 桌上整齐地摆放着碗筷，四周放着些椅子(chair)。 一个酒保正在忙个不停。你要想打听江湖掌故和谣言，这里是个好所在。柜台上立着一个价目表(sign)。]],
  exit = {
    n = { to = '归云庄湖滨小路#S', },
  },
},

['归云庄厨房'] = {
  id = '归云庄厨房',
  area = '归云庄',
  name = '厨房',
  desc =  [[这是归云庄的厨房，供应弟子们每日的饭食。屋中充斥着青菜和调料的味道。几个厨师正在忙碌着。偶尔会有些吃不完的主食和做菜时剩下的猪肉留在这里。]],
  exit = {
    w = { to = '归云庄饭厅', },
  },
},

['归云庄走廊#3S'] = {
  id = '归云庄走廊#3S',
  area = '归云庄',
  name = '走廊',
  desc =  [[这是从中厅通向练武场的走廊。走廊曲曲折折，两旁种满了花树。]],
  exit = {
    s = { to = '归云庄练武场', },
    n = { to = '归云庄走廊#2S', },
  },
},

['归云庄男休息室'] = {
  id = '归云庄男休息室',
  area = '归云庄',
  name = '男休息室',
  desc =  [[这是归云庄内男弟子们的休息室，房内有几张大床，供男弟子们临时休息用。]],
  exit = {
    e = { to = '归云庄练武场', },
  },
},

['归云庄树林深处#C'] = {
  id = '归云庄树林深处#C',
  area = '归云庄',
  name = '树林深处',
  desc =  [[这是一片小树林。地面上绿草如荫，茂密地生长着。树叶的缝隙间偶尔会有一只小鸟被惊起，四周十分静寂。]],
  exit = {
    e = { to = '归云庄树林深处#E', },
    nw = { to = '归云庄树林深处#1N', },
    s = { to = '归云庄树林#E', },
  },
},

['归云庄卧房#2'] = {
  id = '归云庄卧房#2',
  area = '归云庄',
  name = '卧房',
  desc =  [[这是庄主的卧房。房间不大，收拾得很干净。屋中的小八仙桌上放着一把酒壶和一只酒盅，看来主人常常以饮酒自缱。]],
  exit = {
    e = { to = '归云庄后厅', },
  },
},

['归云庄卧房#1'] = {
  id = '归云庄卧房#1',
  area = '归云庄',
  name = '卧房',
  desc =  [[这是少庄主的卧房。床榻上铺着锦被，一位女子羞答答的坐在床边。]],
  exit = {
    s = { to = '归云庄走廊#3N', },
  },
},

['归云庄树林#W'] = {
  id = '归云庄树林#W',
  area = '归云庄',
  name = '树林',
  desc =  [[这是一片小树林。地面上绿草如荫，茂密地生长着。树叶的缝隙间偶尔会有一只小鸟被惊起，四周十分静寂。]],
  exit = {
    e = { to = '归云庄树林#C', },
    s = { to = '归云庄草地#W', },
  },
},

['归云庄草地#W'] = {
  id = '归云庄草地#W',
  area = '归云庄',
  name = '草地',
  desc =  [[一片青翠的草地。绿草如荫，茂密地生长着，草丛间有一些不知名的小虫在钻来钻去。远处有一片树林。]],
  exit = {
    e = { to = '归云庄草地#C', },
    n = { to = '归云庄树林#W', },
  },
},

['归云庄走廊#1N'] = {
  id = '归云庄走廊#1N',
  area = '归云庄',
  name = '走廊',
  desc =  [[这是连接中厅与后厅的走廊。走廊曲曲折折，两旁种满了花树。]],
  exit = {
    w = { to = '归云庄走廊#2N', },
    s = { to = '归云庄中厅', },
  },
},

['归云庄小河西岸'] = {
  id = '归云庄小河西岸',
  area = '归云庄',
  name = '小河西岸',
  desc =  [[这里是一条小河之滨，四下都是乱坟。往周围看去，并无桥梁可以过河(he)。]],
  exit = {
    w = { to = '归云庄湖滨小路#S', },
    hidden = { to = '归云庄小河东岸', cmd = 'ask lao zhe about 裘千丈;jump river', handler = 'gyz_river', },
  },
},

['归云庄九宫桃花阵'] = {
  id = '归云庄九宫桃花阵',
  area = '归云庄',
  name = '九宫桃花阵',
  desc =  [[这是一片茂密的桃花丛，你一走进来就迷失了方向。地上有一株桃花(taohua)。]],
  exit = {
    hidden1 = { to = '归云庄归云庄前', handler = 'gyz_jiugong', cost = 20, },
    hidden2 = { to = '归云庄大石桥', handler = 'gyz_jiugong', cost = 20, },
    s = { to = '归云庄九宫桃花阵', unstable = true, },
    n = { to = '归云庄九宫桃花阵', unstable = true, },
    e = { to = '归云庄九宫桃花阵', unstable = true, },
    w = { to = '归云庄九宫桃花阵', unstable = true, },
  },
},

['归云庄走廊#2N'] = {
  id = '归云庄走廊#2N',
  area = '归云庄',
  name = '走廊',
  desc =  [[这是连接中厅与后厅的走廊。走廊曲曲折折，两旁种满了花树。北边有一间客房。]],
  exit = {
    e = { to = '归云庄走廊#1N', },
    w = { to = '归云庄走廊#3N', },
    n = { to = '归云庄客房', },
  },
},

['归云庄树林#C'] = {
  id = '归云庄树林#C',
  area = '归云庄',
  name = '树林',
  desc =  [[这是一片小树林。地面上绿草如荫，茂密地生长着。树叶的缝隙间偶尔会有一只小鸟被惊起，四周十分静寂。]],
  exit = {
    e = { to = '归云庄树林#E', },
    w = { to = '归云庄树林#W', },
    s = { to = '归云庄草地#C', },
  },
},

['归云庄茶房'] = {
  id = '归云庄茶房',
  area = '归云庄',
  name = '茶房',
  desc =  [[这是归云庄弟子们喝茶休息的地方，满屋的茶香，沁人心脾。屋里摆着几张桌子(table)和椅子(chair)，坐着几个正在喝茶聊天的男女弟子。屋中有几个丫鬟正在忙着为大家上茶。]],
  exit = {
    e = { to = '归云庄饭厅', },
  },
},

['归云庄树林深处#2N'] = {
  id = '归云庄树林深处#2N',
  area = '归云庄',
  name = '树林深处',
  desc =  [[这是一片小树林的深处。地面上绿草如荫，茂密地生长着。树叶的缝隙间偶尔会有一只小鸟被惊起，四周十分静寂。这里时常有毒蛇出没，最好不要在此久留。]],
  exit = {
    s = { to = '归云庄树林深处#1N', },
  },
},

['归云庄草地#C'] = {
  id = '归云庄草地#C',
  area = '归云庄',
  name = '草地',
  desc =  [[一片青翠的草地。绿草如荫，茂密地生长着，草丛间有一些不知名的小虫在钻来钻去。远处有一片树林。]],
  exit = {
    e = { to = '归云庄草地#E', },
    s = { to = '归云庄归云庄前', },
    w = { to = '归云庄草地#W', },
    n = { to = '归云庄树林#C', },
  },
},

['归云庄树林#E'] = {
  id = '归云庄树林#E',
  area = '归云庄',
  name = '树林',
  desc =  [[这是一片小树林。地面上绿草如荫，茂密地生长着。树叶的缝隙间偶尔会有一只小鸟被惊起，四周十分静寂。]],
  exit = {
    s = { to = '归云庄草地#E', },
    w = { to = '归云庄树林#C', },
    n = { to = '归云庄树林深处#C', },
  },
},

['归云庄前厅'] = {
  id = '归云庄前厅',
  area = '归云庄',
  name = '前厅',
  desc =  [[这是归云庄的前厅。平常招待客人都在这里进行。厅中陈设华美，雕梁画栋，极穷巧思。]],
  exit = {
    w = { to = '归云庄中厅', },
    e = { to = '归云庄大石桥', },
  },
},

['归云庄归云庄前'] = {
  id = '归云庄归云庄前',
  area = '归云庄',
  name = '归云庄前',
  desc =  [[这是通向归云庄的道路，西面就是归云庄。向南是一条小路，北面是一片绿油油的草地。]],
  exit = {
    s = { to = '归云庄湖滨小路#M', },
    n = { to = '归云庄草地#C', },
    w = { to = '归云庄大石桥', cond = 'player.party == "桃花岛" and player.skill["奇门八卦"] and player.skill["奇门八卦"].level >= 15 or ( player.skill["奇门八卦"] and player.skill["奇门八卦"].level >= 40 )', },
    hidden = { to = '归云庄九宫桃花阵', cmd = 'w', cond = 'player.party == "桃花岛" and ( not player.skill["奇门八卦"] or player.skill["奇门八卦"].level < 15 ) or ( player.party ~= "桃花岛" and ( not player.skill["奇门八卦"] or player.skill["奇门八卦"].level < 40 ) )', },
  },
},

['归云庄草地#E'] = {
  id = '归云庄草地#E',
  area = '归云庄',
  name = '草地',
  desc =  [[一片青翠的草地。绿草如荫，茂密地生长着，草丛间有一些不知名的小虫在钻来钻去。远处有一片树林。]],
  exit = {
    w = { to = '归云庄草地#C', },
    n = { to = '归云庄树林#E', },
  },
},

['佛山镇英雄客栈'] = {
  id = '佛山镇英雄客栈',
  area = '佛山镇',
  name = '英雄客栈',
  desc =  [[这是一间装修不错的客栈，正上方挂着一块金边的木匾，上书“英雄客栈”，这是凤天南的产业之一，凭着南霸天的威名，这数年来一直无人敢在此捣乱。来来往往的客商在此住宿也比较放心，店小二正里里外外不停地忙乎着。客栈正面的墙上挂着一块醒目的牌子(paizi)。]],
  exit = {
    u = { to = '佛山镇客栈二楼', no_wander = true, },
    e = { to = '佛山镇佛山南街#1', },
  },
},

['佛山镇佛山东街#3'] = {
  id = '佛山镇佛山东街#3',
  area = '佛山镇',
  name = '佛山东街',
  desc =  [[你走在街上，人逐渐稀少起来。南面是一堵高墙，墙上写着一个大大的“当”字，仔细倾听，可以听到压低的讨价还价的声音。东面是佛山东门，通向城外。]],
  exit = {
    e = { to = '佛山镇佛山东门', },
    w = { to = '佛山镇佛山东街#2', },
    s = { to = '佛山镇当铺', },
  },
},

['佛山镇烧饼摊'] = {
  id = '佛山镇烧饼摊',
  area = '佛山镇',
  name = '烧饼摊',
  desc =  [[这家烧饼油条铺是新开张的。铺面不大，正中央摆了一个大炸锅和一个烤炉。此店虽小但生意非常红火，这个镇上的男女老少，都乐意光顾这家小店。]],
  exit = {
    s = { to = '佛山镇佛山东街#2', },
  },
},

['佛山镇林间道#3W'] = {
  id = '佛山镇林间道#3W',
  area = '佛山镇',
  name = '林间道',
  desc =  [[这里是一条林间小道，在树丛中蜿蜒。这里是广西了。岭南山林茂密，多产毒虫，各位行路要十分小心。]],
  exit = {
    nw = { to = '佛山镇林间道#4W', },
    e = { to = '佛山镇林间道#2W', },
  },
},

['佛山镇树林#3'] = {
  id = '佛山镇树林#3',
  area = '佛山镇',
  name = '树林',
  desc =  [[这里是一片密林，参天的大树挡住了阳光，这里显得很阴暗，隐隐传来各种野兽的叫声，看来该离开这里了。]],
  exit = {
    e = { to = '佛山镇草莓地', },
  },
},

['佛山镇佛山南街#1'] = {
  id = '佛山镇佛山南街#1',
  area = '佛山镇',
  name = '佛山南街',
  desc =  [[佛山南街显的比较安静，这里是大部分都是住宅，西面是一家客栈，来来往往的客商都住在那里，东面是一家豪宅，看起来气派非凡。北面就是英雄楼，香气隐隐传来，让人垂涎欲滴。南面是一条宽阔的青石板路。]],
  exit = {
    e = { to = '佛山镇凤府大门', },
    s = { to = '佛山镇佛山南街#2', },
    w = { to = '佛山镇英雄客栈', },
    n = { to = '佛山镇英雄楼', },
  },
},

['佛山镇老渡口#2'] = {
  id = '佛山镇老渡口#2',
  area = '佛山镇',
  name = '老渡口',
  desc =  [[你迎着阵阵海风来到了渡口，这里是一个已经被废弃了很久的渡口。这个渡口曾经繁荣过一段很长的时间，因为古时皇帝为了得到长生不老就从这里出发向传说中的蓬莱航行，一块破旧的牌子(sign)，上面写着几个字。]],
  exit = {
    n = { to = '佛山镇草莓地', },
  },
},

['佛山镇林间道#SE'] = {
  id = '佛山镇林间道#SE',
  area = '佛山镇',
  name = '林间道',
  desc =  [[这里是一条林间小道，在树丛中蜿蜒。岭南山林茂密，多产毒虫，各位行路要十分小心。]],
  exit = {
    nw = { to = '佛山镇林间道#3E', },
  },
},

['佛山镇林间道#3E'] = {
  id = '佛山镇林间道#3E',
  area = '佛山镇',
  name = '林间道',
  desc =  [[这里是一条林间小道，在树丛中蜿蜒。岭南山林茂密，多产毒虫，各位行路要十分小心。]],
  exit = {
    ne = { to = '佛山镇林间道#4E', },
    w = { to = '佛山镇林间道#2E', },
    se = { to = '佛山镇林间道#SE', },
  },
},

['佛山镇钟家'] = {
  id = '佛山镇钟家',
  area = '佛山镇',
  name = '钟家',
  desc =  [[这是一间用土坯搭成的房屋，屋里只有几件残破的家俱。墙上挂着一些农具，地上还摆着一些看起来刚刚用完沾满泥巴的农具。东面有一个木门(door)，好象可以打开。]],
  exit = {
    e = { to = '佛山镇菜地', door = 'open door', },
    n = { to = '佛山镇小巷', },
  },
},

['佛山镇客店二楼'] = {
  id = '佛山镇客店二楼',
  area = '佛山镇',
  name = '客店二楼',
  desc =  [[这是一间干净的厢房，陈设十分简陋，一张木板床靠在墙边放着。]],
  exit = {
    out = { to = '佛山镇客栈二楼', },
  },
},

['佛山镇佛山西街#1'] = {
  id = '佛山镇佛山西街#1',
  area = '佛山镇',
  name = '佛山西街',
  desc =  [[这是一条宽阔的青石板街道，人来人往，非常热闹，东面是佛山的中央广场。南面隐隐传来喧哗声，几个打手凶神恶煞地站在两扇金边黑漆的大门前。]],
  exit = {
    e = { to = '佛山镇佛山广场', },
    w = { to = '佛山镇佛山西街#2', },
    s = { to = '佛山镇英雄会馆', },
  },
},

['佛山镇树林#1'] = {
  id = '佛山镇树林#1',
  area = '佛山镇',
  name = '树林',
  desc =  [[这里是一片树林，由于气候适宜，树林成长很快，已经形成了一片很大的面积，显得很茂密。旁边立着一张木牌(pai)。]],
  exit = {
    sw = { to = '佛山镇草莓地', },
    se = { to = '佛山镇树林#2', },
    n = { to = '佛山镇南门', },
  },
},

['佛山镇林间道#5E'] = {
  id = '佛山镇林间道#5E',
  area = '佛山镇',
  name = '林间道',
  desc =  [[这里是一条林间小道，在树丛中蜿蜒。进入福建省境了，闽西山林茂密，多产毒虫，各位行路要十分小心。]],
  exit = {
    ne = { to = '佛山镇林间道#6E', },
    sw = { to = '佛山镇林间道#4E', },
  },
},

['佛山镇林间道#1E'] = {
  id = '佛山镇林间道#1E',
  area = '佛山镇',
  name = '林间道',
  desc =  [[这里是一条林间小道，在树丛中蜿蜒。西面是岭南重镇佛山，东边通向福建福州。]],
  exit = {
    w = { to = '佛山镇佛山东门', },
    e = { to = '佛山镇林间道#2E', },
  },
},

['佛山镇林间道#1W'] = {
  id = '佛山镇林间道#1W',
  area = '佛山镇',
  name = '林间道',
  desc =  [[这里是一条林间小道，在树丛中蜿蜒。东面是岭南重镇佛山，西边通向广西。]],
  exit = {
    w = { to = '佛山镇林间道#2W', },
    e = { to = '佛山镇西门', },
  },
},

['佛山镇林间道#6E'] = {
  id = '佛山镇林间道#6E',
  area = '佛山镇',
  name = '林间道',
  desc =  [[这里是一条林间小道，在树丛中蜿蜒。北面就是福州城的南门吊桥，向西南可达岭南广东。]],
  exit = {
    sw = { to = '佛山镇林间道#5E', },
    n = { to = '福州城南门吊桥', },
  },
},

['佛山镇佛山东门'] = {
  id = '佛山镇佛山东门',
  area = '佛山镇',
  name = '佛山东门',
  desc =  [[这里是佛山镇的东门。再往东走就要离开佛山，去往福建了。西面一条东西向的大街是佛山镇的主要街道。]],
  exit = {
    w = { to = '佛山镇佛山东街#3', },
    e = { to = '佛山镇林间道#1E', },
  },
},

['佛山镇佛山广场'] = {
  id = '佛山镇佛山广场',
  area = '佛山镇',
  name = '佛山广场',
  desc =  [[这里就是佛山镇的中心，一个很宽阔的广场，铺着青石地面。佛山自来与朱仙，景德，汉口并称天下四大镇，端的是民丰物阜，市廛繁华，来来往往的行人络绎不绝。北面传来阵阵马蹄声，南面隐隐有划拳的叫喝声，西面显得比较安静，东面人声鼎沸，一派繁华景象。]],
  exit = {
    e = { to = '佛山镇佛山东街#1', },
    s = { to = '佛山镇英雄楼', },
    w = { to = '佛山镇佛山西街#1', },
    n = { to = '佛山镇佛山北街', },
  },
},

['佛山镇客栈二楼'] = {
  id = '佛山镇客栈二楼',
  area = '佛山镇',
  name = '客栈二楼',
  desc =  [[这里是客栈二楼的走廊，大部分客房的门都关着，不时传来阵阵的打酣声，此起彼伏，络绎不绝。]],
  exit = {
    enter = { to = '佛山镇客店二楼', },
    d = { to = '佛山镇英雄客栈', },
  },
},

['佛山镇佛山祖庙'] = {
  id = '佛山镇佛山祖庙',
  area = '佛山镇',
  name = '佛山祖庙',
  desc =  [[这里是佛山著名的名胜古迹之一佛山祖庙，这里看起来很热闹，听说这里的佛很灵验，很多外地人都闻名至此，到处都青烟缭绕，香火很旺盛。]],
  exit = {
    se = { to = '佛山镇小路#1', },
  },
},

['佛山镇坟场'] = {
  id = '佛山镇坟场',
  area = '佛山镇',
  name = '坟场',
  desc =  [[这里是一块阴森的坟场，显得很荒凉，站在这里时间长了，有点毛骨悚然的感觉，看来还是早点离开吧。]],
  exit = {
    sw = { to = '佛山镇小路#1', },
  },
},

['佛山镇密林'] = {
  id = '佛山镇密林',
  area = '佛山镇',
  name = '密林',
  desc =  [[到了这里好象就没有路了，突然树林中跳出两个马贼，原来这里是马贼的老窝。]],
  exit = {
    sw = { to = '佛山镇小路#3', },
  },
},

['佛山镇佛山东街#2'] = {
  id = '佛山镇佛山东街#2',
  area = '佛山镇',
  name = '佛山东街',
  desc =  [[这是一条宽阔的青石板街道，向东西两头延伸。南边是打铁铺，叮叮当当的声音老远就能听到。]],
  exit = {
    e = { to = '佛山镇佛山东街#3', },
    s = { to = '佛山镇铁匠铺', },
    w = { to = '佛山镇佛山东街#1', },
    n = { to = '佛山镇烧饼摊', },
  },
},

['佛山镇佛山北门'] = {
  id = '佛山镇佛山北门',
  area = '佛山镇',
  name = '佛山北门',
  desc =  [[这里是佛山镇的北门。出北门向北，翻过南岭可达中原。南面一条东西向的大街是佛山镇的主要街道。]],
  exit = {
    s = { to = '佛山镇佛山北街', },
    n = { to = '佛山镇岭南', },
  },
},

['佛山镇南门'] = {
  id = '佛山镇南门',
  area = '佛山镇',
  name = '南门',
  desc =  [[这里是佛山镇的南门。出南门向南，就到达南海之滨了。北面一条东西向的大街是佛山镇的主要街道。]],
  exit = {
    s = { to = '佛山镇树林#1', },
    n = { to = '佛山镇佛山南街#2', },
  },
},

['佛山镇树林#2'] = {
  id = '佛山镇树林#2',
  area = '佛山镇',
  name = '树林',
  desc =  [[这里是一片树林，由于气候适宜，树林成长很快，已经形成了一片很大的面积，显得很茂密。再往南走就是老渡口了。]],
  exit = {
    nw = { to = '佛山镇树林#1', },
    s = { to = '佛山镇老渡口#1', },
  },
},

['佛山镇林间道#6W'] = {
  id = '佛山镇林间道#6W',
  area = '佛山镇',
  name = '林间道',
  desc =  [[这里是一条林间小道，在树丛中蜿蜒。这里是广西了。岭南山林茂密，多产毒虫，各位行路要十分小心。]],
  exit = {
    w = { to = '大理城南澜沧江边#E', },
    e = { to = '佛山镇林间道#5W', },
  },
},

['佛山镇凤府大厅'] = {
  id = '佛山镇凤府大厅',
  area = '佛山镇',
  name = '凤府大厅',
  desc =  [[这里便是凤府的大厅，气派非凡，装饰奢华，居中一张太师椅，上铺一张黄章黑纹的虎皮，凤天南看来不在，几个打手和师爷在旁嘀咕着。虎皮椅旁边有两座大理石屏风，都有三四尺高，石上山水木石，便如是画出来的一般。]],
  exit = {
    w = { to = '佛山镇凤府大院', },
    s = { to = '佛山镇书房', },
  },
},

['佛山镇杂货店'] = {
  id = '佛山镇杂货店',
  area = '佛山镇',
  name = '杂货店',
  desc =  [[这是一间刚刚开张的杂货铺，门面很小，卖的都是一些日常用品。据说老板是从外地来的，经常去各地进一些常用的物品。    门前立了个牌子(sign)。]],
  exit = {
    s = { to = '佛山镇佛山东街#1', },
  },
},

['佛山镇西门'] = {
  id = '佛山镇西门',
  area = '佛山镇',
  name = '西门',
  desc =  [[这里是佛山镇的西门。岭南以西经由广西可至大理国。东面一条东西向的大街是佛山镇的主要街道。]],
  exit = {
    w = { to = '佛山镇林间道#1W', },
    e = { to = '佛山镇佛山西街#2', },
  },
},

['佛山镇凤府大院'] = {
  id = '佛山镇凤府大院',
  area = '佛山镇',
  name = '凤府大院',
  desc =  [[这是一个非常宽敞的大院，你走进大院，迎面是一个假山水池，水池的两旁种满了花草。一些丫鬟和仆役在进进出出的忙碌着，北面就是凤府的大厅，南面是凤府的大门。]],
  exit = {
    w = { to = '佛山镇凤府大门', },
    e = { to = '佛山镇凤府大厅', },
  },
},

['佛山镇林间道#5W'] = {
  id = '佛山镇林间道#5W',
  area = '佛山镇',
  name = '林间道',
  desc =  [[这里是一条林间小道，在树丛中蜿蜒。这里是广西了。岭南山林茂密，多产毒虫，各位行路要十分小心。]],
  exit = {
    ne = { to = '佛山镇林间道#4W', },
    w = { to = '佛山镇林间道#6W', },
  },
},

['佛山镇林间道#4E'] = {
  id = '佛山镇林间道#4E',
  area = '佛山镇',
  name = '林间道',
  desc =  [[这里是一条林间小道，在树丛中蜿蜒。岭南山林茂密，多产毒虫，各位行路要十分小心。]],
  exit = {
    ne = { to = '佛山镇林间道#5E', },
    sw = { to = '佛山镇林间道#3E', },
  },
},

['佛山镇铁匠铺'] = {
  id = '佛山镇铁匠铺',
  area = '佛山镇',
  name = '铁匠铺',
  desc =  [[这是一家简陋的打铁铺，中心摆着一个火炉，炉火把四周照得一片通红，你一走进去就感到浑身火热。墙角堆满了已完工和未完工的菜刀、铁锤、铁棍、匕首、盔甲等物。一位铁匠满头大汗挥舞着铁锤，专心致志地在打铁。 ]],
  exit = {
    n = { to = '佛山镇佛山东街#2', },
  },
},

['佛山镇英雄楼二楼'] = {
  id = '佛山镇英雄楼二楼',
  area = '佛山镇',
  name = '英雄楼二楼',
  desc =  [[酒楼里桌椅洁净。座中客人衣饰豪奢，十九是富商大贾。]],
  exit = {
    d = { to = '佛山镇英雄楼', },
  },
},

['佛山镇凤府大门'] = {
  id = '佛山镇凤府大门',
  area = '佛山镇',
  name = '凤府大门',
  desc =  [[这是一座白墙黑瓦的大宅第，门上悬着一面金边的大匾，写着“南海凤第”四个大字，一连五进，气象宏伟。]],
  exit = {
    w = { to = '佛山镇佛山南街#1', },
    e = { to = '佛山镇凤府大院', },
  },
},

['佛山镇英雄会馆'] = {
  id = '佛山镇英雄会馆',
  area = '佛山镇',
  name = '英雄会馆',
  desc =  [[这里是一座破败的庙宇，大门上写着“英雄会馆”四个大字。进去以后，只见大殿上围着黑压压的一堆人，正在掷骰子押大小。好象刚刚开盅一次，有的赌客正在欢呼，有的赌客垂头丧气。]],
  exit = {
    n = { to = '佛山镇佛山西街#1', },
  },
},

['佛山镇佛山南街#2'] = {
  id = '佛山镇佛山南街#2',
  area = '佛山镇',
  name = '佛山南街',
  desc =  [[这是一条宽阔的青石板路，东面是一条黑漆漆的小巷，西面是一个小吃店，专卖一些佛山的特产小吃。南面就是佛山南门了。]],
  exit = {
    e = { to = '佛山镇小巷', },
    s = { to = '佛山镇南门', },
    w = { to = '佛山镇小吃店', },
    n = { to = '佛山镇佛山南街#1', },
  },
},

['佛山镇小吃店'] = {
  id = '佛山镇小吃店',
  area = '佛山镇',
  name = '小吃店',
  desc =  [[这是佛山非常有名的一家小吃店，专卖佛山著名的特产小吃，很多外地来的商人和游客都要特地赶来买一些特产尝一尝。老板热情的招呼着行人。]],
  exit = {
    e = { to = '佛山镇佛山南街#2', },
  },
},

['佛山镇小巷'] = {
  id = '佛山镇小巷',
  area = '佛山镇',
  name = '小巷',
  desc =  [[这是一条漆黑的小巷，坑坑洼洼的路面让人走起来感觉很不舒服。]],
  exit = {
    w = { to = '佛山镇佛山南街#2', },
    s = { to = '佛山镇钟家', },
  },
},

['佛山镇岭南'] = {
  id = '佛山镇岭南',
  area = '佛山镇',
  name = '岭南',
  desc =  [[这里是岭南的一个山口。南面就是佛山了，北面是横亘湖南广东的五岭。这里地气炎热，百物速生快长，口音也远异中原了。]],
  exit = {
    s = { to = '佛山镇佛山北门', },
    n = { to = '佛山镇小路#1', },
  },
},

['佛山镇北帝庙'] = {
  id = '佛山镇北帝庙',
  area = '佛山镇',
  name = '北帝庙',
  desc =  [[这就是威灵显赫的北帝庙，它坐北朝南。院子中一个大水塘，塘中石龟石蛇，昂然盘踞。大殿神像石板上血迹殷然。北帝神像立于大殿正中。]],
  exit = {
    s = { to = '佛山镇佛山西街#2', },
  },
},

['佛山镇草莓地'] = {
  id = '佛山镇草莓地',
  area = '佛山镇',
  name = '草莓地',
  desc =  [[这里是一块草莓地，鲜红的草莓散落在绿草中，让人感到美妙惬意。]],
  exit = {
    ne = { to = '佛山镇树林#1', },
    w = { to = '佛山镇树林#3', },
    s = { to = '佛山镇老渡口#2', },
  },
},

['佛山镇英雄楼'] = {
  id = '佛山镇英雄楼',
  area = '佛山镇',
  name = '英雄楼',
  desc =  [[这是一间三开间门面的大酒楼，招牌上写着“英雄楼”三个金漆大字，两边敞着窗户，酒楼里刀杓乱响，酒肉香气阵阵喷出。]],
  exit = {
    u = { to = '佛山镇英雄楼二楼', },
    s = { to = '佛山镇佛山南街#1', },
    n = { to = '佛山镇佛山广场', },
  },
},

['佛山镇小路#2'] = {
  id = '佛山镇小路#2',
  area = '佛山镇',
  name = '小路',
  desc =  [[这里是一条上山的小路，这条路看起来好象很少人走，显得很荒凉，周围的草丛都有一人高了。]],
  exit = {
    nu = { to = '佛山镇小路#3', },
    sd = { to = '佛山镇小路#1', },
  },
},

['佛山镇佛山北街'] = {
  id = '佛山镇佛山北街',
  area = '佛山镇',
  name = '佛山北街',
  desc =  [[这里是佛山的北大街，宽阔的街道上车水马龙，人来人往，向南走就是佛山的广场了，那里人声鼎沸，似乎十分热闹。]],
  exit = {
    s = { to = '佛山镇佛山广场', },
    n = { to = '佛山镇佛山北门', },
  },
},

['佛山镇当铺'] = {
  id = '佛山镇当铺',
  area = '佛山镇',
  name = '当铺',
  desc =  [[绕过高墙，当铺里一张高高的柜台，柜台后面坐着当铺的朝奉。这家当铺是凤天南开的，十多年来从没人敢来胡混。朝奉们懒洋洋地爬在柜台上。柜台上摆着一个牌子(paizi)。]],
  exit = {
    n = { to = '佛山镇佛山东街#3', },
  },
},

['佛山镇菜地'] = {
  id = '佛山镇菜地',
  area = '佛山镇',
  name = '菜地',
  desc =  [[这块菜地位于凤天南的豪宅旁，站在这里，凤府的巍阁雕墙，举目可见。菜地中萝卜白菜长得甚为肥美，菜畦旁丢着一顶小孩帽子，一个粗陶娃娃。西边是一扇木门(door)。]],
  exit = {
    w = { to = '佛山镇钟家', door = 'open door', },
  },
},

['佛山镇佛山西街#2'] = {
  id = '佛山镇佛山西街#2',
  area = '佛山镇',
  name = '佛山西街',
  desc =  [[你走在青石板的街道上，这里显得比较安静，东面隐约传来阵阵喧哗的声音，西面就是佛山的西门了。北面是一座建构宏伟的大神祠，正上方挂着一块破旧的木牌，上书“北帝庙”。]],
  exit = {
    e = { to = '佛山镇佛山西街#1', },
    w = { to = '佛山镇西门', },
    n = { to = '佛山镇北帝庙', },
  },
},

['佛山镇佛山东街#1'] = {
  id = '佛山镇佛山东街#1',
  area = '佛山镇',
  name = '佛山东街',
  desc =  [[这里就是佛山东街，北面有一家杂货铺，向西走就是佛山广场了。由于西面就是佛山广场，很多人都往西去，所以人来人往看起来比较热闹。]],
  exit = {
    e = { to = '佛山镇佛山东街#2', },
    w = { to = '佛山镇佛山广场', },
    n = { to = '佛山镇杂货店', },
  },
},

['佛山镇密室'] = {
  id = '佛山镇密室',
  area = '佛山镇',
  name = '密室',
  desc =  [[这里就是凤天南存放宝物的密室。]],
  exit = {
    u = { to = '佛山镇书房', },
  },
},

['佛山镇林间道#2W'] = {
  id = '佛山镇林间道#2W',
  area = '佛山镇',
  name = '林间道',
  desc =  [[这里是一条林间小道，在树丛中蜿蜒。这里是广西了。岭南山林茂密，多产毒虫，各位行路要十分小心。]],
  exit = {
    w = { to = '佛山镇林间道#3W', },
    e = { to = '佛山镇林间道#1W', },
  },
},

['佛山镇小路#3'] = {
  id = '佛山镇小路#3',
  area = '佛山镇',
  name = '小路',
  desc =  [[这里是一条上山的小路，走到这里路越来越窄，听说山上经常有山贼出没，要格外小心。没有什么事情看来还是回去吧。]],
  exit = {
    ne = { to = '佛山镇密林', },
    sd = { to = '佛山镇小路#2', },
    n = { to = '福州城山路#9W', },
  },
},

['佛山镇书房'] = {
  id = '佛山镇书房',
  area = '佛山镇',
  name = '书房',
  desc =  [[这里是凤天南的书房，却没有一本书。各种古玩琳琅满目，商周青铜、唐三彩，珍珠宝石，应有尽有，普通人只要拥有一件，就够一家大小吃上一辈子了。东面的墙上挂着一副画(picture)。]],
  exit = {
    hidden = { to = '佛山镇密室', handler = 'touch picture;use hei yaoshi', no_wander = true, },
    n = { to = '佛山镇凤府大厅', },
  },
},

['佛山镇林间道#4W'] = {
  id = '佛山镇林间道#4W',
  area = '佛山镇',
  name = '林间道',
  desc =  [[这里是一条林间小道，在树丛中蜿蜒。这里是广西了。岭南山林茂密，多产毒虫，各位行路要十分小心。]],
  exit = {
    se = { to = '佛山镇林间道#3W', },
    sw = { to = '佛山镇林间道#5W', },
  },
},

['佛山镇老渡口#1'] = {
  id = '佛山镇老渡口#1',
  area = '佛山镇',
  name = '老渡口',
  desc =  [[你迎着阵阵海风来到了渡口，这里是一个已经被废弃了很久的渡口。    这个渡口曾经繁荣过一段很长的时间，因为古时皇帝为了得到长生不老就从这里出发向传说中的蓬莱航行。]],
  exit = {
    n = { to = '佛山镇树林#2', },
  },
},

['佛山镇小路#1'] = {
  id = '佛山镇小路#1',
  area = '佛山镇',
  name = '小路',
  desc =  [[北面是一条上山的小路，南面就是岭南山口了。东北面隐隐传来哭声，西北面传来阵阵木鱼声，间或有诵经的声音传来。]],
  exit = {
    nu = { to = '佛山镇小路#2', },
    nw = { to = '佛山镇佛山祖庙', },
    s = { to = '佛山镇岭南', },
    ne = { to = '佛山镇坟场', },
  },
},

['佛山镇林间道#2E'] = {
  id = '佛山镇林间道#2E',
  area = '佛山镇',
  name = '林间道',
  desc =  [[这里是一条林间小道，在树丛中蜿蜒。岭南山林茂密，多产毒虫，各位行路要十分小心。]],
  exit = {
    w = { to = '佛山镇林间道#1E', },
    e = { to = '佛山镇林间道#3E', },
  },
},

['桃花岛海滨'] = {
  id = '桃花岛海滨',
  area = '桃花岛',
  name = '海滨',
  desc = { [[这里是钱塘江的入海口。波涛汹涌，咆哮不息。海潮(tide)不断地扑面而来，拍在岸边，溅起的水珠在半空飞舞，好象大雪纷纷一样。远处有一块巨岩(rock)，后面似乎隐藏着什么。]],  [[这里是钱塘江的入海口。波涛汹涌，咆哮不息。海潮(tide)不断地扑面而来，拍在岸边，溅起的水珠在半空飞舞，好象大雪纷纷一样。]], },
  exit = {
    w = { to = '牛家村江畔#3', },
    hidden = { to = '桃花岛岸边', cond = 'player.party == "桃花岛" or ( player.skill["奇门八卦"] and player.skill["奇门八卦"].level >= 50 )', cmd = 'l rock;#wa 1000;jump boat', },
 },
},

['桃花岛岸边'] = {
  id = '桃花岛岸边',
  area = '桃花岛',
  name = '岸边',
  desc =  [[你疑惑地看着四周，这里就是桃花岛么？四周除了凌乱的礁石外，什么都没有。往北面看，一座小山耸立在那里,可以通过攀爬岩壁到达山顶。]],
  exit = {
    nu = { to = '桃花岛小山', },
 },
},

['桃花岛小山'] = {
  id = '桃花岛小山',
  area = '桃花岛',
  name = '小山',
  desc =  [[一翻上山头，你就发现眼前豁然开朗，北面山脚下是一大片的桃花丛，而在花丛中隐约露出了几座庭院的飞檐，似乎有着一片典雅的建筑在那边。向靠海的一边望去，用来爬山时垫脚的岩石已经被蹬掉了，你再也回不到海边了。而东北边更有一座小山峰，]],
  exit = {
    eu = { to = '桃花岛山脊', },
    nd = { to = '桃花岛桃花阵', cond = 'player.party == "桃花岛" and ( not player.skill["奇门八卦"] or player.skill["奇门八卦"].level < 20 ) or ( player.party ~= "桃花岛" and ( not player.skill["奇门八卦"] or player.skill["奇门八卦"].level <= 130 ) )', },
    hidden = { to = '桃花岛山冈', cmd = 'nd', cond = 'player.party == "桃花岛" and player.skill["奇门八卦"] and player.skill["奇门八卦"].level >= 20 or ( player.skill["奇门八卦"] and player.skill["奇门八卦"].level > 130 )', },
  },
},

['桃花岛桃花阵'] = {
  id = '桃花岛桃花阵',
  area = '桃花岛',
  name = '桃花阵',
  desc =  [[这是一片茂密的桃花丛，你一走进来就迷失了方向。]],
  exit = {
    e = { to = '桃花岛桃花阵', },
    w = { to = '桃花岛桃花阵', },
    s = { to = '桃花岛桃花阵', },
    n = { to = '桃花岛桃花阵', },
    n2 = { to = '桃花岛小院', ignore = true, },
    hidden = { to = '桃花岛小院', cost = 20, handler = 'breadcrumb', },
  },
},

['桃花岛小院'] = {
  id = '桃花岛小院',
  area = '桃花岛',
  name = '小院',
  desc =  [[没有想到这里竟然会有这么幽雅的小院，假山回廊，花树盆景，无一不是放置得极为合适，显然这里的主人非常熟悉布置，再联系到东、西、南三面的桃花阵，足见主人熟通阴阳五行、变化生克之理。北面是一座小亭子。]],
  exit = {
    e = { to = '桃花岛八卦桃花阵', handler = 'thd_bagua', cond = 'not player.skill["奇门八卦"] or player.skill["奇门八卦"].level < 200', },
    s = { to = '桃花岛桃花阵', cond = 'player.party == "桃花岛" and ( not player.skill["奇门八卦"] or player.skill["奇门八卦"].level < 20 ) or ( player.party ~= "桃花岛" and ( not player.skill["奇门八卦"] or player.skill["奇门八卦"].level <= 130 ) )', },
    w = { to = '桃花岛八卦桃花阵', handler = 'thd_bagua', cond = 'not player.skill["奇门八卦"] or player.skill["奇门八卦"].level < 200', },
    n = { to = '桃花岛积翠亭', },
    hidden = { to = '桃花岛洞口', cmd = 'e', cond = 'player.skill["奇门八卦"] and player.skill["奇门八卦"].level >= 200', },
  },
},

['桃花岛山脊'] = {
  id = '桃花岛山脊',
  area = '桃花岛',
  name = '山脊',
  desc =  [[山势至此一转，折而向北就可抵达山顶。往远处望，一片桃花郁郁葱葱，另一边则可远眺大海，极目海天交接处，似乎有些帆影，但又似乎是幻觉。]],
  exit = {
    nu = { to = '桃花岛山顶', },
    wd = { to = '桃花岛小山', },
  },
},

['桃花岛山顶'] = {
  id = '桃花岛山顶',
  area = '桃花岛',
  name = '山顶',
  desc =  [[这里是山顶，很意外地，你发现东边有一座高台。一道石梁凌空而架，连接着这里和那边的入口。几步之外立着一座石碑(shibei)。]],
  exit = {
    e = { to = '桃花岛入口', },
    sd = { to = '桃花岛山脊', },
  },
},

['桃花岛入口'] = {
  id = '桃花岛入口',
  area = '桃花岛',
  name = '入口',
  desc =  [[这里是高台的顶层，往下有一道悬挂着的铁梯，通向太极层。墙壁上挂着一个大牌子，上书：“入阵者不得回头，凶险自负！”笔势凶猛，似在惊吓来人。旁边有一个说明(shuoming)。]],
  exit = {
    w = { to = '桃花岛山顶', },
    d = { to = '桃花岛太极', no_wander = true, },
  },
},

['桃花岛太极'] = {
  id = '桃花岛太极',
  area = '桃花岛',
  name = '太极',
  desc =  [[这里是太极层，你一走下来，往上的铁梯就被撤掉了。往下有一道悬挂着的铁梯，通向两仪层。太极是世界的统一体，阴阳流转不息，互相转化，成为一个整体，这就是所谓的混沌状态。由太极的两个极端变化而生出阴阳，就是太极生两仪。]],
  exit = {
    d = { to = '桃花岛两仪', },
  },
},

['桃花岛两仪'] = {
  id = '桃花岛两仪',
  area = '桃花岛',
  name = '两仪',
  desc =  [[这里是两仪层，你一走下来，往上的铁梯就被撤掉了。往下有一道悬挂着的铁梯，通向四象层。所谓两仪，系指阴阳，是世界的二端。虽然太极浑圆，仍由对立着又统一的二极构成。阴阳之间不停转化，生生不息，是世界运行的原动力。然而阴阳之间仍然不是绝对的对立，所谓阴中有阳，阳中含阴。是故少阳伴太阴而少阴伴太阳，此两仪生四象。以八干四维而论，艮居于东北而为鬼门，谓之阴，坤生于西南而为人门，谓之阳。]],
  exit = {
    ne = { to = '桃花岛阴', },
    sw = { to = '桃花岛阳', },
    d = { to = '桃花岛四象', ignore  = true, },
    hidden = { to = '桃花岛四象', cost = 2, handler = 'thd_liangyi', },
  },
},

['桃花岛阴'] = {
  id = '桃花岛阴',
  area = '桃花岛',
  name = '阴',
  desc =  [[这里是两仪层的阴。阴是太极的一端，古人以黑暗为阴，以死亡为阴，又以地理而认为北方属阴，山之北水之南为阴。]],
  exit = {
    sw = { to = '桃花岛两仪', },
  },
},

['桃花岛阳'] = {
  id = '桃花岛阳',
  area = '桃花岛',
  name = '阳',
  desc =  [[这里是两仪层的阳。阳是太极的一端，古人以光明为阳，以生命为阳，又以地理而认为南方属阳，山之南水之北为阳。]],
  exit = {
    ne = { to = '桃花岛两仪', },
  },
},

['桃花岛四象'] = {
  id = '桃花岛四象',
  area = '桃花岛',
  name = '四象',
  desc =  [[这里是四象层，你一走下来，往上的铁梯就被撤掉了。所谓四象，系指阴阳变化的四态，亦即太阴、少阳、太阳、少阴，是阴阳互相转化的形式。阴极中的阴就是太阴，而阴中带阳就是少阳，同样的也有太阳和少阴。四象进一步演化即是四象生八卦，以方位倒转八卦论，太阳之阳为乾，居正南，太阴之阴为坤，于正北；少阴之阳为离，居东方，少阳之阴为坎，在西方。四象又对应五灵中的四兽，而此室居中央，表示五灵中的人统领其余四灵兽。以方位入五行，此中土之形，尚黄，有一道铁梯直通下方的中央戊己土。]],
  exit = {
    n = { to = '桃花岛太阴', },
    s = { to = '桃花岛太阳', },
    w = { to = '桃花岛少阳', },
    e = { to = '桃花岛少阴', },
    d = { to = '桃花岛土', ignore  = true, },
    hidden = { to = '桃花岛土', cost = 2, handler = 'thd_sixiang', },
  },
},

['桃花岛太阴'] = {
  id = '桃花岛太阴',
  area = '桃花岛',
  name = '太阴',
  desc =  [[这里是四象层的太阴。太阴是阴中之阴，也即至阴。北方对应四灵兽中的玄武，乌龟之形，尚黑。以方位入五行，有一道铁梯直通下方的北方壬癸水。]],
  exit = {
    s = { to = '桃花岛四象', },
    d = { to = '桃花岛水', ignore  = true, },
    hidden = { to = '桃花岛水', cost = 2, handler = 'thd_sixiang', },
  },
},

['桃花岛太阳'] = {
  id = '桃花岛太阳',
  area = '桃花岛',
  name = '太阳',
  desc =  [[这里是四象层的太阳。太阳是阳中之阳，也即至阳。南方对应四灵兽中的朱雀，赤日之形，尚红。以方位入五行，有一道铁梯直通下方的南方丙丁火。]],
  exit = {
    n = { to = '桃花岛四象', },
    d = { to = '桃花岛火', ignore  = true, },
    hidden = { to = '桃花岛火', cost = 2, handler = 'thd_sixiang', },
  },
},

['桃花岛少阳'] = {
  id = '桃花岛少阳',
  area = '桃花岛',
  name = '少阳',
  desc =  [[这里是四象层的少阳。少阳是阴中之阳。西方对应四灵兽中的白虎，白虎之形，尚白。以方位入五行，有一道铁梯直通下方的西方庚辛金。]],
  exit = {
    e = { to = '桃花岛四象', },
    d = { to = '桃花岛金', ignore  = true, },
    hidden = { to = '桃花岛金', cost = 2, handler = 'thd_sixiang', },
  },
},

['桃花岛少阴'] = {
  id = '桃花岛少阴',
  area = '桃花岛',
  name = '少阴',
  desc =  [[这里是四象层的少阴。少阴是阳中之阴。东方对应四灵兽中的青龙，青龙之形，尚青。以方位入五行，有一道铁梯直通下方的东方甲乙木。]],
  exit = {
    w = { to = '桃花岛四象', },
    d = { to = '桃花岛木', ignore  = true, },
    hidden = { to = '桃花岛木', cost = 2, handler = 'thd_sixiang', },
  },
},

['桃花岛金'] = {
  id = '桃花岛金',
  area = '桃花岛',
  name = '金',
  desc =  [[这里是五行层的金，你一走下来，往上的铁梯就被撤掉了。五行层的构局互相连通，进入后就迷失了方向。每一行与其他四行的关系是生、被生、克、被克。]],
  exit = {
    shui = { to = '桃花岛水', },
    huo = { to = '桃花岛火', },
    mu = { to = '桃花岛木', },
    tu = { to = '桃花岛土', },
    hidden = { to = '桃花岛石坟', cost = 6, handler = 'thd_wuxing', },
  },
},

['桃花岛木'] = {
  id = '桃花岛木',
  area = '桃花岛',
  name = '木',
  desc =  [[这里是五行层的木，你一走下来，往上的铁梯就被撤掉了。五行层的构局互相连通，进入后就迷失了方向。每一行与其他四行的关系是生、被生、克、被克。]],
  exit = {
    shui = { to = '桃花岛水', },
    huo = { to = '桃花岛火', },
    jin = { to = '桃花岛金', },
    tu = { to = '桃花岛土', },
    hidden = { to = '桃花岛石坟', cost = 6, handler = 'thd_wuxing', },
  },
},

['桃花岛水'] = {
  id = '桃花岛水',
  area = '桃花岛',
  name = '水',
  desc =  [[这里是五行层的水，你一走下来，往上的铁梯就被撤掉了。五行层的构局互相连通，进入后就迷失了方向。每一行与其他四行的关系是生、被生、克、被克。]],
  exit = {
    mu = { to = '桃花岛木', },
    huo = { to = '桃花岛火', },
    jin = { to = '桃花岛金', },
    tu = { to = '桃花岛土', },
    hidden = { to = '桃花岛石坟', cost = 6, handler = 'thd_wuxing', },
  },
},

['桃花岛火'] = {
  id = '桃花岛火',
  area = '桃花岛',
  name = '火',
  desc =  [[这里是五行层的火，你一走下来，往上的铁梯就被撤掉了。五行层的构局互相连通，进入后就迷失了方向。每一行与其他四行的关系是生、被生、克、被克。]],
  exit = {
    mu = { to = '桃花岛木', },
    shui = { to = '桃花岛水', },
    jin = { to = '桃花岛金', },
    tu = { to = '桃花岛土', },
    hidden = { to = '桃花岛石坟', cost = 6, handler = 'thd_wuxing', },
  },
},

['桃花岛土'] = {
  id = '桃花岛土',
  area = '桃花岛',
  name = '土',
  desc =  [[这里是五行层的土，你一走下来，往上的铁梯就被撤掉了。五行层的构局互相连通，进入后就迷失了方向。每一行与其他四行的关系是生、被生、克、被克。]],
  exit = {
    mu = { to = '桃花岛木', },
    shui = { to = '桃花岛水', },
    jin = { to = '桃花岛金', },
    huo = { to = '桃花岛火', },
    hidden = { to = '桃花岛石坟', cost = 6, handler = 'thd_wuxing', },
  },
},

['桃花岛石坟'] = {
  id = '桃花岛石坟',
  area = '桃花岛',
  name = '石坟',
  desc =  [[从幽暗的高台迷阵中走出来，只见绿草如荫，中间是一片白色花丛,重重叠叠，宛如一座白花堆成的小湖。白花之中有一块东西高高隆起，走近了才发现是一座石坟，坟前有一块墓碑(mubei)。]],
  exit = {
    e = { to = '桃花岛桃花阵', ignore = true, },
    w = { to = '桃花岛桃花阵', ignore = true, },
    s = { to = '桃花岛桃花阵', ignore = true, },
    n = { to = '桃花岛桃花阵', cond = 'player.party == "桃花岛" and ( not player.skill["奇门八卦"] or player.skill["奇门八卦"].level < 20 ) or ( player.party ~= "桃花岛" and ( not player.skill["奇门八卦"] or player.skill["奇门八卦"].level <= 130 ) )', },
    hidden1 = { to = '桃花岛山冈', cmd = 'n', cond = 'player.party == "桃花岛" and player.skill["奇门八卦"] and player.skill["奇门八卦"].level >= 20 or ( player.skill["奇门八卦"] and player.skill["奇门八卦"].level > 130 )', },
    hidden2 = { to = '桃花岛墓道#1', cmd = 'kneel mubei;#3 push mubei left;#3 push mubei right', },
  },
},

['桃花岛墓道#1'] = {
  id = '桃花岛墓道#1',
  area = '桃花岛',
  name = '墓道',
  desc =  [[这是一条通往墓室的通道，两旁尽是古玩珍宝。]],
  exit = {
    out = { to = '桃花岛石坟', },
    d = { to = '桃花岛墓道#M', },
  },
},

['桃花岛墓道#M'] = {
  id = '桃花岛墓道#M',
  area = '桃花岛',
  name = '墓道',
  desc =  [[这是一条通往墓室的通道，两旁尽是古玩珍宝。通道四面八方的伸展，高低不平，你看得头昏脑胀。]],
  exit = {
    u = { to = '桃花岛墓道#1', },
    e = { to = '桃花岛墓道#M', },
    w = { to = '桃花岛墓道#M', },
    s = { to = '桃花岛墓道#M', },
    n = { to = '桃花岛墓道#M', },
    ne = { to = '桃花岛墓道#M', },
    nw = { to = '桃花岛墓道#M', },
    se = { to = '桃花岛墓道#M', },
    sw = { to = '桃花岛墓道#M', },
    su = { to = '桃花岛墓道#M', },
    sd = { to = '桃花岛墓道#M', },
    nu = { to = '桃花岛墓道#M', },
    nd = { to = '桃花岛墓道#M', },
    hidden = { to = '桃花岛墓道#2', handler = 'thd_mudao', cost = 2, },
  },
},

['桃花岛墓道#2'] = {
  id = '桃花岛墓道#2',
  area = '桃花岛',
  name = '墓道',
  desc =  [[这是一条通往墓室的通道，两旁尽是古玩珍宝。通道四面八方的伸展，高低不平，你看得头昏脑胀。]],
  exit = {
    d = { to = '桃花岛墓中圹室', cond = 'player.flag["守墓"]', },
    e = { to = '桃花岛墓道#M', unstable = true, ignore = true, },
    w = { to = '桃花岛墓道#M', unstable = true, ignore = true, },
    s = { to = '桃花岛墓道#M', unstable = true, ignore = true, },
    n = { to = '桃花岛墓道#M', unstable = true, ignore = true, },
    ne = { to = '桃花岛墓道#M', unstable = true, ignore = true, },
    nw = { to = '桃花岛墓道#M', unstable = true, ignore = true, },
    se = { to = '桃花岛墓道#M', unstable = true, ignore = true, },
    sw = { to = '桃花岛墓道#M', unstable = true, ignore = true, },
    su = { to = '桃花岛墓道#M', unstable = true, ignore = true, },
    sd = { to = '桃花岛墓道#M', unstable = true, ignore = true, },
    nu = { to = '桃花岛墓道#M', unstable = true, ignore = true, },
    nd = { to = '桃花岛墓道#M', unstable = true, ignore = true, },
    hidden = { to = '桃花岛墓道#M', handler = 'thd_mudao_up', },
  },
},

['桃花岛墓中圹室'] = {
  id = '桃花岛墓中圹室',
  area = '桃花岛',
  name = '墓中圹室',
  desc =  [[这里就是墓中圹室。圹室中壁间案头尽是古物珍玩、名画法书，没一件不是价值连城的精品。墙头有一盏翡翠灯，只见那些明珠美玉、翡翠玛瑙之属在灯光下发出淡淡光芒。墙上挂着一副青年少妇的画像，旁边有一张毡帷，后面有一具玉棺。]],
  exit = {
    u = { to = '桃花岛墓道#2', },
  },
},

['桃花岛山冈'] = {
  id = '桃花岛山冈',
  area = '桃花岛',
  name = '山冈',
  desc =  [[这里是一个光秃秃的山冈，岩石丛立，但似乎每一块石头都有人精心布置过似的，和东、西和南三面的桃花阵组成了一个整体，足见岛上的主人熟通阴阳五行、变化生克之理。北面是一片草地。]],
  exit = {
    e = { to = '桃花岛八卦桃花阵', handler = 'thd_bagua', cond = 'not player.skill["奇门八卦"] or player.skill["奇门八卦"].level < 200', },
    s = { to = '桃花岛桃花阵', cond = 'player.party == "桃花岛" and ( not player.skill["奇门八卦"] or player.skill["奇门八卦"].level < 20 ) or ( player.party ~= "桃花岛" and ( not player.skill["奇门八卦"] or player.skill["奇门八卦"].level <= 130 ) )', },
    w = { to = '桃花岛八卦桃花阵', handler = 'thd_bagua', cond = 'not player.skill["奇门八卦"] or player.skill["奇门八卦"].level < 200', },
    n = { to = '桃花岛草地', },
    hidden = { to = '桃花岛洞口', cmd = 'e', cond = 'player.skill["奇门八卦"] and player.skill["奇门八卦"].level >= 200', },
  },
},

['桃花岛八卦桃花阵'] = {
  id = '桃花岛八卦桃花阵',
  area = '桃花岛',
  name = '八卦桃花阵',
  desc = { [[这是一片茂密的桃花丛，你一走进来就迷失了方向。眼前是一排桃花树，密密地没有一丝缝隙。]], [[这是一片茂密的桃花丛，你一走进来就迷失了方向。眼前是一排桃花树，中间露出一条小径。]] },
  exit = {
    e = { to = '桃花岛八卦桃花阵', },
    s = { to = '桃花岛八卦桃花阵', },
    w = { to = '桃花岛八卦桃花阵', },
    n = { to = '桃花岛八卦桃花阵', },
    hidden = { to = '桃花岛洞口', cost = 24, handler = 'thd_bagua', },
  },
},

['桃花岛洞口'] = {
  id = '桃花岛洞口',
  area = '桃花岛',
  name = '洞口',
  desc = [[在桃花丛里居然安排了这么一个岩洞，可见岛主用心之巧。岩洞周围全是桃花，而向洞里看，黑乎乎地什么也看不见。]],
  exit = {
    enter = { to = '桃花岛岩洞', },
    n = { to = '桃花岛桃花阵', ignore = true, },
    e = { to = '桃花岛桃花阵', ignore = true, },
    w = { to = '桃花岛桃花阵', ignore = true, },
    s = { to = '桃花岛桃花阵', cond = 'player.party == "桃花岛" and ( not player.skill["奇门八卦"] or player.skill["奇门八卦"].level < 20 ) or ( player.party ~= "桃花岛" and ( not player.skill["奇门八卦"] or player.skill["奇门八卦"].level <= 130 ) )', },
    hidden = { to = '桃花岛山冈', cmd = 's', cond = 'player.party == "桃花岛" and player.skill["奇门八卦"] and player.skill["奇门八卦"].level >= 20 or ( player.skill["奇门八卦"] and player.skill["奇门八卦"].level > 130 )', },
  },
},

['桃花岛岩洞'] = {
  id = '桃花岛岩洞',
  area = '桃花岛',
  name = '岩洞',
  desc = [[这是一个山壁上的小岩洞，虽然不甚宽敞，但也有足够的活动空间。阳光透过桃树间的缝隙射了进来，映得洞中半明半暗。靠里的洞壁上依稀写有一行小字(zi)。]],
  exit = {
    out = { to = '桃花岛洞口', },
  },
},

['桃花岛草地'] = {
  id = '桃花岛草地',
  area = '桃花岛',
  name = '草地',
  desc =  [[一片绿油油的草地映入你的眼帘，你顿时感到周围笼罩着一股清新的气氛。西面有一座桐木搭成的亭子，北面满是竹林密布，而东面则是一条光秃秃的山路，看不清究竟通向哪里。]],
  exit = {
    s = { to = '桃花岛山冈', },
    eu = { to = '桃花岛试剑峰山脚', },
    w = { to = '桃花岛试剑亭', },
    n = { to = '桃花岛绿竹林#1', cond = 'player.party == "桃花岛" and ( not player.skill["奇门八卦"] or player.skill["奇门八卦"].level <= 80 ) or ( player.party ~= "桃花岛" and ( not player.skill["奇门八卦"] or player.skill["奇门八卦"].level <= 150 ) )', handler = 'simple_path_set_pos', },
    hidden = { to = '桃花岛积翠亭', cmd = 'n', cond = 'player.party == "桃花岛" and player.skill["奇门八卦"] and player.skill["奇门八卦"].level > 80 or ( player.skill["奇门八卦"] and player.skill["奇门八卦"].level > 150 )', },
  },
},

['桃花岛绿竹林#1'] = {
  id = '桃花岛绿竹林#1',
  area = '桃花岛',
  name = '绿竹林',
  desc =  [[这里是一片郁郁葱葱的绿竹林，你似乎迷失了方向，象没头苍蝇般到处乱闯。]],
  exit = {
    e = { to = '桃花岛绿竹林#1', },
    w = { to = '桃花岛绿竹林#1', },
    n = { to = '桃花岛绿竹林#1', },
    s = { to = '桃花岛绿竹林#1', },
    s2 = { to = '桃花岛草地', ignore = true, },
    s3 = { to = '桃花岛积翠亭', ignore = true, },
    hidden = { to = '桃花岛积翠亭', cost = 13, handler = 'simple_path', },
  },
},

['桃花岛试剑亭'] = {
  id = '桃花岛试剑亭',
  area = '桃花岛',
  name = '试剑亭',
  desc =  [[这是一座精巧的亭子，上方挂着一个匾牌(bian)。亭中央有一块巨石，上面满是剑痕。石上刻着三个大字，但被剑痕划的已经看不清楚了。亭子的北边有一间客房。]],
  exit = {
    e = { to = '桃花岛草地', },
    n = { to = '桃花岛客房#1', },
  },
},

['桃花岛客房#1'] = {
  id = '桃花岛客房#1',
  area = '桃花岛',
  name = '客房',
  desc =  [[这是招待客人住宿的房间。室内陈设精雅，两床相对，枕衾雅洁。]],
  exit = {
    s = { to = '桃花岛试剑亭', },
  },
},

['桃花岛试剑峰山脚'] = {
  id = '桃花岛试剑峰山脚',
  area = '桃花岛',
  name = '试剑峰山脚',
  desc =  [[这里是试剑峰的山脚下，只见山峰高耸入云，半山腰处便有云雾团绕，要想爬上去实在要费一番功夫。]],
  exit = {
    u = { to = '桃花岛山路#1', },
    wd = { to = '桃花岛草地', },
  },
},

['桃花岛山路#1'] = {
  id = '桃花岛山路#1',
  area = '桃花岛',
  name = '山路',
  desc =  [[这条光秃秃的山路上什么也没有，直通向试剑峰的半山腰。]],
  exit = {
    nu = { to = '桃花岛山路#2', },
    d = { to = '桃花岛试剑峰山脚', },
  },
},

['桃花岛山路#2'] = {
  id = '桃花岛山路#2',
  area = '桃花岛',
  name = '山路',
  desc =  [[这条光秃秃的山路上什么也没有，直通向试剑峰的半山腰。]],
  exit = {
    sd = { to = '桃花岛山路#1', },
    eu = { to = '桃花岛半山腰', },
  },
},

['桃花岛半山腰'] = {
  id = '桃花岛半山腰',
  area = '桃花岛',
  name = '半山腰',
  desc =  [[爬上半山腰，你只觉寒气逼人，脚下也有一团云雾环绕。]],
  exit = {
    wd = { to = '桃花岛山路#2', },
    eu = { to = '桃花岛断崖', },
  },
},

['桃花岛断崖'] = {
  id = '桃花岛断崖',
  area = '桃花岛',
  name = '断崖',
  desc =  [[你向前奔了一阵，发现了这个断崖，已无路可走。]],
  exit = {
    wd = { to = '桃花岛半山腰', },
    hidden = { to = '桃花岛试剑峰顶', cmd = 'yue ya', cond = 'player.enable.dodge and player.enable.dodge.level >= 100 and player.encumbrance <= 20', },
  },
},

['桃花岛试剑峰顶'] = {
  id = '桃花岛试剑峰顶',
  area = '桃花岛',
  name = '试剑峰顶',
  desc =  [[这里就是试剑峰的峰顶，这里岩石林立，绝险之极，要想回去，又是难度之极。但俯身向下望去，整个桃花岛一览无余。]],
  exit = {
    hidden = { to = '桃花岛断崖', cmd = 'yue ya', cond = 'player.enable.dodge and player.enable.dodge.level >= 100 and player.encumbrance <= 20', },
  },
},

['桃花岛积翠亭'] = {
  id = '桃花岛积翠亭',
  area = '桃花岛',
  name = '积翠亭',
  desc = [[这是座竹枝搭成的凉亭，亭中放着竹台竹椅，全是多年之物，用得久了，现出淡淡黄光，两旁悬着一副对联(duilian)。东面不远就是招待上岛客人的客房，南北两面都是郁郁葱葱的绿竹林。]],
  exit = {
    e = { to = '桃花岛客房#2', },
    enter = { to = '桃花岛箫房', no_wander = true, },
    n = { to = '桃花岛绿竹林#2', cond = 'player.party == "桃花岛" and ( not player.skill["奇门八卦"] or player.skill["奇门八卦"].level <= 80 ) or ( player.party ~= "桃花岛" and ( not player.skill["奇门八卦"] or player.skill["奇门八卦"].level <= 150 ) )', },
    s = { to = '桃花岛绿竹林#3', cond = 'player.party == "桃花岛" and ( not player.skill["奇门八卦"] or player.skill["奇门八卦"].level <= 80 ) or ( player.party ~= "桃花岛" and ( not player.skill["奇门八卦"] or player.skill["奇门八卦"].level <= 150 ) )', handler = 'simple_path_set_pos', },
    hidden1 = { to = '桃花岛海滨', cmd = 'ask huang about 离岛', },
    hidden2 = { to = '桃花岛河塘', cmd = 'n', cond = 'player.party == "桃花岛" and player.skill["奇门八卦"] and player.skill["奇门八卦"].level > 80 or ( player.skill["奇门八卦"] and player.skill["奇门八卦"].level > 150 )', },
    hidden3 = { to = '桃花岛草地', cmd = 's', cond = 'player.party == "桃花岛" and player.skill["奇门八卦"] and player.skill["奇门八卦"].level > 80 or ( player.skill["奇门八卦"] and player.skill["奇门八卦"].level > 150 )', },
  },
},

['桃花岛箫房'] = {
  id = '桃花岛箫房',
  area = '桃花岛',
  name = '箫房',
  desc =  [[这里是桃花岛的一个小房间，放着一些乐器和兵器。]],
  exit = {
    out = { to = '桃花岛积翠亭', },
  },
},

['桃花岛绿竹林#2'] = {
  id = '桃花岛绿竹林#2',
  area = '桃花岛',
  name = '绿竹林',
  desc =  [[这里是一片郁郁葱葱的绿竹林，你似乎迷失了方向，象没头苍蝇般到处乱闯。]],
  exit = {
    e = { to = '桃花岛绿竹林#2', },
    w = { to = '桃花岛绿竹林#2', },
    s = { to = '桃花岛绿竹林#2', },
    n = { to = '桃花岛绿竹林#2', },
    n2 = { to = '桃花岛河塘', ignore = true, },
    hidden = { to = '桃花岛河塘', cost = 20, handler = 'breadcrumb', },
  },
},

['桃花岛绿竹林#3'] = {
  id = '桃花岛绿竹林#3',
  area = '桃花岛',
  name = '绿竹林',
  desc =  [[这里是一片郁郁葱葱的绿竹林，你似乎迷失了方向，象没头苍蝇般到处乱闯。]],
  exit = {
    e = { to = '桃花岛绿竹林#3', },
    w = { to = '桃花岛绿竹林#3', },
    n = { to = '桃花岛绿竹林#3', },
    s = { to = '桃花岛绿竹林#3', },
    s2 = { to = '桃花岛草地', ignore = true, },
    hidden = { to = '桃花岛草地', cost = 5, handler = 'simple_path', },
  },
},

['桃花岛客房#2'] = {
  id = '桃花岛客房#2',
  area = '桃花岛',
  name = '客房',
  desc = [[这是招待客人住宿的房间。室内陈设精雅，两床相对，枕衾雅洁。]],
  exit = {
    w = { to = '桃花岛积翠亭', },
  },
},

['桃花岛河塘'] = {
  id = '桃花岛河塘',
  area = '桃花岛',
  name = '河塘',
  desc = [[你曲曲折折的转出竹林，眼前出现一大片荷塘。塘中白莲盛放，清香阵阵，莲叶田田，一条小石堤穿过荷塘中央。]],
  exit = {
    n = { to = '桃花岛小石堤', },
    s = { to = '桃花岛绿竹林#1', cond = 'player.party == "桃花岛" and ( not player.skill["奇门八卦"] or player.skill["奇门八卦"].level <= 80 ) or ( player.party ~= "桃花岛" and ( not player.skill["奇门八卦"] or player.skill["奇门八卦"].level <= 150 ) )', handler = 'simple_path_set_pos', },
    s2 = { to = '桃花岛绿竹林#3', cmd = 's', cond = 'player.party == "桃花岛" and ( not player.skill["奇门八卦"] or player.skill["奇门八卦"].level <= 80 ) or ( player.party ~= "桃花岛" and ( not player.skill["奇门八卦"] or player.skill["奇门八卦"].level <= 150 ) )', handler = 'simple_path_set_pos', },
    hidden = { to = '桃花岛积翠亭', cmd = 's', cond = 'player.party == "桃花岛" and player.skill["奇门八卦"] and player.skill["奇门八卦"].level > 80 or ( player.skill["奇门八卦"] and player.skill["奇门八卦"].level > 150 )', },
  },
},

['桃花岛小石堤'] = {
  id = '桃花岛小石堤',
  area = '桃花岛',
  name = '小石堤',
  desc = [[你踏上小石堤，缓缓而行，两旁荷叶田田，发出清香阵阵。北面不远处有一座屋子。]],
  exit = {
    s = { to = '桃花岛河塘', },
    n = { to = '桃花岛石路', },
  },
},

['桃花岛石路'] = {
  id = '桃花岛石路',
  area = '桃花岛',
  name = '石路',
  desc = [[你踏过小石堤，立时一座精舍映入眼帘,屋外攀满了青藤。东面是一间书房，而西面则是一座方厅。]],
  exit = {
    e = { to = '桃花岛书房', },
    s = { to = '桃花岛小石堤', },
    w = { to = '桃花岛方厅', },
    n = { to = '桃花岛精舍', },
  },
},

['桃花岛书房'] = {
  id = '桃花岛书房',
  area = '桃花岛',
  name = '书房',
  desc = [[这里是黄药师读书的地方。窗明几净，一尘不染。一张古意盎然的书案放在房间正中，案上摆着几本翻开了的线装书籍。]],
  exit = {
    w = { to = '桃花岛石路', },
  },
},

['桃花岛精舍'] = {
  id = '桃花岛精舍',
  area = '桃花岛',
  name = '精舍',
  desc = [[这是桃花岛主黄药师的书房。整间屋子全是以不刨皮的松树搭成，屋中满是诗经典籍玉器古玩。屋边摆着一张桌子(zhuozi)。西边的墙壁上挂着一幅淡墨山水。]],
  exit = {
    s = { to = '桃花岛石路', },
    enter = { to = '桃花岛炼丹房', door = 'press table', },
  },
},

['桃花岛炼丹房'] = {
  id = '桃花岛炼丹房',
  area = '桃花岛',
  name = '炼丹房',
  desc =  [[这是桃花岛主黄药师的秘密练丹房。]],
  exit = {
    out = { to = '桃花岛精舍', },
  },
},

['桃花岛方厅'] = {
  id = '桃花岛方厅',
  area = '桃花岛',
  name = '方厅',
  desc = [[这是一间非常宽敞的方厅。墙上挂着许多的名人字画，个个都是海内罕见的精品。而在门楣之上钉着八片铁片， 排作八卦(bagua)图案，却又不似寻常的八卦那么排的整齐，疏疏落落，歪斜不称，显然与四周的布置极不协调。南面是一座小亭子。]],
  exit = {
    w = { to = '桃花岛回廊#1', },
    e = { to = '桃花岛石路', handler = 'prelook_bagua', },
  },
},

['桃花岛回廊#1'] = {
  id = '桃花岛回廊#1',
  area = '桃花岛',
  name = '回廊',
  desc = [[一条连接大厅和内室的回廊。北边通往内室，西边通向练武场。]],
  exit = {
    e = { to = '桃花岛方厅', },
    w = { to = '桃花岛回廊#2', },
    n = { to = '桃花岛回廊#3', },
  },
},

['桃花岛回廊#2'] = {
  id = '桃花岛回廊#2',
  area = '桃花岛',
  name = '回廊',
  desc = [[一条连接大厅和练武场的回廊。]],
  exit = {
    w = { to = '桃花岛练武场', cond = 'player.party == "桃花岛"', },
    e = { to = '桃花岛回廊#1', },
  },
},

['桃花岛练武场'] = {
  id = '桃花岛练武场',
  area = '桃花岛',
  name = '练武场',
  desc = [[这是供桃花岛上弟子们练功的场子。场边摆了两排兵器架，上面插着各种兵器，最多的还是各式各样的剑。在场子正中竖着一根很高的木桩(zhuang)，看起来象是练功用的。北边是男弟子休息室，而南边则是女弟子休息室。西边是弟子们吃饭和喝茶的地方。]],
  exit = {
    e = { to = '桃花岛回廊#2', },
    s = { to = '桃花岛女休息室', cond = 'player.gender == "female"', },
    w = { to = '桃花岛饭厅#1', },
    n = { to = '桃花岛男休息室', cond = 'player.gender == "male"', },
  },
},

['桃花岛饭厅#1'] = {
  id = '桃花岛饭厅#1',
  area = '桃花岛',
  name = '饭厅',
  desc = [[这是桃花岛弟子们每日吃饭的地方，饭菜的香味充溢着整个房间。屋里摆着一张大桌子(table)和一些椅子(chair)。屋中站着几个哑仆。]],
  exit = {
    e = { to = '桃花岛练武场', },
    w = { to = '桃花岛茶房', },
    n = { to = '桃花岛厨房#1', },
  },
},

['桃花岛茶房'] = {
  id = '桃花岛茶房',
  area = '桃花岛',
  name = '茶房',
  desc = [[这是桃花岛弟子们喝茶休息的地方，满屋的茶香，沁人心脾。屋里摆着几张桌子(table)和椅子(chair)，坐着几个正在喝茶聊天的男女弟子。屋中有几个哑仆正在忙着为大家上茶。]],
  exit = {
    e = { to = '桃花岛饭厅#1', },
  },
},

['桃花岛厨房#1'] = {
  id = '桃花岛厨房#1',
  area = '桃花岛',
  name = '厨房',
  desc = [[这是给桃花岛弟子们做饭用的厨房，供应弟子们每日的饭食。屋中充斥着青菜和调料的味道。几个厨师正在忙碌着。偶尔会有些吃不完的主食和做菜时剩下的猪肉留在这里。]],
  exit = {
    s = { to = '桃花岛饭厅#1', },
  },
},

['桃花岛男休息室'] = {
  id = '桃花岛男休息室',
  area = '桃花岛',
  name = '男休息室',
  desc = [[这是桃花岛上男弟子们的休息室，房内有几张大床，供男弟子们临时休息用。]],
  exit = {
    s = { to = '桃花岛练武场', },
  },
},

['桃花岛女休息室'] = {
  id = '桃花岛女休息室',
  area = '桃花岛',
  name = '女休息室',
  desc = [[这是桃花岛上女弟子们的休息室，房内有几张大床，供女弟子们临时休息用。]],
  exit = {
    n = { to = '桃花岛练武场', },
  },
},

['桃花岛回廊#3'] = {
  id = '桃花岛回廊#3',
  area = '桃花岛',
  name = '回廊',
  desc = [[一条连接大厅和内室的回廊。]],
  exit = {
    s = { to = '桃花岛回廊#1', },
    n = { to = '桃花岛内室#1', },
  },
},

['桃花岛内室#1'] = {
  id = '桃花岛内室#1',
  area = '桃花岛',
  name = '内室',
  desc = [[这是一间小房间，连接着饭厅和卧室。]],
  exit = {
    e = { to = '桃花岛卧室#1', },
    s = { to = '桃花岛回廊#3', },
    w = { to = '桃花岛饭厅#2', },
    n = { to = '桃花岛内室#2', },
  },
},

['桃花岛卧室#1'] = {
  id = '桃花岛卧室#1',
  area = '桃花岛',
  name = '卧室',
  desc = [[这是一间布置得很整齐的卧室。]],
  exit = {
    w = { to = '桃花岛内室#1', },
  },
},

['桃花岛饭厅#2'] = {
  id = '桃花岛饭厅#2',
  area = '桃花岛',
  name = '饭厅',
  desc = [[这是黄药师一家人吃饭的地方。]],
  exit = {
    e = { to = '桃花岛内室#1', },
    n = { to = '桃花岛厨房#2', },
  },
},

['桃花岛厨房#2'] = {
  id = '桃花岛厨房#2',
  area = '桃花岛',
  name = '厨房',
  desc = [[这是桃花岛的厨房。黄药师不知使用了什么方法抓了几个御厨来，正在忙碌着。屋中充斥着青菜和调料的味道。几个厨师正在忙碌着。偶尔会有些吃不完的主食和做菜时剩下的猪肉留在这里。]],
  exit = {
    e = { to = '桃花岛内室#2', },
    s = { to = '桃花岛饭厅#2', },
  },
},

['桃花岛内室#2'] = {
  id = '桃花岛内室#2',
  area = '桃花岛',
  name = '内室',
  desc = [[这是一间小房间，连接着厨房和卧室。]],
  exit = {
    e = { to = '桃花岛卧室#2', },
    w = { to = '桃花岛厨房#2', },
    s = { to = '桃花岛内室#1', },
  },
},

['桃花岛卧室#2'] = {
  id = '桃花岛卧室#2',
  area = '桃花岛',
  name = '卧室',
  desc = [[这是一间布置得很整齐的卧室。]],
  exit = {
    w = { to = '桃花岛内室#2', },
  },
},

['沧州城厅堂'] = {
  id = '沧州城厅堂',
  area = '沧州城',
  name = '厅堂',
  desc =  [[这是这废园里一间快倒塌的厅堂，说是厅堂，倒不如说是草棚子。门口的两个柱子已经歪歪斜斜，用一些细木桩支撑着。墙上到处都是烟熏火燎的黑乎乎痕迹。墙角堆着几块大石头，旁边有口水缸。一个烂席子铺在了地当中，上面放着几个凉馒头。]],
  exit = {
    out = { to = '沧州城废园', },
  },
},

['沧州城官道#4'] = {
  id = '沧州城官道#4',
  area = '沧州城',
  name = '官道',
  desc =  [[你走在一条尘土飞扬的大驿道上。四周人来人往。挑担子的行商，赶着大车的马夫，上京赶考的书生，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。道路两旁是整整齐齐的杨树林。]],
  exit = {
    nw = { to = '沧州城官道#3', },
    s = { to = '黄河流域大渡口#N', },
  },
},

['沧州城驿道#2'] = {
  id = '沧州城驿道#2',
  area = '沧州城',
  name = '驿道',
  desc =  [[你走在一条尘土飞扬的大驿道上。四周人来人往。挑担子的行商，赶着大车的马夫，上京赶考的书生，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。道路两旁是整整齐齐的杨树林。]],
  exit = {
    e = { to = '沧州城驿道#1', },
    sw = { to = '沧州城驿道#3', },
  },
},

['沧州城驿道#1'] = {
  id = '沧州城驿道#1',
  area = '沧州城',
  name = '驿道',
  desc =  [[你走在一条尘土飞扬的大驿道上。四周人来人往。挑担子的行商，赶着大车的马夫，上京赶考的书生，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。道路两旁是整整齐齐的杨树林。]],
  exit = {
    w = { to = '沧州城驿道#2', },
    e = { to = '沧州城西门', },
  },
},

['沧州城北街#2'] = {
  id = '沧州城北街#2',
  area = '沧州城',
  name = '北街',
  desc =  [[沧州城北街，到了这里，风渐渐的小了一点。行人也开始渐渐的多了。在路东有一幢正在施工的房子，西边是沧州府衙。]],
  exit = {
    e = { to = '沧州城工地', },
    s = { to = '沧州城北街#1', },
    w = { to = '沧州城沧州府衙', },
    n = { to = '沧州城北街#3', },
  },
},

['沧州城西门'] = {
  id = '沧州城西门',
  area = '沧州城',
  name = '西门',
  desc =  [[这是西城门，几年前曾经遭到土匪的攻打，因此显得有些破败。城门正上方勉勉强强可以认出“西门”两个大字。这里是罪犯逃往西域的必经之地，官兵们戒备森严，动不动就截住行人盘问。一条笔直的青石板大道向东西两边延伸。]],
  exit = {
    w = { to = '沧州城驿道#1', },
    e = { to = '沧州城西街', },
  },
},

['沧州城客房'] = {
  id = '沧州城客房',
  area = '沧州城',
  name = '客房',
  desc =  [[这是一间很大的客房，陈设十分简陋。靠墙放了十几张小木床，不少客人正和衣而卧，满屋子都是呼呼的打酣声。西边有张床是空的，你蹑手蹑脚地走了过去。]],
  exit = {
    out = { to = '沧州城客栈二楼', },
  },
},

['沧州城大客栈'] = {
  id = '沧州城大客栈',
  area = '沧州城',
  name = '大客栈',
  desc =  [[这里是就是沧州客栈。传说这家客栈是直隶最大的客店的老板原来是一名江湖上的高人，自从退隐江湖后，开了这家客栈，江湖中人路过这里都会在这个客栈投宿一晚，既是给这位高人一个面子，表示我来探望过你了，也顺便照顾生意。客栈的一楼是个酒楼，很多人在打尖吃饭，二楼就是住宿的地方了。门上的横匾上写了四个金字“沧州大客栈”。]],
  exit = {
    u = { to = '沧州城客栈二楼', no_wander = true, },
    s = { to = '沧州城南街', },
    n = { to = '沧州城北街#1', },
  },
},

['沧州城官道#2'] = {
  id = '沧州城官道#2',
  area = '沧州城',
  name = '官道',
  desc =  [[你走在一条尘土飞扬的大驿道上。四周人来人往。挑担子的行商，赶着大车的马夫，上京赶考的书生，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。道路两旁是整整齐齐的杨树林。]],
  exit = {
    se = { to = '沧州城官道#3', },
    n = { to = '沧州城官道#1', },
  },
},

['沧州城工地'] = {
  id = '沧州城工地',
  area = '沧州城',
  name = '工地',
  desc =  [[这是一块正在建筑中的工地。据说是新任的知府的宅院。工地人来人往忙忙碌碌，很是热闹。]],
  exit = {
    w = { to = '沧州城北街#2', },
  },
},

['沧州城客栈二楼'] = {
  id = '沧州城客栈二楼',
  area = '沧州城',
  name = '客栈二楼',
  desc =  [[这里是沧州大客栈的二楼，和楼下不同是这里只管住宿不管吃生意非常兴隆。武林中人到了此地多选择这里落脚，店小二里里外外忙得团团转，接待着南腔北调的客人。着一个牌子(paizi)。]],
  exit = {
    enter = { to = '沧州城客房', },
    d = { to = '沧州城大客栈', },
  },
},

['沧州城驿道#4'] = {
  id = '沧州城驿道#4',
  area = '沧州城',
  name = '驿道',
  desc =  [[你走在一条尘土飞扬的大驿道上。四周人来人往。挑担子的行商，赶着大车的马夫，上京赶考的书生，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。道路两旁是整整齐齐的杨树林。]],
  exit = {
    nw = { to = '沧州城路口', },
    e = { to = '沧州城驿道#3', },
  },
},

['沧州城米行'] = {
  id = '沧州城米行',
  area = '沧州城',
  name = '米行',
  desc =  [[这里米行，大担小斗堆满了一地，都是各种米。掌柜懒洋洋地躺在一只躺椅上，伙计忙着招呼着客人。]],
  exit = {
    e = { to = '沧州城北街#3', },
    s = { to = '沧州城仓库', },
  },
},

['沧州城大驿道#4'] = {
  id = '沧州城大驿道#4',
  area = '沧州城',
  name = '大驿道',
  desc =  [[你走在一条尘土飞扬的大驿道上。四周人来人往。挑担子的行商，赶着大车的马夫，上京赶考的书生，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。道路两旁是整整齐齐的杨树林。]],
  exit = {
    ne = { to = '塘沽城大驿道#4', },
    sw = { to = '沧州城大驿道#3', },
  },
},

['沧州城北街#1'] = {
  id = '沧州城北街#1',
  area = '沧州城',
  name = '北街',
  desc =  [[沧州城北街，到了这里，风几乎已经完全停下。向南就到了最热闹的沧州大客栈了。那里来来往往的每天都有许多人，街的左边是个民居。]],
  exit = {
    s = { to = '沧州城大客栈', },
    se = { to = '沧州城东街', },
    e = { to = '沧州城废园', },
    sw = { to = '沧州城西街', },
    w = { to = '沧州城民居', },
    n = { to = '沧州城北街#2', },
  },
},

['沧州城驿站'] = {
  id = '沧州城驿站',
  area = '沧州城',
  name = '驿站',
  desc =  [[这是沧州驿站，负责传送和京城里的往来公文。每天快马三匹，早午晚各传递书信三次。不管你的书信要寄到哪里，只要放到这里，一天之内绝对可以送到。]],
  exit = {
    s = { to = '沧州城西街', },
  },
},

['沧州城大驿道#2'] = {
  id = '沧州城大驿道#2',
  area = '沧州城',
  name = '大驿道',
  desc =  [[你走在一条尘土飞扬的大驿道上。四周人来人往。挑担子的行商，赶着大车的马夫，上京赶考的书生，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。道路两旁是整整齐齐的杨树林。]],
  exit = {
    ne = { to = '沧州城大驿道#3', },
    w = { to = '沧州城大驿道#1', },
  },
},

['沧州城东门'] = {
  id = '沧州城东门',
  area = '沧州城',
  name = '东门',
  desc =  [[这是东城门，城门正上方刻着“东门”两个楷书大字，城墙上贴着几张官府告示(gaoshi)。官兵们警惕地注视着过往行人，你最好小心为妙。一条笔直的青石板大道向东西两边延伸。城外的郊野里有一片树林。]],
  exit = {
    w = { to = '沧州城东街', },
    e = { to = '沧州城大驿道#1', },
  },
},

['沧州城南街'] = {
  id = '沧州城南街',
  area = '沧州城',
  name = '南街',
  desc =  [[沧州城南街，这是一条宽阔的青石板街道，向南北两头延伸。人来人往，十分热闹。东面是一家花店，西面是一家戏园子。]],
  exit = {
    ne = { to = '沧州城东街', },
    s = { to = '沧州城南门', },
    e = { to = '沧州城花店', },
    w = { to = '沧州城戏园', },
    nw = { to = '沧州城西街', },
    n = { to = '沧州城大客栈', },
  },
},

['沧州城大驿道#1'] = {
  id = '沧州城大驿道#1',
  area = '沧州城',
  name = '大驿道',
  desc =  [[你走在一条尘土飞扬的大驿道上。四周人来人往。挑担子的行商，赶着大车的马夫，上京赶考的书生，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。道路两旁是整整齐齐的杨树林。]],
  exit = {
    w = { to = '沧州城东门', },
    e = { to = '沧州城大驿道#2', },
  },
},

['沧州城西街'] = {
  id = '沧州城西街',
  area = '沧州城',
  name = '西街',
  desc =  [[沧州城西街，这是一条宽阔的青石板街道，向东西两头延伸。南面是本城唯一的当铺。北面是沧州驿站。]],
  exit = {
    ne = { to = '沧州城北街#1', },
    s = { to = '沧州城当铺', },
    se = { to = '沧州城南街', },
    w = { to = '沧州城西门', },
    n = { to = '沧州城驿站', },
  },
},

['沧州城南门'] = {
  id = '沧州城南门',
  area = '沧州城',
  name = '南门',
  desc =  [[这是就是沧州城的南城门了，城墙被当成了广告牌，贴满了花花绿绿各行各业的广告，一个手持长剑、身穿铁甲的武将被附近的欢声笑语所吸引，漫不经心地盘查着过往的行人。]],
  exit = {
    s = { to = '沧州城官道#1', },
    n = { to = '沧州城南街', },
  },
},

['沧州城北门'] = {
  id = '沧州城北门',
  area = '沧州城',
  name = '北门',
  desc =  [[这里是沧州城的北城门，往西北去就到了溏沽了。北方的冬天总是很冷，官兵们都冻的缩手缩脚的，两个穿着重甲的士兵正好搜查一个挑着担子进城的老汉。]],
  exit = {
    s = { to = '沧州城北街#3', },
  },
},

['沧州城东街'] = {
  id = '沧州城东街',
  area = '沧州城',
  name = '东街',
  desc =  [[这里就是沧州城东街，这是一条宽阔的青石板街道，向东西两头延伸。往东通向东门。南北各是沧州的南北主干道了。]],
  exit = {
    e = { to = '沧州城东门', },
    sw = { to = '沧州城南街', },
    nw = { to = '沧州城北街#1', },
  },
},

['沧州城天音阁'] = {
  id = '沧州城天音阁',
  area = '沧州城',
  name = '天音阁',
  desc =  [[这是一家老字号的钱庄，已有几百年的历史，在全国各地都有分店。它发行的银票信誉非常好，通行全国。]],
  exit = {
    w = { to = '沧州城北街#3', },
  },
},

['沧州城官道#3'] = {
  id = '沧州城官道#3',
  area = '沧州城',
  name = '官道',
  desc =  [[你走在一条尘土飞扬的大驿道上。四周人来人往。挑担子的行商，赶着大车的马夫，上京赶考的书生，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。道路两旁是整整齐齐的杨树林。]],
  exit = {
    nw = { to = '沧州城官道#2', },
    se = { to = '沧州城官道#4', },
  },
},

['沧州城路口'] = {
  id = '沧州城路口',
  area = '沧州城',
  name = '路口',
  desc =  [[这里是平定州与沧州交界的一处路口。四周人来人往，挑担子的行商，赶着大车的马夫，上京赶考的书生，熙熙攘攘，非常热闹。东南方是通往沧州的驿道，西面则是一条土路，通向黑木教控制的平定州。]],
  exit = {
    w = { to = '平定州土路#4E', },
    se = { to = '沧州城驿道#4', },
  },
},

['沧州城废园'] = {
  id = '沧州城废园',
  area = '沧州城',
  name = '废园',
  desc =  [[这是一座荒废的宅院，从前是一户大户人家，如今人走屋空，四周土墙多已经倒塌，院子里长了很多杂草。几个乞丐随意做在空地当中，围在一起讨论着什么。这里是丐帮的大仁分舵，沧州附近的丐帮弟子平常都在这里聚齐。]],
  exit = {
    w = { to = '沧州城北街#1', },
    enter = { to = '沧州城厅堂', },
  },
},

['沧州城府衙正厅'] = {
  id = '沧州城府衙正厅',
  area = '沧州城',
  name = '府衙正厅',
  desc =  [[这里是沧州府衙的正厅。大厅正面墙上悬挂一个横匾，上书“正大光明”四个大字。两位插着两排杀威棍和两块“肃静”、“回避”的木牌。现在休息时间大厅里一个人也没有。]],
  exit = {
    e = { to = '沧州城沧州府衙', },
  },
},

['沧州城戏园'] = {
  id = '沧州城戏园',
  area = '沧州城',
  name = '戏园',
  desc =  [[这是一座沧州城里鼎鼎有名的戏园，戏园中生，旦，净，墨，丑一应具全，场中一个大戏台，台上正在唱着《苏三起解》，台下不时地传来票友们的喝彩声。你也忍不住想坐下来看看戏，放松一下筋骨。]],
  exit = {
    e = { to = '沧州城南街', },
  },
},

['沧州城官道#1'] = {
  id = '沧州城官道#1',
  area = '沧州城',
  name = '官道',
  desc =  [[你走在一条尘土飞扬的大驿道上。四周人来人往。挑担子的行商，赶着大车的马夫，上京赶考的书生，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。道路两旁是整整齐齐的杨树林。北面已可以隐隐看到沧州的城门了。]],
  exit = {
    s = { to = '沧州城官道#2', },
    n = { to = '沧州城南门', },
  },
},

['沧州城花店'] = {
  id = '沧州城花店',
  area = '沧州城',
  name = '花店',
  desc =  [[你一到这里，立即被一阵花香陶醉，只见从房顶到地面，全是花的世界。各种各样的花摆满了店堂，有牡丹、芍药、玫瑰、百合数十种。卖花的姑娘见你走了进来，忙迎了上来。]],
  exit = {
    w = { to = '沧州城南街', },
  },
},

['沧州城当铺'] = {
  id = '沧州城当铺',
  area = '沧州城',
  name = '当铺',
  desc =  [[这是一家素以买卖公平著称的老字号当铺，一个四尺高的柜台摆在你的面前，柜台上摆着一个牌子(paizi)， 柜台后坐着当铺的老板，一双鬼溜溜的眼睛上上下下打量着你。]],
  exit = {
    n = { to = '沧州城西街', },
  },
},

['沧州城驿道#3'] = {
  id = '沧州城驿道#3',
  area = '沧州城',
  name = '驿道',
  desc =  [[你走在一条尘土飞扬的大驿道上。四周人来人往。挑担子的行商，赶着大车的马夫，上京赶考的书生，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。道路两旁是整整齐齐的杨树林。]],
  exit = {
    ne = { to = '沧州城驿道#2', },
    w = { to = '沧州城驿道#4', },
  },
},

['沧州城民居'] = {
  id = '沧州城民居',
  area = '沧州城',
  name = '民居',
  desc =  [[这里是一间静静的小屋，从竹藤扎就的窗外可以看到外面的大街。东首是一张床，床头小柜上放了几只简单的竹编小筐。正对面有一张红木方桌。]],
  exit = {
    e = { to = '沧州城北街#1', },
  },
},

['沧州城大驿道#3'] = {
  id = '沧州城大驿道#3',
  area = '沧州城',
  name = '大驿道',
  desc =  [[你走在一条尘土飞扬的大驿道上。四周人来人往。挑担子的行商，赶着大车的马夫，上京赶考的书生，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。道路两旁是整整齐齐的杨树林。]],
  exit = {
    ne = { to = '沧州城大驿道#4', },
    sw = { to = '沧州城大驿道#2', },
  },
},

['沧州城仓库'] = {
  id = '沧州城仓库',
  area = '沧州城',
  name = '仓库',
  desc =  [[这里是米行的仓库，仓库里面堆满了大堆的东西，四周抗着东西的力夫来来往往。在这里走路可要小心呀，一不注意就会被人撞倒的。]],
  exit = {
    n = { to = '沧州城米行', },
  },
},

['沧州城北街#3'] = {
  id = '沧州城北街#3',
  area = '沧州城',
  name = '北街',
  desc =  [[沧州城北街，北地的寒风肆虐的吹过路上几乎一个行人都没有。走到这里你不禁裹紧了衣服。路的西边是一个米行，里面很多苦工正在来来回回的搬着米袋。]],
  exit = {
    e = { to = '沧州城天音阁', },
    s = { to = '沧州城北街#2', },
    w = { to = '沧州城米行', },
    n = { to = '沧州城北门', },
  },
},

['沧州城沧州府衙'] = {
  id = '沧州城沧州府衙',
  area = '沧州城',
  name = '沧州府衙',
  desc =  [[这里是衙门大门，两扇朱木大门紧紧关闭着。“肃静”“回避”的牌子分放两头石狮子的旁边。前面有一个大鼓，显然是供小民鸣冤用的。几名衙役在门前巡逻。]],
  exit = {
    w = { to = '沧州城府衙正厅', },
    e = { to = '沧州城北街#2', },
  },
},

['中原神州打铁铺'] = {
  id = '中原神州打铁铺',
  area = '中原神州',
  name = '打铁铺',
  desc =  [[这是一间很朴实的屋子，里面只放了一张桌子和几张椅子，还有就是终日炉火不熄的打铁炉了，和呼呼作响的风箱。在这里你可以买卖矿石，也可以自己尝试一下打铁的乐趣。]],
  exit = {
    s = { to = '扬州城东大街#4', },
  },
},

['中原神州龙门镖局'] = {
  id = '中原神州龙门镖局',
  area = '中原神州',
  name = '龙门镖局',
  desc =  [[这是一个江湖中人金盆洗手之后开的一个镖局，这的镖师最讲信誉，你托付他的事，无一不是按时完成。这里待遇丰厚，很多江湖中人都愿意替这里做事。]],
  exit = {
    s = { to = '扬州城东门', },
  },
},

['中原神州大驿道#1'] = {
  id = '中原神州大驿道#1',
  area = '中原神州',
  name = '大驿道',
  desc =  [[你走在一条尘土飞扬的大驿道上。四周人来人往。挑担子的行商，赶着大车的马夫，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。道路两旁是整整齐齐的杨树林。]],
  exit = {
    w = { to = '扬州城东门', },
    e = { to = '扬州城大驿道#2', },
  },
},

['中原神州兵器铺'] = {
  id = '中原神州兵器铺',
  area = '中原神州',
  name = '兵器铺',
  desc =  [[这是一家富丽堂皇的兵器铺，墙上挂满长剑，大刀、铁锤、铁棍、匕首等等兵器。屋角还摆着一个火炉，炉火把四周照得一片通红。柜台后面站着一位神态严肃的铸剑师，他不但手艺好，信誉也不错，所以大家都愿意来这里买卖兵器。]],
  exit = {
    n = { to = '扬州城东大街#4', },
  },
},

['中原神州寄卖店'] = {
  id = '中原神州寄卖店',
  area = '中原神州',
  name = '寄卖店',
  desc =  [[这是一家专门为玩家服务的寄卖店，装璜的富丽堂皇，顾客川流不息，很是热闹。有很多有名的工匠都把他们打造的优质兵器装备放在这里寄卖，所以这里往往令武林人士流连忘返，以期有以外的收获。柜台的上方挂着一个木排(sign)，木排上写明了交易的准则和方法。]],
  exit = {
    w = { to = '中原神州陈列室', },
    n = { to = '扬州城东大街#3', },
  },
},

['中原神州陈列室'] = {
  id = '中原神州陈列室',
  area = '中原神州',
  name = '陈列室',
  desc =  [[这里是寄卖店掌柜的陈列室，陈列了掌柜多年来的收藏。此处到处摆满了兵器防具，以及珍奇的药草。此处也成为工匠们交流经验，推荐产品的场所。]],
  exit = {
    e = { to = '中原神州寄卖店', },
  },
},

['天龙寺鼓楼'] = {
  id = '天龙寺鼓楼',
  area = '天龙寺',
  name = '鼓楼',
  desc =  [[这是一座砖木结构的小楼，飞檐翘翎，檐角上挂满了一串串小铜铃，随风叮叮作响。墙上镂空雕绘着无数佛陀们的坐像。一个个形态维肖。楼内高悬者一个大鼓，鼓身上绘有佛祖释迦牟尼于菩提树下说法的彩绘。]],
  exit = {
    s = { to = '天龙寺天龙寺斋堂#E', },
    w = { to = '天龙寺白石路#C', },
    n = { to = '天龙寺药师殿', },
  },
},

['天龙寺无住宝塔'] = {
  id = '天龙寺无住宝塔',
  area = '天龙寺',
  name = '无住宝塔',
  desc =  [[崇圣寺三塔东塔无住，高二百余尺，八角十层，皆为实心，各层分别雕卷龛、佛像、莲花等，华贵庄重。正面中央开卷龛，各置白色大理石佛像一尊。]],
  exit = {
    s = { to = '天龙寺青竹院#W', },
  },
},

['天龙寺雨花阁'] = {
  id = '天龙寺雨花阁',
  area = '天龙寺',
  name = '雨花阁',
  desc =  [[雨花阁是寺中三阁之一，为藏经存书之处。四壁靠墙都立满了竹架，架上经书文献不计其数。因天龙寺乃是帝王出家之地，每到节日必有世俗子弟到寺中朝拜，每朝拜一次，必有奉献装修。北面有个小门通向寺院后面的松林。]],
  exit = {
    out = { to = '天龙寺雨花院', },
    n = { to = '天龙寺石板路#NE', },
  },
},

['天龙寺青竹院#N'] = {
  id = '天龙寺青竹院#N',
  area = '天龙寺',
  name = '青竹院',
  desc =  [[这里一座遍植青竹的小院子，当中一条小路通往后山上，白石地面打扫得非常干净，轻风吹过，只吹得竹叶随风飘动，发出沙沙的声响，却带不起一丝灰尘。东西各有一条小道。]],
  exit = {
    nu = { to = '天龙寺白石路#N', },
    w = { to = '天龙寺大光明殿', },
    s = { to = '天龙寺千寻宝塔', },
    e = { to = '天龙寺须弥殿', },
  },
},

['天龙寺西练武场#N'] = {
  id = '天龙寺西练武场#N',
  area = '天龙寺',
  name = '西练武场',
  desc =  [[这里是一个宽大的平台，是给寺中僧侣练习武艺的地方。台边摆有木桩、梅花桩、沙袋、沙盆等练功设施和各种僧家武器。几个年轻的僧人正在一旁相互切磋。]],
  exit = {
    sd = { to = '天龙寺龙象台', },
  },
},

['天龙寺物品房'] = {
  id = '天龙寺物品房',
  area = '天龙寺',
  name = '物品房',
  desc =  [[这里是天龙寺内的物品房，房间堆的满满的，你看了看，到处是一排排的大木架，架上放着许多物品，却不粘灰尘，看样子随时都有人来打扫。南面过去是慈悲院。]],
  exit = {
    s = { to = '天龙寺慈悲院', },
  },
},

['天龙寺天龙寺斋堂#W'] = {
  id = '天龙寺天龙寺斋堂#W',
  area = '天龙寺',
  name = '天龙寺斋堂',
  desc =  [[这是天龙寺的斋堂。整个房间飘荡着香味，一些仆役在不停的忙碌着，桌上有各式的素菜、素酒，边上一角放着好多刚摘回来的青菜，你不由得舔舔嘴巴，好象听到你的肚子“咕咕咕”的叫了起来。]],
  exit = {
    s = { to = '天龙寺松树院#W', },
    w = { to = '天龙寺厨房', },
    n = { to = '天龙寺钟楼', },
  },
},

['天龙寺松树院#N'] = {
  id = '天龙寺松树院#N',
  area = '天龙寺',
  name = '松树院',
  desc =  [[这里一座遍植青竹的小院子，当中一条小路通往千寻宝塔，白石地面打扫得非常干净，轻风吹过，只吹得竹叶随风飘动，发出沙沙的声响，却带不起一丝灰尘。东西各有一条小道。]],
  exit = {
    e = { to = '天龙寺圆通殿', },
    su = { to = '天龙寺光佛宝殿', },
    w = { to = '天龙寺诵经堂', },
    n = { to = '天龙寺千寻宝塔', },
  },
},

['天龙寺石板路#NW'] = {
  id = '天龙寺石板路#NW',
  area = '天龙寺',
  name = '石板路',
  desc =  [[你走在一条长长的石板路上，道旁古树参天，鸟鸣不绝，前面是一片大松林，这条路一直通向百丈桥，路上冷冷清请，偶尔见几个僧人从松林中穿出来。]],
  exit = {
    s = { to = '天龙寺兜率大士院', },
    n = { to = '天龙寺百丈桥边', },
  },
},

['天龙寺慈悲院'] = {
  id = '天龙寺慈悲院',
  area = '天龙寺',
  name = '慈悲院',
  desc =  [[这是僧人们点化顽徒的地方。不少江湖豪客由于厌倦了打打杀杀的日子，来到此处落发为僧，叛依佛门。墙上一幅佛祖神像，两边各有一条幅，上书：放下屠刀，立地成佛。此处东面是个兵器房，北面是物品房。]],
  exit = {
    e = { to = '天龙寺兵器房', },
    w = { to = '天龙寺白石路#N', },
    n = { to = '天龙寺物品房', },
  },
},

['天龙寺青竹院#E'] = {
  id = '天龙寺青竹院#E',
  area = '天龙寺',
  name = '青竹院',
  desc =  [[这里一座遍植青竹的小院子，当中一条小路向北通往无相塔，白石地面打扫得非常干净，轻风吹过，只吹得竹叶随风飘动，发出沙沙的声响，却带不起一丝灰尘。]],
  exit = {
    e = { to = '天龙寺晃天门', },
    sw = { to = '天龙寺药师殿', },
    w = { to = '天龙寺瑞鹤门', },
    n = { to = '天龙寺无相宝塔', },
  },
},

['天龙寺龙象台'] = {
  id = '天龙寺龙象台',
  area = '天龙寺',
  name = '龙象台',
  desc =  [[龙象台是一个宽大的平台，是寺中俗家弟子练习武艺的地方，台边摆有木桩、梅花桩、沙袋、沙盆等练功设施和各种僧家武器。几名年轻的俗家弟子正在一旁相互切磋。]],
  exit = {
    nu = { to = '天龙寺西练武场#N', },
    w = { to = '天龙寺西练武场#W', },
    sd = { to = '天龙寺西练武场#S', },
    ed = { to = '天龙寺三无宫', },
  },
},

['天龙寺白石路#N'] = {
  id = '天龙寺白石路#N',
  area = '天龙寺',
  name = '白石路',
  desc =  [[这里是天龙寺后山僧人和俗家弟子作休之处，西边传来菜饭的香气，东边是天龙寺的武器房。不少弟子来此挑选自己趁手的兵器。东面是慈悲院，西边山上是斗母宫，北边是天龙僧人睡房。]],
  exit = {
    e = { to = '天龙寺慈悲院', },
    sd = { to = '天龙寺青竹院#N', },
    w = { to = '天龙寺斗母宫', },
    n = { to = '天龙寺休息室#C', },
  },
},

['天龙寺般若台#2'] = {
  id = '天龙寺般若台#2',
  area = '天龙寺',
  name = '般若台',
  desc =  [[般若台是一个宽大的平台，是寺中弟子练习武艺的地方，台边摆有木桩、梅花桩、沙袋、沙盆等练功设施和各种僧家武器。几名年轻的出家弟子正在一旁相互切磋。]],
  exit = {
    w = { to = '天龙寺般若台#1', },
  },
},

['天龙寺万佛洞#2'] = {
  id = '天龙寺万佛洞#2',
  area = '天龙寺',
  name = '万佛洞',
  desc =  [[阳光被外面的树林遮住，这洞内显得较昏暗，洞内满是精美的佛像，墙上绘着佛祖的一生事迹的故事。走在洞里，你看着墙上的壁画，]],
  exit = {
    out = { to = '天龙寺万佛洞#1', },
    n = { to = '天龙寺万佛洞内洞', door = 'open door', },
  },
},

['天龙寺无心井'] = {
  id = '天龙寺无心井',
  area = '天龙寺',
  name = '无心井',
  desc =  [[这是一口千年古井，井旁是用青石砌成的井台，上面是用生铁铸就的一个高一尺的井缘。井内深达十几米，水面上漂满了落叶。井旁杂草丛生，井边的轱辘架也早就朽了，显然很久没人用了，奇怪的是井边的石板居然十分光滑。]],
  exit = {
    w = { to = '天龙寺百丈桥#2', },
  },
},

['天龙寺休息室#W'] = {
  id = '天龙寺休息室#W',
  area = '天龙寺',
  name = '休息室',
  desc =  [[这是间僧人们的睡房，因门窗常闭着，光线很昏暗，静静的，只有微微的酣声。房里别无他物，非常简朴，靠墙摆着很多张木板床，你悄悄的走过去，找了张空床躺了下来。]],
  exit = {
    e = { to = '天龙寺休息室#C', },
    s = { to = '天龙寺白石路#N', },
  },
},

['天龙寺无相宝塔'] = {
  id = '天龙寺无相宝塔',
  area = '天龙寺',
  name = '无相宝塔',
  desc =  [[崇圣寺三塔东塔无相，高二百余尺，八角十层，皆为实心，各层分别雕卷龛、佛像、莲花等，华贵庄重。正面中央开卷龛，各置白色大理石佛像一尊。]],
  exit = {
    s = { to = '天龙寺青竹院#E', },
  },
},

['天龙寺点苍十九峰#2'] = {
  id = '天龙寺点苍十九峰#2',
  area = '天龙寺',
  name = '点苍十九峰',
  desc =  { [["点苍山西三阳、兰峰两峰，峰势雄壮，险要之出不可胜数，且松林遍布。人要上去，当真比登天还难。峰中一溪名曰“白石”，溪水色如白玉，飞流直下。]], [["点苍山西兰峰、雪人两峰，一绿林满覆，一冰雪笼罩，形神各异。峰中冰雪溶水和天然山泉相汇，组成一到白帘瀑布，飞落直下，溅起阵阵水雾，这便是有名的“双鸳”溪。]], [["点苍山西雪人、应乐峰皆为高山雪峰。只见两峰耸立，直冲云霄，峰上白雪层层覆盖，在阳光照耀下显得更加亮丽。冰雪溶水缓缓流下，一条条小渠慢慢相汇，成一溪流名曰“隐仙”。]], [["点苍山西应乐、观音两峰高矮相对，加上山间云雾缭绕，使之越发显得神秘，相传观世音菩萨曾亲临此地游玩而不思归去。峰间流淌的“梅溪”得名于溪旁那一片天然梅林。]], [["点苍山西观音、中和两峰峰势平和，峰中奇花异草繁多。而峰下桃树林更是一绝，远远望去，有如一片红云。“桃溪”从中淌过，带着红色的桃花缓缓流下山去。]], [["点苍山西中和、龙泉两峰气侯温和，乃是种植花草的理想之处。远远可看见由大理花匠所开的一片片花圃，点点花红撒落在两峰之上。峰中“中溪”流经之处更是花开似锦，美不胜收。]], },
  exit = {
    nu = { to = '天龙寺点苍十九峰#3', },
    ed = { to = '天龙寺点苍十九峰#1', },
  },
},

['天龙寺休息室#SW'] = {
  id = '天龙寺休息室#SW',
  area = '天龙寺',
  name = '休息室',
  desc =  [[这是间俗家弟子们的睡房，因门窗常闭着，光线很昏暗，静静的，只有微微的酣声。房里别无他物，非常简朴，靠墙摆着很多张木板床，你悄悄的走过去，找了张空床躺了下来。]],
  exit = {
    n = { to = '天龙寺荡天门', },
  },
},

['天龙寺百丈桥#2'] = {
  id = '天龙寺百丈桥#2',
  area = '天龙寺',
  name = '百丈桥',
  desc =  [[一条深沟横在面前，挡住了你的去路，沟上有一座长长的索桥，桥身是用树藤和木板连起来的，一阵风吹来，桥摇摇欲坠，几块木板还掉了下去。你不由的忧豫起来，止步不前了。一块石碑(shibei)立在桥旁。]],
  exit = {
    e = { to = '天龙寺无心井', },
    s = { to = '天龙寺百丈桥#1', },
    n = { to = '天龙寺飞泉沟', },
  },
},

['天龙寺飞泉沟'] = {
  id = '天龙寺飞泉沟',
  area = '天龙寺',
  name = '飞泉沟',
  desc =  [[这里已是天龙寺的后山很偏僻的地方了，一道瀑布从天而降，空气里充满了瀑布溅起的水雾，在阳光直射下，幻出一道道七色彩虹，瀑布顺着山沟流向南面的百丈桥，路边大石林立，古树参天。]],
  exit = {
    nu = { to = '天龙寺忘雪亭', },
    s = { to = '天龙寺百丈桥#2', },
  },
},

['天龙寺清心阁'] = {
  id = '天龙寺清心阁',
  area = '天龙寺',
  name = '清心阁',
  desc =  [[这是寺中诸僧参修清心净欲的地方。阁中只有地面放有几个蒲团，角落里摆了一张桌子，上面并排立着五支点燃的蜡烛(candle)。除此之外别无它物，确然是个清静之处。]],
  exit = {
    e = { to = '天龙寺兜率大士院', },
  },
},

['天龙寺地藏殿'] = {
  id = '天龙寺地藏殿',
  area = '天龙寺',
  name = '地藏殿',
  desc =  [[眼前空地上一座大殿，殿中灯火明亮，殿里供奉着南无地藏王菩萨，金身金袈，华丽之极。香案上供着各种鲜花，水果，许多香客都来到这里为死去的亲人烧香保佑。]],
  exit = {
    e = { to = '天龙寺大雄宝殿', },
    nw = { to = '天龙寺青竹院#W', },
    s = { to = '天龙寺钟楼', },
  },
},

['天龙寺圆通殿'] = {
  id = '天龙寺圆通殿',
  area = '天龙寺',
  name = '圆通殿',
  desc =  [[眼前这座大殿极为宏伟。殿里供奉着南无大慈大悲广大灵感观世音菩萨，这殿中的千手观音，隐然是用一块大汉白玉精雕而成，镶嵌各种宝石，金银，华丽之极，世间罕见，和寺中的三塔一样被列为天龙五宝之一，殿中香案上放着香客供的各种礼品。]],
  exit = {
    w = { to = '天龙寺松树院#N', },
    n = { to = '天龙寺须弥殿', },
  },
},

['天龙寺长廊#1'] = {
  id = '天龙寺长廊#1',
  area = '天龙寺',
  name = '长廊',
  desc =  [[这是一条非常幽静的长廊。西边小路通往无无境，东边过去是寺院深处的松林。]],
  exit = {
    w = { to = '天龙寺白石路#E', },
    e = { to = '天龙寺松树林#1', },
  },
},

['天龙寺牟尼堂'] = {
  id = '天龙寺牟尼堂',
  area = '天龙寺',
  name = '牟尼堂',
  desc =  [[这是天龙寺高僧们的静修之处，全以松木所制，板门木柱，木料均不去皮，天然质朴，和一路行来金碧辉煌的殿堂截然不同。室中蒲团上分坐着三个白须白眉的老和尚。]],
  exit = {
    out = { to = '天龙寺长廊#2', },
  },
},

['天龙寺石板路#2'] = {
  id = '天龙寺石板路#2',
  area = '天龙寺',
  name = '石板路',
  desc =  [[    你走在一条长长的石板路上，道旁古树参天，鸟鸣不绝，这条路上冷冷清请，你走了好长时间，也看不见一个人。]],
  exit = {
    w = { to = '天龙寺石板路#3', },
    e = { to = '天龙寺石板路#1', },
  },
},

['天龙寺药房'] = {
  id = '天龙寺药房',
  area = '天龙寺',
  name = '药房',
  desc =  [[这里是天龙寺的药房，房间里弥漫着浓浓的药香，房间内排满了装满各类药材的大药柜，每个药柜都有上百个装药的抽屉贴满了各类药名。西边是一个巨大红杉木柜，柜上贴着方丈印的封条。一位中年僧人正来回忙碌着指点众执役僧称量药品，熬药煎汤。]],
  exit = {
    n = { to = '天龙寺清都瑶台', },
  },
},

['天龙寺石板路#NE'] = {
  id = '天龙寺石板路#NE',
  area = '天龙寺',
  name = '石板路',
  desc =  [[    你走在一条长长的石板路上，道旁古树参天，鸟鸣不绝，前面是一片大松林，这条路一直通向松林深处，林子里黑黑漆漆的，你不由的默念“阿弥陀佛”。]],
  exit = {
    s = { to = '天龙寺雨花阁', },
    n = { to = '天龙寺松树林#M', handler = 'reset_data', },
  },
},

['天龙寺崇圣寺'] = {
  id = '天龙寺崇圣寺',
  area = '天龙寺',
  name = '崇圣寺',
  desc =  [[崇圣寺在大理城外点苍山中岳峰之北，因段氏历代祖先做皇帝的，往往避位为僧，都是在这崇圣寺中出家，因此崇圣寺便是大理皇室的家庙，于全国诸寺之中最是尊荣，所以又称之为天龙寺，大门气势恢弘，上挂一巨幅匾额(biane)。这里背负苍山，面临洱水，极占形胜。]],
  exit = {
    s = { to = '天龙寺山路', },
    enter = { to = '天龙寺白石路#S', },
  },
},

['天龙寺休息室#E'] = {
  id = '天龙寺休息室#E',
  area = '天龙寺',
  name = '休息室',
  desc =  [[这是间僧人们的睡房，因门窗常闭着，光线很昏暗，静静的，只有微微的酣声。房里别无他物，非常简朴，靠墙摆着很多张木板床，你悄悄的走过去，找了张空床躺了下来。]],
  exit = {
    w = { to = '天龙寺休息室#C', },
    s = { to = '天龙寺白石路#N', },
  },
},

['天龙寺无净阁'] = {
  id = '天龙寺无净阁',
  area = '天龙寺',
  name = '无净阁',
  desc =  [[这是历代大理王侯女眷前来进香还愿时休息的地方。阁内檀象宝炉，软榻矮几，一应俱全，清静之中隐然透出一丝富贵之象。]],
  exit = {
    s = { to = '天龙寺瑞鹤门', },
  },
},

['天龙寺石板路#3'] = {
  id = '天龙寺石板路#3',
  area = '天龙寺',
  name = '石板路',
  desc =  [[    你走在一条长长的石板路上，道旁古树参天，鸟鸣不绝，这条路上冷冷清请，你走了好长时间，也看不见一个人。]],
  exit = {
    w = { to = '天龙寺石板路#4', },
    e = { to = '天龙寺石板路#2', },
  },
},

['天龙寺天龙寺斋堂#E'] = {
  id = '天龙寺天龙寺斋堂#E',
  area = '天龙寺',
  name = '天龙寺斋堂',
  desc =  [[这是天龙寺的斋堂。整个房间飘荡着香味，一些仆役在不停的忙碌着，桌上有各式的素菜、素酒，边上一角放着好多刚摘回来的青菜，一个大水桶放在旁边，里面装满了清水。你不由得舔舔嘴巴，好象听到你的肚子“咕咕咕”的叫了起来。]],
  exit = {
    s = { to = '天龙寺斑竹院', },
    n = { to = '天龙寺鼓楼', },
  },
},

['天龙寺无无境'] = {
  id = '天龙寺无无境',
  area = '天龙寺',
  name = '无无境',
  desc =  [[忽然眼前景物一变，一座半人高矮围墙里竹林似海，幽静无比，小路从中轻轻穿过，通向院外的雨花院。这里种植的全是西南名竹--云竹。每当轻风吹过，吹得竹干摇摆，如云如海，在你身边一浪浪抚过，使你心中似有所动。东边一条石板路延伸向远方。]],
  exit = {
    e = { to = '天龙寺白石路#E', },
    s = { to = '天龙寺白石路#NE', },
    n = { to = '天龙寺雨花院', },
  },
},

['天龙寺斗母宫'] = {
  id = '天龙寺斗母宫',
  area = '天龙寺',
  name = '斗母宫',
  desc =  [[这里是天龙寺里最高的地方，再往上都是险峻的悬崖了，这座小殿依山而建，殿内灯火通明。你站在门口，远眺天龙寺，只见一片殿堂连绵不绝，甚是浩大。]],
  exit = {
    nu = { to = '天龙寺白石阶', },
    e = { to = '天龙寺白石路#N', },
  },
},

['天龙寺兜率大士院'] = {
  id = '天龙寺兜率大士院',
  area = '天龙寺',
  name = '兜率大士院',
  desc =  [[兜率大士院供奉的是八部天龙、五百阿罗、三千揭啼。这里烟雾弥漫，都是香客门所进的天竺檀香。几个知客僧正忙得不亦乐乎。由此向南是三无宫，西往清音阁，北至后山。]],
  exit = {
    sd = { to = '天龙寺三无宫', },
    w = { to = '天龙寺清心阁', },
    n = { to = '天龙寺石板路#NW', },
  },
},

['天龙寺点苍十九峰#1'] = {
  id = '天龙寺点苍十九峰#1',
  area = '天龙寺',
  name = '点苍十九峰',
  desc =  { [[点苍山云弄、沧浪峰。此两峰相连，险峻峥嵘。峰上云雾环绕，有如仙境。山峰间夹一条山溪，名“霞移”，溪水清碧，涓涓流淌。]], [[点苍山五台、莲花峰。此两峰相连，险峻峥嵘。峰上怪石林立，且又各具形态。山峰间一条山溪，名曰“万花”，溪水清碧，涓涓流淌。]], [[点苍山沧浪、五台峰。此两峰一高一矮，相依成景。峰上林木繁多，雾气翻腾，宛如沧海。山峰间一瀑飞落，乃是“阳溪”，其水甘甜如泉却又冷似冰雪。]], [[点苍山莲花、白云峰。此两峰峰势不雄，但却秀丽无比。峰上花木成林，红绿相间，一片春色。山峰间“茫涌”溪水色如碧玉，随着山势缓缓流淌。]], [[点苍山白云、鹤云峰。白云低而鹤云高，远远望去，有如一只仙鹤矗立于茫茫云海之中。“锦溪”从峰间流过，载起飞花、落叶，宛如一根凌空飞舞的彩云丝带。]], [[点苍山鹤云、三阳峰。一峰高耸有如仙鹤，一峰壮阔有如海涛。溪水流过，形似灵蛇，盘旋于两峰之间，不急不缓，正是“灵泉”名渠。]], },
  exit = {
    sd = { to = '天龙寺点苍山', },
    wu = { to = '天龙寺点苍十九峰#2', },
  },
},

['天龙寺斑竹院'] = {
  id = '天龙寺斑竹院',
  area = '天龙寺',
  name = '斑竹院',
  desc =  [[这里是石路旁的一座小院子，院内遍植湘妃斑竹，轻风吹过，竹干随风飘动，发出沙沙的声响。一旁摆有几只石凳，是准备给进香客们歇脚用的。]],
  exit = {
    w = { to = '天龙寺白石路#S', },
    n = { to = '天龙寺天龙寺斋堂#E', },
  },
},

['天龙寺晃天门'] = {
  id = '天龙寺晃天门',
  area = '天龙寺',
  name = '晃天门',
  desc =  [[过了此门，便是寺中僧侣清修之地。抬头望去，只见屋宇连绵，轻烟缭绕，传来一阵阵诵经、木鱼之声。这里南面是睡房，供给天龙俗家弟子休息之用，门口挂着一个牌子(pai)，左右各站着一位武僧。]],
  exit = {
    e = { to = '天龙寺清都瑶台', door = 'open door', },
    w = { to = '天龙寺青竹院#E', },
    s = { to = '天龙寺休息室#SE', cond = 'not player.is_bonze', },
  },
},

['天龙寺白石路#S'] = {
  id = '天龙寺白石路#S',
  area = '天龙寺',
  name = '白石路',
  desc =  [[走进大门，只见红砖围墙，白石铺路，从这里一直通往天王殿，抬头望去，寺中亭台楼阁规模宏大，构筑精丽，宅地连云，其气势之盛更胜于五台，普陀等诸处佛门胜地的名山大寺。路旁立满了无量功德碑，两边各有一小院，院中满种着松竹。]],
  exit = {
    nu = { to = '天龙寺天王殿', },
    e = { to = '天龙寺斑竹院', },
    w = { to = '天龙寺松树院#W', },
    out = { to = '天龙寺崇圣寺', },
  },
},

['天龙寺大雄宝殿'] = {
  id = '天龙寺大雄宝殿',
  area = '天龙寺',
  name = '大雄宝殿',
  desc =  [[这是一座宽广的大殿，正中是三丈来高的南无如来释迦牟尼佛、南无金刚不坏佛、南无宝光佛三尊宝像，通体镀金，光芒四射。宝座下香炉中香烟缭绕，点的是那天竺檀香。蒲团前有一无量功德宝盒。西过去通往地藏殿，东边是药师殿。]],
  exit = {
    e = { to = '天龙寺药师殿', },
    sd = { to = '天龙寺白石路#C', },
    w = { to = '天龙寺地藏殿', },
    n = { to = '天龙寺光佛宝殿', },
  },
},

['天龙寺雨花院'] = {
  id = '天龙寺雨花院',
  area = '天龙寺',
  name = '雨花院',
  desc =  [[此处依山傍水，一条小溪从你眼前静静流过，一座精雕木桥横跨其上，与其倒影恰成一圆，映着空灵的水面。溪旁遍植百花，风吹花落，便有了雨花院之称。院内雨花阁精舍乃是寺中藏经存书之处，虽有几个和尚来来去去，却不闻一丝声响。]],
  exit = {
    e = { to = '天龙寺松树林#2', },
    s = { to = '天龙寺无无境', },
    enter = { to = '天龙寺雨花阁', },
  },
},

['天龙寺药师殿'] = {
  id = '天龙寺药师殿',
  area = '天龙寺',
  name = '药师殿',
  desc =  [[眼前空地上一座大殿，香火兴旺，殿里供奉着南无药师琉璃光如来，金身金袈，华丽之极。香案上供着各种鲜花，水果，香油。大殿里的香客都在虔诚的磕头烧香，保佑自己生病的亲人早日康复。]],
  exit = {
    ne = { to = '天龙寺青竹院#E', },
    w = { to = '天龙寺大雄宝殿', },
    s = { to = '天龙寺鼓楼', },
  },
},

['天龙寺龙树院'] = {
  id = '天龙寺龙树院',
  area = '天龙寺',
  name = '龙树院',
  desc =  [[你进入了一间小松木屋，木屋门上挂了一个牌匾，上边写着“龙树院”，你吃了一惊，想不到大名鼎鼎的天龙寺龙树院竟然就是这间小屋。]],
  exit = {
    out = { to = '天龙寺松树林#M', handler = 'reset_data', },
  },
},

['天龙寺普云洞'] = {
  id = '天龙寺普云洞',
  area = '天龙寺',
  name = '普云洞',
  desc =  [[原来这普云阁乃是一个小山洞，一进洞，门就无声无息的关闭了，眼前是一个天然形成的石甬道，洞的顶上有一条狭长的石缝，光线来自那里，这条道周围分布着几个山洞，隐隐有些光从洞中透出。]],
  exit = {
    out = { to = '天龙寺龙树院', },
    n = { to = '天龙寺商阳', },
    nu = { to = '天龙寺少商', },
    nw = { to = '天龙寺关冲', },
    ne = { to = '天龙寺中冲', },
    sw = { to = '天龙寺少泽', },
    se = { to = '天龙寺少冲', },
  },
},

['天龙寺商阳'] = {
  id = '天龙寺商阳',
  area = '天龙寺',
  name = '商阳',
  desc =  [[这个山洞内一尘不染，非常干净，光线来自洞顶，似乎有块非常大的宝石，   迎面墙壁上挂着两张图谱(tupu)，地上放着几个蒲团，你随便找了个地方坐了下来。]],
  exit = {
    s = { to = '天龙寺普云洞', },
  },
},

['天龙寺少商'] = {
  id = '天龙寺少商',
  area = '天龙寺',
  name = '少商',
  desc =  [[这个山洞内一尘不染，非常干净，光线来自洞顶，似乎有块非常大的宝石，   迎面墙壁上挂着两张图谱(tupu)，地上放着几个蒲团，你随便找了个地方坐了下来。]],
  exit = {
    sd = { to = '天龙寺普云洞', },
  },
},

['天龙寺关冲'] = {
  id = '天龙寺关冲',
  area = '天龙寺',
  name = '关冲',
  desc =  [[这个山洞内一尘不染，非常干净，光线来自洞顶，似乎有块非常大的宝石，   迎面墙壁上挂着两张图谱(tupu)，地上放着几个蒲团，你随便找了个地方坐了下来。]],
  exit = {
    se = { to = '天龙寺普云洞', },
  },
},

['天龙寺中冲'] = {
  id = '天龙寺中冲',
  area = '天龙寺',
  name = '中冲',
  desc =  [[这个山洞内一尘不染，非常干净，光线来自洞顶，似乎有块非常大的宝石，   迎面墙壁上挂着两张图谱(tupu)，地上放着几个蒲团，你随便找了个地方坐了下来。]],
  exit = {
    sw = { to = '天龙寺普云洞', },
  },
},

['天龙寺少泽'] = {
  id = '天龙寺少泽',
  area = '天龙寺',
  name = '少泽',
  desc =  [[这个山洞内一尘不染，非常干净，光线来自洞顶，似乎有块非常大的宝石，   迎面墙壁上挂着两张图谱(tupu)，地上放着几个蒲团，你随便找了个地方坐了下来。]],
  exit = {
    ne = { to = '天龙寺普云洞', },
  },
},

['天龙寺少冲'] = {
  id = '天龙寺少冲',
  area = '天龙寺',
  name = '少冲',
  desc =  [[这个山洞内一尘不染，非常干净，光线来自洞顶，似乎有块非常大的宝石，   迎面墙壁上挂着两张图谱(tupu)，地上放着几个蒲团，你随便找了个地方坐了下来。]],
  exit = {
    nw = { to = '天龙寺普云洞', },
  },
},

['天龙寺应乐峰'] = {
  id = '天龙寺应乐峰',
  area = '天龙寺',
  name = '应乐峰',
  desc =  [[点苍山最高峰应乐峰，山峰直插云霞，雄伟壮丽。这里寒风刺骨，夹杂着冰雪向你扑面吹来。脚下山路上的积雪都已结冰，你走在上面不住地打滑。]],
  exit = {
    sd = { to = '天龙寺应乐峰南', handler = 'go_straight', },
    nd = { to = '天龙寺应乐峰北', handler = 'go_straight', },
  },
},

['天龙寺应乐峰北'] = {
  id = '天龙寺应乐峰北',
  area = '天龙寺',
  name = '应乐峰北',
  desc =  [[南面便是点苍山最高峰应乐峰，山峰直插云霞，雄伟壮丽。这里天高气寒，山顶还有终年不化的积雪。远远望去，宛如白色峨冠，这就是有名的“苍山雪景”。]],
  exit = {
    su = { to = '天龙寺应乐峰', },
    n = { to = '天龙寺山路', },
  },
},

['天龙寺厨房'] = {
  id = '天龙寺厨房',
  area = '天龙寺',
  name = '厨房',
  desc =  [[这里是天龙寺的厨房。几个仆役正忙个不停，切洗声不绝。边上一角放着大米和好多刚摘回来的青菜，房间里飘荡着热乎乎的饭菜香气，你不由得舔舔嘴，似乎听到你的肚子“咕咕”地叫了起来。东边就是斋堂。]],
  exit = {
    e = { to = '天龙寺天龙寺斋堂#W', },
  },
},

['天龙寺西练武场#W'] = {
  id = '天龙寺西练武场#W',
  area = '天龙寺',
  name = '西练武场',
  desc =  [[这里是一个宽大的平台，是给寺中僧侣练习武艺的地方。台边摆有木桩、梅花桩、沙袋、沙盆等练功设施和各种僧家武器。几个年轻的僧人正在一旁相互切磋。西边一扇门通往塔林，门口站着位禅师。]],
  exit = {
    w = { to = '天龙寺石板路#1', },
    e = { to = '天龙寺龙象台', },
  },
},

['天龙寺休息室#SE'] = {
  id = '天龙寺休息室#SE',
  area = '天龙寺',
  name = '休息室',
  desc =  [[这是间俗家弟子们的睡房，因门窗常闭着，光线很昏暗，静静的，只有微微的酣声。房里别无他物，非常简朴，靠墙摆着很多张木板床，你悄悄的走过去，找了张空床躺了下来。]],
  exit = {
    n = { to = '天龙寺晃天门', },
  },
},

['天龙寺忘雪亭'] = {
  id = '天龙寺忘雪亭',
  area = '天龙寺',
  name = '忘雪亭',
  desc =  [[这是一个小亭子，亭边长着一棵枯树。后面山壁上有个洞口，据说是过去历代高僧苦修的地方，这里山风阴冷，你不由的打了个寒颤，牙齿也开始打起颤来，还是赶快下去吧。]],
  exit = {
    sd = { to = '天龙寺飞泉沟', },
    d = { to = '天龙寺万佛洞#1', },
  },
},

['天龙寺诵经堂'] = {
  id = '天龙寺诵经堂',
  area = '天龙寺',
  name = '诵经堂',
  desc =  [[这里是寺内僧人诵经的地方。一眼望去，大堂内坐满了人，诵经声起伏不绝，有的低沉缓慢，有的尖声急促，中间杂着摇动法器的金属声。你悄悄找个地方，盘腿坐下来，开始念经。你前面放了许多薄薄的小册经书(book),以供你读用。]],
  exit = {
    e = { to = '天龙寺松树院#N', },
    n = { to = '天龙寺大光明殿', },
  },
},

['天龙寺西练武场#S'] = {
  id = '天龙寺西练武场#S',
  area = '天龙寺',
  name = '西练武场',
  desc =  [[这里是一个宽大的平台，是给寺中僧侣练习武艺的地方。台边摆有木桩、梅花桩、沙袋、沙盆等练功设施和各种僧家武器。几个年轻的僧人正在一旁相互切磋。]],
  exit = {
    nu = { to = '天龙寺龙象台', },
  },
},

['天龙寺大光明殿'] = {
  id = '天龙寺大光明殿',
  area = '天龙寺',
  name = '大光明殿',
  desc =  [[这座大殿由四支大红圆柱托住。殿上一个牌匾，上书“正法久住”几个楷书大字。殿里供奉着阿弥陀佛及西方三圣。]],
  exit = {
    e = { to = '天龙寺青竹院#N', },
    s = { to = '天龙寺诵经堂', },
  },
},

['天龙寺百丈桥#1'] = {
  id = '天龙寺百丈桥#1',
  area = '天龙寺',
  name = '百丈桥',
  desc =  [[一座长长的索桥，桥身是用树藤和木板连起来的，一阵风吹来，桥摇摇欲坠。你小心翼翼的走在桥上，抓紧两边的绳索，掂着脚踩着桥板，这桥显得又远又长，你的心'砰砰砰'直跳。]],
  exit = {
    s = { to = '天龙寺百丈桥边', handler = 'go_straight', },
    n = { to = '天龙寺百丈桥#2', handler = 'go_straight', },
  },
},

['天龙寺百丈桥底'] = {
  id = '天龙寺百丈桥底',
  area = '天龙寺',
  name = '百丈桥底',
  desc =  [[这里是百丈桥底，四周都是大石。一条小河顺流而下，四周有不少骨骸，大概都是失足摔死的。这里东面山坡上是一片松林，看来只好从那边上。]],
  exit = {
    eu = { to = '天龙寺石板路#NW', },
  },
},

['天龙寺点苍山'] = {
  id = '天龙寺点苍山',
  area = '天龙寺',
  name = '点苍山',
  desc =  [[点苍山俗称苍山，又叫灵鹫山。南诏时封为中岳山，北起洱源、邓川，南至下关天生桥，东临洱海，西接漾濞，全长五十多公里。点苍山有十九座山峰，峰峰相连，险峻峥嵘。每两座山峰之间夹一条溪水，共有溪水十八条，条条清碧。十九座山峰，海拔都在三千米以上，最高的达四千一百多米，山顶有终年不化的积雪。远远望去，宛如白色峨冠，这就是有名的“苍山雪景”]],
  exit = {
    ed = { to = '大理城西门', },
    wu = { to = '天龙寺点苍十九峰#1', },
    nu = { to = '天龙寺点苍十九峰#1', },
    eu = { to = '天龙寺点苍十九峰#1', },
    sw = { to = '大理城西怒江', },
  },
},

['天龙寺瑞鹤门'] = {
  id = '天龙寺瑞鹤门',
  area = '天龙寺',
  name = '瑞鹤门',
  desc =  [[由光佛殿出此门，可向东行过无相宝塔、幌天门、清都瑶台、无无境、雨花院而至般若台。这一路房屋都是寺中僧人清修养之地，你悄声行走，不敢发出丝毫声响。北面通向无净阁。]],
  exit = {
    e = { to = '天龙寺青竹院#E', },
    w = { to = '天龙寺光佛宝殿', },
    n = { to = '天龙寺无净阁', cond = 'player.gender == "female"', },
  },
},

['天龙寺荡天门'] = {
  id = '天龙寺荡天门',
  area = '天龙寺',
  name = '荡天门',
  desc =  [[过了此门，便是三元宫、兜率大士院等宝殿。抬头望去，只见屋宇连绵，轻烟缭绕，传来一阵阵诵经、木鱼之声。这里南面是睡房，供给天龙俗家弟子休息之用，门口挂着一个牌子(pai)，左右各站着一位武僧。]],
  exit = {
    e = { to = '天龙寺青竹院#W', },
    w = { to = '天龙寺三无宫', door = 'open door', },
    s = { to = '天龙寺休息室#SW', cond = 'not player.is_bonze', },
  },
},

['天龙寺石板路#1'] = {
  id = '天龙寺石板路#1',
  area = '天龙寺',
  name = '石板路',
  desc =  [[    你走在一条长长的石板路上，道旁古树参天，鸟鸣不绝，这条路上冷冷清请，你走了好长时间，也看不见一个人。东面就是龙象台了。]],
  exit = {
    w = { to = '天龙寺石板路#2', },
    e = { to = '天龙寺西练武场#W', },
  },
},

['天龙寺百丈桥边'] = {
  id = '天龙寺百丈桥边',
  area = '天龙寺',
  name = '百丈桥边',
  desc =  [[你走出了松林，一条深沟横在面前，挡住了你的去路，沟上有一座长长的索桥，桥身是用树藤和木板连起来的，一阵风吹来，桥摇摇欲坠，几块木板还掉了下去。你不由的忧豫起来，止步不前了。一块石碑(shibei)立在桥旁。]],
  exit = {
    s = { to = '天龙寺石板路#NW', },
    n = { to = '天龙寺百丈桥#1', },
  },
},

['天龙寺青竹院#W'] = {
  id = '天龙寺青竹院#W',
  area = '天龙寺',
  name = '青竹院',
  desc =  [[这里一座遍植青竹的小院子，当中一条小路向北通往无住塔，白石地面打扫得非常干净，轻风吹过，只吹得竹叶随风飘动，发出沙沙的声响，却带不起一丝灰尘。]],
  exit = {
    e = { to = '天龙寺翔鹤门', },
    se = { to = '天龙寺地藏殿', },
    w = { to = '天龙寺荡天门', },
    n = { to = '天龙寺无住宝塔', },
  },
},

['天龙寺钟楼'] = {
  id = '天龙寺钟楼',
  area = '天龙寺',
  name = '钟楼',
  desc =  [[这是一座砖木结构的小楼，飞檐翘翎，檐角上挂满了一串串小铜铃，随风叮叮作响。墙上镂空雕绘着无数佛陀们的坐像。一个个形态维肖。楼内高悬者一个大钟(zhong)，看样子不下上千斤，钟身上铸有金刚经文，这钟一旦敲响，在大理城内都可闻见。]],
  exit = {
    e = { to = '天龙寺白石路#C', },
    s = { to = '天龙寺天龙寺斋堂#W', },
    n = { to = '天龙寺地藏殿', },
  },
},

['天龙寺小洞天'] = {
  id = '天龙寺小洞天',
  area = '天龙寺',
  name = '小洞天',
  desc =  [[你无意间闯入了一个山谷，这里幽静异常，你不由的心里有些发毛。山谷两侧都是峭壁，南面一直通向山谷深处，这里没有什么路，灌木树枝挡住了前进的路。西面是你进来的路]],
  exit = {
    w = { to = '天龙寺松树林#M', handler = 'reset_data', },
  },
},

['天龙寺白石路#C'] = {
  id = '天龙寺白石路#C',
  area = '天龙寺',
  name = '白石路',
  desc =  [[这里又是一段白石路，连接着前面的大雄宝殿后后面的天王殿，石面平滑，打扫得干干净净。抬眼一看，雪峦万仞，镂银洒翠的点苍山峙其后，波涛万顷、横练蓄黛的洱海嵌于前。寺内三塔鼎峙，撑天拄地；玉柱标空，雄浑壮丽，为苍洱间的胜景之一。]],
  exit = {
    nu = { to = '天龙寺大雄宝殿', },
    e = { to = '天龙寺鼓楼', },
    w = { to = '天龙寺钟楼', },
    su = { to = '天龙寺天王殿', },
  },
},

['天龙寺松树林#M'] = {
  id = '天龙寺松树林#M',
  area = '天龙寺',
  name = '松树林',
  desc =  [[这里是一片茂密的松树林，松树高大，枝叶茂盛，你一走进来差点便迷失了方向。这里灌木丛生，路都给挡住了。]],
  exit = {
    e = { to = '天龙寺松树林#M', },
    s = { to = '天龙寺松树林#M', },
    w = { to = '天龙寺松树林#M', },
    n = { to = '天龙寺松树林#M', },
    hidden1 = { to = '天龙寺石板路#NE', cost = 10, handler = 'cord', },
    hidden2 = { to = '天龙寺龙树院', cost = 11, handler = 'cord', },
    hidden3 = { to = '天龙寺小洞天', cost = 13, cond = 'player.int_innate > 20', handler = 'cord', },
  },
},

['天龙寺石板路#4'] = {
  id = '天龙寺石板路#4',
  area = '天龙寺',
  name = '石板路',
  desc =  [[    你走在一条长长的石板路上，道旁古树参天，鸟鸣不绝，这条路上冷冷清请，你走了好长时间，也看不见一个人。]],
  exit = {
    w = { to = '天龙寺灵塔林', },
    e = { to = '天龙寺石板路#3', },
  },
},

['天龙寺松树院#W'] = {
  id = '天龙寺松树院#W',
  area = '天龙寺',
  name = '松树院',
  desc =  [[这里是石路旁的一座小院子，松树成荫，地上撒满了飘落的松针。一旁摆有几只石凳，是准备给进香客们歇脚用的。]],
  exit = {
    e = { to = '天龙寺白石路#S', },
    n = { to = '天龙寺天龙寺斋堂#W', },
  },
},

['天龙寺白石阶'] = {
  id = '天龙寺白石阶',
  area = '天龙寺',
  name = '白石阶',
  desc =  [[这里是依山而建的一段石阶路，是用点苍山特有的白石砌成，路很陡很险。左面就是悬崖，一阵大风吹来，你不由的晃了几晃，吓出一身冷汗。]],
  exit = {
    sd = { to = '天龙寺斗母宫', },
  },
},

['天龙寺灵塔林'] = {
  id = '天龙寺灵塔林',
  area = '天龙寺',
  name = '灵塔林',
  desc =  [[走出了小路，眼前豁然一亮，这是一片塔林。放眼望去，林林总总有不下百座高矮不一的石塔，这些都是历代高僧圆寂后，为他们修的灵塔。这里冷冷清清，不时传来几声野兽的嗥叫，走在塔林中，你的心中不免有些害怕。]],
  exit = {
    e = { to = '天龙寺石板路#4', },
  },
},

['天龙寺兵器房'] = {
  id = '天龙寺兵器房',
  area = '天龙寺',
  name = '兵器房',
  desc =  [[这里是天龙寺的兵器房，天龙寺的武功一向是以空手为主，但是房中仍然准备有一些兵器供刚入门的弟子使用。墙边的兵器架(jia)上放着各式各样的兵器，可以根据自己喜好，选趁手的。]],
  exit = {
    w = { to = '天龙寺慈悲院', },
  },
},

['天龙寺无我阁'] = {
  id = '天龙寺无我阁',
  area = '天龙寺',
  name = '无我阁',
  desc =  [[这是历代大理王侯前来进香还愿时休息的地方。阁内檀象宝炉，软榻矮几，一应俱全，清静之中隐然透出一丝富贵之象。]],
  exit = {
    s = { to = '天龙寺翔鹤门', },
  },
},

['天龙寺应乐峰南'] = {
  id = '天龙寺应乐峰南',
  area = '天龙寺',
  name = '应乐峰南',
  desc =  [[北面便是点苍山最高峰应乐峰，山峰直插云霞，雄伟壮丽。这里天高气寒，山顶还有终年不化的积雪。远远望去，宛如白色峨冠，这就是有名的“苍山雪景”。]],
  exit = {
    nu = { to = '天龙寺应乐峰', },
    s = { to = '天龙寺点苍十九峰#3', },
  },
},

['天龙寺白石路#E'] = {
  id = '天龙寺白石路#E',
  area = '天龙寺',
  name = '白石路',
  desc =  [[这里又是一段白石路，石面平滑，打扫得干干净净。路旁种有各式花草，两株参天大树分立左右两边。]],
  exit = {
    w = { to = '天龙寺无无境', },
    e = { to = '天龙寺长廊#1', },
  },
},

['天龙寺三无宫'] = {
  id = '天龙寺三无宫',
  area = '天龙寺',
  name = '三无宫',
  desc =  [[无住、无相、无愿便是佛家常说的‘三无’。这宝座上坐的是南无弥勒尊佛金像，开怀露腹，笑看众生。几个知客僧人正来往忙碌招待香客。北面通往兜率大士院，南面是一条石板路。西面通向龙象台。]],
  exit = {
    nu = { to = '天龙寺兜率大士院', },
    e = { to = '天龙寺荡天门', door = 'open door', },
    wu = { to = '天龙寺龙象台', },
  },
},

['天龙寺万佛洞#1'] = {
  id = '天龙寺万佛洞#1',
  area = '天龙寺',
  name = '万佛洞',
  desc =  [[你走出忘雪亭来到山壁边，眼前一座古洞，洞口上面书有三个大字“万佛洞”，这洞隐藏在寺后深处，寻常人等恐怕找也找不到这里。]],
  exit = {
    u = { to = '天龙寺忘雪亭', },
    enter = { to = '天龙寺万佛洞#2', },
  },
},

['天龙寺松树林#2'] = {
  id = '天龙寺松树林#2',
  area = '天龙寺',
  name = '松树林',
  desc =  [[这里是一片茂密的松树林，松树高大，枝叶茂盛，你一走进来差点便迷失了方向。一条长廊由西向东通往松林深处。]],
  exit = {
    e = { to = '天龙寺松树林#2', },
    s = { to = '天龙寺松树林#2', },
    w = { to = '天龙寺松树林#M', cost = 3, handler = 'alternate_step', },
    n = { to = '天龙寺松树林#2', },
  },
},

['天龙寺长廊#2'] = {
  id = '天龙寺长廊#2',
  area = '天龙寺',
  name = '长廊',
  desc =  [[这里松树林里一条非常幽静的长廊，往西直通无无境等地。长廊尽头处有一简屋，材料天然，与这茂密的松树林混为一体。]],
  exit = {
    enter = { to = '天龙寺牟尼堂', },
    s = { to = '天龙寺松树林#2', },
    w = { to = '天龙寺松树林#1', },
    n = { to = '天龙寺松树林#2', },
  },
},

['天龙寺休息室#C'] = {
  id = '天龙寺休息室#C',
  area = '天龙寺',
  name = '休息室',
  desc =  [[这是间僧人们的睡房，因门窗常闭着，光线很昏暗，静静的，只有微微的酣声。房里别无他物，非常简朴，靠墙摆着很多张木板床，你悄悄的走过去，找了张空床躺了下来。]],
  exit = {
    e = { to = '天龙寺休息室#E', },
    w = { to = '天龙寺休息室#W', },
    s = { to = '天龙寺白石路#N', },
  },
},

['天龙寺般若台#1'] = {
  id = '天龙寺般若台#1',
  area = '天龙寺',
  name = '般若台',
  desc =  [[般若台是一个宽大的平台，是寺中弟子练习武艺的地方，台边摆有木桩、梅花桩、沙袋、沙盆等练功设施和各种僧家武器。几名年轻的出家弟子正在一旁相互切磋。]],
  exit = {
    e = { to = '天龙寺般若台#2', },
    nw = { to = '天龙寺白石路#NE', },
    wd = { to = '天龙寺清都瑶台', },
  },
},

['天龙寺清都瑶台'] = {
  id = '天龙寺清都瑶台',
  area = '天龙寺',
  name = '清都瑶台',
  desc =  [[由此过去一路都是碎石路了，这一带只准寺内僧侣进入，其它人等如果没有方丈许可是不可以来此的。向北可到无无境、雨花院阅读经书文献，向东可至般若台练习武功，南面是寺内的药房。]],
  exit = {
    nu = { to = '天龙寺白石路#NE', },
    eu = { to = '天龙寺般若台#1', },
    w = { to = '天龙寺晃天门', },
    s = { to = '天龙寺药房', },
  },
},

['天龙寺白石路#NE'] = {
  id = '天龙寺白石路#NE',
  area = '天龙寺',
  name = '白石路',
  desc =  [[这里又是一段白石路，石面平滑，打扫得干干净净。路旁种有各式花草，两株参天大树分立左右两边。北面是无无境，往南是般若台、清都瑶台等地。]],
  exit = {
    se = { to = '天龙寺般若台#1', },
    sd = { to = '天龙寺清都瑶台', },
    n = { to = '天龙寺无无境', },
  },
},

['天龙寺须弥殿'] = {
  id = '天龙寺须弥殿',
  area = '天龙寺',
  name = '须弥殿',
  desc =  [[这座殿堂规模较小，但香雾缭绕，人来人往，很是热闹，殿内供奉着五百罗汉，佛像金身金衣，或笑口大开，或斜靠坐着，或怒目而视，各不相同。许多香客都在数着罗汉，看哪尊会和自己有源。]],
  exit = {
    w = { to = '天龙寺青竹院#N', },
    s = { to = '天龙寺圆通殿', },
  },
},

['天龙寺点苍十九峰#3'] = {
  id = '天龙寺点苍十九峰#3',
  area = '天龙寺',
  name = '点苍十九峰',
  desc =  { [["点苍山龙泉、玉局两峰，峰势平和，景色秀丽。峰中有‘龙泉’、‘玉局’两泉，泉水清澈甘甜，是泡茶上品。两泉之水再加上山中无数小溪水，成溪“绿玉”，流向大理城郊。]], [["玉局、马龙两峰位于点苍山东，峰上绿林满覆，鸟兽出没，一派生机勃勃的景象。“龙溪”从半山腰飞瀑而下，落入一深潭之中，瀑声若雷，宛如龙吟。]], [["马龙、圣应峰山势平坦，一溪曰“青碧”从中缓缓流出，于峰底平坡上分为三条小溪，再又于山下‘圣应亭’侧相汇流向大理城郊。]], [["圣应、佛顶两峰高矮相对，山间常年雾气弥漫，有如仙境。一溪流出，名曰“莫残”，盘盘转转十几个弯后才向山下流去。]], [["佛顶、马耳两峰形态怪异，峰中所生草木多为药材，时常有大理城中的采药人来这里采集名贵草药。山上流下的“葶溟”溪据说也具奇效，常饮百病不生、延年益寿。]], [["点苍山东马耳、斜阳两峰前后并立，登上峰顶后大理城全貌尽收眼底，是游人常来之地。“阳南”溪水从此流过，水流不急不缓，绕过山石流向大理城郊。]], },
  exit = {
    sd = { to = '天龙寺点苍十九峰#2', },
    n = { to = '天龙寺应乐峰南', },
  },
},

['天龙寺山路'] = {
  id = '天龙寺山路',
  area = '天龙寺',
  name = '山路',
  desc =  [[这是条应乐峰以北山脚下的山路，路面用青砖铺成，每隔四五步又有一匹由汉白玉制长砖，看来着实花了不少功夫。前面有一片斑竹林子，遥现红墙和三座高塔，随风隐隐传来一阵寺院的钟声和佛门檀香香味。]],
  exit = {
    s = { to = '天龙寺应乐峰北', },
    n = { to = '天龙寺崇圣寺', },
  },
},

['天龙寺天王殿'] = {
  id = '天龙寺天王殿',
  area = '天龙寺',
  name = '天王殿',
  desc =  [[穿过前院一段白石小路，登上七层石阶，便是天王殿。殿内两侧分立四大伏魔金刚，正中贡案上两盏长明灯吐着雄雄火焰，一座尺余高的铁鼎中香烟缭绕。东西两边是寺院的斋堂。]],
  exit = {
    sd = { to = '天龙寺白石路#S', },
    nd = { to = '天龙寺白石路#C', },
  },
},

['天龙寺光佛宝殿'] = {
  id = '天龙寺光佛宝殿',
  area = '天龙寺',
  name = '光佛宝殿',
  desc =  [[这座大殿正正方方，殿中光线明亮，原来屋顶有一圆洞为琉璃瓦所制，由四支大红圆柱托住。殿里供奉着南无燃灯上古佛祖，金身金袈，华丽之极。一般香客行到这里就得止步了，再往后便是寺中僧侣清修之地。]],
  exit = {
    e = { to = '天龙寺瑞鹤门', },
    nd = { to = '天龙寺松树院#N', },
    w = { to = '天龙寺翔鹤门', },
    s = { to = '天龙寺大雄宝殿', },
  },
},

['天龙寺千寻宝塔'] = {
  id = '天龙寺千寻宝塔',
  area = '天龙寺',
  name = '千寻宝塔',
  desc =  [[崇圣寺三塔主塔千寻居中，是三塔中最高的一座，共有十六层，高三百余尺，与西安大小雁塔同是唐代密檐式建筑。塔下仰望，只见塔矗云端，云移塔驻似有倾倒之势。塔的基座呈方形，分二层，下层四周有石栏，栏的四角柱头雕有石狮；上层东面正中有石照壁，上有黔国公沐英后裔洒世阶题的“永镇山川”四个大字，庄重雄奇，颇有气魄。每层正面中央开卷龛，各置白色大理石佛像一尊。]],
  exit = {
    s = { to = '天龙寺松树院#N', },
    n = { to = '天龙寺青竹院#N', },
  },
},

['天龙寺万佛洞内洞'] = {
  id = '天龙寺万佛洞内洞',
  area = '天龙寺',
  name = '万佛洞内洞',
  desc =  [[这里是万佛洞的内洞了，洞内显得较昏暗异常，你看不清什么东西，洞内静静的，只听见自己的脚步声和心跳呼吸声，隐隐有个人面]],
  exit = {
    s = { to = '天龙寺万佛洞#2', door = 'open door', },
  },
},

['天龙寺松树林#1'] = {
  id = '天龙寺松树林#1',
  area = '天龙寺',
  name = '松树林',
  desc =  [[这里是一片茂密的松树林，松树高大，枝叶茂盛，你一走进来差点便迷失了方向。一条长廊由西向东通往松林深处。]],
  exit = {
    e = { to = '天龙寺长廊#2', },
    s = { to = '天龙寺松树林#2', },
    w = { to = '天龙寺长廊#1', },
    n = { to = '天龙寺松树林#2', },
  },
},

['天龙寺翔鹤门'] = {
  id = '天龙寺翔鹤门',
  area = '天龙寺',
  name = '翔鹤门',
  desc =  [[由光佛殿出此门，可向西行过无住宝塔、三元宫、兜率大士院。这一路房屋都是寺中僧人清修养之地，你悄声行走，不敢发出丝毫声响。北面通向无我阁。]],
  exit = {
    e = { to = '天龙寺光佛宝殿', },
    w = { to = '天龙寺青竹院#W', },
    n = { to = '天龙寺无我阁', cond = 'player.gender ~= "female"', },
  },
},

['长乐帮柴房'] = {
  id = '长乐帮柴房',
  area = '长乐帮',
  name = '柴房',
  desc =  [[一间简单的柴房，普通的帮众可以在这里干点杂活。劈好的木柴凌乱地堆在墙角，旁边是砍柴刀和笤帚。门后还有个水缸，却已经空了。时而也有帮众过来打个盹。]],
  exit = {
    n = { to = '长乐帮西走廊', },
  },
},

['长乐帮走廊'] = {
  id = '长乐帮走廊',
  area = '长乐帮',
  name = '走廊',
  desc =  [[宽敞的走廊人来人往，再向内便是总舵的内宅了。空中弥漫着烟酒气味。地上显得甚是肮脏。一些日常守卫的帮众警惕地注视着每个人。]],
  exit = {
    e = { to = '长乐帮东走廊#1', },
    s = { to = '长乐帮大厅', },
    w = { to = '长乐帮西走廊', },
    n = { to = '长乐帮小厅', },
  },
},

['长乐帮甬道'] = {
  id = '长乐帮甬道',
  area = '长乐帮',
  name = '甬道',
  desc =  [[长长的甬道通向一个石室，旁边壁上每隔不远便有一盏油灯，头上是高高的拱顶，显得有些阴森可怖。几名帮众在这里把守，闲杂人等不能随意前进。]],
  exit = {
    e = { to = '长乐帮石室', },
    s = { to = '长乐帮花园', },
  },
},

['长乐帮青石路#2'] = {
  id = '长乐帮青石路#2',
  area = '长乐帮',
  name = '青石路',
  desc =  [[你走在一条尘土飞扬的大驿道上。四周人来人往。挑担子的行商，赶着大车的马夫，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。马上的人个个身着劲装，衣甲鲜明，有的还随身佩带着刀剑。看来都是些习武的江湖人。道路两旁是整整齐齐的杨树林。]],
  exit = {
    w = { to = '长乐帮青石路#1', },
    n = { to = '长乐帮大门', },
  },
},

['长乐帮睡房'] = {
  id = '长乐帮睡房',
  area = '长乐帮',
  name = '睡房',
  desc =  [[这里是长乐帮的睡房，屋里灯光黑暗，几张略旧的木床靠在屋内的墙角。因为最近刺客盛行，门口有几个人把守。好让帮中弟兄能安然入睡，不必害怕行刺。]],
  exit = {
    s = { to = '长乐帮西走廊', },
  },
},

['长乐帮卧室'] = {
  id = '长乐帮卧室',
  area = '长乐帮',
  name = '卧室',
  desc =  [[室内陈设甚是奢华，极大的床边有张朱漆书桌，桌旁两张椅子，上铺锦垫。床前罗帐低垂，隐约看见床上似乎无人。窗前的香炉中青烟袅袅，你只觉置身于一个香喷喷，软绵绵的神仙洞府。]],
  exit = {
    s = { to = '长乐帮小厅', },
  },
},

['长乐帮八角亭'] = {
  id = '长乐帮八角亭',
  area = '长乐帮',
  name = '八角亭',
  desc =  [[这是花园中一个小巧的亭子，供赏花时休息之用。亭中石桌石凳俱全，石桌上还摆放着几盘点心。院中花卉暗香浮动。几个假山做得甚是别致。]],
  exit = {
    w = { to = '长乐帮花园', },
  },
},

['长乐帮东走廊#2'] = {
  id = '长乐帮东走廊#2',
  area = '长乐帮',
  name = '东走廊',
  desc =  [[这里往来的人少了些，南面是个厨房，空中弥漫着烟酒气味。地上显得甚是肮脏，抛弃着一些油腻的残羹剩菜。]],
  exit = {
    w = { to = '长乐帮东走廊#1', },
    s = { to = '长乐帮厨房', },
  },
},

['长乐帮西走廊'] = {
  id = '长乐帮西走廊',
  area = '长乐帮',
  name = '西走廊',
  desc =  [[这里往来的人少了些，北面是睡房，你隐隐约约听见打鼾声从房里传出来。南面是间干杂活的柴房，空中弥漫着烟酒气味。地上显得甚是肮脏，抛弃着一些油腻的残羹剩菜。]],
  exit = {
    e = { to = '长乐帮走廊', },
    s = { to = '长乐帮柴房', },
    n = { to = '长乐帮睡房', },
  },
},

['长乐帮石室'] = {
  id = '长乐帮石室',
  area = '长乐帮',
  name = '石室',
  desc =  [[昏暗的石屋没有窗户，乃是长乐帮私设的刑堂及囚室。周围摆放着几件刑具，墙上有些新旧不一的血痕，令人不寒而栗。室内甚是潮湿，头顶不时滴下水珠。]],
  exit = {
    w = { to = '长乐帮甬道', },
  },
},

['长乐帮小厅'] = {
  id = '长乐帮小厅',
  area = '长乐帮',
  name = '小厅',
  desc =  [[这是帮主及总管商讨机密大事的所在，正中是一张太师椅，门上吊着半旧的红绸软帘。墙上附庸风雅地挂着几张山水字画，一望可知均是俗手之作。窗前几盆菊花倒是十分繁茂。]],
  exit = {
    e = { to = '长乐帮花园', },
    s = { to = '长乐帮走廊', },
    n = { to = '长乐帮卧室', },
  },
},

['长乐帮大驿道#2'] = {
  id = '长乐帮大驿道#2',
  area = '长乐帮',
  name = '大驿道',
  desc =  [[你走在一条尘土飞扬的大驿道上。四周人来人往。挑担子的行商，赶着大车的马夫，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。马上的人个个身着劲装，衣甲鲜明，有的还随身佩带着刀剑。看来都是些习武的江湖人。道路两旁是整整齐齐的杨树林。]],
  exit = {
    sw = { to = '长乐帮大驿道#1', },
  },
},

['长乐帮青石路#1'] = {
  id = '长乐帮青石路#1',
  area = '长乐帮',
  name = '青石路',
  desc =  [[你走在一条尘土飞扬的大驿道上。四周人来人往。挑担子的行商，赶着大车的马夫，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。马上的人个个身着劲装，衣甲鲜明，有的还随身佩带着刀剑。看来都是些习武的江湖人。道路两旁是整整齐齐的杨树林。]],
  exit = {
    nw = { to = '长乐帮大驿道#1', },
    e = { to = '长乐帮青石路#2', },
  },
},

['长乐帮大驿道#1'] = {
  id = '长乐帮大驿道#1',
  area = '长乐帮',
  name = '大驿道',
  desc =  [[你走在一条尘土飞扬的大驿道上。四周人来人往。挑担子的行商，赶着大车的马夫，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。马上的人个个身着劲装，衣甲鲜明，有的还随身佩带着刀剑。看来都是些习武的江湖人。道路两旁是整整齐齐的杨树林。]],
  exit = {
    ne = { to = '长乐帮大驿道#2', },
    nw = { to = '扬州城大驿道#2', },
    se = { to = '长乐帮青石路#1', },
  },
},

['长乐帮大厅'] = {
  id = '长乐帮大厅',
  area = '长乐帮',
  name = '大厅',
  desc =  [[大厅中一股肃杀威严之气。厅堂极为宽大，能容下数十人之众。只见四周桌上点着明晃晃的巨烛，正中空着一张虎皮交椅。不时有帮众经过这里，都是屏息静气地低头走过。]],
  exit = {
    out = { to = '长乐帮大门', },
    n = { to = '长乐帮走廊', },
  },
},

['长乐帮厨房'] = {
  id = '长乐帮厨房',
  area = '长乐帮',
  name = '厨房',
  desc =  [[这里是长乐帮的厨房。位于西廊之外的一间很大的房间。房角里有一只小炭炉。也不知道在炖著什么东西，波波波的直响。桌子上放著一些煮好的食物，香味扑鼻。]],
  exit = {
    n = { to = '长乐帮东走廊#2', },
  },
},

['长乐帮小屋'] = {
  id = '长乐帮小屋',
  area = '长乐帮',
  name = '小屋',
  desc =  [[这是帮众们酗酒赌钱的的小屋，正中的方桌上杯盘狼籍，有人醉倒在一旁，不醒人事。隔扇后面另有一张赌桌，几个帮众正在吆五喝六地赌钱。屋内烛光摇曳，似乎没有人注意你进来。]],
  exit = {
    n = { to = '长乐帮东走廊#1', },
  },
},

['长乐帮东走廊#1'] = {
  id = '长乐帮东走廊#1',
  area = '长乐帮',
  name = '东走廊',
  desc =  [[这里往来的人少了些，南面不断传来阵阵吵闹之声，有时还夹杂着怒骂和尖叫。空中弥漫着烟酒气味。地上显得甚是肮脏，抛弃着一些油腻的残羹剩菜。]],
  exit = {
    e = { to = '长乐帮东走廊#2', },
    w = { to = '长乐帮走廊', },
    s = { to = '长乐帮小屋', },
  },
},

['长乐帮花园'] = {
  id = '长乐帮花园',
  area = '长乐帮',
  name = '花园',
  desc =  [[这个花园是典型的江南风格，精巧细致。园中花卉虽没有什么名贵品种，也是争奇斗妍。正中一条石子铺就的小路，上面遍布青苔，甚是湿滑。向北是一条甬道，向东有个亭子。]],
  exit = {
    e = { to = '长乐帮八角亭', },
    w = { to = '长乐帮小厅', },
    n = { to = '长乐帮甬道', },
  },
},

['长乐帮大门'] = {
  id = '长乐帮大门',
  area = '长乐帮',
  name = '大门',
  desc =  [[这里便是威镇江南的长乐帮总舵所在。长乐帮在江湖上声势非同小可，近年来更是日渐兴旺。两扇红漆大门上钉着狰狞的虎头，几个满脸横肉的帮众站在两侧。门上有一个大匾(bian)，两盏气死风灯来回摇摆。旁边有一座碑，上面刻着一些文字。]],
  exit = {
    s = { to = '长乐帮青石路#2', },
    enter = { to = '长乐帮大厅', },
  },
},

['武当后山茅屋'] = {
  id = '武当后山茅屋',
  area = '武当后山',
  name = '茅屋',
  desc =  [[这里是一间由竹子搭成的茅屋，屋内摆设简朴。西面的墙壁上挂着一幅山水画，下面一把藤椅上坐着一位老者。傍边一张桌子上摆放了许多书籍。]],
  exit = {
    n = { to = '武当后山山顶#E', },
  },
},

['武当后山山路#3'] = {
  id = '武当后山山路#3',
  area = '武当后山',
  name = '山路',
  desc =  [[山坡上的灌木越来越多，路面上的荆棘不时的把你的手脚划破，一些长草中常常倏的蹿出一条毒蛇，让你心惊胆颤。]],
  exit = {
    su = { to = '武当后山山路#4', },
    nd = { to = '武当后山小路#1', },
  },
},

['武当后山丛林边缘#1'] = {
  id = '武当后山丛林边缘#1',
  area = '武当后山',
  name = '丛林边缘',
  desc =  [[前面已无路可寻，只有一片无边无垠的茂密丛林，风吹叶落“哗哗沙沙”如歌似弦。弦歌声中，偶尔传来一两声丛林野兽凶残的呼啸，你怵然一惊，似乎有些进退两难了。]],
  exit = {
    nw = { to = '武当后山谷底', },
    hidden = { to = '武当后山烈火丛林', cmd = 'tou conglin', },
  },
},

['武当后山烈火丛林'] = {
  id = '武当后山烈火丛林',
  area = '武当后山',
  name = '烈火丛林',
  desc =  [[这里是一片红色的海洋，由于地处丛林的外围，独特的地理气候，使得这里满山红枫，你惊叹自然之神奇，不知不觉的迷失了方向。]],
  exit = {
    e = { to = '武当后山烈火丛林', },
    e2 = { to = '武当后山落叶丛林', ignore = true, },
    w = { to = '武当后山烈火丛林', },
    w2 = { to = '武当后山落叶丛林', ignore = true, },
    s = { to = '武当后山烈火丛林', },
    s2 = { to = '武当后山落叶丛林', ignore = true, },
    n = { to = '武当后山烈火丛林', },
    n2 = { to = '武当后山落叶丛林', ignore = true, },
    ne = { to = '武当后山烈火丛林', },
    ne2 = { to = '武当后山落叶丛林', ignore = true, },
    nw = { to = '武当后山烈火丛林', },
    nw2 = { to = '武当后山落叶丛林', ignore = true, },
    se = { to = '武当后山烈火丛林', },
    se2 = { to = '武当后山落叶丛林', ignore = true, },
    sw = { to = '武当后山烈火丛林', },
    sw2 = { to = '武当后山落叶丛林', ignore = true, },
    hidden = { to = '武当后山落叶丛林', cost = 10, handler = 'wdhs_conglin', },
  },
},

['武当后山落叶丛林'] = {
  id = '武当后山落叶丛林',
  area = '武当后山',
  name = '落叶丛林',
  desc =  [[这是一片落叶丛林，风吹叶落，你走在这又厚又软的落叶上，不会留下一丝足迹，很快的你就发现迷失了自己的方向。]],
  exit = {
    e = { to = '武当后山落叶丛林', },
    e2 = { to = '武当后山烈火丛林', ignore = true, },
    e3 = { to = '武当后山积雪丛林', ignore = true, },
    w = { to = '武当后山落叶丛林', },
    w2 = { to = '武当后山烈火丛林', ignore = true, },
    w3 = { to = '武当后山积雪丛林', ignore = true, },
    s = { to = '武当后山落叶丛林', },
    s2 = { to = '武当后山烈火丛林', ignore = true, },
    s3 = { to = '武当后山积雪丛林', ignore = true, },
    n = { to = '武当后山落叶丛林', },
    n2 = { to = '武当后山烈火丛林', ignore = true, },
    n3 = { to = '武当后山积雪丛林', ignore = true, },
    ne = { to = '武当后山落叶丛林', },
    ne2 = { to = '武当后山烈火丛林', ignore = true, },
    ne3 = { to = '武当后山积雪丛林', ignore = true, },
    nw = { to = '武当后山落叶丛林', },
    nw2 = { to = '武当后山烈火丛林', ignore = true, },
    nw3 = { to = '武当后山积雪丛林', ignore = true, },
    se = { to = '武当后山落叶丛林', },
    se2 = { to = '武当后山烈火丛林', ignore = true, },
    se3 = { to = '武当后山积雪丛林', ignore = true, },
    sw = { to = '武当后山落叶丛林', },
    sw2 = { to = '武当后山烈火丛林', ignore = true, },
    sw3 = { to = '武当后山积雪丛林', ignore = true, },
    hidden1 = { to = '武当后山烈火丛林', cost = 10, handler = 'wdhs_conglin', },
    hidden2 = { to = '武当后山积雪丛林', cost = 10, handler = 'wdhs_conglin', },
  },
},

['武当后山积雪丛林'] = {
  id = '武当后山积雪丛林',
  area = '武当后山',
  name = '积雪丛林',
  desc =  [[海拔越走越高，气候越转寒冷，路上、树上都布满厚厚的积雪，行进越来越艰难，加之野兽的袭击，你只盼能早日离开这片丛林。]],
  exit = {
    e = { to = '武当后山积雪丛林', },
    e2 = { to = '武当后山落叶丛林', ignore = true, },
    e3 = { to = '武当后山阔叶丛林', ignore = true, },
    w = { to = '武当后山积雪丛林', },
    w2 = { to = '武当后山落叶丛林', ignore = true, },
    w3 = { to = '武当后山阔叶丛林', ignore = true, },
    s = { to = '武当后山积雪丛林', },
    s2 = { to = '武当后山落叶丛林', ignore = true, },
    s3 = { to = '武当后山阔叶丛林', ignore = true, },
    n = { to = '武当后山积雪丛林', },
    n2 = { to = '武当后山落叶丛林', ignore = true, },
    n3 = { to = '武当后山阔叶丛林', ignore = true, },
    ne = { to = '武当后山积雪丛林', },
    ne2 = { to = '武当后山落叶丛林', ignore = true, },
    ne3 = { to = '武当后山阔叶丛林', ignore = true, },
    nw = { to = '武当后山积雪丛林', },
    nw2 = { to = '武当后山落叶丛林', ignore = true, },
    nw3 = { to = '武当后山阔叶丛林', ignore = true, },
    se = { to = '武当后山积雪丛林', },
    se2 = { to = '武当后山落叶丛林', ignore = true, },
    se3 = { to = '武当后山阔叶丛林', ignore = true, },
    sw = { to = '武当后山积雪丛林', },
    sw2 = { to = '武当后山落叶丛林', ignore = true, },
    sw3 = { to = '武当后山阔叶丛林', ignore = true, },
    hidden1 = { to = '武当后山落叶丛林', cost = 10, handler = 'wdhs_conglin', },
    hidden2 = { to = '武当后山阔叶丛林', cost = 10, handler = 'wdhs_conglin', },
  },
},

['武当后山阔叶丛林'] = {
  id = '武当后山阔叶丛林',
  area = '武当后山',
  name = '阔叶丛林',
  desc =  [[你突觉眼前一亮，走进了一片翠绿生生的丛林，虽说林深叶阔，日照不多，却已能听到欢快的雀鸣，和远处山泉的叮咚声，你精神为之一振。]],
  exit = {
    e = { to = '武当后山阔叶丛林', },
    e2 = { to = '武当后山积雪丛林', ignore = true, },
    w = { to = '武当后山阔叶丛林', },
    w2 = { to = '武当后山积雪丛林', ignore = true, },
    s = { to = '武当后山阔叶丛林', },
    s2 = { to = '武当后山积雪丛林', ignore = true, },
    n = { to = '武当后山阔叶丛林', },
    n2 = { to = '武当后山积雪丛林', ignore = true, },
    ne = { to = '武当后山阔叶丛林', },
    ne2 = { to = '武当后山积雪丛林', ignore = true, },
    nw = { to = '武当后山阔叶丛林', },
    nw2 = { to = '武当后山积雪丛林', ignore = true, },
    se = { to = '武当后山阔叶丛林', },
    se2 = { to = '武当后山积雪丛林', ignore = true, },
    sw = { to = '武当后山阔叶丛林', },
    sw2 = { to = '武当后山积雪丛林', ignore = true, },
    hidden1 = { to = '武当后山积雪丛林', cost = 10, handler = 'wdhs_conglin', },
    hidden2 = { to = '武当后山丛林边缘#2', cost = 10, handler = 'wdhs_conglin', },
  },
},

['武当后山丛林边缘#2'] = {
  id = '武当后山丛林边缘#2',
  area = '武当后山',
  name = '丛林边缘',
  desc =  [[你终于走出了丛林，前面是一座高耸的山峰，一条溪流环山而过，两面是峭壁，你不禁看作后面的丛林和眼前的山溪出神，不知如何才能找到出山的路径。]],
  exit = {
    s = { to = '武当后山阔叶丛林', },
    n = { to = '武当后山阔叶丛林', },
    nw = { to = '武当后山阔叶丛林', },
    ne = { to = '武当后山阔叶丛林', },
    hidden = { to = '武当后山水中', cmd = 'jump river', },
  },
},

['武当后山水中'] = {
  id = '武当后山水中',
  area = '武当后山',
  name = '水中',
  desc =  [[四周白蒙蒙的一片，水花飞溅，你感到一阵寒意袭上心来。]],
  exit = {
    hidden = { to = '襄阳城汉水西岸', handler = 'wait', },
  },
},

['武当后山峰顶'] = {
  id = '武当后山峰顶',
  area = '武当后山',
  name = '峰顶',
  desc =  [[这里是武当后山的峰顶，四周树木青翠，桃化绽放。地上有许多不知名的草本植物，纵横交错。一些不显眼的植物结出了许多褐色的坚果。]],
  exit = {
    e = { to = '武当后山山顶#E', },
    d = { to = '武当后山小路#2', },
    w = { to = '武当后山山顶#W', },
  },
},

['武当后山小路#2'] = {
  id = '武当后山小路#2',
  area = '武当后山',
  name = '小路',
  desc =  [[这里是山路的尽头，前面是一座险峻的山峰。峭壁上长着许多松树，在山壁上打了一些一尺来长的木桩，似乎可以踩着木桩爬(pa)上去。]],
  exit = {
    hidden = { to = '武当后山峰顶', cmd = 'pa up', cond = 'player.skill["基本轻功"] and player.skill["基本轻功"].level >= 20', },
    nd = { to = '武当后山山路#5', },
  },
},

['武当后山山路#5'] = {
  id = '武当后山山路#5',
  area = '武当后山',
  name = '山路',
  desc =  [[山路弯弯曲曲延深向上，山路西侧是麻绳围起的护栏，下面是万丈峡谷，东面是陡峭的山壁。路面上的砾石凹凸不平，一不小心就可能要摔下深渊。一般人到了这里就不敢再向前了。]],
  exit = {
    su = { to = '武当后山小路#2', },
    nd = { to = '武当后山山路#4', },
  },
},

['武当后山小路#1'] = {
  id = '武当后山小路#1',
  area = '武当后山',
  name = '小路',
  desc =  [[这是一条人迹鲜足的山麓，四周灌木茂盛，不时有野兽的出没，偶尔有一些采药人来这里寻找一些稀有的草药。]],
  exit = {
    nw = { to = '武当山山路#2', },
    su = { to = '武当后山山路#3', },
  },
},

['武当后山山路#4'] = {
  id = '武当后山山路#4',
  area = '武当后山',
  name = '山路',
  desc =  [[这里的杂草较为稀少，可是山路越发陡峭。四周有一些茂盛的松树，你能看到一些松鼠从一棵树上跃到另一棵树上。极目远眺，隐隐能看到前面有一座险峻的山峰。]],
  exit = {
    su = { to = '武当后山山路#5', },
    nd = { to = '武当后山山路#3', },
  },
},

['武当后山山顶#E'] = {
  id = '武当后山山顶#E',
  area = '武当后山',
  name = '山顶',
  desc =  [[这里是山峰顶部东侧的一个小坡，坡上也是杂草密布，在杂草之中隐约有一些炯异的植物。南边有一排枝繁叶茂的树林。树林后面好象有一间茅屋。]],
  exit = {
    w = { to = '武当后山峰顶', },
    hidden = { to = '武当后山茅屋', cond = 'player.flag["asked 后山"]', cmd = 'zuan shulin', },
  },
},

['武当后山山顶#W'] = {
  id = '武当后山山顶#W',
  area = '武当后山',
  name = '山顶',
  desc =  [[这里是山顶的西侧，遍地野果。草深齐肩，间或开放着的白花，迎风摇曳，一切都沉沁在自然的怀抱里，是那么的自然、野性和洒脱。下面是一条深不见底的峡谷，山藤密集，藤粗似臂，又如瀑布一泻而下，煞是壮观。]],
  exit = {
    e = { to = '武当后山峰顶', },
    hidden = { to = '武当后山谷底', cond = 'player.skill["基本轻功"] and player.skill["基本轻功"].level > 100 and player.skill["基本手法"] and player.skill["基本手法"].level > 80', cmd = 'hold 山藤;jump down', },
  },
},

['武当后山谷底'] = {
  id = '武当后山谷底',
  area = '武当后山',
  name = '谷底',
  desc =  [[这里是武当后山的峡谷谷底，草深过人，山藤如虬。四面是陡峭的山壁，只有东南方似乎有一片密林，清风拂叶，传来阵阵有韵律的“哗哗”声。煞是悦耳动听。]],
  exit = {
    se = { to = '武当后山丛林边缘#1', },
  },
},

['大理城茶花园#5'] = {
  id = '大理城茶花园#5',
  area = '大理城',
  name = '茶花园',
  desc =  [[你走在一个小山坡上，这里到处都是盛开的鲜花，你有点眼花缭乱了，你漫步在这花园中，心情舒畅许多。]],
  exit = {
    se = { to = '大理城茶花园#3', },
  },
},

['大理城茶花园#1'] = {
  id = '大理城茶花园#1',
  area = '大理城',
  name = '茶花园',
  desc =  [[大理城茶花名满天下，这个里是一个小山坡，花园依山而建，山坡上种满了茶花，有上等品种「红妆素裹」，「十八学士」，也有差一些的「落第秀才」，和「抓破美人脸」。]],
  exit = {
    nu = { to = '大理城茶花园#2', },
    w = { to = '大理城东大街#2S', },
  },
},

['大理城西门'] = {
  id = '大理城西门',
  area = '大理城',
  name = '西门',
  desc =  [[西门是通向天龙古刹的必经之地，不少作奸犯科的歹徒妄想从这里逃向山中，均被在此值勤的武将官兵擒获，段王爷更是常派自己的贴身侍卫来此守卫，城门旁进出的行人络绎不绝。]],
  exit = {
    e = { to = '大理城太和西街', },
    wu = { to = '天龙寺点苍山', },
  },
},

['大理城蝴蝶泉'] = {
  id = '大理城蝴蝶泉',
  area = '大理城',
  name = '蝴蝶泉',
  desc =  [[这是在大理城北四十公里的苍山云弄峰下。沿林荫小道曲折前行，只见古树林立，浓荫蔽天，一方清泉嵌于其间，底铺青石，泉水明澈，常有人掷金属钱币于池，观其缓缓旋落，阳光从树顶筛下，池底银光闪烁，倍感泉水清冽。]],
  exit = {
    e = { to = '大理城蝴蝶会', },
    sw = { to = '大理城大道#2N', },
  },
},

['大理城驿站'] = {
  id = '大理城驿站',
  area = '大理城',
  name = '驿站',
  desc =  [[这是大理驿站，负责传送和大宋国及武林各大门派的公文，密函。这里戒备森严，静悄悄的，只见不时有人进来领命，又急急忙忙地离开。门口的木柱上边立了一快牌子（sign)。]],
  exit = {
    w = { to = '大理城青石街#1', },
  },
},

['大理城太和北街'] = {
  id = '大理城太和北街',
  area = '大理城',
  name = '太和北街',
  desc =  [[这是大理北大街，大理近百年来从无战事，一片太平盛世的模样。停留这里的人们不少是文人墨客。东西连接着大理的主要道路。往南就到大理城中心了，一直往北走，可以看到大理的城门了。]],
  exit = {
    e = { to = '大理城北大街#1E', },
    s = { to = '大理城城中心', },
    w = { to = '大理城北大街#1W', },
    n = { to = '大理城北门', },
  },
},

['大理城走廊#1'] = {
  id = '大理城走廊#1',
  area = '大理城',
  name = '走廊',
  desc =  [[你正走在客店的走廊上，北面是一排装修精美的客房。不时有睡意朦胧的旅客进进出出，到楼下的掌柜处付了钱再上来睡觉。]],
  exit = {
    out = { to = '大理城迎宾馆', },
    n = { to = '大理城客房', },
  },
},

['大理城城中心'] = {
  id = '大理城城中心',
  area = '大理城',
  name = '城中心',
  desc =  [[这里是大理中心广场，是大理最繁华的所在。白天这里人声鼎沸，晚上更是灯火通明，忙碌了一天的人们晚上总喜欢到这里走一走，广场上卖各种东西的都有，不少江湖人物混迹其中。]],
  exit = {
    e = { to = '大理城云雪楼', },
    s = { to = '大理城青石街#2', },
    w = { to = '大理城风味小吃店', },
    n = { to = '大理城太和北街', },
  },
},

['大理城大道#4N'] = {
  id = '大理城大道#4N',
  area = '大理城',
  name = '大道',
  desc =  [[你终于从山林中走了出来，眼前豁然开朗，一条笔直的石板大道通向前方，四周开始有一些吵杂的喧闹声音，你现在来到了西南边陲，这里战国楚时期为滇国地,汉代属益州，三国蜀置云南，永昌等郡，唐为南诏，宋为大理地。]],
  exit = {
    sw = { to = '玉虚观道旁田野#1', },
    s = { to = '大理城大道#3N', },
    n = { to = '大理城山路#1N', },
  },
},

['大理城当铺'] = {
  id = '大理城当铺',
  area = '大理城',
  name = '当铺',
  desc =  [[这是一家素以买卖公平著称的老字号当铺，在全国各地名气很大，一块牌子（paizi)高高挂在墙上，柜台后坐着当铺的老板，手拿一杆大水烟袋上上下下打量着你。]],
  exit = {
    w = { to = '大理城东大街#3N', },
  },
},

['大理城风味小吃店'] = {
  id = '大理城风味小吃店',
  area = '大理城',
  name = '风味小吃店',
  desc =  [[这是一家有名的风味小吃店，专卖各种地方名小吃，虽然就开在云仙楼旁边，可是生意一样很兴隆，这里到处坐满了人，有些客人就站在一旁端个碗吃的津津有味。]],
  exit = {
    e = { to = '大理城城中心', },
    w = { to = '大理城西大街#3N', },
    n = { to = '大理城北大街#1W', },
  },
},

['大理城东门'] = {
  id = '大理城东门',
  area = '大理城',
  name = '东门',
  desc =  [[这是东城门，城门正上方刻着“东门”两个楷书大字，城墙上贴着几张官府告示。官兵们警惕地注视着过往行人，你最好小心为妙。一条笔直的青石板大道向东西两边延伸。东边是郊外，隐约可见一片一望无际的树林，神秘莫测。西边是城里。]],
  exit = {
    w = { to = '大理城太和东街', },
    e = { to = '大理城东山路#1E', },
  },
},

['大理城西大街#3N'] = {
  id = '大理城西大街#3N',
  area = '大理城',
  name = '西大街',
  desc =  [[这是大理西大街，大理百姓把这里叫三月街，又叫观音街。是白族三月贸市古街。每到三月，这里挤满了交易的人群。向东走是座酒楼，不时有香气传过来。还有不少人在西边的裁缝店里挑选衣服。]],
  exit = {
    e = { to = '大理城风味小吃店', },
    s = { to = '大理城西大街#2N', },
    w = { to = '大理城裁缝店', },
    n = { to = '大理城北大街#2W', },
  },
},

['大理城杂货铺'] = {
  id = '大理城杂货铺',
  area = '大理城',
  name = '杂货铺',
  desc =  [[这是一家小小的杂货铺，别看其小，却收拾得非常整齐，因为对面是城中富人的积居地，所以卖的货物都是特地从产地长途贩来的。有一两个家人模样正在和老板讨价还价。左侧立着一块招牌(zhaopai)。    门前立了个牌子(sign)。]],
  exit = {
    n = { to = '大理城南大街#2E', },
  },
},

['大理城太和东街'] = {
  id = '大理城太和东街',
  area = '大理城',
  name = '太和东街',
  desc =  [[这是大理的太和东街，街面是由碗口大的彩色石块铺成，青兰紫绿，煞是好看。城内居民族裔繁杂，习俗各异，饮食穿着无不异于中原。往东边走，就到东城门了，南面不远就能看见镇南王府了。]],
  exit = {
    e = { to = '大理城东门', },
    s = { to = '大理城东大街#1S', },
    n = { to = '大理城东大街#1N', },
  },
},

['大理城司空堂'] = {
  id = '大理城司空堂',
  area = '大理城',
  name = '司空堂',
  desc =  [[这是一间端正堂皇的公堂，是大理国司空巴天石平常办理公务的司所。司空管辖内政事务，如税务、道路桥梁修建等。所司紧要，政务繁忙，文案上高高堆起一叠公文。]],
  exit = {
    s = { to = '大理城府衙前厅', },
  },
},

['大理城茶花园#2'] = {
  id = '大理城茶花园#2',
  area = '大理城',
  name = '茶花园',
  desc =  [[你走在一个小山坡上，这里到处都是盛开的鲜花，你有点眼花缭乱了，你漫步在这花园中，心情舒畅许多。]],
  exit = {
    nu = { to = '大理城茶花园#3', },
    sd = { to = '大理城茶花园#1', },
  },
},

['大理城马房'] = {
  id = '大理城马房',
  area = '大理城',
  name = '马房',
  desc =  [[你现在正站在大理城西边的一家马房里，别看岭南马体型不是很魁武，可跑起来很有长力。来自中原的旅人和要去中原的人们总在这里挑选一匹好马，靠近门口的地方方有一块木雕成的招牌(sign)。]],
  exit = {
    e = { to = '大理城青石街#1', },
  },
},

['大理城茶花园#4'] = {
  id = '大理城茶花园#4',
  area = '大理城',
  name = '茶花园',
  desc =  [[你走在一个小山坡上，这里到处都是盛开的鲜花，你有点眼花缭乱了，你漫步在这花园中，心情舒畅许多。]],
  exit = {
    sw = { to = '大理城茶花园#3', },
  },
},

['大理城书院'] = {
  id = '大理城书院',
  area = '大理城',
  name = '书院',
  desc =  [[这里是书院的讲堂，窗明几净，一尘不染。一位庄重严肃的老者坐在太师椅上讲学。在他的两侧坐满了求学的学生们。一张古意盎然的书案放在老先生的前面，案上摆着几本翻开的线装书籍。讲堂内多历代楹联石刻，足见书院历史的悠久。值得一提的是嵌在讲堂前左壁的学规(xuegui)。]],
  exit = {
    w = { to = '大理城南大街#2E', },
  },
},

['大理城北大街#2W'] = {
  id = '大理城北大街#2W',
  area = '大理城',
  name = '北大街',
  desc =  [[这是大理北大街，西边茶馆的旗帜迎风轻轻的在飘，一些茶客在里面边喝茶，边聊着天。北边是大理国机要府衙的前厅，极少有人进出。南面就是西大街了。东边喧闹的声音不停的传了过来，快到大理城中心广场了。]],
  exit = {
    e = { to = '大理城北大街#1W', },
    s = { to = '大理城西大街#3N', },
    w = { to = '大理城茶馆', },
    n = { to = '大理城府衙前厅', },
  },
},

['大理城南大街#1W'] = {
  id = '大理城南大街#1W',
  area = '大理城',
  name = '南大街',
  desc =  [[你走在大理南大街上，这里安静极了，大理百姓走到这里，无不放慢了脚步，以敬仰的目光向东看去，东边过去就是大理皇宫了。南面是大理的司法机关定安府，东面紧邻着太和东街。]],
  exit = {
    e = { to = '大理城太和南街', },
    w = { to = '大理城南大街#2W', },
    s = { to = '大理城定安府', },
  },
},

['大理城云雪楼'] = {
  id = '大理城云雪楼',
  area = '大理城',
  name = '云雪楼',
  desc =  [[这里是大理最有名的酒楼，店名来源于点苍山的云雪峰溪奇观，平时这里高朋满座，一到节日更是要提前来定下雅间。江湖人物更是把这里当成聚会的场所，不时有江湖豪客进进出出。]],
  exit = {
    e = { to = '大理城东大街#3N', },
    s = { to = '大理城豆腐坊', },
    w = { to = '大理城城中心', },
    n = { to = '大理城北大街#1E', },
  },
},

['大理城太和南街'] = {
  id = '大理城太和南街',
  area = '大理城',
  name = '太和南街',
  desc =  [[你走在太和南街上，这里十分安静，大理百姓臣民走到这里，无不放慢了脚步，以敬仰的目光向北看去，北边过青石街就是大理皇宫了。东西两边都是大理南大街，南面就是大理的南门了。]],
  exit = {
    e = { to = '大理城南大街#1E', },
    s = { to = '大理城南门', },
    w = { to = '大理城南大街#1W', },
    n = { to = '大理城青石街#1', },
  },
},

['大理城鸡足山上'] = {
  id = '大理城鸡足山上',
  area = '大理城',
  name = '鸡足山上',
  desc =  [[这里奇花异草，争芳斗艳；苍藤古树，缨络万千；危崖嵌寺，群峰如屏从鸡足山东麓的宾川沙址入山，路旁溪水淙淙，丛荫泛碧，]],
  exit = {
    wd = { to = '大理城灵山一会', },
    eu = { to = '大理城鸡足山', },
  },
},

['大理城豆腐坊'] = {
  id = '大理城豆腐坊',
  area = '大理城',
  name = '豆腐坊',
  desc =  [[这是大理城内的豆腐坊，这里的主人磨的豆腐远近闻名，不少大理的食客专门跑来购买，整个房间飘着豆腐淡淡的清香，好多人在不停的忙着。]],
  exit = {
    e = { to = '大理城东大街#2N', },
    w = { to = '大理城青石街#2', },
    n = { to = '大理城云雪楼', },
  },
},

['大理城太和西街'] = {
  id = '大理城太和西街',
  area = '大理城',
  name = '太和西街',
  desc =  [[这里相对于北边的三月贸市街和东北边的城中心，显得安静了好多。西边就是大理西门，通往天龙寺古刹就从西门出去。南面就靠近善阐侯府了。大理近百年来从无战事，一片太平盛世的模样。]],
  exit = {
    s = { to = '大理城西大街#1S', },
    w = { to = '大理城西门', },
    n = { to = '大理城西大街#1N', },
  },
},

['大理城客房'] = {
  id = '大理城客房',
  area = '大理城',
  name = '客房',
  desc =  [[这是一间很大的客房，陈设十分华丽。靠墙放了几张大床，客人们盖着大被子睡的正香，满屋子都是呼呼的打酣声。西边有张床是空的，你蹑手蹑脚地走了过去。]],
  exit = {
    s = { to = '大理城走廊#1', },
  },
},

['大理城赌场'] = {
  id = '大理城赌场',
  area = '大理城',
  name = '赌场',
  desc =  [[这里是大理赌场的大堂，几个赌徒光着膀子，满头大汗的推着牌九，一些人在旁边看着，多半是输光了又不想走的人。墙上挂着一块牌子(paizi)。]],
  exit = {
    s = { to = '大理城北大街#2E', },
  },
},

['大理城西大街#2N'] = {
  id = '大理城西大街#2N',
  area = '大理城',
  name = '西大街',
  desc =  [[这是大理西大街，大理百姓把这里叫三月街，又叫观音街。是白族三月贸市古街。每到三月，这里挤满了交易的人群。西面是一家绣楼，透门看去，好象一位少妇正和老板娘在说着话。]],
  exit = {
    s = { to = '大理城西大街#1N', },
    w = { to = '大理城绣楼', },
    n = { to = '大理城西大街#3N', },
  },
},

['大理城西大街#1S'] = {
  id = '大理城西大街#1S',
  area = '大理城',
  name = '西大街',
  desc =  [[这里相对于北边的三月贸市街和东北边的城中心，显得安静了好多。大理近百年来从无战事，一片太平盛世的模样。西边过去就是善阐侯高升泰的府邸了，南面是大理西街，北面就是太和西街。]],
  exit = {
    s = { to = '大理城西大街#2S', },
    w = { to = '大理城善阐侯府', },
    n = { to = '大理城太和西街', },
  },
},

['大理城绣楼'] = {
  id = '大理城绣楼',
  area = '大理城',
  name = '绣楼',
  desc =  [[这家绣楼已开了几十年了，这里的老板娘祖上曾到中原学过刺绣织布回来开了这家店，好多有钱人都到这来买布买服装，你可以在这里买卖布匹，和编织自己的布匹。]],
  exit = {
    e = { to = '大理城西大街#2N', },
  },
},

['大理城司马堂'] = {
  id = '大理城司马堂',
  area = '大理城',
  name = '司马堂',
  desc =  [[这间大堂宽敞明亮，两壁各有一行兵器架，刀枪剑戟皆全，书案之后更有宝剑横于架上，堂中虎皮熊皮铺地，一望可之乃武官公堂。此堂正是大理国司马范烨的司所，司马责属军务，大理四境安宁，为数不多的兵马主要负责边境地区的治安而已。]],
  exit = {
    e = { to = '大理城府衙前厅', },
  },
},

['大理城药铺'] = {
  id = '大理城药铺',
  area = '大理城',
  name = '药铺',
  desc =  [[这是一家药铺，一股浓浓的药味让你几欲窒息，那是从药柜上的几百个小抽屉里散发出来的。药店掌柜独自坐在茶几旁，独自喝着茶，看也不看你一眼。一名小伙计站在柜台后招呼着顾客。柜台上贴着一张发黄的纸片。]],
  exit = {
    w = { to = '大理城东大街#2N', },
  },
},

['大理城铸剑房'] = {
  id = '大理城铸剑房',
  area = '大理城',
  name = '铸剑房',
  desc =  [[这是一家富丽堂皇的铸剑房，墙上挂满长剑，大刀、铁锤、铁棍、匕首等等兵器。屋角还摆着一个火炉，炉火把四周照得一片通红。炉边站着一位神态严肃的铸剑师，他不但手艺好，信誉也不错。]],
  exit = {
    e = { to = '大理城西大街#3S', },
  },
},

['大理城定安府'] = {
  id = '大理城定安府',
  area = '大理城',
  name = '定安府',
  desc =  [[这是大理的司法机关，接管的主要是一些民族之间的纠纷和误解，因此府里有汉族，白族，摆夷族，哈尼族，壮族官员各一名，以示公正。另外，府里还雇了通译，以便讯问。近年来事态安和，定安府门前清清淡淡。]],
  exit = {
    n = { to = '大理城南大街#1W', },
  },
},

['大理城司徒堂'] = {
  id = '大理城司徒堂',
  area = '大理城',
  name = '司徒堂',
  desc =  [[一所清静的书堂，打扫得干干净净。这里是司徒华赫艮的司所，司徒一般负责官吏选拔等文书工作，是以堂内文卷堆积。时有官员来此拜领印玺公文等物，前往所排遣的任地公干。]],
  exit = {
    w = { to = '大理城府衙前厅', },
  },
},

['大理城南门'] = {
  id = '大理城南门',
  area = '大理城',
  name = '南门',
  desc =  [[这是大理南城门，城楼建在高高的城台上，分上下两层，站在上面一看北边就是大理繁华的街市，一条石板大道向南边延伸，远处是群山，不知通往哪里,城墙下的武将和官兵正在检查着来往的行人。]],
  exit = {
    s = { to = '大理城南山路#1S', },
    n = { to = '大理城太和南街', },
  },
},

['大理城蝴蝶会'] = {
  id = '大理城蝴蝶会',
  area = '大理城',
  name = '蝴蝶会',
  desc =  [[蝴蝶泉的景致美，这里一年一度的蝴蝶会更加引人。每当春末夏初，雨季未到之前，周围田野庄稼收割将尽，田野较为干枯炎热，相对之下，蝴蝶泉就更加显得清凉湿润，这时恰好是蝴蝶交尾产卵的季节，成了远近数十里蝴蝶交欢的极乐世界。大量的蝴蝶，从四面八方，汇集在树荫下，花丛中，翩翩起舞，成千上万只彩蝶，欢聚一处，使这里变得花团锦簇。]],
  exit = {
    w = { to = '大理城蝴蝶泉', },
    e = { to = '大理城洱海园', },
  },
},

['大理城山路#1N'] = {
  id = '大理城山路#1N',
  area = '大理城',
  name = '山路',
  desc =  [[你正走在一条崎岖不平的路上,四周是阴森森的原始老林,不时传来一阵阵的野兽叫声,头顶有一些不知名的小鸟在跳来跳去，前面的路渐渐开阔,看来官道离这不远了,路旁有一块石碑(shibei),刻着一些字。]],
  exit = {
    s = { to = '大理城大道#4N', },
    n = { to = '大理城山路#2N', },
  },
},

['大理城洱海园'] = {
  id = '大理城洱海园',
  area = '大理城',
  name = '洱海园',
  desc =  [[洱海园位于下关城东北近郊，洱海之滨的团山上，距新桥约有二公里半从远处眺望，该山呈团形，故称团山，山上的洱海园也叫团山园。但登上苍山斜阳峰的山腹一看，便知道这座山并不是圆的，而是从东到西呈狭长形。西端，即靠市区的一端较高，向东则略低；北坡，即濒临洱海一面较陡，南坡地势较为平缓。由于团山位置适中，风光优美，]],
  exit = {
    w = { to = '大理城蝴蝶会', },
    eu = { to = '大理城灵山一会', },
  },
},

['大理城灵山一会'] = {
  id = '大理城灵山一会',
  area = '大理城',
  name = '灵山一会',
  desc =  [[不一里，到“灵山一会”坊址，这里是入山门户，左书“云路初登”，右书“灵山一会”。过坊缘溪前行，过“九品石”，越“石梁桥”，再经“大士阁”，见山谷丛林中飞瀑涌泻，声如雷鸣，蔚为壮观。]],
  exit = {
    wd = { to = '大理城洱海园', },
    eu = { to = '大理城鸡足山上', },
  },
},

['大理城绸缎庄'] = {
  id = '大理城绸缎庄',
  area = '大理城',
  name = '绸缎庄',
  desc =  [[一进门。老板就热情的迎上来了，这家铺面很大，这儿所卖的绸缎大多都是从中原购来的，另外也卖一些当地产布匹。]],
  exit = {
    e = { to = '大理城西大街#1N', },
  },
},

['大理城青石街#1'] = {
  id = '大理城青石街#1',
  area = '大理城',
  name = '青石街',
  desc =  [[这是一条宽阔的青石板街道，向南北两头延伸。北边高耸着一些房子，那就是大理皇宫了。南边是笔直走就能出大理南门，东面不断的有人骑马急驰而出，那里是一个驿站。还有不少人在西边挑选马匹，那是一家马房。]],
  exit = {
    e = { to = '大理城驿站', },
    s = { to = '大理城太和南街', },
    w = { to = '大理城马房', },
    n = { to = '大理皇宫皇宫正门', },
  },
},

['大理城西大街#1N'] = {
  id = '大理城西大街#1N',
  area = '大理城',
  name = '西大街',
  desc =  [[这是大理西大街，大理百姓把这里叫三月街，又叫观音街。是白族三月贸市古街。每到三月，这里挤满了交易的人群。西边是座新开的绸缎庄，生意很不错，不时有客人来往此处，南面就是太和西街了。]],
  exit = {
    s = { to = '大理城太和西街', },
    w = { to = '大理城绸缎庄', },
    n = { to = '大理城西大街#2N', },
  },
},

['大理城兵营'] = {
  id = '大理城兵营',
  area = '大理城',
  name = '兵营',
  desc =  [[这里是大理御林军的兵营，官兵们在武将的指挥下列队操练，尽管这么多年没有战事，官兵们还是在认真的排阵，对面就是镇南王府，士兵们不敢有任何松懈。这里可不是闲杂人等来的地方，你最好还是赶快离开。]],
  exit = {
    w = { to = '大理城东大街#1N', },
  },
},

['大理城青石街#2'] = {
  id = '大理城青石街#2',
  area = '大理城',
  name = '青石街',
  desc =  [[这是一条宽阔的青石板街道，向南北两头延伸。这里来来往往的大理臣民你推我挤，热闹非常。北边是一个广场，也就是大理的中心了。南边是一个客店，远远地看见上面挂着「迎宾馆」三个字。]],
  exit = {
    e = { to = '大理城豆腐坊', },
    s = { to = '大理城迎宾馆', },
    n = { to = '大理城城中心', },
  },
},

['大理城北大街#1W'] = {
  id = '大理城北大街#1W',
  area = '大理城',
  name = '北大街',
  desc =  [[这是大理北大街，这里人来人往，大理虽小，但是也颇兴旺，是西南的重要城市。向南走是座酒楼，不时有香气传了过来，东西连接着北大街，东边喧闹的声音不停的传了过来，快到大理城中心广场了。]],
  exit = {
    e = { to = '大理城太和北街', },
    w = { to = '大理城北大街#2W', },
    s = { to = '大理城风味小吃店', },
  },
},

['大理城南大街#2W'] = {
  id = '大理城南大街#2W',
  area = '大理城',
  name = '南大街',
  desc =  [[你走在大理南大街上，这里安静极了，大理百姓走到这里，无不放慢了脚步，以敬仰的目光向东看去，东边过去就是大理皇宫了。西边是叮叮当当地传来一阵打铁的响声，原来是个铁匠铺，南面有个规模不大的书肆。]],
  exit = {
    e = { to = '大理城南大街#1W', },
    s = { to = '大理城书肆', },
    w = { to = '大理城打铁铺', },
    n = { to = '大理城西大街#3S', },
  },
},

['大理城戏园子'] = {
  id = '大理城戏园子',
  area = '大理城',
  name = '戏园子',
  desc =  [[这是一座大理城里鼎鼎有名的戏园，台下不时地传来票友们的叫跃，喝彩声。场中一个大戏台，台上正演的精彩，是「武松打虎」，你也忍不住想坐下来看看戏，放松一下筋骨。]],
  exit = {
    e = { to = '大理城西大街#2S', },
  },
},

['大理城茶花园#3'] = {
  id = '大理城茶花园#3',
  area = '大理城',
  name = '茶花园',
  desc =  [[你走在一个小山坡上，这里到处都是盛开的鲜花，你有点眼花缭乱了，你漫步在这花园中，心情舒畅许多。]],
  exit = {
    ne = { to = '大理城茶花园#4', },
    nw = { to = '大理城茶花园#5', },
    sd = { to = '大理城茶花园#2', },
  },
},

['大理城大道#2N'] = {
  id = '大理城大道#2N',
  area = '大理城',
  name = '大道',
  desc =  [[一条笔直的石板大道通向前方，路上不时的有南来北往的车马经过，到了这里你发现穿民族服饰的人越来越多了，大理居民中有三分之一为少数民族，有彝、白、哈尼、傣等二十多个民族，路旁的茶花笑脸迎人。]],
  exit = {
    ne = { to = '大理城蝴蝶泉', },
    s = { to = '大理城大道#1N', },
    n = { to = '大理城大道#3N', },
  },
},

['大理城大富之家'] = {
  id = '大理城大富之家',
  area = '大理城',
  name = '大富之家',
  desc =  [[这是一家大理城内的富贵人家，这家主人经商一辈子，攒了不少钱，在大理城内盖了这么个大宅子，门口立着两个大石狮子，站着两个家丁。]],
  exit = {
    n = { to = '大理城南大街#1E', },
  },
},

['大理城山路#2N'] = {
  id = '大理城山路#2N',
  area = '大理城',
  name = '山路',
  desc =  [[你正走在一条崎岖不平的山路上，偶尔听到一阵阵的野兽叫声，头顶有一些不知名的小鸟在跳来跳去，四周丛林密布，鲜花绿草若隐若现，随着山谷里吹来的阵阵清风，传来哗哗的松涛声和一些淡淡的花香，身临其境，古朴、幽静之感油然而生。]],
  exit = {
    ne = { to = '无量山山中小溪', },
    s = { to = '大理城山路#1N', },
    n = { to = '大理城山路#3N', },
  },
},

['大理城茶馆'] = {
  id = '大理城茶馆',
  area = '大理城',
  name = '茶馆',
  desc =  [[一走进来，你就闻到一股清清的茶香，茶馆一角放着好多坛子，全装满了茶叶，有几个客人正在那细细的挑选茶叶。茶博士一脸微笑，招呼着在座的客人，各色客人坐满了周围，却也没有几分喧闹。]],
  exit = {
    e = { to = '大理城北大街#2W', },
  },
},

['大理城东大街#3S'] = {
  id = '大理城东大街#3S',
  area = '大理城',
  name = '东大街',
  desc =  [[你走在东大街上，街道上花草和树木郁郁葱葱，花香阵阵，街面是由碗口大的彩色石块铺成，青兰紫绿，煞是好看。城内居民族裔繁杂，习俗各异，饮食穿着无不异于中原。东面是个花店，买卖茶花，往南就是南大街了。]],
  exit = {
    e = { to = '大理城花店', },
    s = { to = '大理城南大街#2E', },
    n = { to = '大理城东大街#2S', },
  },
},

['大理城北大街#2E'] = {
  id = '大理城北大街#2E',
  area = '大理城',
  name = '北大街',
  desc =  [[这是大理北大街，这里人来人往，大理虽小，但是也颇兴旺，是西南的重要城市。这里北面是一个赌场，喧哗声不断传来，东面建筑高大，是官府的盐局。西面就是北大街，往南走就到了大理东大街。]],
  exit = {
    e = { to = '大理城作坊', },
    s = { to = '大理城东大街#3N', },
    w = { to = '大理城北大街#1E', },
    n = { to = '大理城赌场', },
  },
},

['大理城花店'] = {
  id = '大理城花店',
  area = '大理城',
  name = '花店',
  desc =  [[你一到这里，立即被一阵花香陶醉，只见从房顶到地面，全是花的世界标签上写着:「红妆素裹」,「十八学士」,「眼儿媚」,「风尘三侠」之类，大部分都是大理的国花：茶花，卖花的姑娘见你走了进来，忙迎了上来。]],
  exit = {
    w = { to = '大理城东大街#3S', },
  },
},

['大理城东大街#1N'] = {
  id = '大理城东大街#1N',
  area = '大理城',
  name = '东大街',
  desc =  [[你走在大理的东大街上，街道上花草和树木郁郁葱葱，花香阵阵。东边是大理御林军的兵营，人们走过都肃然无声，再往南走就到了太和东街。]],
  exit = {
    e = { to = '大理城兵营', },
    s = { to = '大理城太和东街', },
    n = { to = '大理城东大街#2N', },
  },
},

['大理城裁缝店'] = {
  id = '大理城裁缝店',
  area = '大理城',
  name = '裁缝店',
  desc =  [[这里是大理城内的一个小裁缝店，店主手艺不怎么样，可是由于仅此一家，生意倒还可以。店里四壁挂着客人们做好的衣服，还有一些是样品，老板满头大汗的忙着裁剪衣料。]],
  exit = {
    e = { to = '大理城西大街#3N', },
  },
},

['大理城鸡足山'] = {
  id = '大理城鸡足山',
  area = '大理城',
  name = '鸡足山',
  desc =  [[巍峨秀丽的鸡足山，屹立在滇西的宾川、大理、邓川、永胜、鹤床等县的交界处，它以耸入云表的天柱峰为中枢，前列三峰，后拖一岭，形如鸡足而得名。在方圆二百余里的莽莽大山中，又分为文笔、象鼻、满月等四十余座小山，有天柱、凤头等古三峰，风汉壁、舍身崖等三十四座石壁，有传经洞等四十五个崖窟，有乌龙潭、洗心涧、玉龙瀑布等溪泉一百余个。]],
  exit = {
    wd = { to = '大理城鸡足山上', },
  },
},

['大理城南大街#2E'] = {
  id = '大理城南大街#2E',
  area = '大理城',
  name = '南大街',
  desc =  [[这是繁华的大理南大街，街上人来人往，大理百姓走到这里，无不放慢了脚步，以敬仰的目光向西看去，西边过去就是大理皇宫了。南面传来一阵吆喝声，原来是个杂货铺，东面是文人骚客光顾的书院。北面就是大理东街了。]],
  exit = {
    e = { to = '大理城书院', },
    s = { to = '大理城杂货铺', },
    w = { to = '大理城南大街#1E', },
    n = { to = '大理城东大街#3S', },
  },
},

['大理城大理钱庄'] = {
  id = '大理城大理钱庄',
  area = '大理城',
  name = '大理钱庄',
  desc =  [[这家钱庄据说是来自中原的一位退位高官所开办，在全国各地开了不少分店。因为谣言，曾经有过一次挤兑风潮，钱庄一一兑付，不欠分毫。如今名气大震，发行的银票通行全国。]],
  exit = {
    s = { to = '大理城北大街#1E', },
  },
},

['大理城西大街#3S'] = {
  id = '大理城西大街#3S',
  area = '大理城',
  name = '西大街',
  desc =  [[你走在西大街上，街道上花草和树木郁郁葱葱，花香阵阵，街面是由碗口大的彩色石块铺成，青兰紫绿，煞是好看。城内居民族裔繁杂，习俗各异，饮食穿着无不异于中原。西面是家新开的铸剑房，看起来生意还不错。]],
  exit = {
    s = { to = '大理城南大街#2W', },
    w = { to = '大理城铸剑房', },
    n = { to = '大理城西大街#2S', },
  },
},

['大理城东大街#2S'] = {
  id = '大理城东大街#2S',
  area = '大理城',
  name = '东大街',
  desc =  [[你走在东大街上，街道上花草和树木郁郁葱葱，花香阵阵，街面是由碗口大的彩色石块铺成，青兰紫绿，煞是好看。城内居民族裔繁杂，习俗各异，饮食穿着无不异于中原。东面是个茶花园，品种繁多。]],
  exit = {
    e = { to = '大理城茶花园#1', },
    s = { to = '大理城东大街#3S', },
    n = { to = '大理城东大街#1S', },
  },
},

['大理城北门'] = {
  id = '大理城北门',
  area = '大理城',
  name = '北门',
  desc =  [[这是大理北城门，大理和大宋间的来往都要经过此门，往北你可看到一条宽广笔直的石板大道，可以通向中原。阳苜咩城，或简称苜咩城，是大理国的都城。自南诏于初创，历经陈氏“长大和国”、赵氏“大天兴国”、杨氏“大义宁国”诸代而至当今的段氏的“大理国”，均以此城为都。城门两边的武将和士兵门认真地检查着过往的行人，不少中原来的江洋大盗均在此落网。]],
  exit = {
    s = { to = '大理城太和北街', },
    n = { to = '大理城大道#1N', },
  },
},

['大理城北大街#1E'] = {
  id = '大理城北大街#1E',
  area = '大理城',
  name = '北大街',
  desc =  [[这是大理北大街，大理近百年来从无战事，一片太平盛世的模样。往北进出的好象都是有钱财主。南面就是大理有名的云雪楼了，从里面不时传出诱人的香味。东西连接着大理北大街。]],
  exit = {
    e = { to = '大理城北大街#2E', },
    s = { to = '大理城云雪楼', },
    w = { to = '大理城太和北街', },
    n = { to = '大理城大理钱庄', },
  },
},

['大理城善阐侯府'] = {
  id = '大理城善阐侯府',
  area = '大理城',
  name = '善阐侯府',
  desc =  [[这座府邸规模略小。门口上悬一大牌，几个金字“善阐侯府”，善阐侯高升泰是镇南王的结义兄弟，多年来为皇上立下战功，特赐此府邸。府内堂的门都紧闭着，没有什么别的出口，东面通向西大街。]],
  exit = {
    e = { to = '大理城西大街#1S', },
  },
},

['大理城作坊'] = {
  id = '大理城作坊',
  area = '大理城',
  name = '作坊',
  desc =  [[这是间简陋的小屋子，屋子里面最引人注目的是那口终日不息的熬药锅。这个作坊一般不生产成药，而只是收购采药人采回来的药材原料，加工成可以用来配药的药材原料。]],
  exit = {
    w = { to = '大理城北大街#2E', },
  },
},

['大理城打铁铺'] = {
  id = '大理城打铁铺',
  area = '大理城',
  name = '打铁铺',
  desc =  [[这里是一间打铁铺子，从火炉中冒出的火光将墙壁映得通红，屋子的角落里堆满了各式铁器的完成品或未完成品，像是锄头、铁锤、铲子等，叮叮当当的声音敲得满屋子响。]],
  exit = {
    e = { to = '大理城南大街#2W', },
  },
},

['大理城南大街#1E'] = {
  id = '大理城南大街#1E',
  area = '大理城',
  name = '南大街',
  desc =  [[这是繁华的大理南大街，街上人来人往，大理百姓走到这里，无不放慢了脚步，以敬仰的目光向西看去，西边过去就是大理皇宫了。南面住着一家大富人家，门口站着几个家人，西边就是太和南街了。]],
  exit = {
    e = { to = '大理城南大街#2E', },
    w = { to = '大理城太和南街', },
    s = { to = '大理城大富之家', },
  },
},

['大理城迎宾馆'] = {
  id = '大理城迎宾馆',
  area = '大理城',
  name = '迎宾馆',
  desc =  [[你现在正站在大理城北边的一家客店里，这家客店是大理城最负盛名的一家，来自中原的旅人都喜欢聚集在这里交换旅途上的见闻，你也可以在这里打听到许多有趣的消息。靠近门口的地方有一块乌木雕成的招牌(sign)。]],
  exit = {
    enter = { to = '大理城走廊#1', no_wander = true, },
    n = { to = '大理城青石街#2', },
  },
},

['大理城东大街#3N'] = {
  id = '大理城东大街#3N',
  area = '大理城',
  name = '东大街',
  desc =  [[这是大理东大街，街道上花草和树木郁郁葱葱，花香阵阵。西面不时传来阵阵诱人的香味，原来是有名的云雪楼。东面是个当铺，很多穷苦人家为了生计不得不把家中值钱的东西典当换钱。往北走就是大理的北大街了。]],
  exit = {
    e = { to = '大理城当铺', },
    s = { to = '大理城东大街#2N', },
    w = { to = '大理城云雪楼', },
    n = { to = '大理城北大街#2E', },
  },
},

['大理城书肆'] = {
  id = '大理城书肆',
  area = '大理城',
  name = '书肆',
  desc =  [[这是书店，整个房间布满了书架，书店的主人本是中原一个秀才，屡次参加朝庭科举应试，全部落榜，深感怀才不遇。一气之下，来到这西南小国开了这家书店为生。]],
  exit = {
    n = { to = '大理城南大街#2W', },
  },
},

['大理城西大街#2S'] = {
  id = '大理城西大街#2S',
  area = '大理城',
  name = '西大街',
  desc =  [[你走在西大街上，街道上花草和树木郁郁葱葱，花香阵阵，街面是由碗口大的彩色石块铺成，青兰紫绿，煞是好看。城内居民族裔繁杂，习俗各异，饮食穿着无不异于中原。西面是个戏院，正热闹地上演着好戏。]],
  exit = {
    s = { to = '大理城西大街#3S', },
    w = { to = '大理城戏园子', },
    n = { to = '大理城西大街#1S', },
  },
},

['大理城山路#3N'] = {
  id = '大理城山路#3N',
  area = '大理城',
  name = '山路',
  desc =  [[你正走在一条崎岖不平的山路上，偶尔听到一阵阵的野兽叫声，头顶有一些不知名的小鸟在跳来跳去，四周丛林密布，鲜花绿草若隐若现，随着山谷里吹来的阵阵清风，传来哗哗的松涛声和一些淡淡的花香，身临其境，古朴、幽静之感油然而生。]],
  exit = {
    s = { to = '大理城山路#2N', },
    n = { to = '成都城小南门', },
  },
},

['大理城大道#3N'] = {
  id = '大理城大道#3N',
  area = '大理城',
  name = '大道',
  desc =  [[一条笔直的石板大道通向前方，路上不时的有南来北往的车马经过，不少行人手持各种兵器，看来都是习武之人，大理段家上自皇爷，下至王子，数代保留祖上武林传统，民间习武之风更是盛行。]],
  exit = {
    s = { to = '大理城大道#2N', },
    n = { to = '大理城大道#4N', },
  },
},

['大理城大道#1N'] = {
  id = '大理城大道#1N',
  area = '大理城',
  name = '大道',
  desc =  [[一条笔直的石板大道通向前方，路上不时的有南来北往的车马经过，到了这里你发现穿民族服饰的人越来越多了，大理居民中有三分之一为少数民族，有彝、白、哈尼、傣等二十多个民族，路旁的茶花笑脸迎人。]],
  exit = {
    s = { to = '大理城北门', },
    n = { to = '大理城大道#2N', },
  },
},

['大理城东大街#1S'] = {
  id = '大理城东大街#1S',
  area = '大理城',
  name = '东大街',
  desc =  [[这是大理东大街，城中一些王侯富户都集中的住在这里，路边站着几个大富人家的家丁，这里安静极了，大理百姓走到这里，无不放慢了脚步，以敬仰的目光向东看去，爱民如子的镇南王的王府就坐落在那里。]],
  exit = {
    e = { to = '大理王府镇南王府大门', },
    s = { to = '大理城东大街#2S', },
    n = { to = '大理城太和东街', },
  },
},

['大理城东大街#2N'] = {
  id = '大理城东大街#2N',
  area = '大理城',
  name = '东大街',
  desc =  [[你走在东大街上，街道上花草和树木郁郁葱葱，花香阵阵，风中夹着一丝丝从北边药房里传来的中药味，街道平滑如洗。透过树木，你可以看到西边是一个豆腐坊，再往南就是太和东街了。]],
  exit = {
    e = { to = '大理城药铺', },
    s = { to = '大理城东大街#1N', },
    w = { to = '大理城豆腐坊', },
    n = { to = '大理城东大街#3N', },
  },
},

['大理城府衙前厅'] = {
  id = '大理城府衙前厅',
  area = '大理城',
  name = '府衙前厅',
  desc =  [[这里是大理国机要府衙的前厅，乃大理官员商议国政军务之所，厅堂并不很大，装饰朴素，厅门有御林军将士把手。除了南面出口，堂内另三面各有一门，通往三公各自的司堂。]],
  exit = {
    e = { to = '大理城司徒堂', },
    s = { to = '大理城北大街#2W', },
    w = { to = '大理城司马堂', },
    n = { to = '大理城司空堂', },
  },
},

['无量山石板路'] = {
  id = '无量山石板路',
  area = '无量山',
  name = '石板路',
  desc =  [[你走在一条宽阔的石板路上。这是用一米见方的巨大石板铺设而成的，可以并行十来个人也绝无问题。两侧是参天古柏，直耸入天，上端树冠相叠，遮天蔽日。路的尽头，就是剑湖宫了。]],
  exit = {
    e = { to = '无量山东厅', },
    out = { to = '无量山无量剑宗', },
    w = { to = '无量山西厅', },
    n = { to = '无量山剑湖宫', },
  },
},

['无量山万劫谷'] = {
  id = '无量山万劫谷',
  area = '无量山',
  name = '万劫谷',
  desc =  [[你来到了万劫谷内，对面不远处是几间瓦房，左首边另有一间小瓦房。两边的山壁很陡峭，看来是没法上下的。谷中一条小路绕过正面的房舍通往谷后，不知去向什么地方。]],
  exit = {
    s = { to = '无量山客厅', },
    w = { to = '无量山小厅', },
    n = { to = '无量山谷中小径', },
  },
},

['无量山青石台阶#2'] = {
  id = '无量山青石台阶#2',
  area = '无量山',
  name = '青石台阶',
  desc =  [[这是由青石砌成的台阶，方方正正，看起来颇为考究，大青石一块一块直铺到大厅，台阶两边还做了栏杆。台阶四周长着一些野草，头顶有一些不知名的小鸟在跳来跳去。]],
  exit = {
    nu = { to = '无量山无量剑宗', },
    ed = { to = '无量山青石台阶#1', },
  },
},

['无量山铁索桥'] = {
  id = '无量山铁索桥',
  area = '无量山',
  name = '铁索桥',
  desc =  [[铁索桥共是四条铁索，两条在下，上铺木板，以供行走，两条在旁作为扶手。一踏上桥，几条铁索便即幌动，行到江心，铁索晃得更加厉害，一瞥眼间，但见江水荡荡，激起无数泡沫，如快马奔腾般从脚底飞过，只要一个失足，卷入江水，任你多好的水性也难活命。 ]],
  exit = {
    s = { to = '无量山江岸', },
    n = { to = '无量山黑森林', },
  },
},

['无量山无量剑宗'] = {
  id = '无量山无量剑宗',
  area = '无量山',
  name = '无量剑宗',
  desc =  [[「无量剑」于五代后唐年间在南诏无量山创派，掌门人居住无量山剑湖宫。自大宋仁过年间分为东、北、西三宗，每隔五年，三宗门下弟子便在剑湖宫中比武斗剑，获胜者入住剑湖宫。]],
  exit = {
    sd = { to = '无量山青石台阶#2', },
    enter = { to = '无量山石板路', },
  },
},

['无量山澜沧江畔'] = {
  id = '无量山澜沧江畔',
  area = '无量山',
  name = '澜沧江畔',
  desc =  [[你一眼望出去，之见前面怒涛汹涌，水流湍急，竟是一条大江。江岸山石壁立，嶙峋巍峨，看这情势，已是到了澜沧江畔。江面有十来丈高，但要走到江岸，却也着实不易。 ]],
  exit = {
    w = { to = '无量山荆棘林#1', },
    e = { to = '无量山江岸', },
  },
},

['无量山乱石堆'] = {
  id = '无量山乱石堆',
  area = '无量山',
  name = '乱石堆',
  desc =  [[你片刻间转过山坳，只见一大堆乱石之中团团坐着二十余人。人丛中一个瘦小的老者坐在一块高岩之上，高出旁人。]],
  exit = {
    sw = { to = '无量山青石小路#2', },
  },
},

['无量山青石台阶#1'] = {
  id = '无量山青石台阶#1',
  area = '无量山',
  name = '青石台阶',
  desc =  [[这是由青石砌成的台阶，方方正正，看起来颇为考究，大青石一块一块直铺到大厅，台阶两边还做了栏杆。台阶四周长着一些野草，头顶有一些不知名的小鸟在跳来跳去。]],
  exit = {
    sd = { to = '无量山青石小路#3', },
    wu = { to = '无量山青石台阶#2', },
  },
},

['无量山东厅'] = {
  id = '无量山东厅',
  area = '无量山',
  name = '东厅',
  desc =  [[这里是供来无量剑的客人休息之用，一应茶点具备，窗边一溜平放着不少锦凳，墙上挂着几幅山水画，几缕阳光透过窗外的绿荫中直射进来。]],
  exit = {
    w = { to = '无量山石板路', },
  },
},

['无量山无量山路'] = {
  id = '无量山无量山路',
  area = '无量山',
  name = '无量山路',
  desc =  [[你正走在一条崎岖不平的路上,四周是阴森森的原始老林,不时传来一阵阵的野兽叫声, 头顶有一些不知名的小鸟在跳来跳去。东边一条山路向上延伸，不知道通向哪里。]],
  exit = {
    eu = { to = '无量山青石小路#1', },
    nd = { to = '无量山山中小溪', },
  },
},

['无量山山中小溪'] = {
  id = '无量山山中小溪',
  area = '无量山',
  name = '山中小溪',
  desc =  [[在山路的旁边了出现一条小溪。周围安静极了，只听见小河流水在孱孱作响。一些口渴的行人在溪边喝水，远处好象有一些看不清模样的动物也在溪里玩闹。南面是一条上山的路，正北面都是荆棘和矮草灌木，走在里面一定会划伤身体，依稀有一条小路通向深处。]],
  exit = {
    sw = { to = '大理城山路#2N', },
    su = { to = '无量山无量山路', },
    n = { to = '无量山荆棘林#1', },
  },
},

['无量山小厅'] = {
  id = '无量山小厅',
  area = '无量山',
  name = '小厅',
  desc =  [[一间雅致的小厅，桌上点着一对巨烛，东壁上有四幅屏条，绘的是梅兰竹菊，可是顺序却挂成了兰竹梅菊，西壁上的春夏秋冬，则挂成了冬夏春秋。看来此间主人必是个武人。]],
  exit = {
    e = { to = '无量山万劫谷', },
  },
},

['无量山黑森林'] = {
  id = '无量山黑森林',
  area = '无量山',
  name = '黑森林',
  desc =  [[你快步而行，只见迎面黑压压的一座大森林。走近前去，只见左首一排九株大松树参天并列，好象有些异样。]],
  exit = {
    s = { to = '无量山铁索桥', },
    hidden = { to = '无量山万劫谷谷口', cmd = 'enter 第四株', },
  },
},

['无量山厢房'] = {
  id = '无量山厢房',
  area = '无量山',
  name = '厢房',
  desc =  [[这是内室厢房，四周布置一望便知是小姐的闺房。石桌石凳，颇有山野气息，房里乱挂了些书画，一望可知主人是没有什么修养的。窗外盛开着一些野山茶花，不远处的山石提醒你这是在一个山谷里。]],
  exit = {
    w = { to = '无量山客厅', },
  },
},

['无量山青石小路#2'] = {
  id = '无量山青石小路#2',
  area = '无量山',
  name = '青石小路',
  desc =  [[这是由青石铺成的小路，路面上夹杂着一些泥沙，小路两边长着一些野草，开出来的野花飘着阵阵花香。四周是阴森森的原始老林，不时传来一阵阵的野兽叫声, 头顶有一些不知名的小鸟在跳来跳去。]],
  exit = {
    ne = { to = '无量山乱石堆', },
    wd = { to = '无量山青石小路#1', },
    nu = { to = '无量山青石小路#3', },
  },
},

['无量山谷中小径'] = {
  id = '无量山谷中小径',
  area = '无量山',
  name = '谷中小径',
  desc =  [[你走在谷中的一条小径上，这里十分荒僻，头顶有一些不知名的小鸟在跳来跳去，四周丛林密布，鲜花绿草若隐若现。]],
  exit = {
    s = { to = '无量山万劫谷', },
    n = { to = '无量山万劫谷谷口', },
  },
},

['无量山荆棘林#1'] = {
  id = '无量山荆棘林#1',
  area = '无量山',
  name = '荆棘林',
  desc =  [[你信步而行，举步踏到的尽是矮树长草，这里没有路,每走一步，荆棘都钩刺到小腿,划破你的身体。]],
  exit = {
    e = { to = '无量山澜沧江畔', },
    s = { to = '无量山山中小溪', },
    w = { to = '无量山荆棘林#1', },
    n = { to = '无量山荆棘林#2', cond = 'player.qi > 600 and player.jing > 200 and player.jingli > 200', },
  },
},

['无量山荆棘林#2'] = {
  id = '无量山荆棘林#2',
  area = '无量山',
  name = '荆棘林',
  desc = [[你信步而行，举步踏到的尽是矮树长草，这里没有路,每走一步，荆棘都钩刺到小腿,划破你的身体。]],
  exit = {
    e = { to = '无量山荆棘林#3', },
    s = { to = '无量山荆棘林#1', },
    w = { to = '无量山荆棘林#3', },
    n = { to = '无量山荆棘林#3', },
  },
},

['无量山荆棘林#3'] = {
  id = '无量山荆棘林#3',
  area = '无量山',
  name = '荆棘林',
  desc = [[你信步而行，举步踏到的尽是矮树长草，这里没有路,每走一步，荆棘都钩刺到小腿,划破你的身体。]],
  exit = {
    e = { to = '无量山斜坡#2', cond = 'player.skill["基本轻功"] and player.skill["基本轻功"].level >= 20', },
    s = { to = '无量山荆棘林#2', },
    w = { to = '无量山斜坡#1', cond = 'player.skill["基本轻功"] and player.skill["基本轻功"].level >= 20', },
    n = { to = '无量山荆棘林#4', },
  },
},

['无量山荆棘林#4'] = {
  id = '无量山荆棘林#4',
  area = '无量山',
  name = '荆棘林',
  desc = [[你信步而行，举步踏到的尽是矮树长草，这里没有路,每走一步，荆棘都钩刺到小腿,划破你的身体。]],
  exit = {
    e = { to = '无量山斜坡#1', cond = 'player.skill["基本轻功"] and player.skill["基本轻功"].level >= 20', },
    s = { to = '无量山荆棘林#3', },
    w = { to = '无量山斜坡#2', cond = 'player.skill["基本轻功"] and player.skill["基本轻功"].level >= 20', },
    n = { to = '无量山山路#M', no_wander = true, },
  },
},

['无量山斜坡#1'] = {
  id = '无量山斜坡#1',
  area = '无量山',
  name = '斜坡',
  desc = [[这里是个斜坡,你小心翼翼的走着,斜坡不算很深,可掉下去决不是闹着玩的,这里杂草丛生,十分荒凉,地上散着几块骨骸.]],
  exit = {
    e = { to = '无量山荆棘林#4', },
    s = { to = '无量山荆棘林#3', },
    w = { to = '无量山荆棘林#2', },
    n = { to = '无量山荆棘林#3', },
  },
},

['无量山斜坡#2'] = {
  id = '无量山斜坡#2',
  area = '无量山',
  name = '斜坡',
  desc = [[这里是个斜坡,你小心翼翼的走着,斜坡不算很深,可掉下去决不是闹着玩的,这里杂草丛生,十分荒凉,地上散着几块骨骸.]],
  exit = {
    e = { to = '无量山荆棘林#2', },
    s = { to = '无量山荆棘林#3', },
    w = { to = '无量山荆棘林#4', },
    n = { to = '无量山荆棘林#3', },
  },
},

['无量山山路#M'] = {
  id = '无量山山路#M',
  area = '无量山',
  name = '山路',
  desc = [[你信步而行，举步踏到的尽是矮树长草，这里没有路,每走一步，荆棘都钩刺到小腿,划破你的身体。]],
  exit = {
    e = { to = '无量山山路#M', },
    s = { to = '无量山山路#M', },
    w = { to = '无量山山路#M', },
    n = { to = '无量山山路#M', },
  },
},

['无量山青石小路#1'] = {
  id = '无量山青石小路#1',
  area = '无量山',
  name = '青石小路',
  desc =  [[这是由青石铺成的小路，路面上夹杂着一些泥沙，小路两边长着一些野草，开出来的野花飘着阵阵花香。四周是阴森森的原始老林，不时传来一阵阵的野兽叫声, 头顶有一些不知名的小鸟在跳来跳去。]],
  exit = {
    wd = { to = '无量山无量山路', },
    eu = { to = '无量山青石小路#2', },
  },
},

['无量山青石小路#3'] = {
  id = '无量山青石小路#3',
  area = '无量山',
  name = '青石小路',
  desc =  [[这是由青石铺成的小路，路面上夹杂着一些泥沙，小路两边长着一些野草，开出来的野花飘着阵阵花香。四周是阴森森的原始老林，不时传来一阵阵的野兽叫声, 头顶有一些不知名的小鸟在跳来跳去。]],
  exit = {
    nu = { to = '无量山青石台阶#1', },
    sd = { to = '无量山青石小路#2', },
  },
},

['无量山客厅'] = {
  id = '无量山客厅',
  area = '无量山',
  name = '客厅',
  desc =  [[万劫谷的正房，这是一间大客厅，宽敞明亮，青石铺的地，两边靠墙摆着的刀枪架，十八般兵器样样俱全。正中一张八仙桌，上有清茶一盏。旁边是谷主坐的太师椅。]],
  exit = {
    e = { to = '无量山厢房', },
    n = { to = '无量山万劫谷', },
  },
},

['无量山剑湖宫'] = {
  id = '无量山剑湖宫',
  area = '无量山',
  name = '剑湖宫',
  desc =  [[宫内坐着二人，上首是个四十左右的中年道姑，下首是个五十余岁的老者。西首锦凳上所坐的则是别派人士，其中有的是东西二宗掌门人共同出面邀请的公证人，其余则是前来观礼的嘉宾。这些人都是云南武林中的知名之士。]],
  exit = {
    e = { to = '无量山东练武厅', },
    s = { to = '无量山石板路', },
    w = { to = '无量山西练武厅', },
    n = { to = '无量山后院', },
  },
},

['无量山西练武厅'] = {
  id = '无量山西练武厅',
  area = '无量山',
  name = '西练武厅',
  desc =  [[这是无量山剑湖宫的练功房，两边有两个兵器架，十八武器样样俱全，墙角还散放着几个练力的石锤和一些杂物，宫中弟子每天在此练功。]],
  exit = {
    e = { to = '无量山剑湖宫', },
  },
},

['无量山江岸'] = {
  id = '无量山江岸',
  area = '无量山',
  name = '江岸',
  desc =  [[江岸尽是山石，小路也没一条，七高八低的走出七八里地，见到一株野生桃树，树上结实累累。又走了十馀里，才见到一条小径。沿着小径行去，终于见了过江的铁索桥，只见桥边石上刻着“善人渡”三个大字。 ]],
  exit = {
    w = { to = '无量山澜沧江畔', },
    n = { to = '无量山铁索桥', },
  },
},

['无量山西厅'] = {
  id = '无量山西厅',
  area = '无量山',
  name = '西厅',
  desc =  [[这里是供来无量剑的客人休息之用，一应茶点具备，窗边一溜平放着不少锦凳，墙上挂着几幅山水画，几缕阳光透过窗外的绿荫中直射进来。]],
  exit = {
    e = { to = '无量山石板路', },
  },
},

['无量山大松林'] = {
  id = '无量山大松林',
  area = '无量山',
  name = '大松林',
  desc =  [[你眼前骤然一黑，朦胧中，只见左右前后，到处都是铺天盖地的松树林。几十丈高的大松树簇在一块，密实的枝叶象一蓬蓬巨伞般伸向天空，把阳光遮得丝毫也无。尺把厚的松针积在地上，一脚踩下去，半天拔不出来。你似乎迷失了方向，象没头苍蝇般到处乱闯。]],
  exit = {
    e = { to = '无量山大松林', },
    e2 = { to = '无量山大瀑布', ignore = true, },
    s = { to = '无量山大松林', },
    s2 = { to = '无量山后院', ignore = true, },
    w = { to = '无量山大松林', },
    n = { to = '无量山大松林', },
    hidden1 = { to = '无量山大瀑布', cost = 5, handler = 'wls_songlin', },
    hidden2 = { to = '无量山后院', cost = 5, handler = 'wls_songlin', },
  },
},

['无量山大瀑布'] = {
  id = '无量山大瀑布',
  area = '无量山',
  name = '大瀑布',
  desc =  [[你又奔出一阵，双腿酸软，气喘吁吁，终于走出了大松林。猛听得水声响亮，轰轰隆隆，便如潮水大至一般，抬头一看，只见西北角上犹如银河倒悬，一条大瀑布从高崖上直泻下来。]],
  exit = {
    w = { to = '无量山大松林', },
    se = { to = '无量山白龙峰', },
  },
},

['无量山白龙峰'] = {
  id = '无量山白龙峰',
  area = '无量山',
  name = '白龙峰',
  desc = [[走出十余里，你来到无量山主峰的后山，已来到无量剑派禁地，任何外人不得擅入。这里丛林密布，山石怪异。旁边就是一深不见底的悬崖(cliff)。]],
  exit = {
    nw = { to = '无量山大瀑布', },
    hidden1 = { to = '无量山半空', cmd = 'jump down', cond = 'player.flag["凌波微步"]', },
    hidden2 = { to = '大理城山路#2N', cost = 100, cmd = 'jump down', },
  },
},

['无量山半空'] = {
  id = '无量山半空',
  area = '无量山',
  name = '半空',
  desc = [[你吓出一身冷汗，不管全身的疼痛，伸出手牢牢抱住古松的树枝，登时挂在半空，不住摇晃，向下望去，只见深谷中云雾弥漫，还是不见尽头，周围只有树枝在不停的摇晃。下面是悬崖，再往下掉看来危险万分。]],
  exit = {
    hidden1 = { to = '无量山树上', cmd = 'climb yabi', },
    hidden2 = { to = '大理城山路#2N', cost = 100, cmd = 'down', },
  },
},

['无量山树上'] = {
  id = '无量山树上',
  area = '无量山',
  name = '树上',
  desc = [[你现在的处境还是不妙，树枝不停地发出『吱吱』的响声，随时会断你人还是挂在半空，不住摇晃，向下望去，只见深谷中云雾弥漫，见不到尽头，看那崖壁好象有条细缝(feng)。]],
  exit = {
    hidden1 = { to = '无量山半山', cmd = 'reach feng', },
    hidden2 = { to = '大理城山路#2N', cost = 100, cmd = 'move', },
  },
},

['无量山半山'] = {
  id = '无量山半山',
  area = '无量山',
  name = '半山',
  desc = [[这山崖似乎无穷无尽，幸好崖缝中有不少砂石，不至于一溜而下，越到底越是平缓，不再是危崖笔立，但耳中轰隆轰隆的声音越来越响，只觉水珠如下大雨溅到脸上，隐隐生疼。]],
  exit = {
    d = { to = '无量山半山', },
    d2 = { to = '无量山山谷底部', ignore = true, },
    hidden = { to = '无量山山谷底部', cmd = 'pa down', },
  },
},

['无量山山谷底部'] = {
  id = '无量山山谷底部',
  area = '无量山',
  name = '山谷底部',
  desc = [[只见左边山崖上一条大瀑布如玉龙悬空，滚滚而下，倾入一座清澈异常的大湖之中，大瀑布不断倾入，湖水却不满溢，瀑布注入处湖水翻腾，只离得瀑布十余丈，湖水便又一平如镜，四周围长满了杂草(cao)。]],
  exit = {
    w = { to = '无量山东湖边', },
    hidden = { to = '大理城山路#2N', cmd = 'zuan cao', },
  },
},

['无量山东湖边'] = {
  id = '无量山东湖边',
  area = '无量山',
  name = '东湖边',
  desc = [[这湖作椭园之形，大半部隐在花树丛中，东南西北尽是悬崖峭壁，只有刚爬下来的山坡比较最斜，其他各处决计无法攀上，湖畔生长着一丛丛的茶花，摇夷生姿。湖水清澈，闪着银光。]],
  exit = {
    e = { to = '无量山山谷底部', },
    sw = { to = '无量山北湖边', },
    w = { to = '无量山西湖边', },
    n = { to = '无量山山中密林#E', },
  },
},

['无量山北湖边'] = {
  id = '无量山北湖边',
  area = '无量山',
  name = '北湖边',
  desc = [[这湖作椭园之形，大半部隐在花树丛中，东南西北尽是悬崖峭壁，只有刚爬下来的山坡比较最斜，其他各处决计无法攀上，湖畔生长着一丛丛的茶花，摇夷生姿。湖水清澈，闪着银光。]],
  exit = {
    ne = { to = '无量山东湖边', },
    se = { to = '无量山南湖边', },
    n = { to = '无量山山中密林#N', },
  },
},

['无量山南湖边'] = {
  id = '无量山南湖边',
  area = '无量山',
  name = '南湖边',
  desc = [[这湖作椭园之形，大半部隐在花树丛中，东南西北尽是悬崖峭壁，只有刚爬下来的山坡比较最斜，其他各处决计无法攀上，湖畔生长着一丛丛的茶花，摇夷生姿。湖水清澈，闪着银光。]],
  exit = {
    ne = { to = '无量山西湖边', },
    nw = { to = '无量山北湖边', },
    n = { to = '无量山山中密林#S', },
  },
},

['无量山西湖边'] = {
  id = '无量山西湖边',
  area = '无量山',
  name = '西湖边',
  desc = [[这湖作椭园之形，大半部隐在花树丛中，东南西北尽是悬崖峭壁，只有刚爬下来的山坡比较最斜，其他各处决计无法攀上，湖畔生长着一丛丛的茶花，摇夷生姿。湖水清澈，闪着银光。]],
  exit = {
    e = { to = '无量山东湖边', },
    sw = { to = '无量山南湖边', },
    n = { to = '无量山山中密林#W', },
  },
},

['无量山山中密林#W'] = {
  id = '无量山山中密林#W',
  area = '无量山',
  name = '山中密林',
  desc = [[仰望高崖，白雾封谷，谷中静悄悄的，别说人迹，就连兽踪也无半点，唯闻鸟语相间，遥相和呼，逆着瀑布从下往上看去，只见瀑布之右一块石壁光润如玉，不知多少年的冲激磨洗，才将这半面石壁磨得如此平整，后来瀑水量减少，才将这片如琉璃，如明镜的石壁露了出来。]],
  exit = {
    s = { to = '无量山西湖边', },
  },
},

['无量山山中密林#S'] = {
  id = '无量山山中密林#S',
  area = '无量山',
  name = '山中密林',
  desc = [[仰望高崖，白雾封谷，谷中静悄悄的，别说人迹，就连兽踪也无半点，唯闻鸟语相间，遥相和呼，逆着瀑布从下往上看去，只见瀑布之右一块石壁光润如玉，不知多少年的冲激磨洗，才将这半面石壁磨得如此平整，后来瀑水量减少，才将这片如琉璃，如明镜的石壁露了出来。]],
  exit = {
    s = { to = '无量山南湖边', },
  },
},

['无量山山中密林#N'] = {
  id = '无量山山中密林#N',
  area = '无量山',
  name = '山中密林',
  desc = [[仰望高崖，白雾封谷，谷中静悄悄的，别说人迹，就连兽踪也无半点，唯闻鸟语相间，遥相和呼，逆着瀑布从下往上看去，只见瀑布之右一块石壁光润如玉，不知多少年的冲激磨洗，才将这半面石壁磨得如此平整，后来瀑水量减少，才将这片如琉璃，如明镜的石壁露了出来。]],
  exit = {
    s = { to = '无量山北湖边', },
  },
},

['无量山山中密林#E'] = {
  id = '无量山山中密林#E',
  area = '无量山',
  name = '山中密林',
  desc = [[仰望高崖，白雾封谷，谷中静悄悄的，别说人迹，就连兽踪也无半点，唯闻鸟语相间，遥相和呼，逆着瀑布从下往上看去，只见瀑布之右一块石壁光润如玉，不知多少年的冲激磨洗，才将这半面石壁磨得如此平整，后来瀑水量减少，才将这片如琉璃，如明镜的石壁露了出来。]],
  exit = {
    s = { to = '无量山东湖边', },
    hidden = { to = '无量山树丛后', cmd = 'enter', },
  },
},

['无量山树丛后'] = {
  id = '无量山树丛后',
  area = '无量山',
  name = '树丛后',
  desc = [[这里光秃秃的一大片石壁，爬满藤蔓，但见石壁平整异常，宛然一面铜镜，只是比湖西的山壁小了许多，再细看那石壁，平整光滑，别无他异。]],
  exit = {
    out = { to = '无量山山中密林#E', },
    hidden = { to = '无量山石壁下', cmd = 'tear teng', },
  },
},

['无量山石壁下'] = {
  id = '无量山石壁下',
  area = '无量山',
  name = '石壁下',
  desc = [[你在一块大石壁(dashi)下，下面是一块小石璧(xiaoshi)，上面爬满了藤蔓，纵横交错，地下枯黄的树枝落叶积了好多层，看来很久这里没人来过了。]],
  exit = {
    out = { to = '无量山树丛后', },
    enter = { to = '无量山洞口', door = 'tear teng;#2 huang dashi left;#2 tui dashi right', },
  },
},


['无量山洞口'] = {
  id = '无量山洞口',
  area = '无量山',
  name = '洞口',
  desc = [[走得十余步，洞中已无丝毫光亮，但觉脚下平整，便似走在石板路上一样，洞中道路必是经过人工修整，只是道路不住的向下倾斜，显是越走越低突然之间，你碰到什么，有圆物铛的一下，声音清亮，原来是个门环(huan)]],
  exit = {
    out = { to = '无量山石壁下', },
    enter = { to = '无量山石室', door = 'knock huan;push huan', },
  },
},

['无量山石室'] = {
  id = '无量山石室',
  area = '无量山',
  name = '石室',
  desc = [[所处之地是座圆型石室，左边石壁上镶着一块水晶，约有铜盆大小，光亮即由水晶中透入。向外瞧去，可看到水流不停晃动，原来这里地处水底。室内有一石桌，尘土寸积，不知已有多少年无人来此。]],
  exit = {
    u = { to = '无量山台阶', },
    enter = { to = '无量山内室', },
    out = { to = '无量山洞口', },
  },
},

['无量山内室'] = {
  id = '无量山内室',
  area = '无量山',
  name = '内室',
  desc = [[眼前突然一亮，一个宫装美女，手持长剑，剑尖对准了你的胸膛。细看之下，原来是一座玉像(yuxiang)。东壁写了许多字(zi)，笔法飘逸，似以极强腕力以利器写成，西壁镶了六块大水晶，水晶外绿水隐隐，映得石室中比第一间石室亮了数倍。]],
  exit = {
    out = { to = '无量山石室', },
  },
},

['无量山台阶'] = {
  id = '无量山台阶',
  area = '无量山',
  name = '台阶',
  desc = [[一条台阶斜向上引，走到一百多级时，隐隐听到轰隆轰隆的水声，又行二百余级，水声已经震耳欲聋，前面并有光亮透入，走到台阶的尽头，前面是个仅可容身的洞穴。]],
  exit = {
    out = { to = '无量山江畔', },
    d = { to = '无量山石室', },
  },
},

['无量山江畔'] = {
  id = '无量山江畔',
  area = '无量山',
  name = '江畔',
  desc = [[外边怒涛汹涌，水流湍急，江岸山石壁立，嶙峋巍峨，看这情势，已是到了澜仓江边，容身处离讲面有十来丈高，江水纵然大涨，也不会淹到此处江岸全是山石。]],
  exit = {
    enter = { to = '无量山台阶', },
    d = { to = '无量山澜沧江畔', },
  },
},

['无量山万劫谷谷口'] = {
  id = '无量山万劫谷谷口',
  area = '无量山',
  name = '万劫谷谷口',
  desc =  [[眼前大片草地，尽头处又全是一株株松树。走过草地，只见一株大松上削下了丈许长、尺许宽的一片，漆上白漆，写着九个大字：“姓段者入此谷杀无赦”。八字黑色，那“杀”字却作殷红之色。 ]],
  exit = {
    s = { to = '无量山谷中小径', },
    out = { to = '无量山黑森林', },
  },
},

['无量山东练武厅'] = {
  id = '无量山东练武厅',
  area = '无量山',
  name = '东练武厅',
  desc =  [[这是无量山剑湖宫的练功房，两边有两个兵器架，十八武器样样俱全，墙角还散放着几个练力的石锤和一些杂物，宫中弟子每天在此练功。 ]],
  exit = {
    w = { to = '无量山剑湖宫', },
  },
},

['无量山后院'] = {
  id = '无量山后院',
  area = '无量山',
  name = '后院',
  desc =  [[后院乃剑湖宫清闲之所，一排茶花相间而开，青藤绕树，两三果子忽隐忽现。靠墙放着一张长桌子，上面放了些水果，还有一只大水壶。几只青瓷小碗洗得干干净净。北面是一片松林，也是无量剑派的禁地。]],
  exit = {
    s = { to = '无量山剑湖宫', },
    n = { to = '无量山大松林', },
  },
},

['大理城南下关风'] = {
  id = '大理城南下关风',
  area = '大理城南',
  name = '下关风',
  desc =  [[大理城“风花雪月”四景，富有诗情画意，早已脍炙人口。四景之中，首推其风。象苍山顶上终年积雪一样，下关风四季呼啸，确有奇异之处。据说下关风原来是装在观音老母的瓶子里。很早很早以前，苍山上有一个狐狸精变的美貌女子，为救落入洱海的情人，历尽艰辛，到南海向观音菩萨求得六瓶风。只因美女救人心切，不慎在下关天生桥跌了一跤，打破了五个风瓶。从此以后，天生桥大风不止。]],
  exit = {
    e = { to = '大理城南安宁温泉', },
    nd = { to = '大理城南山路#1S', },
    se = { to = '大理城南大观楼', },
  },
},

['大理城南秀山'] = {
  id = '大理城南秀山',
  area = '大理城南',
  name = '秀山',
  desc =  [[秀山位于通海县城南。通海县城临水依山，秀山紧靠其南，俯临城镇，点缀成一幅秀丽的山水图卷：前有杞麓湖波光澄碧，中有城镇屋舍俨然，后有秀山群峰列翠，颇具江南景色。秀山，林木扶疏，幽深静谧，春日杂花生树，夏日树影幢幛，秋日红叶萧萧，冬日枝干奇倔。山之中方，树木各异：山北之麓，翠如屏，在崎岖的小径上，白昼犹昏；北西山腰，则苍松古劲，掩映天日，分外幽深；山之西，密林覆盖，灌木丛生，人迹罕至，幽僻宁静；山之东，杉罗树及栗树，青翠欲滴，幽闲漫步最佳；山之南，则古松新松如幢幢翠盖，涛声不绝于耳，颇有幽雅聆曲之妙趣。]],
  exit = {
    sw = { to = '大理城南西双版纳', },
    nd = { to = '大理城南土林', },
  },
},

['大理城南游园会'] = {
  id = '大理城南游园会',
  area = '大理城南',
  name = '游园会',
  desc =  [[这里常举行游园联欢，载歌载舞，人山人海。有时还举办传统灯会，每晚游客不下数万。中秋之夜，春城人民爱在这里赏月，楼上亭边，满缀彩灯风清月白，滇池浮光耀金，廊外池水盈盈，树梢轻风徐来，花香飘逸，引人心醉。]],
  exit = {
    e = { to = '大理城南荷花池', },
  },
},

['大理城南海埂'] = {
  id = '大理城南海埂',
  area = '大理城南',
  name = '海埂',
  desc =  [[这里原是一条由东向西横插入滇池中的长堤，东面从金家河起，徐徐向西延伸，止于距西山脚一里许的滇池中。隔水与西山、大观楼等名胜遥相呼应，堤长约四公里半，宽处从四五十公尺至二三百公尺不等，它象一条漂浮在海中的玉带，将滇池一分为二：南为滇池主体，北为直达昆明城边的“草海”。]],
  exit = {
    nd = { to = '大理城南大观楼', },
    s = { to = '大理城南海埂南', },
    n = { to = '大理城南海埂北', },
  },
},

['大理城南海埂北'] = {
  id = '大理城南海埂北',
  area = '大理城南',
  name = '海埂北',
  desc =  [[这里被大理百姓称为“草海”，水平如镜，洲屿隐现，傍岸曲折，港汊纵横，苹天苇地。堤上大树参云，垂柳拂波。这里眺望湖光山色，别有佳趣往南行就到海埂了。]],
  exit = {
    s = { to = '大理城南海埂', },
  },
},

['大理城南西双版纳'] = {
  id = '大理城南西双版纳',
  area = '大理城南',
  name = '西双版纳',
  desc =  [[西双版纳是大理边疆一块美丽富饶的土地，澜沧江及其支流小黑江、普文河、流沙河、罗梭江、南腊河等河流，横贯全境。东部为无量山山地，西侧为怒山山地余脉，最高峰为孔明山，有允景洪、勐遮、勐罕、勐海、勐腊普文等坝子。在一望无际的原始森林里还繁殖着野象、虎、豹、犀牛、金丝猴、孔雀、犀鸟等珍禽异兽。]],
  exit = {
    ne = { to = '大理城南秀山', },
    e = { to = '大理城南澜沧江边#W', },
  },
},

['大理城南海埂南'] = {
  id = '大理城南海埂南',
  area = '大理城南',
  name = '海埂南',
  desc =  [[这里三面云山，一湖秀水，碧波浩荡，白帆点点，出没天际；斜坡缓舒形成细软白沙铺底的海滩，水绿沙白，清幽可爱，是附近最佳的天然游泳场。每当盛夏，这里游人如织，柳树丛中，沙滩上，到处都会挤满一群群，一伙伙来消夏的游人。]],
  exit = {
    n = { to = '大理城南海埂', },
  },
},

['大理城南安宁温泉'] = {
  id = '大理城南安宁温泉',
  area = '大理城南',
  name = '安宁温泉',
  desc =  [[这里位于昆明西郊约八十里的螳螂川畔。这里山峦叠翠、森林茂密、空气清新、自然环境优美，螳螂川江水绕泉而过。泉水质地优良，水温适当，含有人体多种疾病较好疗效的各种微量元素，被誉为“天下第一汤”。]],
  exit = {
    w = { to = '大理城南下关风', },
  },
},

['大理城南大观楼'] = {
  id = '大理城南大观楼',
  area = '大理城南',
  name = '大观楼',
  desc =  [[大观楼是昆明重要的风景区之一，位于城西南二公里的滇池岸边。据其地势，约可分成三片：近华浦、大观楼片，楼外楼、鲁园片，庚园，花圃及柏园片。这里往西可看到很多荷花。]],
  exit = {
    w = { to = '大理城南荷花池', },
    s = { to = '大理城南土林', },
    nw = { to = '大理城南下关风', },
    su = { to = '大理城南海埂', },
  },
},

['大理城南澜沧江边#W'] = {
  id = '大理城南澜沧江边#W',
  area = '大理城南',
  name = '澜沧江边',
  desc =  [[你一眼望出去，之见前面怒涛汹涌，水流湍急，竟是一条大江(river）。江岸山石壁立，嶙峋巍峨，看这情势，已是到了澜沧江畔。江面有十来丈高，但要走到江岸，却也着实不易。 ]],
  exit = {
    w = { to = '大理城南西双版纳', },
    enter = { to = '大理城南渡船', cmd = 'dujiang', unstable = true, handler = 'fly_across', no_wander = true, },
  },
},

['大理城南山路#1S'] = {
  id = '大理城南山路#1S',
  area = '大理城南',
  name = '山路',
  desc =  [[你正走在一条崎岖不平的山路上，偶尔听到一阵阵的野兽叫声，头顶有一些不知名的小鸟在跳来跳去，四周丛林密布，鲜花绿草若隐若现，随着山谷里吹来的阵阵清风，传来哗哗的松涛声和一些淡淡的花香，身临其境，古朴、幽静之感油然而生。]],
  exit = {
    su = { to = '大理城南下关风', },
    n = { to = '大理城南门', },
  },
},

['大理城南荷花池'] = {
  id = '大理城南荷花池',
  area = '大理城南',
  name = '荷花池',
  desc =  [[直往西行，垂杨夹道，荷池分列两旁。每当盛夏，那“出淤泥而不染”的荷花、荷叶或浮或立，密密层层，如碧玉盘，中捧莲花，白、粉、红、深红、洒金，五色焕然。若值雨后，珠滚玉盘，微风徐来，清香国溢，更令人快意。]],
  exit = {
    w = { to = '大理城南游园会', },
    e = { to = '大理城南大观楼', },
  },
},

['大理城南澜沧江边#E'] = {
  id = '大理城南澜沧江边#E',
  area = '大理城南',
  name = '澜沧江边',
  desc =  [[你一眼望出去，之见前面怒涛汹涌，水流湍急，竟是一条大江(river）。江岸山石壁立，嶙峋巍峨，看这情势，已是到了澜沧江畔。江面有十来丈高，但要走到江岸，却也着实不易。 ]],
  exit = {
    e = { to = '佛山镇林间道#6W', },
    enter = { to = '大理城南渡船', cmd = 'dujiang', unstable = true, handler = 'fly_across', no_wander = true, },
  },
},

['大理城南渡船'] = {
  id = '大理城南渡船',
  area = '大理城南',
  name = '渡船',
  desc =  [[一叶小舟，最多也就能载七、八个人。一名六十多岁的老艄公手持一根长竹篙，正在船尾吃力地撑着船。]],
  exit = {
    out2 = { to = '大理城南澜沧江边#E', unstable = true, handler = 'disembark', cost = 50, },
    out = { to = '大理城南澜沧江边#W', unstable = true, handler = 'disembark', cost = 50, },
  },
},

['大理城南土林'] = {
  id = '大理城南土林',
  area = '大理城南',
  name = '土林',
  desc =  [[一踏进土林。那千姿百态的造型，就仿佛使人进入另一个新奇天地。有的土柱如锥似剑，直蓝天；有的象威严武士，整装待发；有的如婷婷少女，凝视远方，有的土柱顶上杂草丛生，间或长有野花；有的砂石垒垒，裸露身躯。]],
  exit = {
    su = { to = '大理城南秀山', },
    w = { to = '桃源县小饭铺', },
    n = { to = '大理城南大观楼', },
  },
},

['嘉兴城西门'] = {
  id = '嘉兴城西门',
  area = '嘉兴城',
  name = '西门',
  desc =  [[这里是嘉兴的西门，城门不是很高，但是很古朴。出城一直走是一条细细的乡间小道，小道两旁长着大片大片茂密的竹林。放眼望去，阡陌纵横，一片江南水乡风光。]],
  exit = {
    e = { to = '嘉兴城西街#2', },
  },
},

['嘉兴城有间客栈'] = {
  id = '嘉兴城有间客栈',
  area = '嘉兴城',
  name = '有间客栈',
  desc =  [[这里是生意兴隆的有间客栈，附近的外地游客多选择在此落脚。一个年轻的店小二里里外外忙得团团转，接待着南腔北调的客人。客栈北面的墙上挂着一块醒目的招牌(zhaopai)。]],
  exit = {
    u = { to = '嘉兴城客店二楼', no_wander = true, },
    s = { to = '嘉兴城西街#2', },
  },
},

['嘉兴城後院'] = {
  id = '嘉兴城後院',
  area = '嘉兴城',
  name = '後院',
  desc =  [[这里是陆家庄後院。东边墙头上坐著一个男孩，伸手正去摘凌霄花。墙边花丛守着几个男孩女孩。]],
  exit = {
    n = { to = '嘉兴城大厅', },
  },
},

['嘉兴城天井'] = {
  id = '嘉兴城天井',
  area = '嘉兴城',
  name = '天井',
  desc =  [[这是陆家庄庄内的天井，正面有一个青石屏风，上面画着一幅画。对着门口有一个仆人正在低头扫地。]],
  exit = {
    w = { to = '嘉兴城大厅', },
    e = { to = '嘉兴城陆家庄', },
  },
},

['嘉兴城市集'] = {
  id = '嘉兴城市集',
  area = '嘉兴城',
  name = '市集',
  desc =  [[这是江南名城嘉兴的中心市集，市面上人来人往，很是热闹。各色各样的店铺沿街林立，里面摆着各种货品。南面的方向可以望见一座城门。从这里直奔城东就是风景如画的南湖。西北方的街道通往苏州。]],
  exit = {
    e = { to = '嘉兴城东街', },
    s = { to = '嘉兴城南街', },
    w = { to = '嘉兴城西街#1', },
    n = { to = '嘉兴城北街', },
  },
},

['嘉兴城西街#2'] = {
  id = '嘉兴城西街#2',
  area = '嘉兴城',
  name = '西街',
  desc =  [[这里是嘉兴的西街，街道不是很宽，但是很干净。脚下的路面铺着一层厚厚的青石板，显得整个街道悠闲而又古朴。东面是一个热闹的市集，不时传来阵阵嘈杂声，似乎很热闹。]],
  exit = {
    e = { to = '嘉兴城西街#1', },
    s = { to = '嘉兴城小巷#2', },
    w = { to = '嘉兴城西门', },
    n = { to = '嘉兴城有间客栈', },
  },
},

['嘉兴城铁枪庙'] = {
  id = '嘉兴城铁枪庙',
  area = '嘉兴城',
  name = '铁枪庙',
  desc =  [[这铁枪庙里祀奉的是五代时的名将，铁枪王彦章。因为年久失修，香火不是很旺盛，庙里的设施多已破损。庙旁有座高塔，建于何年何月人们已经无从知晓，塔顶群鸦世代为巢，当地乡民传说铁枪庙的乌鸦是神兵神将，向来不敢侵犯，以致乌鸦生养繁殖，越来越多。]],
  exit = {
    w = { to = '嘉兴城乡间小径#1', },
  },
},

['嘉兴城青石官道#2'] = {
  id = '嘉兴城青石官道#2',
  area = '嘉兴城',
  name = '青石官道',
  desc =  [[你走在一条青石大道上，人来人往非常繁忙，不时有人骑着马匆匆而过。西北通向苏州城。东南面是嘉兴城。]],
  exit = {
    nw = { to = '嘉兴城青石官道#1', },
    se = { to = '嘉兴城北门', },
  },
},

['嘉兴城小巷#2'] = {
  id = '嘉兴城小巷#2',
  area = '嘉兴城',
  name = '小巷',
  desc =  [[这里是嘉兴的小巷，街道不是很宽，但是很干净。脚下的路面铺着一层厚厚的青石板，显得整个街道悠闲而又古朴。附近是一个热闹的市集，不时传来阵阵嘈杂声，似乎很热闹。]],
  exit = {
    e = { to = '嘉兴城小巷#1', },
    s = { to = '嘉兴城旧园', },
    n = { to = '嘉兴城西街#2', },
  },
},

['嘉兴城南门'] = {
  id = '嘉兴城南门',
  area = '嘉兴城',
  name = '南门',
  desc =  [[这里是嘉兴的南门，城门不是很高，但是很古朴。出城一直走是一条细细的乡间小道，小道两旁长着大片大片茂密的竹林。放眼望去，阡陌纵横，一片江南水乡风光。]],
  exit = {
    s = { to = '嘉兴城乡间小径#1', },
    n = { to = '嘉兴城南街', },
  },
},

['嘉兴城旧园'] = {
  id = '嘉兴城旧园',
  area = '嘉兴城',
  name = '旧园',
  desc =  [[这是嘉兴城中一座不起眼的旧园，园子的主人不知道哪里去了，只留下破败的院落和崩塌的院墙和一地的荒草，满目疮痍。园子四周种有一些桑树，桑树丛中有一块空地。]],
  exit = {
    n = { to = '嘉兴城小巷#2', },
  },
},

['嘉兴城东边门'] = {
  id = '嘉兴城东边门',
  area = '嘉兴城',
  name = '东边门',
  desc =  [[这是嘉兴城的东边门，街道上行人不是很多，路面上的青石被江南的细雨洗刷得干干净净。东面可以望见几个游客的身影。从这里直奔城东就是风景如画的嘉兴南湖。西边是城中心。]],
  exit = {
    e = { to = '嘉兴城南湖#1', },
    w = { to = '嘉兴城东街', },
    n = { to = '嘉兴城杂货铺', },
  },
},

['嘉兴城坟墓'] = {
  id = '嘉兴城坟墓',
  area = '嘉兴城',
  name = '坟墓',
  desc =  [[这儿有两株高耸的大槐树，槐树下赫然并列著两座坟墓，一座墓碑上写著「陆公展元之墓」六字，另一碑下则是「陆门何夫人之墓」七字。墓畔青草齐膝，显是安葬已久。一青袍长须的老者呆呆望著墓碑，自言自语。]],
  exit = {
    w = { to = '嘉兴城树林', },
  },
},

['嘉兴城小巷#1'] = {
  id = '嘉兴城小巷#1',
  area = '嘉兴城',
  name = '小巷',
  desc =  [[这里是嘉兴的小巷，街道不是很宽，但是很干净。脚下的路面铺着一层厚厚的青石板，显得整个街道悠闲而又古朴。附近是一个热闹的市集，不时传来阵阵嘈杂声，似乎很热闹。]],
  exit = {
    w = { to = '嘉兴城小巷#2', },
    e = { to = '嘉兴城南街', },
  },
},

['嘉兴城乡间小径#2'] = {
  id = '嘉兴城乡间小径#2',
  area = '嘉兴城',
  name = '乡间小径',
  desc =  [[江南乡间阡陌纵横，小路弯来绕去，道路狭窄，你数次踏入田中，双脚全是烂泥。]],
  exit = {
    e = { to = '嘉兴城河岸', },
    se = { to = '嘉兴城树林', },
    n = { to = '嘉兴城乡间小径#1', },
  },
},

['嘉兴城湖边'] = {
  id = '嘉兴城湖边',
  area = '嘉兴城',
  name = '湖边',
  desc =  [[这里是嘉兴南湖湖畔。节近中秋，湖边的游人也多了起来，湖里的荷花有些已经凋谢，一群金红的鲤鱼在悠闲自在地啃着荷叶下丰满的莲藕。远处不时传来一阵轻柔而婉转的歌声，飘在烟水蒙蒙的湖面上。]],
  exit = {
    w = { to = '嘉兴城南湖#1', },
  },
},

['嘉兴城客店二楼'] = {
  id = '嘉兴城客店二楼',
  area = '嘉兴城',
  name = '客店二楼',
  desc =  [[你正走在客店二楼的走廊上，可以听到从客房里不时地呼呼的打酣声，一阵高过一阵。不时有睡意朦胧的旅客进进出出，到楼下的掌柜处付了钱再上来睡觉。]],
  exit = {
    enter = { to = '嘉兴城客房', },
    d = { to = '嘉兴城有间客栈', },
  },
},

['嘉兴城南湖#1'] = {
  id = '嘉兴城南湖#1',
  area = '嘉兴城',
  name = '南湖',
  desc =  [[这里是嘉兴南湖。节近中秋，荷叶渐残，莲肉饱实。一阵轻柔而婉转的歌声，飘在烟水蒙蒙的湖面上。远处湖面上三三两两的小舟上不时传来采莲少女的笑声。]],
  exit = {
    e = { to = '嘉兴城湖边', },
    w = { to = '嘉兴城东边门', },
    se = { to = '嘉兴城南湖#2', },
  },
},

['嘉兴城南湖#2'] = {
  id = '嘉兴城南湖#2',
  area = '嘉兴城',
  name = '南湖',
  desc =  [[这里是烟波浩淼的南湖。湖上几只画舫在游荡，船上的游客和青楼女子在嘻笑。湖水很深，没有船是渡不过去的。但不知是谁在湖底钉了一些木桩。桩顶潜在水面之下一两寸的地方。即使是不懂轻功的人走上去也像是水上漂的样子。]],
  exit = {
    nw = { to = '嘉兴城南湖#1', },
    s = { to = '嘉兴城烟雨楼#1', },
  },
},

['嘉兴城烟雨楼#2'] = {
  id = '嘉兴城烟雨楼#2',
  area = '嘉兴城',
  name = '烟雨楼',
  desc =  [[这里是烟雨楼的二楼，经常有文人墨客到这里游玩，凭栏远眺，观赏嘉兴的湖光山色。]],
  exit = {
    d = { to = '嘉兴城烟雨楼#1', },
  },
},

['嘉兴城杂货铺'] = {
  id = '嘉兴城杂货铺',
  area = '嘉兴城',
  name = '杂货铺',
  desc =  [[这是一家小小的杂货铺，大箱小箱堆满了一地，都是一些日常用品。掌柜懒洋洋地躺在一只躺椅上，招呼着过往行人。据说私底下他也卖一些贵重的东西。摊上立着一块招牌(zhaopai)。]],
  exit = {
    s = { to = '嘉兴城东边门', },
  },
},

['嘉兴城西街#1'] = {
  id = '嘉兴城西街#1',
  area = '嘉兴城',
  name = '西街',
  desc =  [[这里是嘉兴的西街，街道不是很宽，但是很干净。脚下的路面铺着一层厚厚的青石板，显得整个街道悠闲而又古朴。东面是一个热闹的市集，不时传来阵阵嘈杂声，似乎很热闹。]],
  exit = {
    w = { to = '嘉兴城西街#2', },
    e = { to = '嘉兴城市集', },
  },
},

['嘉兴城大厅'] = {
  id = '嘉兴城大厅',
  area = '嘉兴城',
  name = '大厅',
  desc =  [[这是陆家庄内的一个大厅，厅内古色古香，案上放着许多精美的古董。四面的墙壁上挂满了字画。一处墙上有九个血淋淋的手印，现任庄主陆立鼎面带愁容坐在椅子上，望著血手印呆呆地出神。]],
  exit = {
    e = { to = '嘉兴城天井', },
    s = { to = '嘉兴城後院', },
  },
},

['嘉兴城河岸'] = {
  id = '嘉兴城河岸',
  area = '嘉兴城',
  name = '河岸',
  desc =  [[江南水乡之地到处河泊纵横，前面是小河拦路，无法再行。后面是一片绿柳林，传出阵阵花香鸟鸣。左边一架小桥，从桥下几叶小舟，隐隐可以听见少女们正唱着那宛转动人的江南小调。]],
  exit = {
    w = { to = '嘉兴城乡间小径#2', },
  },
},

['嘉兴城树林'] = {
  id = '嘉兴城树林',
  area = '嘉兴城',
  name = '树林',
  desc =  [[江南难得一见的大片树林，周围黑漆漆一团, 你几乎迷了路。]],
  exit = {
    e = { to = '嘉兴城坟墓', },
    nw = { to = '嘉兴城乡间小径#2', },
    s = { to = '嘉兴城陆家庄', },
  },
},

['嘉兴城烟雨楼#1'] = {
  id = '嘉兴城烟雨楼#1',
  area = '嘉兴城',
  name = '烟雨楼',
  desc =  [[这里就是江南有名的烟雨楼，是建在嘉兴风景圣地南湖中央的小岛上，湖面终年不断的水气把它笼罩得迷迷蒙蒙的。经常有文人墨客到这里游玩，凭栏远眺，观赏嘉兴的湖光山色。]],
  exit = {
    u = { to = '嘉兴城烟雨楼#2', },
    n = { to = '嘉兴城南湖#2', },
  },
},

['嘉兴城客房'] = {
  id = '嘉兴城客房',
  area = '嘉兴城',
  name = '客房',
  desc =  [[这是一间很大的客房，陈设十分简陋。靠墙放了十几张小木床，不少客人正和衣而卧，满屋子都是呼呼的打酣声。旁边有张床是空的，你蹑手蹑脚地走了过去。]],
  exit = {
    out = { to = '嘉兴城客店二楼', },
  },
},

['嘉兴城北门'] = {
  id = '嘉兴城北门',
  area = '嘉兴城',
  name = '北门',
  desc =  [[这是江南名城嘉兴的北门，城门不是很高，看起来有很久的历史了，岁月沧桑的痕迹刻划在城墙上，斑驳而又古朴。街道上行人不多，南面传来一阵阵的人声。西北方的青石路通往苏州。]],
  exit = {
    nw = { to = '嘉兴城青石官道#2', },
    s = { to = '嘉兴城北街', },
  },
},

['嘉兴城陆家庄'] = {
  id = '嘉兴城陆家庄',
  area = '嘉兴城',
  name = '陆家庄',
  desc =  [[这里便是有名的江南嘉兴陆家庄。从前的庄主陆展元为人豪爽，而且武功高强，在江湖上名声一向都很好。可惜前一阵因病突然不治身亡, 其妻何沅君当晚也随着死去，外界传闻是自刎殉夫。陆展元夫妇虽然不幸身死，然而侠名依旧。嘉兴陆家庄的名头，在武林中仍然是无人胆敢小觑的。现在当家的是陆展元之弟陆立鼎。]],
  exit = {
    w = { to = '嘉兴城天井', },
    n = { to = '嘉兴城树林', },
  },
},

['嘉兴城北街'] = {
  id = '嘉兴城北街',
  area = '嘉兴城',
  name = '北街',
  desc =  [[这是江南名城嘉兴的北大街，市面上人来人往，很是热闹。北面的方向可以望见一座城门，出城北就是通往苏州府的大路。南面是一个热闹的市集。]],
  exit = {
    s = { to = '嘉兴城市集', },
    n = { to = '嘉兴城北门', },
  },
},

['嘉兴城乡间小径#1'] = {
  id = '嘉兴城乡间小径#1',
  area = '嘉兴城',
  name = '乡间小径',
  desc =  [[江南乡间阡陌纵横，小路弯来绕去，道路狭窄，你数次踏入田中，双脚全是烂泥。东面似乎有一座破旧的庙宇，庙外有座高塔。]],
  exit = {
    e = { to = '嘉兴城铁枪庙', },
    s = { to = '嘉兴城乡间小径#2', },
    n = { to = '嘉兴城南门', },
  },
},

['嘉兴城青石官道#1'] = {
  id = '嘉兴城青石官道#1',
  area = '嘉兴城',
  name = '青石官道',
  desc =  [[你走在一条青石大道上，人来人往非常繁忙，不时有人骑着马匆匆而过。西北通向苏州城。东南面是嘉兴城。]],
  exit = {
    nw = { to = '苏州城青石官道#1', },
    se = { to = '嘉兴城青石官道#2', },
  },
},

['嘉兴城南街'] = {
  id = '嘉兴城南街',
  area = '嘉兴城',
  name = '南街',
  desc =  [[这是江南名城嘉兴的南街，街道上人来人往，很是热闹。各色各样的店铺沿街林立，里面摆着各种货品。向南面的方向可以望见一座城门。从这里出南门可以前往陆家庄。]],
  exit = {
    s = { to = '嘉兴城南门', },
    w = { to = '嘉兴城小巷#1', },
    n = { to = '嘉兴城市集', },
  },
},

['嘉兴城东街'] = {
  id = '嘉兴城东街',
  area = '嘉兴城',
  name = '东街',
  desc =  [[这是江南名城嘉兴的东街，街道上人来人往，很是热闹。各色各样的店铺沿街林立，里面摆着各种货品。向东面的方向可以望见一座小城门。从这里出东边门可以前往南湖。]],
  exit = {
    w = { to = '嘉兴城市集', },
    e = { to = '嘉兴城东边门', },
  },
},

['塘沽城杂货铺'] = {
  id = '塘沽城杂货铺',
  area = '塘沽城',
  name = '杂货铺',
  desc =  [[这是一家杂货铺，天南地北的各式奇货这里都有。柜台后面的货物收拾得非常整齐。不过老板不在，小伙计蹲在墙角里不吭声。    门前立了个牌子(sign)。]],
  exit = {
    s = { to = '塘沽城东街', },
  },
},

['塘沽城仙家楼'] = {
  id = '塘沽城仙家楼',
  area = '塘沽城',
  name = '仙家楼',
  desc =  [[这是一家有名的酒楼，平日里高朋满座，如果到节时更始定来一聚。小二在楼上楼下忙的不亦乐乎，吹拉谈唱相互交融，一派胜世景象。]],
  exit = {
    e = { to = '塘沽城北街#2', },
  },
},

['塘沽城北街#1'] = {
  id = '塘沽城北街#1',
  area = '塘沽城',
  name = '北街',
  desc =  [[这是塘沽口北大街，这里人来人往，塘沽城虽小，但是也颇兴旺，这里西面是一家武器铺，叮叮当当的武器作响，东面是一家典当行，生意更是红火。]],
  exit = {
    e = { to = '塘沽城万福典当', },
    s = { to = '塘沽城中心广场', },
    w = { to = '塘沽城武器铺', },
    n = { to = '塘沽城北街#2', },
  },
},

['塘沽城地藏庙'] = {
  id = '塘沽城地藏庙',
  area = '塘沽城',
  name = '地藏庙',
  desc =  [[这里是城里的地藏庙，平时有不少人来这里上香拜佛。]],
  exit = {
    w = { to = '塘沽城北街#2', },
  },
},

['塘沽城客房'] = {
  id = '塘沽城客房',
  area = '塘沽城',
  name = '客房',
  desc =  [[这是一间很大的客房，陈设十分简陋。靠墙放了十几张小木床，不少客人正和衣而卧，满屋子都是呼呼的打酣声。西边有张床是空的，你蹑手蹑脚地走了过去。]],
  exit = {
    out = { to = '塘沽城二楼走廊', },
  },
},

['塘沽城大驿道#4'] = {
  id = '塘沽城大驿道#4',
  area = '塘沽城',
  name = '大驿道',
  desc =  [[你走在一条尘土飞扬的大驿道上。四周人来人往。挑担子的行商，赶着大车的马夫，上京赶考的书生，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。道路两旁是整整齐齐的杨树林。]],
  exit = {
    e = { to = '塘沽城大驿道#3', },
    sw = { to = '沧州城大驿道#4', },
  },
},

['塘沽城木器店'] = {
  id = '塘沽城木器店',
  area = '塘沽城',
  name = '木器店',
  desc =  [[这是一家木器店，屋里四散放着几张做好的椅子。西首的墙上靠着几块刨好的木板，东首挂着各种木匠工具。屋里没有人在，店主不知道上哪里去了。]],
  exit = {
    n = { to = '塘沽城西街#2', },
  },
},

['塘沽城北街#2'] = {
  id = '塘沽城北街#2',
  area = '塘沽城',
  name = '北街',
  desc =  [[这是就是塘沽口北大街，前面就是北门了。街左是一家酒楼，右边一个地藏庙，竟也有不少香火。]],
  exit = {
    e = { to = '塘沽城地藏庙', },
    s = { to = '塘沽城北街#1', },
    w = { to = '塘沽城仙家楼', },
    n = { to = '塘沽城北城门', },
  },
},

['塘沽城普通人家#W'] = {
  id = '塘沽城普通人家#W',
  area = '塘沽城',
  name = '普通人家',
  desc =  [[这是住户的小庭院。门口大树的树荫投到院子里，让人觉得很凉快。院子里有几个孩子在打闹，屋檐下有几个大人在做席子。可以看的出他们生活的很清贫。]],
  exit = {
    e = { to = '塘沽城石头南街#2', },
  },
},

['塘沽城西街#2'] = {
  id = '塘沽城西街#2',
  area = '塘沽城',
  name = '西街',
  desc =  [[这是一条宽阔的青石街道，向东西两头延伸。西面是西城门通向城东边直通繁忙的塘沽城中心。北边是一家小酒馆，是过路人歇脚的好地方，南面的房子好象是一家木器店。]],
  exit = {
    e = { to = '塘沽城西街#1', },
    s = { to = '塘沽城木器店', },
    w = { to = '塘沽城西城门', },
    n = { to = '塘沽城小酒馆', },
  },
},

['塘沽城大驿道#1'] = {
  id = '塘沽城大驿道#1',
  area = '塘沽城',
  name = '大驿道',
  desc =  [[你走在一条尘土飞扬的大驿道上。四周人来人往。挑担子的行商，赶着大车的马夫，上京赶考的书生，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。道路两旁是整整齐齐的杨树林。东面已经能隐隐看到塘沽城的城门了。]],
  exit = {
    e = { to = '塘沽城西城门', },
    sw = { to = '塘沽城大驿道#2', },
  },
},

['塘沽城北城门'] = {
  id = '塘沽城北城门',
  area = '塘沽城',
  name = '北城门',
  desc =  [[这里就是塘沽口的北城门了，城门口一队队官兵正在盘查过往的百姓。一个手持长剑身穿铁甲的武将在门口巡视。城门的墙上张贴着一纸告示(gaoshi)。]],
  exit = {
    s = { to = '塘沽城北街#2', },
  },
},

['塘沽城钱庄'] = {
  id = '塘沽城钱庄',
  area = '塘沽城',
  name = '钱庄',
  desc =  [[这是全国规模最大的一家钱庄，在全国各地都有分店。宽阔的大厅，长长的柜台，都打扫的干干净净。柜台后几个账房先生与小活计们忙的焦头烂额。老板却坐后喝茶聊天。]],
  exit = {
    e = { to = '塘沽城石头南街#1', },
  },
},

['塘沽城二楼走廊'] = {
  id = '塘沽城二楼走廊',
  area = '塘沽城',
  name = '二楼走廊',
  desc =  [[客店的二楼，有几间房间关着门，看来里面已经住上了人。小二一看见你来，连忙迎上来，引着你进了空屋。]],
  exit = {
    enter = { to = '塘沽城客房', },
    d = { to = '塘沽城喜发客栈', },
  },
},

['塘沽城南城门'] = {
  id = '塘沽城南城门',
  area = '塘沽城',
  name = '南城门',
  desc =  [[这是就是塘沽口的南城门了，城门口一队队官兵正在盘查过往的百姓。一个手持长剑身穿铁甲武将正在门口巡视。城门的墙上张贴着一纸告示(gaoshi)。]],
  exit = {
    n = { to = '塘沽城石头南街#2', },
  },
},

['塘沽城广场空地'] = {
  id = '塘沽城广场空地',
  area = '塘沽城',
  name = '广场空地',
  desc =  [[此处内是塘沽繁华之所，只见红楼画阁，绣户朱门，雕车竞驻，骏马争驰。一片开阔的场地上，但听得前面人声喧哗，喝彩之声不绝于耳，远远望去，围着好大一堆人，只见中间老大一块空地，立着一方擂台，地下插了一面锦旗（Qi），白底红花，绣着『比武 招亲』四个金字，旗下一块白板（Board）。旗下两人正自拳来脚去的打得热闹，一个是红衣少女，一个是长大汉子。]],
  exit = {
    nw = { to = '塘沽城中心广场', },
  },
},

['塘沽城纤云阁'] = {
  id = '塘沽城纤云阁',
  area = '塘沽城',
  name = '纤云阁',
  desc =  [[这里就是远近闻名，同如江南的织造府一样出名的“恋美衣庄”。据说就是京城里的官家小姐太太也会到这里来订做衣服。据说这里的衣服穿上就会感觉到一丝的忧愁，让人情不自禁的想起自己的恋人，自己的亲人....]],
  exit = {
    n = { to = '塘沽城东街', },
  },
},

['塘沽城大驿道#3'] = {
  id = '塘沽城大驿道#3',
  area = '塘沽城',
  name = '大驿道',
  desc =  [[你走在一条尘土飞扬的大驿道上。四周人来人往。挑担子的行商，赶着大车的马夫，上京赶考的书生，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。道路两旁是整整齐齐的杨树林。]],
  exit = {
    w = { to = '塘沽城大驿道#4', },
    e = { to = '塘沽城大驿道#2', },
  },
},

['塘沽城大药房'] = {
  id = '塘沽城大药房',
  area = '塘沽城',
  name = '大药房',
  desc =  [[这是塘沽小镇的药房。虽然地方不大，但每次进来浓浓的药味却让你无处喘息。一个年纪轻轻的药童正在忙呼着从蜂窝式中的抽屉里给客人抓药。药房的老板正在给人号脉，没功夫搭理你。]],
  exit = {
    s = { to = '塘沽城西街#1', },
  },
},

['塘沽城金银珠宝行'] = {
  id = '塘沽城金银珠宝行',
  area = '塘沽城',
  name = '金银珠宝行',
  desc =  [[龙三爷乃城中福人，他开的金银珠宝行更始生意红火，每日有不少的富家小姐来此购买金银珠宝首饰。由于离城中心最近，又是不少外乡客来光顾。]],
  exit = {
    w = { to = '塘沽城石头南街#1', },
  },
},

['塘沽城喜发客栈'] = {
  id = '塘沽城喜发客栈',
  area = '塘沽城',
  name = '喜发客栈',
  desc =  [[看见不少的外乡人进进出出的地方就是这里有名的“喜发客栈”。一楼的乡里人在喝茶听着评书。店小二上上下下的忙呼，柜台后面老板在幽闲自在。柜台上面有一个牌子。]],
  exit = {
    u = { to = '塘沽城二楼走廊', },
    n = { to = '塘沽城西街#1', },
  },
},

['塘沽城石头南街#2'] = {
  id = '塘沽城石头南街#2',
  area = '塘沽城',
  name = '石头南街',
  desc =  [[你走在塘沽口的石头南街。从这里再往南去就是城里的南门，往北些就到了繁华地段。左右都是平静住家，白日孩子喜喜笑笑，晚上千家灯火。]],
  exit = {
    e = { to = '塘沽城普通人家#E', },
    s = { to = '塘沽城南城门', },
    w = { to = '塘沽城普通人家#W', },
    n = { to = '塘沽城石头南街#1', },
  },
},

['塘沽城万福典当'] = {
  id = '塘沽城万福典当',
  area = '塘沽城',
  name = '万福典当',
  desc =  [[这里就是方圆白里数一数二的万福典当行。]],
  exit = {
    w = { to = '塘沽城北街#1', },
  },
},

['塘沽城普通人家#E'] = {
  id = '塘沽城普通人家#E',
  area = '塘沽城',
  name = '普通人家',
  desc =  [[这是住户的小庭院。门口大树的树荫投到院子里，让人觉得很凉快。院子里有几个孩子在打闹，屋檐下有几个大人在做席子。可以看的出他们生活的很清贫。]],
  exit = {
    w = { to = '塘沽城石头南街#2', },
  },
},

['塘沽城武器铺'] = {
  id = '塘沽城武器铺',
  area = '塘沽城',
  name = '武器铺',
  desc =  [[这是塘沽口城里唯一一家武器铺。前面摆着一个火炉，一位混身是汗的大汉正在忙着打造长剑。据说是因为这里打造的铁器坚硬无比所以有不少江湖人士到这里来买武器。]],
  exit = {
    e = { to = '塘沽城北街#1', },
  },
},

['塘沽城大驿道#2'] = {
  id = '塘沽城大驿道#2',
  area = '塘沽城',
  name = '大驿道',
  desc =  [[你走在一条尘土飞扬的大驿道上。四周人来人往。挑担子的行商，赶着大车的马夫，上京赶考的书生，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。道路两旁是整整齐齐的杨树林。]],
  exit = {
    ne = { to = '塘沽城大驿道#1', },
    w = { to = '塘沽城大驿道#3', },
  },
},

['塘沽城西城门'] = {
  id = '塘沽城西城门',
  area = '塘沽城',
  name = '西城门',
  desc =  [[这是就是塘沽口的西城门了，城门口一队队官兵正在盘查过往的百姓。一个手持长剑身穿铁甲武将在门口巡视。城门的墙上张贴着一纸告示(gaoshi)。]],
  exit = {
    w = { to = '塘沽城大驿道#1', },
    e = { to = '塘沽城西街#2', },
  },
},

['塘沽城东街'] = {
  id = '塘沽城东街',
  area = '塘沽城',
  name = '东街',
  desc =  [[这是塘沽东街。西面不断有人骑马急驰而出，那里是塘沽口城中心，北面是一家专卖杂货的店子，往南就是本城手艺最好的衣店。东面可以隐约看见海上不少的船只哪就是出海的港口了。]],
  exit = {
    e = { to = '塘沽城港口', },
    s = { to = '塘沽城纤云阁', },
    w = { to = '塘沽城中心广场', },
    n = { to = '塘沽城杂货铺', },
  },
},

['塘沽城西街#1'] = {
  id = '塘沽城西街#1',
  area = '塘沽城',
  name = '西街',
  desc =  [[这是一条宽阔的青石板街道，向东西两头延伸。东边的就是塘沽城最繁华的城中心了。西边有不少外乡的过客。北边是塘沽大药房，半月形的大门上方写着“妙手回春”四个烫金大字，里面出来飘出浓重的药味。南边是本城有名的喜发客栈。]],
  exit = {
    e = { to = '塘沽城中心广场', },
    s = { to = '塘沽城喜发客栈', },
    w = { to = '塘沽城西街#2', },
    n = { to = '塘沽城大药房', },
  },
},

['塘沽城中心广场'] = {
  id = '塘沽城中心广场',
  area = '塘沽城',
  name = '中心广场',
  desc =  [[这里是塘沽城中心广场，是塘沽口最繁华的所在。白天这里人声鼎沸晚上更是灯火通明，忙碌了一天的人们晚上总喜欢到这里走一走，广场上卖各种东西的都有，不少江湖人物混迹其中。]],
  exit = {
    s = { to = '塘沽城石头南街#1', },
    se = { to = '塘沽城广场空地', },
    e = { to = '塘沽城东街', },
    w = { to = '塘沽城西街#1', },
    n = { to = '塘沽城北街#1', },
  },
},

['塘沽城石头南街#1'] = {
  id = '塘沽城石头南街#1',
  area = '塘沽城',
  name = '石头南街',
  desc =  [[南大街乃是城中的繁华地段。白日唱戏说书，晚上灯红酒绿灯红酒绿尤为热闹。北边是一个热闹的广场。东边是一家华丽的珠宝行，“金银”两个镏金大字在阳光的照耀下闪闪发光。西边则是一家生意兴隆的钱庄。]],
  exit = {
    e = { to = '塘沽城金银珠宝行', },
    s = { to = '塘沽城石头南街#2', },
    w = { to = '塘沽城钱庄', },
    n = { to = '塘沽城中心广场', },
  },
},

['塘沽城港口'] = {
  id = '塘沽城港口',
  area = '塘沽城',
  name = '港口',
  desc =  [[这里就是大海之滨，浪花拍打着礁石，发出阵阵响声，海面上一群群海鸥『欧欧..』地叫着，不时有鱼儿跃出海面，溅起层层的浪花。边上有艘大船，船上坐着几个渔夫打扮的人，乘船可渡过大海到达海的另一端。西面是塘沽城，东面是一望无际的大海。]],
  exit = {
    ne = { to = '神龙岛小路', },
    w = { to = '塘沽城东街', },
  },
},

['塘沽城小酒馆'] = {
  id = '塘沽城小酒馆',
  area = '塘沽城',
  name = '小酒馆',
  desc =  [[这是塘沽口城西的一个小酒馆。离的很远就能闻到酒香飘来，如果肚子饿了可以在这里歇歇，买点吃的喝的东西再上路。不过富家子弟是不会到这里的。]],
  exit = {
    s = { to = '塘沽城西街#2', },
  },
},

['回疆草场'] = {
  id = '回疆草场',
  area = '回疆',
  name = '草场',
  desc =  [[这一族哈萨克人大概已经习惯了定居生活，于是做了个大草场。春夏把远处肥嫩的水草割下来堆在这里，以备秋冬季节畜生的食料。这里堆满了一堆堆帐篷大小的草堆和干草(gancao)，看起来不下千堆。]],
  exit = {
    e = { to = '回疆大草原#1', },
    nd = { to = '回疆跑马场', },
    wd = { to = '回疆坎儿井', },
  },
},

['回疆大草原#6'] = {
  id = '回疆大草原#6',
  area = '回疆',
  name = '大草原',
  desc =  [[你走进了这遍绵绵不绝的大草原，脚下是寸厚的青草，软绵绵的还真不好走，看来买匹马来代步到是的好主意。]],
  exit = {
    e = { to = '回疆大草原#5', },
    s = { to = '回疆大草原#5', },
    w = { to = '回疆小路#1N', },
    n = { to = '回疆大草原#5', },
  },
},

['回疆马棚'] = {
  id = '回疆马棚',
  area = '回疆',
  name = '马棚',
  desc =  [[这是个大马棚，支起来的帐篷有十多丈长，里面拴着几百匹骏马。马虽多，却是安安分分的，偶尔有几声嘶叫声，看来草原族的驯马之术的确高明。一堆人正在旁边和马棚主人商讨价钱，看他们的服饰好象是从遥远的波斯而来。]],
  exit = {
    e = { to = '回疆哈萨克帐篷#2', },
    w = { to = '回疆大草原#2', },
    n = { to = '回疆大草原#1', },
  },
},

['回疆针叶林#M'] = {
  id = '回疆针叶林#M',
  area = '回疆',
  name = '针叶林',
  desc =  [[这是极西天山脚下的一片针叶林，林中鸟兽成群，满地铺盖着厚厚一层松针。北方的一座高耸的山脉便是天山了，山上终年积雪，山下却是绿树成荫。往南走便是大草原，有辛勤的哈萨克族人在那里放牧。你走着走着，竟然迷失了道路。]],
  exit = {
    e = { to = '回疆针叶林#M', },
    s = { to = '回疆针叶林#M', },
    w = { to = '回疆针叶林#M', },
    n = { to = '回疆针叶林#M', },
		hidden = { to = '回疆针叶林#E', cost = 30, handler = 'fixed_step', },
  },
},

['回疆苏鲁克的家'] = {
  id = '回疆苏鲁克的家',
  area = '回疆',
  name = '苏鲁克的家',
  desc =  [[由于苏鲁克的妻子十年前被强盗害死，只剩下苏鲁克和他儿子苏普两人，所以屋里乱七八糟的。但苏鲁克并不在意，因为他觉得象他这样的草原汉子是不能去做女人们做的事情的。火堆一旁的墙上挂着两张羊毛毯子(tanzi)。]],
  exit = {
    ne = { to = '回疆坎儿井', },
    w = { to = '回疆大草原#2', },
    s = { to = '回疆大草原#2', },
    e = { to = '回疆大草原#2', },
  },
},

['回疆哈萨克帐篷#1'] = {
  id = '回疆哈萨克帐篷#1',
  area = '回疆',
  name = '哈萨克帐篷',
  desc =  [[这是哈萨克族人居住的帐篷，帐篷内用羊皮铺地，四周也挂了好些羊皮牛皮，左边是一张用干草垫底的羊毛床，入口有一小火盆。看起来主人似乎不在家，你如果累了就歇息(sleep)一下吧。]],
  exit = {
    se = { to = '回疆哈萨克小店', },
  },
},

['回疆哈萨克帐篷#2'] = {
  id = '回疆哈萨克帐篷#2',
  area = '回疆',
  name = '哈萨克帐篷',
  desc =  [[这是哈萨克族人居住的帐篷，方圆两三丈，正中以一粗木做主梁，四周用小木桩围成一圈，从主梁拉牛皮帐篷过木桩再钉于地上。草原上居住的民族都喜欢这种帐篷，方便简单。因蒙古族人数最多，又统称这种帐篷为“蒙古包”。]],
  exit = {
    w = { to = '回疆马棚', },
    e = { to = '回疆草原边缘', },
    sw = { to = '回疆车尔库的家', },
  },
},

['回疆小路#2N'] = {
  id = '回疆小路#2N',
  area = '回疆',
  name = '小路',
  desc =  [[说是路，其实是人在草原上走过留下的痕迹，天长日久就渐渐形成了。这支哈萨克部族在这里定居已久，可以看见到处是这种原始的道路。北边好象有一间小草棚。]],
  exit = {
    ne = { to = '回疆大草原#7', },
    sw = { to = '回疆小路#1N', },
    n = { to = '回疆草棚', },
  },
},

['回疆小屋'] = {
  id = '回疆小屋',
  area = '回疆',
  name = '小屋',
  desc =  [[小屋中陈设简陋，但桌椅整洁，打扫得乾乾净净。一位老人正做在毡子上整理着碗筷。四周放了些杂物，中间的小方木著上搁了几个瓦壶，飘出阵阵诱人的香气。]],
  exit = {
    out = { to = '回疆草棚', },
  },
},

['回疆黑石围子'] = {
  id = '回疆黑石围子',
  area = '回疆',
  name = '黑石围子',
  desc =  [[这个叫做黑石围子的地方其实是个山前的小湖泊。这里非常的奇怪，他四周两面是大沙漠，一面过去是西域白驼山，往西却是大草原。周围乱七八糟的有几百个灰褐色的巨石(stone)，象是自然形成的又象是有人搬来的。]],
  exit = {
    se = { to = '星宿海大沙漠#HJ', },
    sw = { to = '回疆大草原#8', },
    s = { to = '星宿海大沙漠#HJ', },
    n = { to = '回疆大戈壁', handler = 'reset_data', },
  },
},

['回疆草原'] = {
  id = '回疆草原',
  area = '回疆',
  name = '草原',
  desc =  [[你走进了这遍绵绵不绝的大草原，脚下是寸厚的青草，软绵绵的还真不好走，看来买匹马来代步到是的好主意。北边和西边都有好多帐篷，往东可以看见沙漠的边缘。]],
  exit = {
    ed = { to = '回疆草原边缘', },
    s = { to = '回疆大草原#1', },
    nu = { to = '回疆小路#1N', },
    w = { to = '回疆跑马场', },
    nw = { to = '回疆哈萨克小店', },
    n = { to = '大草原草海#1', },
  },
},

['回疆车尔库的家'] = {
  id = '回疆车尔库的家',
  area = '回疆',
  name = '车尔库的家',
  desc =  [[车尔库的帐蓬中收拾得很整洁，一张张织著红花绿草的羊毛毯挂在四周。矮桌上放着几个大酒碗，一个身材苗条的女孩子捧了酒浆出来笑嘻嘻地看着你。]],
  exit = {
    ne = { to = '回疆哈萨克帐篷#2', },
    w = { to = '回疆大草原#4', },
    s = { to = '回疆大草原#4', },
    e = { to = '回疆大草原#4', },
  },
},

['回疆针叶林#E'] = {
  id = '回疆针叶林#E',
  area = '回疆',
  name = '针叶林',
  desc =  [[这是极西天山脚下的一片针叶林，林中鸟兽成群，满地铺盖着厚厚一层松针。西北方的一座高耸的山脉便是天山了，山上终年积雪，山下却是绿树成荫。往东南走便是大草原，有辛勤的哈萨克族人在那里放牧。]],
  exit = {
    ne = { to = '星宿海天山脚下', },
    nw = { to = '星宿海山脚下', },
    se = { to = '回疆小山丘', },
  },
},

['回疆大草原#7'] = {
  id = '回疆大草原#7',
  area = '回疆',
  name = '大草原',
  desc =  [[你走进了这遍绵绵不绝的大草原，脚下是寸厚的青草，软绵绵的还真不好走，看来买匹马来代步到是的好主意。]],
  exit = {
    e = { to = '回疆草原边缘', },
    sw = { to = '回疆小路#2N', },
    nw = { to = '回疆草棚', },
    s = { to = '回疆草原边缘', },
  },
},

['回疆大草原#5'] = {
  id = '回疆大草原#5',
  area = '回疆',
  name = '大草原',
  desc =  [[你走进了这遍绵绵不绝的大草原，脚下是寸厚的青草，软绵绵的还真不好走，看来买匹马来代步到是的好主意。]],
  exit = {
    e = { to = '回疆大草原#6', },
    s = { to = '回疆大草原#6', },
    w = { to = '回疆大草原#6', },
    n = { to = '回疆大草原#6', },
  },
},

['回疆草原边缘'] = {
  id = '回疆草原边缘',
  area = '回疆',
  name = '草原边缘',
  desc =  [[这里是大草原和沙漠接壤之地，青草由稀至密，向西绵绵延伸而去。地上有几行骆驼踏过的蹄印，看样子这里常常有商队来往。西南方好象有些炊烟。]],
  exit = {
    s = { to = '回疆大草原#4', cost = 4, handler = 'go_straight', },
    s2 = { to = '回疆草原边缘', },
    wu = { to = '回疆草原', },
    e = { to = '星宿海大沙漠#HJ', },
    sw = { to = '回疆大草原#1', },
    n = { to = '回疆黑石围子', cost = 4, handler = 'go_straight', },
    n2 = { to = '回疆草原边缘', },
  },
},

['回疆小山丘'] = {
  id = '回疆小山丘',
  area = '回疆',
  name = '小山丘',
  desc =  [[这里是草原和森林的分界线，往西可以看到高耸如云的天山山脉和从这里一直延伸出去的针叶林，往东可以看见部族的跑马场，还隐隐可以听见哈萨克族人的话语。]],
  exit = {
    ed = { to = '回疆小路#W', },
    wd = { to = '回疆针叶林#M', handler = 'reset_data', },
    s = { to = '回疆大草原#3', },
  },
},

['回疆大草原#3'] = {
  id = '回疆大草原#3',
  area = '回疆',
  name = '大草原',
  desc =  [[你走进了这遍绵绵不绝的大草原，脚下是寸厚的青草，软绵绵的还真不好走，看来买匹马来代步到是的好主意。]],
  exit = {
    e = { to = '回疆大草原#4', },
    s = { to = '回疆草原边缘', },
    w = { to = '回疆大草原#2', },
    n = { to = '回疆草原边缘', },
  },
},

['回疆跑马场'] = {
  id = '回疆跑马场',
  area = '回疆',
  name = '跑马场',
  desc =  [[这一大遍草地就是哈萨克族人的跑马场了。广阔的空间和来往的众多商人使它成为这一带最繁忙的集会地和市场。一年一度的摔跤比赛和跑马节也在这里举行。]],
  exit = {
    su = { to = '回疆草场', },
    e = { to = '回疆草原', },
    sw = { to = '回疆坎儿井', },
    w = { to = '回疆小路#W', },
    n = { to = '回疆哈萨克小店', },
  },
},

['回疆大草原#8'] = {
  id = '回疆大草原#8',
  area = '回疆',
  name = '大草原',
  desc =  [[你走进了这遍绵绵不绝的大草原，脚下是寸厚的青草，软绵绵的还真不好走，看来买匹马来代步到是的好主意。]],
  exit = {
    e = { to = '回疆大草原#4', },
    s = { to = '回疆草原边缘', },
    w = { to = '回疆大草原#2', },
    n = { to = '回疆大草原#3', },
  },
},

['回疆大戈壁'] = {
  id = '回疆大戈壁',
  area = '回疆',
  name = '大戈壁',
  desc =  [[这是西域的大戈壁，要走出这里并非易事。不远处尘土沙粒铺天盖地般吹来，看来要起风暴了。]],
  exit = {
    e = { to = '回疆大戈壁', },
    w = { to = '回疆大戈壁', },
    s = { to = '回疆大戈壁', },
    n = { to = '回疆大戈壁', },
    hidden1 = { to = '回疆针叶林#M', cost = 12, no_wander = true, handler = 'twisted_cord', },
    hidden2 = { to = '回疆草棚', cost = 11, handler = 'twisted_cord', },
    hidden3 = { to = '白驼山白驼山', cost = 11, no_wander = true, handler = 'twisted_cord', },
    hidden4 = { to = '回疆回疆绿洲', cost = 25, no_wander = true, handler = 'fixed_step', },
  },
},

['回疆回疆绿洲'] = {
  id = '回疆回疆绿洲',
  area = '回疆',
  name = '回疆绿洲',
  desc =  [[在戈壁的尽头出现了一个绿洲。这里有口水井，可是已经干涸了。]],
  exit = {
    ne = { to = '回疆大戈壁', handler = 'reset_data', },
    nw = { to = '回疆大戈壁', ignore = true, },
    sw = { to = '回疆大戈壁', ignore = true, },
    se = { to = '回疆大戈壁', ignore = true, },
  },
},

['回疆大草原#4'] = {
  id = '回疆大草原#4',
  area = '回疆',
  name = '大草原',
  desc =  [[你走进了这遍绵绵不绝的大草原，脚下是寸厚的青草，软绵绵的还真不好走，看来买匹马来代步到是的好主意。]],
  exit = {
    e = { to = '回疆草原边缘', },
    s = { to = '回疆大草原#3', },
    w = { to = '回疆大草原#2', },
    n = { to = '回疆车尔库的家', },
  },
},

['回疆小路#W'] = {
  id = '回疆小路#W',
  area = '回疆',
  name = '小路',
  desc =  [[这条小路是胆大的男人们去密林里打猎时走出来的，再往西走就到草原边缘而进入森林了。偶尔可以听见远处传来野兽的吼声，你还是快回去吧。]],
  exit = {
    e = { to = '回疆跑马场', },
    wu = { to = '回疆小山丘', },
  },
},

['回疆坎儿井'] = {
  id = '回疆坎儿井',
  area = '回疆',
  name = '坎儿井',
  desc =  [[山丘下灌木丛中有一眼坎儿井，是牧民们的水源。井台上有一个木杯专供口渴的行人喝水。井边有一个由人踏动的水车，水渠从这里一直连到了东边的马厩。]],
  exit = {
    ne = { to = '回疆跑马场', },
    eu = { to = '回疆草场', },
    sw = { to = '回疆苏鲁克的家', },
  },
},

['回疆大草原#2'] = {
  id = '回疆大草原#2',
  area = '回疆',
  name = '大草原',
  desc =  [[你走进了这遍绵绵不绝的大草原，脚下是寸厚的青草，软绵绵的还真不好走，看来买匹马来代步到是的好主意。]],
  exit = {
    e = { to = '回疆草原边缘', },
    s = { to = '回疆大草原#4', },
    w = { to = '回疆大草原#3', },
    n = { to = '回疆苏鲁克的家', },
  },
},

['回疆哈萨克小店'] = {
  id = '回疆哈萨克小店',
  area = '回疆',
  name = '哈萨克小店',
  desc =  [[这座帐篷略显破旧，似乎搭好后主人就没再修整过它。帐篷边到是挂了不少东西，牛皮筋，铃铛等等，看来这里是个小杂品点。]],
  exit = {
    e = { to = '回疆小路#1N', },
    s = { to = '回疆跑马场', },
    nw = { to = '回疆哈萨克帐篷#1', },
    se = { to = '回疆草原', },
  },
},

['回疆大草原#1'] = {
  id = '回疆大草原#1',
  area = '回疆',
  name = '大草原',
  desc =  [[你走进了这遍绵绵不绝的大草原，脚下是寸厚的青草，软绵绵的还真不好走，看来买匹马来代步到是的好主意。南边和西边都有好多帐篷，往东可以看见沙漠的边缘。]],
  exit = {
    ne = { to = '回疆草原边缘', },
    s = { to = '回疆马棚', },
    w = { to = '回疆草场', },
    n = { to = '回疆草原', },
    d = { to = '星宿海大厅', unstable = true, ignore = true, },
  },
},

['回疆小路#1N'] = {
  id = '回疆小路#1N',
  area = '回疆',
  name = '小路',
  desc =  [[说是路，其实是人在草原上走过留下的痕迹，天长日久就渐渐形成了。这支哈萨克部族在这里定居已久，可以看见到处是这种原始的道路。]],
  exit = {
    ne = { to = '回疆小路#2N', },
    w = { to = '回疆哈萨克小店', },
    sd = { to = '回疆草原', },
    e = { to = '回疆大草原#5', },
  },
},

['回疆草棚'] = {
  id = '回疆草棚',
  area = '回疆',
  name = '草棚',
  desc =  [[这是在部族东北部孤零零的一座草棚。这棚屋土墙草顶，形式宛如内地汉人的砖屋，只是甚为简陋，旁边有一个小水漕。你悄悄的掩向小屋后面，正想探头从窗子向屋内张望，哪知窗内有张脸同时探了上来。北去就是大戈壁了。]],
  exit = {
    enter = { to = '回疆小屋', },
    nw = { to = '回疆大戈壁', handler = 'reset_data', },
    s = { to = '回疆小路#2N', },
    se = { to = '回疆大草原#7', },
  },
},

['兰州城土门子'] = {
  id = '兰州城土门子',
  area = '兰州城',
  name = '土门子',
  desc =  [[土门子也是以前驻军的地方，周围全是沙漠，中间一块小小的绿洲，本来这里有当地的牧民居住，可是前不就来了一伙马贼占据了这里以这里为大本营四出劫掠，无恶不做。]],
  exit = {
    ne = { to = '兰州城石峡子', },
    w = { to = '兰州城武威', },
    d = { to = '星宿海大厅', unstable = true, ignore = true, },
  },
},

['兰州城西夏渡口#N'] = {
  id = '兰州城西夏渡口#N',
  area = '兰州城',
  name = '西夏渡口',
  desc =  [[这里是黄河大渡口，是通往中原的必经之路。宽阔的黄河江面上飘荡着几只轻帆。渡口处正停着一艘渡船，几个乘客正在和船家讨论价钱。你可以由此上(yell)船渡过黄河。]],
  exit = {
    nw = { to = '兰州城黄河#2', },
    enter = { to = '兰州城黄河渡船#1', cmd = 'duhe', unstable = true, handler = 'fly_across', no_wander = true, },
  },
},

['兰州城营盘水'] = {
  id = '兰州城营盘水',
  area = '兰州城',
  name = '营盘水',
  desc =  [[这里是当年蒙恬修长城时驻军的地方，蒙恬治军有方，当年他亲自带人在驻地挖了好几口甜水井，使士卒们不用喝又苦又涩的咸水，后来此地的百姓们叫这里为营盘水，称这里的井为“蒙恬井”。]],
  exit = {
    e = { to = '兰州城古长城', },
    sw = { to = '兰州城冰草湾', },
  },
},

['兰州城冰草湾'] = {
  id = '兰州城冰草湾',
  area = '兰州城',
  name = '冰草湾',
  desc =  [[冰草湾在营盘水的西南，平时人迹少至，因为当地沙漠里长着一种神奇的药草----“冰草”而得名。据说这种药草能解百毒，所以偶有人来采这种草，不过沙漠里常有毒虫出没，极为危险。]],
  exit = {
    ne = { to = '兰州城营盘水', },
    sw = { to = '兰州城石峡子', },
  },
},

['兰州城黄河#2'] = {
  id = '兰州城黄河#2',
  area = '兰州城',
  name = '黄河',
  desc =  [[葛水过了古浪，和源于酒泉西北的洪水河于新城合流。到了这里，河水的去势逐渐加强，挟带着千万吨的高原泥沙，势不可挡地向西南奔去。由于此处水流湍急，这里的鱼大多肉厚脂丰。名扬天下的黄河大鲤鱼即产于此。]],
  exit = {
    w = { to = '兰州城黄河#1', },
    se = { to = '兰州城西夏渡口#N', },
  },
},

['兰州城靖远'] = {
  id = '兰州城靖远',
  area = '兰州城',
  name = '靖远',
  desc =  [[靖远是个不大不小的城镇，黄沙在离城四十里的地方被一排排的钻天白杨树给挡住了。因此这里有了一块较大的绿洲，聚集了不少从别处来的移民。这些白杨据说是当年唐朝李靖赶走了突厥后在这里屯兵时所种。这也是靖远得名的由来。东边有坐不高的山。]],
  exit = {
    ne = { to = '兰州城崆峒山', },
    eu = { to = '兰州城六盘山', },
    sw = { to = '兰州城大道#2E', },
  },
},

['兰州城大道#1S'] = {
  id = '兰州城大道#1S',
  area = '兰州城',
  name = '大道',
  desc =  [[这是闻名中外的丝绸商道。迎面而来的是一个个沙包，星罗棋布於荒原之上。一阵风沙吹过，象刀割一样撕裂着你的脸。这里是通往西域的丝绸古路，繁华的城镇在身后慢慢消逝，迎面而来的是阵阵风浪。不时有一队队商人丛你身边擦身而过。北边就是兰州城了。]],
  exit = {
    s = { to = '兰州城大道#2S', },
    w = { to = '兰州城苗家庄门口', no_wander = true, },
    n = { to = '兰州城南城门', },
  },
},

['兰州城大道#2W'] = {
  id = '兰州城大道#2W',
  area = '兰州城',
  name = '大道',
  desc =  [[这是闻名中外的丝绸商道。迎面而来的是一个个沙包，星罗棋布於荒原之上。一阵风沙吹过，象刀割一样撕裂着你的脸。这里是通往西域的丝绸古路，繁华的城镇在身后慢慢消逝，迎面而来的是阵阵风浪。不时有一队队商人丛你身边擦身而过。]],
  exit = {
    w = { to = '兰州城永登', },
    se = { to = '兰州城大渡口#N', },
  },
},

['兰州城黄河渡船#2'] = {
  id = '兰州城黄河渡船#2',
  area = '兰州城',
  name = '黄河渡船',
  desc =  [[黄河上的渡船大都是这种很简陋的小舟。一位年迈的艄公正站在船尾吃力地掌舵，一位膀子壮硕的小伙子也在船头用劲地划水撑船。]],
  exit = {
    out2 = { to = '兰州城大渡口#N', unstable = true, handler = 'disembark', cost = 50, },
    out = { to = '兰州城大渡口#S', unstable = true, handler = 'disembark', cost = 50, },
  },
},

['兰州城大道#2S'] = {
  id = '兰州城大道#2S',
  area = '兰州城',
  name = '大道',
  desc =  [[这里是通往西域的丝绸古路，繁华的城镇在身后慢慢消逝，迎面而来的是阵阵风浪。不时有一队队商人丛你身边擦身而过。北边就接近了兰州城，往东南方向是去青城的道路。]],
  exit = {
    se = { to = '兰州城大道#3S', },
    n = { to = '兰州城大道#1S', },
  },
},

['兰州城石门'] = {
  id = '兰州城石门',
  area = '兰州城',
  name = '石门',
  desc =  [[这里是石门，是西夏的采石场，当地没有别的物产，只有遍地的白玉石，西夏王宫里的玉石地板就是用这里出产的白玉石铺成的。时常有大批的苦力被官府征到这儿来，没日没夜的开采白玉石矿，许多人倒下后就没有再站起来。北面有一座寺庙。]],
  exit = {
    s = { to = '兰州城红山峡', },
    w = { to = '兰州城古长城', },
    n = { to = '兰州城五佛寺', },
  },
},

['兰州城黄河#1'] = {
  id = '兰州城黄河#1',
  area = '兰州城',
  name = '黄河',
  desc =  [[黄河出了青海，经甘肃之后，向东受到黄土高原的阻挡，转而向东北流去。在流经黄土高原的过程中泥沙含量猛增，水色澄黄，就被称为黄河。]],
  exit = {
    nw = { to = '兰州城景泰', },
    e = { to = '兰州城黄河#2', },
  },
},

['兰州城红山峡'] = {
  id = '兰州城红山峡',
  area = '兰州城',
  name = '红山峡',
  desc =  [[红山峡是个非常险峻的峡谷，两边是数十丈的黄土坡，很是陡峭，中间只有一条可以通行一人一马的窄道，俗称“一线天”。附近没有什么生物，却有商旅常在这里失踪。]],
  exit = {
    se = { to = '兰州城景泰', },
    n = { to = '兰州城石门', },
  },
},

['兰州城西城门'] = {
  id = '兰州城西城门',
  area = '兰州城',
  name = '西城门',
  desc =  [[这是就是兰州的西城门。再往东就进城了，这儿有军队驻扎，不时盘问来往行人。你小心翼翼，急步离开这是非之地。出关向西，是通往纪永河的驿道。城门的墙上张贴着一纸告示(gaoshi)。]],
  exit = {
    nw = { to = '兰州城大道#1W', },
    e = { to = '兰州城城中心', },
  },
},

['兰州城石洞'] = {
  id = '兰州城石洞',
  area = '兰州城',
  name = '石洞',
  desc =  [[这是沙漠中天然形成的一个石洞，洞中光线昏暗，但却十分干燥，地下铺者几堆稻草，似乎是供人睡卧之用，静心凝听，洞中仿佛有阵阵水声。洞的一角放着数堆人头骨(skulls)。]],
  exit = {
    out = { to = '兰州城沙漠#2', },
  },
},

['兰州城景泰'] = {
  id = '兰州城景泰',
  area = '兰州城',
  name = '景泰',
  desc =  [[景泰是西夏国的重镇，驻有重兵，城楼高达三丈，门口有两排官兵正在认真的盘查过往行人，城门口的告示上画着最近通缉的江洋大盗的图形，城里头看上去还挺热闹。东南方向过了黄河就是崆峒山了。]],
  exit = {
    nw = { to = '兰州城红山峡', },
    se = { to = '兰州城黄河#1', },
  },
},

['兰州城黄河渡船#1'] = {
  id = '兰州城黄河渡船#1',
  area = '兰州城',
  name = '黄河渡船',
  desc =  [[黄河上的渡船大都是这种很简陋的小舟。一位年迈的艄公正站在船尾吃力地掌舵，一位膀子壮硕的小伙子也在船头用劲地划水撑船。]],
  exit = {
    out2 = { to = '兰州城西夏渡口#N', unstable = true, handler = 'disembark', cost = 50, },
    out = { to = '兰州城西夏渡口#S', unstable = true, handler = 'disembark', cost = 50, },
  },
},

['兰州城大道#1E'] = {
  id = '兰州城大道#1E',
  area = '兰州城',
  name = '大道',
  desc =  [[这是闻名中外的丝绸商道。迎面而来的是一个个沙包，星罗棋布於荒原之上。一阵风沙吹过，象刀割一样撕裂着你的脸。这里是通往西域的丝绸古路，繁华的城镇在身后慢慢消逝，迎面而来的是阵阵风浪。不时有一队队商人丛你身边擦身而过。西边是兰州，继续往东走便是就是六盘山了。]],
  exit = {
    ne = { to = '兰州城大道#2E', },
    w = { to = '兰州城东城门', },
  },
},

['兰州城南城门'] = {
  id = '兰州城南城门',
  area = '兰州城',
  name = '南城门',
  desc =  [[这是就是兰州的南城门。再往北就进城了，这儿有军队驻扎，不时盘问来往行人。你小心翼翼，急步离开这是非之地。出关向南，是通往青城镇的大道。城门的墙上张贴着一纸告示(gaoshi)。]],
  exit = {
    s = { to = '兰州城大道#1S', },
    n = { to = '兰州城城中心', },
  },
},

['兰州城二楼走廊'] = {
  id = '兰州城二楼走廊',
  area = '兰州城',
  name = '二楼走廊',
  desc =  [[你正走在客店二楼的走廊上，可以听到从客房里不时地呼呼的打酣声，一阵高过一阵。不时有睡意朦胧的旅客进进出出，到楼下的掌柜处付了钱再上来睡觉。]],
  exit = {
    enter = { to = '兰州城客房', },
    d = { to = '兰州城客店', },
  },
},

['兰州城苗家庄门口'] = {
  id = '兰州城苗家庄门口',
  area = '兰州城',
  name = '苗家庄门口',
  desc =  [[这里是苗家庄的大门，两扇黑漆漆的大门敞开着，门口正中央高悬着一块金色横匾“苗家庄”，台阶两旁立着两个石狮，只是门街冷清，颇为凄凉。]],
  exit = {
    w = { to = '兰州城前厅', cmd = '#wb 2000;w', },
    e = { to = '兰州城大道#1S', cmd = '#wb 2000;e', },
  },
},

['兰州城前厅'] = {
  id = '兰州城前厅',
  area = '兰州城',
  name = '前厅',
  desc =  [[这是苗家庄的前厅，由于修建年代久远，看起来已颇为陈旧，但因颇为干净完全没有陈年旧宅的阴晦之气。]],
  exit = {
    e = { to = '兰州城苗家庄门口', },
    n = { to = '兰州城正厅', },
  },
},

['兰州城正厅'] = {
  id = '兰州城正厅',
  area = '兰州城',
  name = '正厅',
  desc =  [[这里是苗家庄的正厅,周围的墙上挂着几幅字画,似乎出自名家手笔，屋子打扫的很干净，但是一字两排八仙桌，却颇有山寨模样。]],
  exit = {
    s = { to = '兰州城前厅',cmd = '#wb 2000;s', },
    n = { to = '兰州城后院', cmd = '#wb 2000;n', },
  },
},

['兰州城后院'] = {
  id = '兰州城后院',
  area = '兰州城',
  name = '后院',
  desc =  [[这里是苗家的後院，打扫的非常干净，错落有序的放着几把藤椅。一角种种植着各种花草，只是似乎很久没人管理，有些杂乱。南边是正厅。]],
  exit = {
    s = { to = '兰州城正厅', },
  },
},

['兰州城崆峒山'] = {
  id = '兰州城崆峒山',
  area = '兰州城',
  name = '崆峒山',
  desc =  [[崆峒山林木葱茏，峰险石奇，既有北方山势之雄，又兼南国山色之秀，下有宛如白练的径河、胭脂河绕山南北交儿东去。曾被宗教界誉为“十二仙山之一”。古迹胜景甚多，有气势磅礴的马鬃山，奇特的香山胜景，幽雅别致的五台风光，神秘的玄鹤洞，引人入胜的弹筝峡、月石峡等自然景观。 ]],
  exit = {
    sw = { to = '兰州城靖远', },
    nd = { to = '兰州城山脚下', },
  },
},

['兰州城六盘山'] = {
  id = '兰州城六盘山',
  area = '兰州城',
  name = '六盘山',
  desc =  [[这是一座不太高的小山。山顶望去，瓦蓝的天空飘着几朵淡淡的白云。一群大雁发出「嘎嘎」的叫声，从头上飞过。西面山下长城的残垣断壁依稀可辨。路旁有一处悬崖之上刻着首词。]],
  exit = {
    wd = { to = '兰州城靖远', },
    se = { to = '长安城官道#2W', },
  },
},

['兰州城五佛寺'] = {
  id = '兰州城五佛寺',
  area = '兰州城',
  name = '五佛寺',
  desc =  [[这里是一个被废弃的破庙，周围全是沙丘，破庙的寺门已经倒塌，地上有块半埋在沙里的匾，从剥落的金字上你依稀可以辨别出“五佛寺”三个字，唯一尚算完整的建筑是大殿，但屋顶上全是窟窿，强劲的西北风吹过发出难听的“呜---呜---”声。]],
  exit = {
    s = { to = '兰州城石门', },
    d = { to = '星宿海大厅', unstable = true, ignore = true, },
  },

},
['兰州城大渡口#S'] = {
  id = '兰州城大渡口#S',
  area = '兰州城',
  name = '大渡口',
  desc =  [[这里是兰州黄河大渡口，是通往西域的必经之路。宽阔的黄河江面上飘荡着几只轻帆。渡口处正停着一艘渡船，几个乘客正在和船家讨论价钱。你可以由此上(yell)船渡过黄河。]],
  exit = {
    e = { to = '兰州城大道#1W', },
    enter = { to = '兰州城黄河渡船#2', cmd = 'duhe', unstable = true, handler = 'fly_across', no_wander = true, },
  },
},

['兰州城古长城'] = {
  id = '兰州城古长城',
  area = '兰州城',
  name = '古长城',
  desc =  [[这里是一段古长城。相传是当年秦始皇派他的心腹爱将蒙恬率三十万大军所修。世事变迁、沧海桑田，如今这里已是一片废墟，唯一依稀可见的是夯土制成的烽火台象个小土包一样矗立在那里。]],
  exit = {
    w = { to = '兰州城营盘水', },
    e = { to = '兰州城石门', },
    d = { to = '星宿海大厅', unstable = true, ignore = true, },
  },
},

['兰州城古浪'] = {
  id = '兰州城古浪',
  area = '兰州城',
  name = '古浪',
  desc =  [[古浪城建于西周，本名鬼武，后整修于汉，更名古浪。古浪是西北地区的毛皮集散地，当初的紫羊羔皮袄，一出于张家口，另一出处就是古浪了，过了古浪再往东四十里，跨过纪水河即到兰州。]],
  exit = {
    e = { to = '兰州城皮货药材店', },
    nw = { to = '兰州城打柴沟', },
    se = { to = '兰州城萧家桥', },
  },
},

['兰州城沙漠#2'] = {
  id = '兰州城沙漠#2',
  area = '兰州城',
  name = '沙漠',
  desc =  [[这是一片没边际的沙漠，到处是近百米高的巨大沙丘。你一走进来就仿佛迷了路。地下有个石洞。]],
  exit = {
    enter = { to = '兰州城石洞', },
    s = { to = '兰州城沙漠#1', ignore = true, },
    e = { to = '兰州城沙漠#1', },
    w = { to = '兰州城沙漠#1', },
    n = { to = '兰州城沙漠#1', ignore = true, },
  },
},

['兰州城城中心'] = {
  id = '兰州城城中心',
  area = '兰州城',
  name = '城中心',
  desc =  [[西北第一大城，既是西北的经济中心，也是文化中心。兰州的文化集各家丰采，既有传统的释、道、儒三家影响，也有回教的投影，比起京城、扬州，细腻稍有不足，但飞扬之势却有过之。]],
  exit = {
    e = { to = '兰州城东城门', },
    w = { to = '兰州城西城门', },
    s = { to = '兰州城南城门', },
  },
},

['兰州城山脚下'] = {
  id = '兰州城山脚下',
  area = '兰州城',
  name = '山脚下',
  desc =  [[这里已经接近崆峒山的山脚了。崆峒山山史文化悠久，为中国道教发祥地之一。相传轩辕黄帝到此问道于广成子。秦汉时山上已有庙观建筑，后经历代修葺，琳宫梵刹遍布诸峰。]],
  exit = {
    nw = { to = '兰州城西夏渡口#S', },
    su = { to = '兰州城崆峒山', },
  },
},

['兰州城皮货药材店'] = {
  id = '兰州城皮货药材店',
  area = '兰州城',
  name = '皮货药材店',
  desc =  [[这是古浪城里唯一的一家店铺，一踏进铺内就可闻到一股淡淡的膻味，隐隐可以看见堆放在后院翻晒的各式皮货，怕有不下千余件。在西墙边，立了一个大红木药柜，里面盛放了草药。]],
  exit = {
    w = { to = '兰州城古浪', },
  },
},

['兰州城永登'] = {
  id = '兰州城永登',
  area = '兰州城',
  name = '永登',
  desc =  [[这里就是西北的军事重镇永登。一座孤城耸立在茫茫荒野之上。此城建于汉光武年间，据闻大将军霍去病曾在此练兵三年，后一举平定大西北。历代而来，这里都有军队长驻。]],
  exit = {
    e = { to = '兰州城大道#2W', },
    w = { to = '兰州城客店', },
    nw = { to = '兰州城萧家桥', },
  },
},

['兰州城青城'] = {
  id = '兰州城青城',
  area = '兰州城',
  name = '青城',
  desc =  [[青城位于靖远以南三百二十里，西北八十里就是兰州，名为青城，其实只是个小镇，因为地处北去西夏的要冲，许多往来西夏和大宋的商旅都必须经过这儿，人来人往很是热闹。]],
  exit = {
    ne = { to = '兰州城沙漠#1', },
    nw = { to = '兰州城大道#3S', },
    s = { to = '成都城大道#2N', },
    d = { to = '星宿海大厅', unstable = true, ignore = true, },
  },
},

['兰州城萧家桥'] = {
  id = '兰州城萧家桥',
  area = '兰州城',
  name = '萧家桥',
  desc =  [[在兰州和古浪中间，纪永河水咆哮而过，河水湍激，河床最宽处九丈四尺，窄处七丈余，度船难过。相传汉年间，本地一位萧姓大财主，穷六年之功，遍集巧匠，费尽家私，方建成桥，欲到兰州，必先度本桥。]],
  exit = {
    nw = { to = '兰州城古浪', },
    se = { to = '兰州城永登', },
  },
},

['兰州城乌鞘岭'] = {
  id = '兰州城乌鞘岭',
  area = '兰州城',
  name = '乌鞘岭',
  desc =  [[乌鞘岭是武威东南的一个险要地段，黑石山上密林重重，时常有野兽出没。一条官道从山下蜿蜒而过。]],
  exit = {
    nw = { to = '兰州城武威', },
    s = { to = '兰州城打柴沟', },
  },
},

['兰州城大道#3S'] = {
  id = '兰州城大道#3S',
  area = '兰州城',
  name = '大道',
  desc =  [[这里是通往西域的丝绸古路，繁华的城镇在身后慢慢消逝，迎面而来的是阵阵风浪。不时有一队队商人丛你身边擦身而过。北边就接近了兰州城，往东南方向是去青城的道路。]],
  exit = {
    nw = { to = '兰州城大道#2S', },
    se = { to = '兰州城青城', },
  },
},

['兰州城沙漠#1'] = {
  id = '兰州城沙漠#1',
  area = '兰州城',
  name = '沙漠',
  desc =  [[这是一片没边际的沙漠，到处是近百米高的巨大沙丘。你一走进来就仿佛迷了路。]],
  exit = {
    e = { to = '兰州城沙漠#1', },
    s = { to = '兰州城沙漠#2', },
    w = { to = '兰州城青城', cost = 10, handler = 'go_straight', },
    w2 = { to = '兰州城沙漠#1', },
    n = { to = '兰州城沙漠#1', },
  },
},

['兰州城大道#2E'] = {
  id = '兰州城大道#2E',
  area = '兰州城',
  name = '大道',
  desc =  [[这是闻名中外的丝绸商道。迎面而来的是一个个沙包，星罗棋布於荒原之上。一阵风沙吹过，象刀割一样撕裂着你的脸。这里是通往西域的丝绸古路，繁华的城镇在身后慢慢消逝，迎面而来的是阵阵风浪。不时有一队队商人丛你身边擦身而过。西边是兰州，继续往东走便是就是六盘山了。]],
  exit = {
    ne = { to = '兰州城靖远', },
    sw = { to = '兰州城大道#1E', },
  },
},

['兰州城石峡子'] = {
  id = '兰州城石峡子',
  area = '兰州城',
  name = '石峡子',
  desc =  [[石峡子是以前的黄河故道，现在遍地是大大小小的鹅卵石，两边是数丈高的高坡，千沟万壑，向你诉说着世事的沧桑。要是运气好的话你可以在这里拣到非常漂亮、非常珍贵的雨花石。]],
  exit = {
    ne = { to = '兰州城冰草湾', },
    sw = { to = '兰州城土门子', },
  },
},

['兰州城东城门'] = {
  id = '兰州城东城门',
  area = '兰州城',
  name = '东城门',
  desc =  [[这是就是兰州的东城门。再往西就进城了，这儿有军队驻扎，不时盘问来往行人。你小心翼翼，急步离开这是非之地。出关向东，是通往六盘山的驿道。城门的墙上张贴着一纸告示(gaoshi)。]],
  exit = {
    w = { to = '兰州城城中心', },
    e = { to = '兰州城大道#1E', },
  },
},

['兰州城西夏渡口#S'] = {
  id = '兰州城西夏渡口#S',
  area = '兰州城',
  name = '西夏渡口',
  desc =  [[这里是西夏黄河大渡口，是通往西夏的必经之路。宽阔的黄河江面上飘荡着几只轻帆。渡口处正停着一艘渡船，几个乘客正在和船家讨论价钱。你可以由此上(yell)船渡过黄河。]],
  exit = {
    enter = { to = '兰州城黄河渡船#1', cmd = 'duhe', unstable = true, handler = 'fly_across', no_wander = true, },
    se = { to = '兰州城山脚下', },
  },
},

['兰州城客店'] = {
  id = '兰州城客店',
  area = '兰州城',
  name = '客店',
  desc =  [[这是一家当地居民开的鸡毛小店，楼下卖些卤菜和劣酒，楼上则是客房。这是在进祈连山区前的唯一休息之处，贩夫走卒，采药客等皆在此休憩，不时还可看见一两个寻仙访道之辈。墙上有一块牌子(paizi)。]],
  exit = {
    u = { to = '兰州城二楼走廊', no_wander = true, },
    e = { to = '兰州城永登', },
  },
},

['兰州城大道#1W'] = {
  id = '兰州城大道#1W',
  area = '兰州城',
  name = '大道',
  desc =  [[这是闻名中外的丝绸商道。迎面而来的是一个个沙包，星罗棋布於荒原之上。一阵风沙吹过，象刀割一样撕裂着你的脸。这里是通往西域的丝绸古路，繁华的城镇在身后慢慢消逝，迎面而来的是阵阵风浪。不时有一队队商人丛你身边擦身而过。]],
  exit = {
    w = { to = '兰州城大渡口#S', },
    se = { to = '兰州城西城门', },
  },
},

['兰州城武威'] = {
  id = '兰州城武威',
  area = '兰州城',
  name = '武威',
  desc =  [[武威是西夏国的西南重镇，驻有重兵，城楼高达三丈，门口有两排官兵正在认真的盘查过往行人，城门口的告示上画着最近通缉的江洋大盗的图形，城里头看上去还挺热闹。东南就是去永登的方向了，西南面就是祁连山脉。]],
  exit = {
    e = { to = '兰州城土门子', },
    nw = { to = '星宿海万里长城#E', },
    se = { to = '兰州城乌鞘岭', },
  },
},

['兰州城打柴沟'] = {
  id = '兰州城打柴沟',
  area = '兰州城',
  name = '打柴沟',
  desc =  [[打柴沟地势不如乌鞘岭那样险要，比较平坦，官道两边全是密林，时常有樵夫砍柴的声音从林中传出。]],
  exit = {
    se = { to = '兰州城古浪', },
    n = { to = '兰州城乌鞘岭', },
  },
},

['兰州城客房'] = {
  id = '兰州城客房',
  area = '兰州城',
  name = '客房',
  desc =  [[这是一间很大的客房，陈设十分简陋。靠墙放了十几张小木床，不少客人正和衣而卧，满屋子都是呼呼的打酣声。西边有张床是空的，你蹑手蹑脚地走了过去。]],
  exit = {
    out = { to = '兰州城二楼走廊', },
  },
},

['兰州城大渡口#N'] = {
  id = '兰州城大渡口#N',
  area = '兰州城',
  name = '大渡口',
  desc =  [[这里是黄河大渡口，是通往中原的必经之路。宽阔的黄河江面上飘荡着几只轻帆。渡口处正停着一艘渡船，几个乘客正在和船家讨论价钱。你可以由此上(yell)船渡过黄河。]],
  exit = {
    nw = { to = '兰州城大道#2W', },
    enter = { to = '兰州城黄河渡船#2', cmd = 'duhe', unstable = true, handler = 'fly_across', no_wander = true, },
  },
},

['杭州城柳林#1'] = {
  id = '杭州城柳林#1',
  area = '杭州城',
  name = '柳林',
  desc =  [[这里是一大片柳林，郁郁葱葱，一眼望不到尽头，你在柳林里来回来去的走，想要找到出来的路，但是走了半天后发现还是没有找到出来的路。]],
  exit = {
    e = { to = '杭州城柳林#1', },
    s = { to = '杭州城柳林#1', },
    w = { to = '杭州城柳林#1', },
    n = { to = '杭州城柳林#2', cost = 2, handler = 'go_straight', },
  },
},

['杭州城天香楼'] = {
  id = '杭州城天香楼',
  area = '杭州城',
  name = '天香楼',
  desc =  [[这是一座杭州城里有名的酒楼，整个楼面一雕刻为特色，砖雕，木雕，石雕。走进楼内，一眼便看到一副八仙上寿图，八仙人被描画的惟妙惟肖。楼内许多南北来往的门客正在聊天品茶，只见店小二忙的不亦乐乎。]],
  exit = {
    e = { to = '杭州城青石大道#2', },
  },
},

['杭州城青石大道#4'] = {
  id = '杭州城青石大道#4',
  area = '杭州城',
  name = '青石大道',
  desc =  [[你走在一条林荫大道上，两边鸟语花香，游客们往来穿梭，熙熙攘攘好不热闹。你也兴致勃勃地继续在杭州观赏美丽的风景。大道西面是一个钱庄，东面就是杭州城里的老字号当铺。]],
  exit = {
    e = { to = '杭州城翠合斋', },
    s = { to = '杭州城鸿昌客栈', },
    w = { to = '杭州城金华斋', },
    n = { to = '杭州城青石大道#3', },
  },
},

['杭州城西湖边#2'] = {
  id = '杭州城西湖边#2',
  area = '杭州城',
  name = '西湖边',
  desc =  [[杭州西湖山青水秀，碧波涟漪，湖光山色，相映成趣，泛舟湖上犹如镜中行，漫步湖堤则如画中游。西湖之美令人陶醉。自古以来，人们常以艳、娇、媚、秀、柔、嫩来形容她。宋代大诗人苏轼的“水光潋滟晴方好，山色空蒙雨亦奇，欲把西湖比西子，淡妆浓抹总相宜”一诗把西湖明媚秀丽的景色描绘的淋漓尽致。]],
  exit = {
    s = { to = '杭州城柳浪闻莺', },
    sw = { to = '杭州城白堤', },
  },
},

['杭州城北门'] = {
  id = '杭州城北门',
  area = '杭州城',
  name = '北门',
  desc =  [[这里就是杭州城的北门了，俗话说：上有天堂，下有苏杭。慕名而来的游客络绎不绝，而站在城门口把守的官兵，也细细盘查过往的游客，他见你走过来，连忙上前盘查。城门口贴着一张告示(gaoshi)。]],
  exit = {
    s = { to = '杭州城青石大道#2', },
    n = { to = '杭州城青石大道#1', },
  },
},

['杭州城花港观鱼'] = {
  id = '杭州城花港观鱼',
  area = '杭州城',
  name = '花港观鱼',
  desc =  [[从前，这里有一条小溪从花家山流入西湖，故名花港。南宋时有内侍在此建园凿池养鱼，人们常来此凭栏观鱼，此地故名花港观鱼。东面是红鱼池，过桥、出廊往北就是牡丹园。南面就是虎跑泉，东南面可遥望净慈寺,北面就是苏堤了。]],
  exit = {
    s = { to = '杭州城西湖边#5', },
    se = { to = '杭州城西湖边#4', },
    e = { to = '杭州城红鱼池', },
    w = { to = '杭州城牡丹园', },
    n = { to = '杭州城苏堤', },
  },
},

['杭州城青石大道#5'] = {
  id = '杭州城青石大道#5',
  area = '杭州城',
  name = '青石大道',
  desc =  [[你走在一条林荫大道上，两边鸟语花香，游客们往来穿梭，熙熙攘攘好不热闹。你也兴致勃勃地继续在杭州观赏美丽的风景。大道西面是通往玉泉。西北是令人仰慕的岳王庙，东南是一条大道。]],
  exit = {
    w = { to = '杭州城玉泉', },
    nw = { to = '杭州城岳王庙', },
    s = { to = '杭州城苏堤', },
    se = { to = '杭州城青石大道#7', },
  },
},

['杭州城迎熏阁'] = {
  id = '杭州城迎熏阁',
  area = '杭州城',
  name = '迎熏阁',
  desc =  [[迎熏阁石赏荷的最佳处，它在一片水杉密林之中，建筑多依曲折池岸而立。游客们最喜欢到这里前来赏荷。]],
  exit = {
    w = { to = '杭州城曲园风荷', },
  },
},

['杭州城园门'] = {
  id = '杭州城园门',
  area = '杭州城',
  name = '园门',
  desc =  [[入墓园门是一个小庭院，内有南北两道碑廊，南廊陈列着南宋以来历代诗人歌颂岳飞的誓词碑刻；北廊有岳飞的手记《满江红》、《前后出师表》，还有奏章、宋高宗诏书、岳飞的石刻像等。]],
  exit = {
    e = { to = '杭州城精忠柏', },
    out = { to = '杭州城岳王庙', },
  },
},

['杭州城红鱼池'] = {
  id = '杭州城红鱼池',
  area = '杭州城',
  name = '红鱼池',
  desc =  [[红鱼池是园内的热闹之地，池中养有几千条红鲫鱼，大的有数尺长，凭栏投铒，群鱼奋起挣食，即会返起阵阵微波。池旁假山池沼，步移景易，山水无比奇秀。]],
  exit = {
    w = { to = '杭州城花港观鱼', },
  },
},

['杭州城精忠柏'] = {
  id = '杭州城精忠柏',
  area = '杭州城',
  name = '精忠柏',
  desc =  [[墓园的西部有一“精忠柏”亭，乃以“化石”来比喻岳飞坚贞不屈的精神，反映了人民对这位民族英雄的崇敬、景仰之情。]],
  exit = {
    w = { to = '杭州城园门', },
    s = { to = '杭州城岳飞墓', },
  },
},

['杭州城泉屋'] = {
  id = '杭州城泉屋',
  area = '杭州城',
  name = '泉屋',
  desc =  [[泉屋内有两股泉水，“珍珠泉”和“晴空细雨泉”。“珍珠泉”，当你在池畔用脚跺地，即有水泡连串上涌，状似一颗颗珍珠。“晴空细雨泉”则因泉眼多而细密，泉水细细上涌，在阳光下从水面上看去似有许多雨点，仿佛正在下着细雨。]],
  exit = {
    s = { to = '杭州城玉泉', },
  },
},

['杭州城紫来洞'] = {
  id = '杭州城紫来洞',
  area = '杭州城',
  name = '紫来洞',
  desc =  [[你从这里的前山林海亭循磴道上山，过“佛道崖”、“玉皇宫”，就到了紫来洞。洞前可俯视山下的“八卦田”，传说这就是南宋皇帝所谓“躬耕的籍田，每逢春耕，皇帝率文武百官到此籍礼，用以表示对农业的重视。]],
  exit = {
    su = { to = '杭州城山路#1S', },
    n = { to = '杭州城玉皇山', },
  },
},

['杭州城虎跑'] = {
  id = '杭州城虎跑',
  area = '杭州城',
  name = '虎跑',
  desc =  [[过了西湖西南的大慈山麓就到了虎跑。这里青山灵秀，溪流淙淙，林木繁茂，环境幽雅。泉自后山的石英岩中渗出，汇于一小方池中，干洌醇厚，享有天下第三泉之称。相传唐时性空和尚云游至此，见青峰独秀，想在此建寺，但苦于无水，正要去时，忽梦神人相告“：南岳有童子泉，当谴两虎移来”。第二天果然两虎“跑地作穴”涌出清泉，虎跑由此得名。用虎跑泉泡龙井茶，沁人心脾，誉为西湖双绝。]],
  exit = {
    ne = { to = '杭州城玉皇山', },
    nw = { to = '杭州城龙井', },
    n = { to = '杭州城西湖边#5', },
  },
},

['杭州城万年春'] = {
  id = '杭州城万年春',
  area = '杭州城',
  name = '万年春',
  desc =  [[这是一家药铺，一股浓浓的药味让你几欲窒息，那是从药柜上的几百个小抽屉里散发出来的。药房先生坐在茶几旁，独自喝着茶，看也不看你一眼。一名小伙计站在柜台后招呼着顾客。]],
  exit = {
    w = { to = '杭州城青石大道#3', },
  },
},

['杭州城西冷桥'] = {
  id = '杭州城西冷桥',
  area = '杭州城',
  name = '西冷桥',
  desc =  [[这里就是西冷桥了，从这里看西湖，碧波万倾，山光水色，分外秀丽。往东面走去就是孤山了。]],
  exit = {
    e = { to = '杭州城孤山', },
  },
},

['杭州城飞来峰'] = {
  id = '杭州城飞来峰',
  area = '杭州城',
  name = '飞来峰',
  desc =  [[飞来峰上有枣刻在石壁上的各种造像。左岩壁上刻有阿弥陀佛、观音等造像，袒腹露胸、笑容满面的弥勒佛，是这里最大的一组雕像。右边石壁上刻有“多闻天王”的造像，他全身披甲，眼若铜玲，威风凛凛的骑在狮子背上，十分生动。]],
  exit = {
    w = { to = '杭州城青石大道#7', },
    se = { to = '杭州城石屋洞', },
  },
},

['杭州城水池'] = {
  id = '杭州城水池',
  area = '杭州城',
  name = '水池',
  desc =  [[假山中央的岩石上一道泉水从龙口中喷涌而出，形成多级瀑布，注入深池。池畔两块山石上分别刻着“水不在深”，“有龙则灵”。池西面是一组园林小筑。]],
  exit = {
    nw = { to = '杭州城黄龙洞', },
    w = { to = '杭州城小筑', },
  },
},

['杭州城石屋洞'] = {
  id = '杭州城石屋洞',
  area = '杭州城',
  name = '石屋洞',
  desc =  [[烟霞三洞洞中有洞，主洞高大。其中石屋洞高敞如屋，两侧各有洞府，曲曲折折通向洞外。洞内有罗汉五百十六身。因洞外青龙山麓一带桂树成片，洞前庭院中种满桂花，是中秋时节赏桂圣地。]],
  exit = {
    nw = { to = '杭州城飞来峰', },
    se = { to = '杭州城水乐洞', },
  },
},

['杭州城青石大道#1'] = {
  id = '杭州城青石大道#1',
  area = '杭州城',
  name = '青石大道',
  desc =  [[你走在一条林荫大道上，两边鸟语花香，游客们往来穿梭，熙熙攘攘好不热闹。远处就是杭州城了，你也不禁加快脚步，杭州北门展现在你的面前。]],
  exit = {
    s = { to = '杭州城北门', },
    n = { to = '杭州城山路#1N', },
  },
},

['杭州城小筑'] = {
  id = '杭州城小筑',
  area = '杭州城',
  name = '小筑',
  desc =  [[这里有各式各样的园林小筑，各种建筑随着地势低高而错落有制。东边以三折曲廊联接主庭院。傍山依水的翠云亭和香雪亭错落有制，亭内有男女乐宫弹奏着悠扬动听的古乐曲，为你品茗、观景助兴。]],
  exit = {
    e = { to = '杭州城水池', },
    sw = { to = '杭州城长廊#M', handler = 'simple_path_set_pos', },
  },
},

['杭州城大雄宝殿'] = {
  id = '杭州城大雄宝殿',
  area = '杭州城',
  name = '大雄宝殿',
  desc =  [[大雄宝殿正中是释迦牟尼说法坐像，妙像庄严，金碧辉煌。靠两厢殿壁排列着二十诸天，后面趺坐着十二圆觉。释枷牟尼佛的背后是金壁辉煌的“五十三参”彩塑。]],
  exit = {
    s = { to = '杭州城天王殿', },
  },
},

['杭州城西湖边#5'] = {
  id = '杭州城西湖边#5',
  area = '杭州城',
  name = '西湖边',
  desc =  [[杭州西湖山青水秀，碧波涟漪，湖光山色，相映成趣，泛舟湖上犹如镜中行，漫步湖堤则如画中游。西湖之美令人陶醉。自古以来，人们常以艳、娇、媚、秀、柔、嫩来形容她。宋代大诗人苏轼的“水光潋滟晴方好，山色空蒙雨亦奇，欲把西湖比西子，淡妆浓抹总相宜”一诗把西湖明媚秀丽的景色描绘的淋漓尽致。]],
  exit = {
    e = { to = '杭州城西湖边#4', },
    s = { to = '杭州城虎跑', },
    n = { to = '杭州城花港观鱼', },
  },
},

['杭州城山路#1S'] = {
  id = '杭州城山路#1S',
  area = '杭州城',
  name = '山路',
  desc =  [[延石阶登上山巅，过南天门，迎面有“祥云护仙”的巨幅壁画，再过门庭，就是福星观。观内供奉着玉皇神像。上“登云阁”可极目远眺，南屏群山、西湖秀色、八卦籍田、钱江山水尽收眼底，当云烟飞渡时，更使人有凌空欲飞之感。]],
  exit = {
    ed = { to = '宁波城青石官道#1', },
    nd = { to = '杭州城紫来洞', },
  },
},

['杭州城平湖秋月'] = {
  id = '杭州城平湖秋月',
  area = '杭州城',
  name = '平湖秋月',
  desc =  [[平湖秋月面临外湖，水面十分开阔。楼阁前有一广阔的平台，并直伸到湖中，三面临水，平台与水面相平，视线低平，视野开阔，是临湖赏月的好地方。在此四眺湖山，烟波浩渺，群山吐翠，山光水色无比秀美。特别是皓月当空之时，这里的水云月天更是引人入胜。]],
  exit = {
    e = { to = '杭州城白堤', },
  },
},

['杭州城山路#2N'] = {
  id = '杭州城山路#2N',
  area = '杭州城',
  name = '山路',
  desc =  [[你走在山路上，山路两旁树木葱绿，鸟语话香，山路两旁是一大片郁郁葱葱的柳林。]],
  exit = {
    ne = { to = '苏州城青石官道#1', },
    w = { to = '杭州城柳林#1', },
    s = { to = '杭州城山路#1N', },
    e = { to = '杭州城柳林#1', },
  },
},

['杭州城青石大道#3'] = {
  id = '杭州城青石大道#3',
  area = '杭州城',
  name = '青石大道',
  desc =  [[你走在一条林荫大道上，两边鸟语花香，游客们往来穿梭，熙熙攘攘好不热闹。你也兴致勃勃地继续在杭州观赏美丽的风景。大道西面是杂货铺，东面就是杭州城里的一个药铺。]],
  exit = {
    e = { to = '杭州城万年春', },
    s = { to = '杭州城青石大道#4', },
    w = { to = '杭州城杂货铺', },
    n = { to = '杭州城青石大道#2', },
  },
},

['杭州城山路#1NW'] = {
  id = '杭州城山路#1NW',
  area = '杭州城',
  name = '山路',
  desc =  [[你走在山路上，不远处就能看到黄龙洞，你走进古色古香的山门，沿着古树修竹夹峙的石级上行，来到第二道门，这里又一垛随坡而筑的黄色粉墙，墙上整齐地排列着“九龙窗”，门两侧又有鹤鹿雕窗，东侧竹木园中松竹交翠，显示了园林风格。望东面是雷峰塔，北面就是宝塔山。]],
  exit = {
    nu = { to = '杭州城黄龙洞', },
    eu = { to = '杭州城雷峰塔', },
    su = { to = '杭州城宝淑塔', },
  },
},

['杭州城映波桥'] = {
  id = '杭州城映波桥',
  area = '杭州城',
  name = '映波桥',
  desc =  [[映波桥在西湖的西侧，可观赏花港山庄倒映的楼台亭阁，千倾一碧的三潭映月，望南面可观南屏、西山葱郁叠翠。往南走就是跨虹桥。]],
  exit = {
    e = { to = '杭州城苏堤', },
    s = { to = '杭州城跨虹桥', },
  },
},

['杭州城烟霞洞'] = {
  id = '杭州城烟霞洞',
  area = '杭州城',
  name = '烟霞洞',
  desc =  [[烟霞洞中石壁上刻有五代和宋代的石像，栩栩如生，其中又以洞口两壁凿成于宋代的“观音”和“大势至”造像最为精美。]],
  exit = {
    e = { to = '杭州城水乐洞', },
    se = { to = '杭州城龙井', },
  },
},

['杭州城曲园风荷'] = {
  id = '杭州城曲园风荷',
  area = '杭州城',
  name = '曲园风荷',
  desc =  [[曲院风菏在苏堤跨虹桥的西北，以种植荷花而闻名。园内叠石理水，临水筑有亭、廊、楼、阁，陈列着各式盆景和金石书画。水面种有红、白、粉、洒金、并蒂等多种颜色和种类的荷花名品。四周有迎熏阁，环碧桥，风微亭，红绡翠盖廊，波香亭等临水小筑。]],
  exit = {
    e = { to = '杭州城迎熏阁', },
    se = { to = '杭州城跨虹桥', },
  },
},

['杭州城天王殿'] = {
  id = '杭州城天王殿',
  area = '杭州城',
  name = '天王殿',
  desc =  [[天王殿气势恢宏，殿门上方高悬御笔“云林禅寺”和“灵鹫飞来”两块金匾。殿内正面是大肚弥勒佛，喜迎各方香客。弥勒背后，面对大雄宝殿的是韦驮菩萨，两侧分力气势非凡的四大天王，韦驮和四大天王皆是降魔护法的护法神。]],
  exit = {
    e = { to = '杭州城灵隐寺', },
    n = { to = '杭州城大雄宝殿', },
  },
},

['杭州城玉皇山'] = {
  id = '杭州城玉皇山',
  area = '杭州城',
  name = '玉皇山',
  desc =  [[玉皇山林木葱绿，翠竹挺拔，亭阁众多，云雾缭绕，可以纵览西湖和西湖周围的全部景色。西北面是净慈寺，西南面就到了虎跑。往南走是紫来洞。]],
  exit = {
    sw = { to = '杭州城虎跑', },
    nw = { to = '杭州城净慈寺', },
    s = { to = '杭州城紫来洞', },
  },
},

['杭州城青石大道#2'] = {
  id = '杭州城青石大道#2',
  area = '杭州城',
  name = '青石大道',
  desc =  [[你走在一条林荫大道上，两边鸟语花香，游客们往来穿梭，熙熙攘攘好不热闹。你也兴致勃勃地继续在杭州观赏美丽的风景。大道西面是天香楼，东面是一个书堂。]],
  exit = {
    e = { to = '杭州城书院', },
    s = { to = '杭州城青石大道#3', },
    w = { to = '杭州城天香楼', },
    n = { to = '杭州城北门', },
  },
},

['杭州城青石大道#6'] = {
  id = '杭州城青石大道#6',
  area = '杭州城',
  name = '青石大道',
  desc =  [[你走在一条青石大道上，道路上游客熙熙攘攘，全都是来游历西湖的湖光山色的。大道的北面是一座宝塔山，从这里可以看到宝淑塔亭亭玉立的婀娜身影。]],
  exit = {
    nu = { to = '杭州城宝淑塔', },
    s = { to = '杭州城白堤', },
  },
},

['杭州城青石大道#7'] = {
  id = '杭州城青石大道#7',
  area = '杭州城',
  name = '青石大道',
  desc =  [[过了小溪与灵隐寺相对的就是飞来峰。飞来峰上有五代、唐、宋各代的石像几百尊，是佛家参拜的灵圣的宝地。东南方是一条土路。]],
  exit = {
    e = { to = '杭州城飞来峰', },
    nw = { to = '杭州城青石大道#5', },
    w = { to = '杭州城灵隐寺', },
    se = { to = '牛家村土路#1SE', },
  },
},

['杭州城水乐洞'] = {
  id = '杭州城水乐洞',
  area = '杭州城',
  name = '水乐洞',
  desc =  [[水乐洞洞狭长幽深，地下水流循着凹凸不平的水道前进，发出丁丁咚咚的声音，犹如奏乐。再往西边走就到了烟霞洞。]],
  exit = {
    nw = { to = '杭州城石屋洞', },
    w = { to = '杭州城烟霞洞', },
  },
},

['杭州城长廊#M'] = {
  id = '杭州城长廊#M',
  area = '杭州城',
  name = '长廊',
  desc =  [[你走进长廊，看到长廊上面全是一幅幅工笔彩画，当真是妙不可言。每一幅都栩栩如生，看的你都入迷了，连原来的路都找不到了。]],
  exit = {
    e = { to = '杭州城长廊#M', },
    s = { to = '杭州城长廊#M', },
    w = { to = '杭州城长廊#M', },
    n = { to = '杭州城长廊#M', },
    hidden = { to = '杭州城长廊#E', cost = 3, handler = 'simple_path', },
  },
},

['杭州城长廊#E'] = {
  id = '杭州城长廊#E',
  area = '杭州城',
  name = '长廊',
  desc =  [[你走进长廊，看到长廊上面全是一幅幅工笔彩画，当真是妙不可言。每一幅都栩栩如生，看的你都入迷了，连原来的路都找不到了。]],
  exit = {
    e = { to = '杭州城长廊#M', ignore = true, },
    s = { to = '杭州城长廊#M', ignore = true, },
    w = { to = '杭州城黄龙洞', },
    n = { to = '杭州城长廊#M', handler = 'simple_path_set_pos', },
  },
},

['杭州城苏堤'] = {
  id = '杭州城苏堤',
  area = '杭州城',
  name = '苏堤',
  desc =  [[你来到苏堤之上，看到游客来往络绎不绝，熙熙攘攘，热闹非凡。苏堤景色四时不同，晨昏各异，其中又以春晓景色令人心醉。其时晨雾密朦，春色迷人，万枝杨柳刚吐嫩芽，如青烟绿雾，湖上风来，翠浪翻空。地面碧桃吐艳，红霞满地，处处生机勃勃，列锦铺锈。又因她在湖山之间，更富有诗情画意。苏堤的南面是花港观鱼,北面是一条青石大道，东西各是一座小桥。]],
  exit = {
    e = { to = '杭州城跨虹桥', },
    s = { to = '杭州城花港观鱼', },
    w = { to = '杭州城映波桥', },
    n = { to = '杭州城青石大道#5', },
  },
},

['杭州城金华斋'] = {
  id = '杭州城金华斋',
  area = '杭州城',
  name = '金华斋',
  desc =  [[这是一家老字号的钱庄，已有几百年的历史，在全国各地都有分店。它发行的银票信誉非常好，通行全国。]],
  exit = {
    e = { to = '杭州城青石大道#4', },
  },
},

['杭州城宝淑塔'] = {
  id = '杭州城宝淑塔',
  area = '杭州城',
  name = '宝淑塔',
  desc =  [[你上到山来，就是宝淑塔了，塔身玲珑修长，高耸挺拔，造型俏丽，风格独特。从塔下仰望塔尖，有高不可抑之感；从山下远望，亭亭玉立，秀丽玲珑。所以有句谚语说：“湖上两浮屠，雷峰如老衲，宝淑如美人。”]],
  exit = {
    sd = { to = '杭州城青石大道#6', },
    nd = { to = '杭州城山路#1NW', },
  },
},

['杭州城柳林#2'] = {
  id = '杭州城柳林#2',
  area = '杭州城',
  name = '柳林',
  desc =  [[这里是一大片柳林，郁郁葱葱，一眼望不到尽头，你在柳林里来回来去的走，想要找到出来的路，但是走了半天后发现还是没有找到出来的路。]],
  exit = {
    e = { to = '杭州城柳林#2', },
    s = { to = '杭州城柳林#2', },
    n = { to = '杭州城山路#2N', },
  },
},

['杭州城玉泉'] = {
  id = '杭州城玉泉',
  area = '杭州城',
  name = '玉泉',
  desc =  [[你到了玉泉池，这里有一个大的水池，围绕着水池建有花厅、茶室、回廊。玉泉池池水清澈见底，池内养有二百多条青鱼、草鱼、和红、黄两色的鲤鱼。“鱼乐园”三字匾书写的苍劲有力，亭柱上一幅对联十分贴切：“鱼乐人亦乐，泉清心共清”。在此观鱼可以忘却烦恼，忘却自我。往北走就到了泉屋。]],
  exit = {
    e = { to = '杭州城青石大道#5', },
    n = { to = '杭州城泉屋', },
  },
},

['杭州城西湖边#4'] = {
  id = '杭州城西湖边#4',
  area = '杭州城',
  name = '西湖边',
  desc =  [[杭州西湖山青水秀，碧波涟漪，湖光山色，相映成趣，泛舟湖上犹如镜中行，漫步湖堤则如画中游。西湖之美令人陶醉。自古以来，人们常以艳、娇、媚、秀、柔、嫩来形容她。宋代大诗人苏轼的“水光潋滟晴方好，山色空蒙雨亦奇，欲把西湖比西子，淡妆浓抹总相宜”一诗把西湖明媚秀丽的景色描绘的淋漓尽致。]],
  exit = {
    se = { to = '杭州城净慈寺', },
    w = { to = '杭州城西湖边#5', },
    nw = { to = '杭州城花港观鱼', },
    n = { to = '杭州城柳浪闻莺', },
  },
},

['杭州城白堤'] = {
  id = '杭州城白堤',
  area = '杭州城',
  name = '白堤',
  desc =  [[白堤两岸垂柳纷披，碧桃成云。春暖时节，柳丝放青，如烟如雾，碧桃吐艳，艳丽夺目，一路风采，犹如锦带飘动，两岸青山绿水，秀色可餐，你漫步其间，足以令你心醉神迷。西面就是平湖秋月。北面是一条大道，东南面是岳王庙，西南面可遥望孤山，西北面就是断桥。]],
  exit = {
    ne = { to = '杭州城西湖边#2', },
    se = { to = '杭州城岳王庙', },
    w = { to = '杭州城平湖秋月', },
    sw = { to = '杭州城孤山', },
    nw = { to = '杭州城断桥残雪', },
    n = { to = '杭州城青石大道#6', },
  },
},

['杭州城西湖边#1'] = {
  id = '杭州城西湖边#1',
  area = '杭州城',
  name = '西湖边',
  desc =  [[杭州西湖山青水秀，碧波涟漪，湖光山色，相映成趣，泛舟湖上犹如镜中行，漫步湖堤则如画中游。西湖之美令人陶醉。自古以来，人们常以艳、娇、媚、秀、柔、嫩来形容她。宋代大诗人苏轼的“湖光潋滟晴方好，山色空蒙雨亦奇，欲把西湖比西子，淡妆浓抹总相宜”一诗把西湖明媚秀丽的景色描绘的淋漓尽致。]],
  exit = {
    nw = { to = '杭州城白堤', },
    e = { to = '杭州城岳王庙', },
  },
},

['杭州城黄龙洞'] = {
  id = '杭州城黄龙洞',
  area = '杭州城',
  name = '黄龙洞',
  desc =  [[你走进了黄龙洞，看见左侧庭院出圆洞门为“方竹园”，内植名贵方竹。右侧庭院南侧有游廊，廊外有深池，池的东面和南面利用山势以太湖石堆叠假山，山后有密林烘托。山虽不高却颇具峰谷起伏的气度。]],
  exit = {
    sd = { to = '杭州城山路#1NW', },
    se = { to = '杭州城水池', },
  },
},

['杭州城翠合斋'] = {
  id = '杭州城翠合斋',
  area = '杭州城',
  name = '翠合斋',
  desc =  [[这是一家以买卖公平著称的当铺，一个五尺高的柜台挡在你的面前，柜台上摆着一个牌子(sign)，柜台后坐着位老板，一双精明的眼睛上上下下打量着你。]],
  exit = {
    w = { to = '杭州城青石大道#4', },
  },
},

['杭州城灵隐寺'] = {
  id = '杭州城灵隐寺',
  area = '杭州城',
  name = '灵隐寺',
  desc =  [[灵隐寺具今以有一千多年的历史了，是佛教禅宗十刹之一。灵隐寺规模宏大超群，二天门前的一对陀罗尼经幢是五代越国时的原物，极为珍贵。]],
  exit = {
    w = { to = '杭州城天王殿', },
    e = { to = '杭州城青石大道#7', },
  },
},

['杭州城鸿昌客栈'] = {
  id = '杭州城鸿昌客栈',
  area = '杭州城',
  name = '鸿昌客栈',
  desc =  [[鸿昌客栈是杭州城里最大的客店了，凡是到杭州来游玩的游客疲劳后都到这里来小憩，鸿昌客栈的老板非常好客，而且这里的房钱比别处要便宜的多。你一走进这里，店小二就笑盈盈地迎了过来。墙上挂着一个牌子(paizi)。]],
  exit = {
    u = { to = '杭州城二楼走廊', no_wander = true, },
    e = { to = '杭州城马厩', },
    w = { to = '杭州城岳王庙', },
    n = { to = '杭州城青石大道#4', },
  },
},

['杭州城山路#1N'] = {
  id = '杭州城山路#1N',
  area = '杭州城',
  name = '山路',
  desc =  [[你走在山路上，山路两旁树木葱绿，鸟语话香，山路两旁是一大片郁郁葱葱的柳林。再往前走就是杭州地界了。]],
  exit = {
    e = { to = '杭州城柳林#1', },
    s = { to = '杭州城青石大道#1', },
    w = { to = '杭州城柳林#1', },
    n = { to = '杭州城山路#2N', },
  },
},

['杭州城岳飞墓'] = {
  id = '杭州城岳飞墓',
  area = '杭州城',
  name = '岳飞墓',
  desc =  [[从庭院过精忠桥，进入即为岳飞墓，墓两侧有石虎、石羊、石马和石翁仲等。墓前篆有“宋岳鄂王墓”五字巨碑。墓前反翦双手跪着秦桧等四个奸贼的铸铁像。墓旁有一联(lian)。墓前望柱上的一幅楹联是：“正邪自古同冰炭；毁誉于今判伪真”。]],
  exit = {
    n = { to = '杭州城精忠柏', },
  },
},

['杭州城二楼走廊'] = {
  id = '杭州城二楼走廊',
  area = '杭州城',
  name = '二楼走廊',
  desc =  [[你正走在客店二楼的走廊上，可以听到从客房里不时地呼呼的打酣声，一阵高过一阵。不时有睡意朦胧的旅客进进出出，到楼下的掌柜处付了钱再上来睡觉。]],
  exit = {
    enter = { to = '杭州城客房', },
    d = { to = '杭州城鸿昌客栈', },
  },
},

['杭州城龙井'] = {
  id = '杭州城龙井',
  area = '杭州城',
  name = '龙井',
  desc =  [[过了西湖西南凤篁岭，你就来到了龙井。只见四周，林木茂密，怪石嵯峨，风景优美。龙井为杭州名泉之一，泉水清凉干冽，大旱不枯。]],
  exit = {
    nw = { to = '杭州城烟霞洞', },
    se = { to = '杭州城虎跑', },
  },
},

['杭州城牡丹园'] = {
  id = '杭州城牡丹园',
  area = '杭州城',
  name = '牡丹园',
  desc =  [[你走到牡丹园内，看到假山高处有一重檐八角的牡丹亭，亭周植有各种名贵的牡丹几百株，还有四季应时之花，八节常青之树，有的傲然挺立，有的盘曲多姿，远看宛如一幅立体的中国山水画。]],
  exit = {
    e = { to = '杭州城花港观鱼', },
  },
},

['杭州城马厩'] = {
  id = '杭州城马厩',
  area = '杭州城',
  name = '马厩',
  desc =  [[这是客店边上的马厩，常年供应新鲜草料。据说此地民风淳朴，客人要住店，马夫们就会把马牵到马厩好生照看，将它们喂饱饮足，再洗刷得干乾净净。一直伺候到客人离店上路。马厩中堆放著几堆草料，正中有一口泔槽。]],
  exit = {
    w = { to = '杭州城鸿昌客栈', },
  },
},

['杭州城雷峰塔'] = {
  id = '杭州城雷峰塔',
  area = '杭州城',
  name = '雷峰塔',
  desc =  [[夕照山上遍植栖树和红枫。每逢深秋，层林尽染，分外壮观。山顶有一座塔，雷峰塔。神话“白蛇传”中的白娘娘就是被法海禁锢在这座塔里。每当夕阳西下，彩云缭绕，塔影幢幢，这就是西湖名景“雷峰夕照”。]],
  exit = {
    wd = { to = '杭州城山路#1NW', },
  },
},

['杭州城文澜阁'] = {
  id = '杭州城文澜阁',
  area = '杭州城',
  name = '文澜阁',
  desc =  [[文澜阁位于孤山的南麓，建筑结构独特，全为木结构。阁旁的叠石假山，一池曲水。文澜阁原是一藏书阁，后因战火而关闭。现在的文澜阁内有许多藏书，如果运气好，管事能够借你一本。]],
  exit = {
    n = { to = '杭州城孤山', },
  },
},

['杭州城书院'] = {
  id = '杭州城书院',
  area = '杭州城',
  name = '书院',
  desc =  [[这里是书院的讲堂，窗明几净，一尘不染。一位庄重严肃的老者坐在太师椅上讲学，那就是当今大儒朱先生了。在他的两侧坐满了求学的学生。一张古意盎然的书案放在朱先生的前面，案上摆着几本翻开了的线装书籍。朱先生的身后是一个书架(shujia)讲堂内多历代楹联石刻，足见书院历史的悠久。值得一提的是嵌在讲堂前左壁的学规(xuegui)。]],
  exit = {
    w = { to = '杭州城青石大道#2', },
  },
},

['杭州城杂货铺'] = {
  id = '杭州城杂货铺',
  area = '杭州城',
  name = '杂货铺',
  desc =  [[这是一家小小的杂货铺，大箱小箱堆满了一地，都是一些日常用品。掌柜懒洋洋地躺在一只躺椅上，招呼着过往行人。据说私底下他也卖一些贵重的东西。摊上立着一块招牌(zhaopai)。    门前立了个牌子(sign)。]],
  exit = {
    e = { to = '杭州城青石大道#3', },
  },
},

['杭州城跨虹桥'] = {
  id = '杭州城跨虹桥',
  area = '杭州城',
  name = '跨虹桥',
  desc =  [[跨虹桥是环视西湖的全景之地，是观赏苏堤春晓之处。清晨可观平湖日出，在夏天可远眺孤山楼阁、鱼后彩虹，望西面则可观“接天莲叶无穷碧，映日荷花别样红”的景色。]],
  exit = {
    w = { to = '杭州城苏堤', },
    nw = { to = '杭州城曲园风荷', },
    n = { to = '杭州城映波桥', },
  },
},

['杭州城净慈寺'] = {
  id = '杭州城净慈寺',
  area = '杭州城',
  name = '净慈寺',
  desc =  [[净慈寺有前，中，後三殿，以中间的大雄宝殿最为壮观。大雄宝殿，外观两层，黄色琉璃瓦屋顶，特别显的精美宏伟。寺廊的钟声在苍烟暮霭中回荡，抑扬动听，这就是西湖十景之一“南屏晚钟”的来历。]],
  exit = {
    nw = { to = '杭州城西湖边#4', },
    se = { to = '杭州城玉皇山', },
  },
},

['杭州城断桥残雪'] = {
  id = '杭州城断桥残雪',
  area = '杭州城',
  name = '断桥残雪',
  desc =  [[断桥位于白堤的东面，是西湖中最出名的一座桥，也以她的雪景为西湖名景之一。她横亘于白堤之上，在积雪消融未尽时，远近景物与水中倒影互相辉映，形成特有的“断桥残雪”的美景。]],
  exit = {
    se = { to = '杭州城白堤', },
  },
},

['杭州城放鹤亭'] = {
  id = '杭州城放鹤亭',
  area = '杭州城',
  name = '放鹤亭',
  desc =  [[放鹤亭在孤山北面，据说是为了纪念北宋隐逸诗人林和靖而筑。因此人喜爱隐居，平日除了吟诗作画外,喜欢种梅养鹤，故有“梅妻鹤子”之说。其作《山园小梅》“疏影横斜水清浅，暗香浮动月黄昏”，至今还脍炙人口，传咏遐迩。]],
  exit = {
    s = { to = '杭州城孤山', },
  },
},

['杭州城柳浪闻莺'] = {
  id = '杭州城柳浪闻莺',
  area = '杭州城',
  name = '柳浪闻莺',
  desc =  [[你走在一条湖边大道上，岸边两排整齐的柳树成荫，柳枝随风摇摆，下垂的柳条拍打着你的肩膀，时时几只燕子结队飞过，一派江南风景令你如吃如醉。大道旁有一片碧绿的草坪，小草长的是那么的绿，那么的嫩。]],
  exit = {
    s = { to = '杭州城西湖边#4', },
    n = { to = '杭州城西湖边#2', },
  },
},

['杭州城岳王庙'] = {
  id = '杭州城岳王庙',
  area = '杭州城',
  name = '岳王庙',
  desc =  [[你走进岳王庙，只见正殿内岳飞塑像，红樱帅盔，紫甲金袍，右手握拳，左手按剑，正气凛然。座像上端挂着岳飞亲笔手书的四字横匾(bian)。大殿内两侧挂有“精忠报国”四个大字。令人对这位民族英雄的气壮山河的一生不禁钦佩不已。]],
  exit = {
    enter = { to = '杭州城园门', },
    se = { to = '杭州城青石大道#5', },
    e = { to = '杭州城鸿昌客栈', },
    w = { to = '杭州城西湖边#1', },
    nw = { to = '杭州城白堤', },
  },
},

['杭州城孤山'] = {
  id = '杭州城孤山',
  area = '杭州城',
  name = '孤山',
  desc =  [[在西湖的外湖与内湖之间，就是孤山，其实是一座小岛，岛上青峰独秀，又多梅花。每当天晴之日，旭日东升之时，泛舟湖上，回首孤山，白雪皑皑，宛如置身琼楼玉宇之中。唐代诗人白居易有诗云：“到岸请君回头望，蓬莱宫在水中央”。孤山的东连白堤，西面就是西冷桥。]],
  exit = {
    ne = { to = '杭州城白堤', },
    s = { to = '杭州城文澜阁', },
    e = { to = '梅庄西湖边', },
    w = { to = '杭州城西冷桥', },
    n = { to = '杭州城放鹤亭', },
  },
},

['杭州城客房'] = {
  id = '杭州城客房',
  area = '杭州城',
  name = '客房',
  desc =  [[这是一间很大的客房，陈设十分简陋。靠墙放了十几张小木床，不少客人正和衣而卧，满屋子都是呼呼的打酣声。西边有张床是空的，你蹑手蹑脚地走了过去。]],
  exit = {
    out = { to = '杭州城二楼走廊', },
  },
},

['神龙岛卧室#HEI'] = {
  id = '神龙岛卧室#HEI',
  area = '神龙岛',
  name = '卧室',
  desc =  [[此处是黑龙门的卧室，屋中的布置很简单，只有几只大床靠墙放着，供本门教众休息之用。]],
  exit = {
    w = { to = '神龙岛黑龙门议事厅', },
  },
},

['神龙岛卧室#GAO'] = {
  id = '神龙岛卧室#GAO',
  area = '神龙岛',
  name = '卧室',
  desc =  [[此处是陆高轩夫妇的卧室，里面除了有一张大床，一张八仙桌，几只衣柜和一些椅子外别无它物，屋内收拾得颇为干净，看来女主人是相当勤快的。]],
  exit = {
    s = { to = '神龙岛陆府正厅', },
  },
},

['神龙岛山路#1'] = {
  id = '神龙岛山路#1',
  area = '神龙岛',
  name = '山路',
  desc =  [[这是一条蜿蜒曲折的山路，路的一边是一道溪水淙淙的山溪，另一边是一棵棵提拔的大树，间杂着一些清新的小草，时而可以看见有鸟儿从树梢上飞过。]],
  exit = {
    u = { to = '神龙岛山路#2', },
    sd = { to = '神龙岛林间空地', },
  },
},

['神龙岛山路#3'] = {
  id = '神龙岛山路#3',
  area = '神龙岛',
  name = '山路',
  desc =  [[这是一条蜿蜒曲折的山路，路的一边是一道溪水淙淙的山溪，另一边是许多生长茂盛的树木，间杂着一些清新的小草，时而可以看见有鸟儿从树梢上飞过。]],
  exit = {
    nu = { to = '神龙岛山路#HUANG', },
    eu = { to = '神龙岛山路#4', },
    wd = { to = '神龙岛山坡#C', },
  },
},

['神龙岛树林#E'] = {
  id = '神龙岛树林#E',
  area = '神龙岛',
  name = '树林',
  desc =  [[这里的树长得都又高有大，粗大的树枝伸出来互相交叉在一起，遮住了阳光，地上是茂密的杂草，间杂着许多不知名的野花，散发出了阵阵很好闻的香气，在树上和杂草里有许多蛇在发出嘶嘶的声音。]],
  exit = {
    e = { to = '神龙岛沙滩#E', },
    sw = { to = '神龙岛树林#1S', },
    nw = { to = '神龙岛树林#1N', },
  },
},

['神龙岛山峰顶'] = {
  id = '神龙岛山峰顶',
  area = '神龙岛',
  name = '山峰顶',
  desc =  [[一登上这里，眼前顿时一亮，此处已是山峰最高处，一眼望去，只见青山绿水，海浪涛涌，极目视之，远处还可见数帆船影。此处有几间和五门的竹屋用同样的材料搭起来的竹屋，但比五门的竹屋要大得多，其中中间一间的门匾上写着“神龙教总坛”五个字。]],
  exit = {
    enter = { to = '神龙岛走廊#1', },
    d = { to = '神龙岛山路#6', },
  },
},

['神龙岛树林#W'] = {
  id = '神龙岛树林#W',
  area = '神龙岛',
  name = '树林',
  desc =  [[，这里的树长得都又高有大，粗大的树枝伸出来互相交叉在一起，遮住了阳光，地上是茂密的杂草，间杂着许多不知名的野花，散发出了阵阵很好闻的香气，在树上和杂草里有许多蛇在发出嘶嘶的声音。]],
  exit = {
    ne = { to = '神龙岛树林#1N', },
    w = { to = '神龙岛沙滩#W', },
    se = { to = '神龙岛树林#1S', },
  },
},

['神龙岛沙滩#W'] = {
  id = '神龙岛沙滩#W',
  area = '神龙岛',
  name = '沙滩',
  desc =  [[这里遍地都是被潮水冲刷出来的黄色的细沙，走在上面有一种软绵绵、湿乎乎的感觉，常常可以看到有小蟹之类东西在细沙里钻来钻去，有时还可以看见有已死或濒死的鱼虾。从这里往南就是渡口了，往东则有个树林。]],
  exit = {
    e = { to = '神龙岛树林#W', },
    ne = { to = '神龙岛沙滩#N', },
    se = { to = '神龙岛渡口', },
  },
},

['神龙岛青龙门议事厅'] = {
  id = '神龙岛青龙门议事厅',
  area = '神龙岛',
  name = '青龙门议事厅',
  desc =  [[此处是青龙门的议事厅，正对着大门处有一张大竹椅倚墙而置，在这张竹椅的周围则有数只矮凳靠墙放着。]],
  exit = {
    e = { to = '神龙岛卧室#QING', },
    w = { to = '神龙岛练功房#QING', },
    out = { to = '神龙岛山坡#QING', },
  },
},

['神龙岛厅后'] = {
  id = '神龙岛厅后',
  area = '神龙岛',
  name = '厅后',
  desc =  [[这里一排放着二十余只水缸，里面都装满了清水。]],
  exit = {
    e = { to = '神龙岛厨房', },
    s = { to = '神龙岛大厅', },
    n = { to = '神龙岛后厅', },
  },
},

['神龙岛竹林#1'] = {
  id = '神龙岛竹林#1',
  area = '神龙岛',
  name = '竹林',
  desc =  [[这里到处都是高可及天的竹子，把太阳都遮住了，又位居峰顶，随时可以吹到海风，所以在炎夏季节是一处纳凉的好地方。偶而，海风不知从哪里带来一股药香。]],
  exit = {
    w = { to = '神龙岛竹林#2', },
    enter = { to = '神龙岛走廊#4', },
    hidden = { to = '神龙岛药圃#SE', handler = 'sld_yaopu', no_wander = true, },
  },
},

['神龙岛药圃#SE'] = {
  id = '神龙岛药圃#SE',
  area = '神龙岛',
  name = '药圃',
  desc = [[这里是神龙岛的药圃，种了不少珍奇药材。]],
  exit = {
    n = { to = '神龙岛药圃#E', },
    s = { to = '神龙岛竹林#1', },
    w = { to = '神龙岛药圃#S', },
  },
},

['神龙岛药圃#S'] = {
  id = '神龙岛药圃#S',
  area = '神龙岛',
  name = '药圃',
  desc = [[这里是神龙岛的药圃，种了不少珍奇药材。]],
  exit = {
    e = { to = '神龙岛药圃#SE', },
    n = { to = '神龙岛药圃#C', },
    w = { to = '神龙岛药圃#SW', },
  },
},

['神龙岛药圃#SW'] = {
  id = '神龙岛药圃#SW',
  area = '神龙岛',
  name = '药圃',
  desc = [[这里是神龙岛的药圃，种了不少珍奇药材。]],
  exit = {
    e = { to = '神龙岛药圃#S', },
    n = { to = '神龙岛药圃#W', },
  },
},

['神龙岛药圃#W'] = {
  id = '神龙岛药圃#W',
  area = '神龙岛',
  name = '药圃',
  desc = [[这里是神龙岛的药圃，种了不少珍奇药材。]],
  exit = {
    n = { to = '神龙岛药圃#NW', },
    s = { to = '神龙岛药圃#SW', },
    e = { to = '神龙岛药圃#C', },
  },
},

['神龙岛药圃#C'] = {
  id = '神龙岛药圃#C',
  area = '神龙岛',
  name = '药圃',
  desc = [[这里是神龙岛的药圃，种了不少珍奇药材。]],
  exit = {
    n = { to = '神龙岛药圃#N', },
    e = { to = '神龙岛药圃#E', },
    s = { to = '神龙岛药圃#S', },
    w = { to = '神龙岛药圃#W', },
  },
},

['神龙岛药圃#E'] = {
  id = '神龙岛药圃#E',
  area = '神龙岛',
  name = '药圃',
  desc = [[这里是神龙岛的药圃，种了不少珍奇药材。]],
  exit = {
    n = { to = '神龙岛药圃#NE', },
    s = { to = '神龙岛药圃#SE', },
    w = { to = '神龙岛药圃#C', },
  },
},

['神龙岛药圃#NE'] = {
  id = '神龙岛药圃#NE',
  area = '神龙岛',
  name = '药圃',
  desc = [[这里是神龙岛的药圃，种了不少珍奇药材。]],
  exit = {
    s = { to = '神龙岛药圃#E', },
    w = { to = '神龙岛药圃#N', },
  },
},

['神龙岛药圃#N'] = {
  id = '神龙岛药圃#N',
  area = '神龙岛',
  name = '药圃',
  desc = [[这里是神龙岛的药圃，种了不少珍奇药材。]],
  exit = {
    w = { to = '神龙岛药圃#NW', },
    s = { to = '神龙岛药圃#C', },
    e = { to = '神龙岛药圃#NE', },
  },
},

['神龙岛药圃#NW'] = {
  id = '神龙岛药圃#NW',
  area = '神龙岛',
  name = '药圃',
  desc = [[这里是神龙岛的药圃，种了不少珍奇药材。]],
  exit = {
    s = { to = '神龙岛药圃#W', },
    e = { to = '神龙岛药圃#N', },
  },
},

['神龙岛山坡#C'] = {
  id = '神龙岛山坡#C',
  area = '神龙岛',
  name = '山坡',
  desc =  [[这里是一块不小的平坡，山路到了这里转了个方向继续往上延伸。在山坡的中央有一个石桌，桌旁是四只石凳，做工都很是粗糙，只不过将就地可以用而已。]],
  exit = {
    eu = { to = '神龙岛山路#3', },
    d = { to = '神龙岛山路#2', },
    n = { to = '神龙岛山路#1CHI', },
  },
},

['神龙岛赤龙门议事厅'] = {
  id = '神龙岛赤龙门议事厅',
  area = '神龙岛',
  name = '赤龙门议事厅',
  desc =  [[此处是赤龙门的议事厅，正对着大门处有一张大竹椅倚墙而置，在这张竹椅的周围则有数只矮凳靠墙放着。]],
  exit = {
    e = { to = '神龙岛卧室#CHI', },
    w = { to = '神龙岛练功房#CHI', },
    out = { to = '神龙岛山坡#CHI', },
  },
},

['神龙岛树林#1S'] = {
  id = '神龙岛树林#1S',
  area = '神龙岛',
  name = '树林',
  desc =  [[这里的树长得都又高有大，粗大的树枝伸出来互相交叉在一起遮住了阳光，地上是茂密的杂草，间杂着许多不知名的野花，散发出阵阵很好闻的香气，在树上和杂草里有许多蛇在发出嘶嘶的声音。北边隐隐约约地好象有几间竹屋。]],
  exit = {
    ne = { to = '神龙岛树林#E', },
    s = { to = '神龙岛树林#2S', },
    nw = { to = '神龙岛树林#W', },
    n = { to = '神龙岛林间空地', },
  },
},

['神龙岛小木筏'] = {
  id = '神龙岛小木筏',
  area = '神龙岛',
  name = '小木筏',
  desc =  [[你坐在一个小木筏上，四周是无边无际的的茫茫大海，一阵海风轻轻吹来，小木筏“咯吱咯吱”的左右摇晃，你不由心底有些发虚，你试图去划(hua)着木筏前进。]],
  exit = {
    hidden = { to = '神龙岛渡口', handler = 'sld_mufa', },
  },
},

['神龙岛后厅'] = {
  id = '神龙岛后厅',
  area = '神龙岛',
  name = '后厅',
  desc =  [[这里是教主夫妇休息和召见心腹密商之处。此处的厅堂不很大，居中有两张大竹椅，下面设了五张矮凳。]],
  exit = {
    s = { to = '神龙岛厅后', },
  },
},

['神龙岛山路#2'] = {
  id = '神龙岛山路#2',
  area = '神龙岛',
  name = '山路',
  desc =  [[这是一条蜿蜒曲折的山路，路的一边是一道溪水淙淙的山溪，另一边是一棵棵提拔的大树，间杂着一些清新的小草，时而可以看见有鸟儿从树梢飞过。]],
  exit = {
    u = { to = '神龙岛山坡#C', },
    d = { to = '神龙岛山路#1', },
    nu = { to = '神龙岛山路#1HEI', },
  },
},

['神龙岛竹林#2'] = {
  id = '神龙岛竹林#2',
  area = '神龙岛',
  name = '竹林',
  desc =  [[这里到处都是高可及天的竹子，把太阳都遮住了，又位居峰顶，随时可以吹到海风，所以在炎夏季节是一处纳凉的好地方。]],
  exit = {
    w = { to = '神龙岛平台', },
    e = { to = '神龙岛竹林#1', },
  },
},

['神龙岛山路#4'] = {
  id = '神龙岛山路#4',
  area = '神龙岛',
  name = '山路',
  desc =  [[这是一条蜿蜒曲折的山路，路的一边是一道溪水淙淙的山溪，另一边是许多生长茂盛的树木，间杂着一些清新的小草，时而可以看见有鸟儿从树梢上飞过。]],
  exit = {
    nd = { to = '神龙岛山坡#QING', },
    wd = { to = '神龙岛山路#3', },
    eu = { to = '神龙岛山坡#BAI', },
  },
},

['神龙岛走廊#4'] = {
  id = '神龙岛走廊#4',
  area = '神龙岛',
  name = '走廊',
  desc =  [[这是一条很长的用青石板砌成的走廊，沿着走廊的两边放着数盆艳丽的鲜花，走廊的左边有一个门。]],
  exit = {
    e = { to = '神龙岛走廊#3', },
    out = { to = '神龙岛竹林#1', },
  },
},

['神龙岛卧室#CHI'] = {
  id = '神龙岛卧室#CHI',
  area = '神龙岛',
  name = '卧室',
  desc =  [[此处是赤龙门的卧室，屋中的布置很简单，只有几只大床靠墙放着，供本门教众休息之用。]],
  exit = {
    w = { to = '神龙岛赤龙门议事厅', },
  },
},

['神龙岛卧室#ZONG'] = {
  id = '神龙岛卧室#ZONG',
  area = '神龙岛',
  name = '卧室',
  desc =  [[此处是神龙教总坛教众的卧室，屋中的布置很简单，只有几只大床靠墙放着，供本坛教众休息之用。]],
  exit = {
    n = { to = '神龙岛走廊#2', },
  },
},

['神龙岛练功房#QING'] = {
  id = '神龙岛练功房#QING',
  area = '神龙岛',
  name = '练功房',
  desc =  [[此处是青龙门教众平时练功习武的地方。房中靠墙有个兵器架，上面插着不少兵器，旁边放着几个石锁，屋子中间是一个梅花桩，房子的大粱上则吊着几个沙袋。]],
  exit = {
    e = { to = '神龙岛青龙门议事厅', },
  },
},

['神龙岛练功房#BAI'] = {
  id = '神龙岛练功房#BAI',
  area = '神龙岛',
  name = '练功房',
  desc =  [[此处是白龙门教众平时练功习武的地方。房中靠墙有个兵器架，上面插着不少兵器，旁边放着几个石锁，屋子中间是一个梅花桩，房子的大粱上则吊着几个沙袋。]],
  exit = {
    e = { to = '神龙岛白龙门议事厅', },
  },
},

['神龙岛小帆船'] = {
  id = '神龙岛小帆船',
  area = '神龙岛',
  name = '小帆船',
  desc =  [[这是一艘小帆船，正扬起风帆朝前疾驶，随着海浪的起伏，船身猛的左右摇晃。船尾的水手好象也有些颤颤惊惊，生怕一个不小心被大海吞没。]],
  exit = {
    hidden = { to = '神龙岛海滩', cmd = 'order 开船', handler = 'go_straight', },
  },
},

['神龙岛走廊#2'] = {
  id = '神龙岛走廊#2',
  area = '神龙岛',
  name = '走廊',
  desc =  [[这是一条很长的用青石板砌成的走廊，沿着走廊的两边放着数盆艳丽的鲜花，走廊的左边有一个门。]],
  exit = {
    e = { to = '神龙岛走廊#1', },
    w = { to = '神龙岛走廊#3', },
    s = { to = '神龙岛卧室#ZONG', },
  },
},

['神龙岛沙滩#N'] = {
  id = '神龙岛沙滩#N',
  area = '神龙岛',
  name = '沙滩',
  desc =  [[这里遍地都是被潮水冲刷出来的黄色的细沙，走在上面有一种软绵绵、湿乎乎的感觉，常常可以看到有小蟹之类东西在细沙里钻来钻去，有时还可以看见有已死或濒死的鱼虾。从这里往南有个树林。]],
  exit = {
    sw = { to = '神龙岛沙滩#W', },
    s = { to = '神龙岛树林#2N', },
    se = { to = '神龙岛沙滩#E', },
  },
},

['神龙岛走廊#3'] = {
  id = '神龙岛走廊#3',
  area = '神龙岛',
  name = '走廊',
  desc =  [[这是一条很长的用青石板砌成的走廊，沿着走廊的两边放着数盆艳丽的鲜花，走廊的左边有一个门。]],
  exit = {
    e = { to = '神龙岛走廊#2', },
    w = { to = '神龙岛走廊#4', },
    n = { to = '神龙岛练功房#ZONG', },
  },
},

['神龙岛练功房#HUANG'] = {
  id = '神龙岛练功房#HUANG',
  area = '神龙岛',
  name = '练功房',
  desc =  [[此处是黄龙门教众平时练功习武的地方。房中靠墙有个兵器架，上面插着不少兵器，旁边放着几个石锁，屋子中间是一个梅花桩，房子的大粱上则吊着几个沙袋。]],
  exit = {
    e = { to = '神龙岛黄龙门议事厅', },
  },
},

['神龙岛山路#5'] = {
  id = '神龙岛山路#5',
  area = '神龙岛',
  name = '山路',
  desc =  [[这是一条蜿蜒曲折的山路，路的一边是一道溪水淙淙的山溪，另一边是许多生长茂盛的树木，间杂着一些清新的小草，时而可以看见有鸟儿从树梢上飞过。]],
  exit = {
    u = { to = '神龙岛山路#6', },
    s = { to = '神龙岛山坡#BAI', },
  },
},

['神龙岛林间空地'] = {
  id = '神龙岛林间空地',
  area = '神龙岛',
  name = '林间空地',
  desc =  [[这里是林间的一块空地，一走进这里就可以闻到一股浓浓的雄黄味扑鼻而来。在空地上有两三间竹屋，屋子的墙壁、屋顶均由碗口大小的粗竹所编，看来甚是坚定。屋后有道山溪垂山而下。]],
  exit = {
    nu = { to = '神龙岛山路#1', },
    enter = { to = '神龙岛陆府正厅', },
    s = { to = '神龙岛树林#1S', handler = 'sld_preget_lingpai', },
    n = { to = '神龙岛树林#1N', },
  },
},

['神龙岛树林#1N'] = {
  id = '神龙岛树林#1N',
  area = '神龙岛',
  name = '树林',
  desc =  [[这里的树长得都又高有大，粗大的树枝伸出来互相交叉在一起，遮住了阳光，地上是茂密的杂草，间杂着许多不知名的野花，散发出了阵阵很好闻的香气，在树上和杂草里有许多蛇在发出嘶嘶的声音。南边隐隐约约地好象有几间竹屋。]],
  exit = {
    se = { to = '神龙岛树林#E', },
    sw = { to = '神龙岛树林#W', },
    s = { to = '神龙岛林间空地', },
    n = { to = '神龙岛树林#2N', },
  },
},

['神龙岛卧室#QING'] = {
  id = '神龙岛卧室#QING',
  area = '神龙岛',
  name = '卧室',
  desc =  [[此处是青龙门的卧室，屋中的布置很简单，只有几只大床靠墙放着，供本门教众休息之用。]],
  exit = {
    w = { to = '神龙岛青龙门议事厅', },
  },
},

['神龙岛药室'] = {
  id = '神龙岛药室',
  area = '神龙岛',
  name = '药室',
  desc =  [[一走进这间屋子，就闻到很浓的草药味，只见这里靠墙是一个药柜，从上到下，从左到右，一格格地分成许多格，墙上，地下，也到处都是药草，这里是陆高轩制药的地方。]],
  exit = {
    w = { to = '神龙岛陆府正厅', },
  },
},

['神龙岛沙滩#E'] = {
  id = '神龙岛沙滩#E',
  area = '神龙岛',
  name = '沙滩',
  desc =  [[这里遍地都是被潮水冲刷出来的黄色的细沙，走在上面有一种软绵绵、湿乎乎的感觉，常常可以看到有小蟹之类东西在细沙里钻来钻去，有时还可以看见有已死或濒死的鱼虾。从这里往南就是渡口了，往西则有个树林。]],
  exit = {
    sw = { to = '神龙岛渡口', },
    w = { to = '神龙岛树林#E', },
    nw = { to = '神龙岛沙滩#N', },
  },
},

['神龙岛渡口'] = {
  id = '神龙岛渡口',
  area = '神龙岛',
  name = '渡口',
  desc =  [[眼前就是辽阔无边的茫茫大海，海水波涛起伏，一浪接着一浪地朝岸边击来，一眼望去，只见几羽海鸥在海面上飞翔，偶而也可见到远处有帆影掠过。这里是神龙岛唯一可以停靠船舶的地方，这里的东西两边都是沙滩，往北则有一个树林。]],
  exit = {
    ne = { to = '神龙岛沙滩#E', },
    nw = { to = '神龙岛沙滩#W', },
    hidden = { to = '神龙岛小帆船', handler = 'sld_leave', },
    n = { to = '神龙岛树林#2S', },
  },
},

['神龙岛陆府正厅'] = {
  id = '神龙岛陆府正厅',
  area = '神龙岛',
  name = '陆府正厅',
  desc =  [[这里是神龙教散人陆高轩的家，屋内四壁上挂了不少书画，其中不乏价值连城之作，可想而知，主人对此是花费了大量心血，才得以收集到如此多的名贵之作。]],
  exit = {
    e = { to = '神龙岛药室', },
    out = { to = '神龙岛林间空地', },
    n = { to = '神龙岛卧室#GAO', },
  },
},

['神龙岛山坡#BAI'] = {
  id = '神龙岛山坡#BAI',
  area = '神龙岛',
  name = '山坡',
  desc =  [[山路到此处嘎然而止，不在向上延伸。此处山坡的中央是一大块空地，有几个身穿白色劲装的人在练武，在空地边上有几间竹屋，其中中间一间的门匾上写着“白龙门”三个字，这里的东、南面都是峭壁，西面有条路往下而去，北面则有条小路。]],
  exit = {
    enter = { to = '神龙岛白龙门议事厅', },
    wd = { to = '神龙岛山路#4', },
    n = { to = '神龙岛山路#5', },
  },
},

['神龙岛练功房#HEI'] = {
  id = '神龙岛练功房#HEI',
  area = '神龙岛',
  name = '练功房',
  desc =  [[此处是黑龙门教众平时练功习武的地方。房中靠墙有个兵器架，上面插着不少兵器，旁边放着几个石锁，屋子中间是一个梅花桩，房子的大粱上则吊着几个沙袋。]],
  exit = {
    e = { to = '神龙岛黑龙门议事厅', },
  },
},

['神龙岛山路#2HEI'] = {
  id = '神龙岛山路#2HEI',
  area = '神龙岛',
  name = '山路',
  desc =  [[这是一条不很宽的山路，路的两边是高大的树木和一拔拔的灌木丛，前面不远的地方则有一个平坡，盖着几间竹屋。]],
  exit = {
    wd = { to = '神龙岛山路#1HEI', },
    eu = { to = '神龙岛山坡#HEI', },
  },
},

['神龙岛平台'] = {
  id = '神龙岛平台',
  area = '神龙岛',
  name = '平台',
  desc =  [[这里是一个天然生成的平台，筑有一间竹屋，竹屋的门匾上写着“仙福居”三个字，屋旁种了不少花草。]],
  exit = {
    e = { to = '神龙岛竹林#2', },
    enter = { to = '神龙岛祭坛', },
  },
},

['神龙岛黑龙门议事厅'] = {
  id = '神龙岛黑龙门议事厅',
  area = '神龙岛',
  name = '黑龙门议事厅',
  desc =  [[此处是黑龙门的议事厅，正对着大门处有一张大竹椅倚墙而置，在这张竹椅的周围则有数只矮凳靠墙放着。]],
  exit = {
    e = { to = '神龙岛卧室#HEI', },
    w = { to = '神龙岛练功房#HEI', },
    out = { to = '神龙岛山坡#HEI', },
  },
},

['神龙岛山路#HUANG'] = {
  id = '神龙岛山路#HUANG',
  area = '神龙岛',
  name = '山路',
  desc =  [[这是一条不很宽的山路，路的两边是及膝的杂草和一拔拔的灌木丛，前面不远的高处有一个平坡，盖着几间竹屋。]],
  exit = {
    nu = { to = '神龙岛山坡#HUANG', },
    eu = { to = '神龙岛山崖', },
    sd = { to = '神龙岛山路#3', },
  },
},

['神龙岛山路#2CHI'] = {
  id = '神龙岛山路#2CHI',
  area = '神龙岛',
  name = '山路',
  desc =  [[这是一条不很宽的山路，路的两边是及膝的杂草和一拔拔的灌木丛，前面不远的低处有一个平坡，盖着几间竹屋。]],
  exit = {
    su = { to = '神龙岛山路#1CHI', },
    nd = { to = '神龙岛山坡#CHI', },
  },
},

['神龙岛练功房#ZONG'] = {
  id = '神龙岛练功房#ZONG',
  area = '神龙岛',
  name = '练功房',
  desc =  [[此处是总坛教众平时练功习武的地方。房中靠墙有个兵器架，上面插着不少兵器，旁边放着几个石锁，屋子中间是一个梅花桩，房子的大粱上则吊着几个沙袋。]],
  exit = {
    s = { to = '神龙岛走廊#3', },
  },
},

['神龙岛树林#2N'] = {
  id = '神龙岛树林#2N',
  area = '神龙岛',
  name = '树林',
  desc =  [[这里的树长得都又高有大，粗大的树枝伸出来互相交叉在一起，遮住了阳光，地上是茂密的杂草，间杂着许多不知名的野花，散发出了阵阵很好闻的香气，在树上和杂草里有许多蛇在发出嘶嘶的声音。]],
  exit = {
    se = { to = '神龙岛树林#E', },
    sw = { to = '神龙岛树林#W', },
    s = { to = '神龙岛树林#1N', },
    n = { to = '神龙岛沙滩#N', },
  },
},

['神龙岛小路'] = {
  id = '神龙岛小路',
  area = '神龙岛',
  name = '小路',
  desc =  [[这是塘沽边上的一条小路，弯弯曲曲的沿向东方的海滨。路边长着些花草，几只蝴蝶在花丛中飞来飞去。一阵海风吹来，使你精神更加爽朗。]],
  exit = {
    ne = { to = '神龙岛海滩', },
    sw = { to = '塘沽城港口', },
  },
},

['神龙岛山路#1HEI'] = {
  id = '神龙岛山路#1HEI',
  area = '神龙岛',
  name = '山路',
  desc =  [[这是一条不很宽的山路，路的两边是高大的树木和一拔拔的灌木丛，前面不远的地方则有一个平坡，盖着几间竹屋。]],
  exit = {
    sd = { to = '神龙岛山路#2', },
    eu = { to = '神龙岛山路#2HEI', },
  },
},

['神龙岛大厅'] = {
  id = '神龙岛大厅',
  area = '神龙岛',
  name = '大厅',
  desc =  [[这是一间硕大无朋的屋子，里面足可容千人之众。大厅彼端居中并排放着两张竹椅，铺了锦缎垫子，显然是给教主夫妇坐的。此处是神龙教平日议事之处。]],
  exit = {
    s = { to = '神龙岛走廊#1', },
    n = { to = '神龙岛厅后', },
  },
},

['神龙岛山崖'] = {
  id = '神龙岛山崖',
  area = '神龙岛',
  name = '山崖',
  desc =  [[这里的草木稀疏，仅有的一些也没精打采，发黄枯萎，空气中则隐隐约约地有股腥臭味，似乎是从崖底飘上来的，让人闻了感到很不舒服，此处决非久留之地，还是赶快离开为妙。]],
  exit = {
    wd = { to = '神龙岛山路#HUANG', },
    hidden = { to = '神龙岛蛇窟', no_wander = true, handler = 'sld_sheku', cond = 'player.skill["毒技"] and player.skill["毒技"].level >= 100', },
  },
},

['神龙岛蛇窟'] = {
  id = '神龙岛蛇窟',
  area = '神龙岛',
  name = '蛇窟',
  desc =  [[这里整年毒雾弥漫，腥臭扑鼻，遍地都是又粗又长的毒蛇和一堆堆白骨，时常有飞鸟被毒雾熏昏，落下来成为众蛇的美食，群蛇之间的互相吞噬也是家常便饭，只有那些武功高强的用毒高手才能从这里生离。此处好象没有什么出路，你可以到处走走(go)看。]],
  exit = {
    hidden = { to = '神龙岛树林#2N', handler = 'sld_sheku_leave', cost = 20, },
  },
},

['神龙岛黑屋'] = {
  id = '神龙岛黑屋',
  area = '神龙岛',
  name = '黑屋',
  desc =  [[这里是神龙教弟子犯错时受惩罚的地方，整个屋子没有一扇窗子，也没有门，只在屋顶开了个洞口，装了块翻板。这里整日暗不见光，腥臭扑鼻，里面无桌无椅更无床，累了只能躺在地上或扶(fu)墙站着。这里只有诚心悔过(repent)的人才能出去。]],
  exit = {
  },
},

['神龙岛海滩'] = {
  id = '神龙岛海滩',
  area = '神龙岛',
  name = '海滩',
  desc =  [[这里是东海之滨的一个小海滩。放眼望去，一片无际的的茫茫大海，远处海天一线，你隐隐看到几只海鸥在海上飞翔。海滩的四周稀稀落落的有一些长得颇为茂盛的树木(tree)。]],
  exit = {
    hidden = { to = '神龙岛小木筏', handler = 'sld_enter', },
    sw = { to = '神龙岛小路', },
  },
},

['神龙岛山路#1CHI'] = {
  id = '神龙岛山路#1CHI',
  area = '神龙岛',
  name = '山路',
  desc =  [[这是一条不很宽的山路，路的两边是及膝的杂草和一拔拔的灌木丛，前面不远的低处有一个平坡，盖着几间竹屋。]],
  exit = {
    s = { to = '神龙岛山坡#C', },
    nd = { to = '神龙岛山路#2CHI', },
  },
},

['神龙岛山路#6'] = {
  id = '神龙岛山路#6',
  area = '神龙岛',
  name = '山路',
  desc =  [[这是一条蜿蜒曲折的山路，路的一边是一道溪水淙淙的山溪，另一边是许多生长茂盛的树木，间杂着一些清新的小草，时而可以看见有鸟儿从树梢上飞过。]],
  exit = {
    u = { to = '神龙岛山峰顶', },
    d = { to = '神龙岛山路#5', },
  },
},

['神龙岛白龙门议事厅'] = {
  id = '神龙岛白龙门议事厅',
  area = '神龙岛',
  name = '白龙门议事厅',
  desc =  [[此处是白龙门的议事厅，正对着大门处有一张大竹椅倚墙而置，在这张竹椅的周围则有数只矮凳靠墙放着。]],
  exit = {
    e = { to = '神龙岛卧室#BAI', },
    w = { to = '神龙岛练功房#BAI', },
    out = { to = '神龙岛山坡#BAI', },
  },
},

['神龙岛山坡#HEI'] = {
  id = '神龙岛山坡#HEI',
  area = '神龙岛',
  name = '山坡',
  desc =  [[山路到此处已经不能再往上去了，山坡的中央是一大块空地，有几个身穿黑色劲装的人在练武，在空地边上有几间竹屋，其中中间一间的门匾上写着“黑龙门”三个字。]],
  exit = {
    wd = { to = '神龙岛山路#2HEI', },
    enter = { to = '神龙岛黑龙门议事厅', },
  },
},

['神龙岛厨房'] = {
  id = '神龙岛厨房',
  area = '神龙岛',
  name = '厨房',
  desc =  [[这里是神龙教教众吃饭喝水的地方，灶台上放着不少包子、酒袋。]],
  exit = {
    w = { to = '神龙岛厅后', },
  },
},

['神龙岛黄龙门议事厅'] = {
  id = '神龙岛黄龙门议事厅',
  area = '神龙岛',
  name = '黄龙门议事厅',
  desc =  [[此处是黄龙门的议事厅，正对着大门处有一张大竹椅倚墙而置，在这张竹椅的周围则有数只矮凳靠墙放着。]],
  exit = {
    e = { to = '神龙岛卧室#HUANG', },
    w = { to = '神龙岛练功房#HUANG', },
    out = { to = '神龙岛山坡#HUANG', },
  },
},

['神龙岛祭坛'] = {
  id = '神龙岛祭坛',
  area = '神龙岛',
  name = '祭坛',
  desc =  [[这间静室内光线十分昏暗，只有中央的祭坛中发出幽幽的红光，而四周沉浸在一片黑暗之中。这间房间的空间似乎极大，你竟然不能看到四周的边际，更看不到天花板。你似乎已经进入了另外一个时空。]],
  exit = {
    out = { to = '神龙岛平台', },
  },
},

['神龙岛练功房#CHI'] = {
  id = '神龙岛练功房#CHI',
  area = '神龙岛',
  name = '练功房',
  desc =  [[此处是赤龙门教众平时练功习武的地方。房中靠墙有个兵器架，上面插着不少兵器，旁边放着几个石锁，屋子中间是一个梅花桩，房子的大粱上则吊着几个沙袋。]],
  exit = {
    e = { to = '神龙岛赤龙门议事厅', },
  },
},

['神龙岛树林#2S'] = {
  id = '神龙岛树林#2S',
  area = '神龙岛',
  name = '树林',
  desc =  [[这里的树长得都又高有大，粗大的树枝伸出来互相交叉在一起遮住了阳光，地上是茂密的杂草，间杂着许多不知名的野花，散发出阵阵很好闻的香气，在树上和杂草里有许多蛇在发出嘶嘶的声音。]],
  exit = {
    ne = { to = '神龙岛树林#E', },
    s = { to = '神龙岛渡口', },
    nw = { to = '神龙岛树林#W', },
    n = { to = '神龙岛树林#1S', },
  },
},

['神龙岛山坡#HUANG'] = {
  id = '神龙岛山坡#HUANG',
  area = '神龙岛',
  name = '山坡',
  desc =  [[山路到此处已经到了尽头，不再往上伸展，山坡的中央是一大块空地，有几个身穿黄色劲装的人在练武，在空地边上有几间竹屋，其中中间一间的门匾上写着“黄龙门”三个字。]],
  exit = {
    sd = { to = '神龙岛山路#HUANG', },
    enter = { to = '神龙岛黄龙门议事厅', },
  },
},

['神龙岛卧室#BAI'] = {
  id = '神龙岛卧室#BAI',
  area = '神龙岛',
  name = '卧室',
  desc =  [[此处是白龙门的卧室，屋中的布置很简单，只有几只大床靠墙放着，供本门教众休息之用。]],
  exit = {
    w = { to = '神龙岛白龙门议事厅', },
  },
},

['神龙岛山坡#CHI'] = {
  id = '神龙岛山坡#CHI',
  area = '神龙岛',
  name = '山坡',
  desc =  [[山路到此处已经到了尽头，不再往下延伸，山坡的中央是一大块空地，有几个身穿赤色劲装的人在练武，在空地边上有几间竹屋，其中中间一间的门匾上写着“赤龙门”三个字。]],
  exit = {
    enter = { to = '神龙岛赤龙门议事厅', },
    su = { to = '神龙岛山路#2CHI', },
  },
},

['神龙岛卧室#HUANG'] = {
  id = '神龙岛卧室#HUANG',
  area = '神龙岛',
  name = '卧室',
  desc =  [[此处是黄龙门的卧室，屋中的布置很简单，只有几只大床靠墙放着，供本门教众休息之用。]],
  exit = {
    w = { to = '神龙岛黄龙门议事厅', },
  },
},

['神龙岛走廊#1'] = {
  id = '神龙岛走廊#1',
  area = '神龙岛',
  name = '走廊',
  desc =  [[这是一条很长的走廊，沿着走廊的两边放着数盆艳丽的鲜花，走廊的前边和左边各有一个门。]],
  exit = {
    out = { to = '神龙岛山峰顶', },
    w = { to = '神龙岛走廊#2', },
    n = { to = '神龙岛大厅', },
  },
},

['神龙岛山坡#QING'] = {
  id = '神龙岛山坡#QING',
  area = '神龙岛',
  name = '山坡',
  desc =  [[山路到此处已经到了尽头，不再往下去了，山坡的中央是一大块空地，有几个身穿青色劲装的人在练武，在空地边上有几间竹屋，其中中间一间的门匾上写着“青龙门”三个字。]],
  exit = {
    enter = { to = '神龙岛青龙门议事厅', },
    su = { to = '神龙岛山路#4', },
  },
},

['泰山青石大道'] = {
  id = '泰山青石大道',
  area = '泰山',
  name = '青石大道',
  desc =  [[你走在一条青石大道上，南边隐约可见到扬州城的城墙。东面是通往京城的驿道，西面一条土路通向黄河区域。]],
  exit = {
    w = { to = '黄河流域田地#1', },
    e = { to = '泰山大驿道#1', },
  },
},

['泰山大驿道#1'] = {
  id = '泰山大驿道#1',
  area = '泰山',
  name = '大驿道',
  desc =  [[你走在一条尘土飞扬的大驿道上。四周人来人往。挑担子的行商，赶着大车的马夫，上京赶考的书生，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。道路两旁是整整齐齐的杨树林。]],
  exit = {
    e = { to = '中原神州大驿道#2', },
    w = { to = '泰山青石大道', },
    nw = { to = '黄河流域杨树林', },
  },
},

['泰山南天门'] = {
  id = '泰山南天门',
  area = '泰山',
  name = '南天门',
  desc =  [[走完了十八盘，这里便是泰山顶的入口处。从这里附视山下，群山如龟伏地，河流如蚓缠绕，天地空阔，无可名状。从这里往东北走可到一个市集，往西走便是月观峰，往北走则是到玉皇顶之路。]],
  exit = {
    nu = { to = '泰山玉皇顶', },
    sd = { to = '泰山升仙坊', },
  },
},

['泰山回马岭'] = {
  id = '泰山回马岭',
  area = '泰山',
  name = '回马岭',
  desc =  [[此处又名天关，到了这里，马匹已不能再前进。据说当年唐玄宗上泰山封禅，来到这里，因陡峭难攀，累死了白马，要改乘小轿上山。]],
  exit = {
    nu = { to = '泰山二天门', },
    sd = { to = '泰山石经峪', },
  },
},

['泰山日观峰'] = {
  id = '泰山日观峰',
  area = '泰山',
  name = '日观峰',
  desc =  [[这里是位于南天门西面的山岭，怪石攒簇，最高的地方一石卓立，名为君子峰。往北走便是泰山的西天门。]],
  exit = {
    eu = { to = '泰山探海石', },
    wu = { to = '泰山玉皇顶', },
  },
},

['泰山岱宗坊'] = {
  id = '泰山岱宗坊',
  area = '泰山',
  name = '岱宗坊',
  desc =  [[位于泰安县城以北约一里，此处是登泰山的入口。相传当年碧霞元君被姜子牙戏弄，诱她投掷绣花鞋以定泰山地界，结果碧霞元君只能把绣花鞋从山顶掷到此处。从此泰山便以此为起点。]],
  exit = {
    nu = { to = '泰山白鹤泉', },
    w = { to = '黄河流域黄河岸边#5', },
    s = { to = '中原神州大驿道#2', },
    e = { to = '泰山海滩', },
  },
},

['泰山斗母宫'] = {
  id = '泰山斗母宫',
  area = '泰山',
  name = '斗母宫',
  desc =  [[上了一段山路，游人一般都会在这里稍为休息。这里的地势已经比泰山邻近的徂徕山为高，从这里往东北走便是石经峪。]],
  exit = {
    sd = { to = '泰山一天门', },
    eu = { to = '泰山石经峪', },
  },
},

['泰山探海石'] = {
  id = '泰山探海石',
  area = '泰山',
  name = '探海石',
  desc =  [[这是一块从山崖向横突出的巨石，长约二丈余，向东直指渤海。巨石三面无所凭依，视野广阔，但除非有绝高胆色的人，普通人一般都不敢攀登这块探海石。]],
  exit = {
    e = { to = '泰山东天门', },
    wd = { to = '泰山日观峰', },
  },
},

['泰山丈人峰'] = {
  id = '泰山丈人峰',
  area = '泰山',
  name = '丈人峰',
  desc =  [[这里位于玉皇顶以西里许的地方，形状有如一个伛偻的老人。靠西有黄华洞，因洞路极为危险，后人在进路处写上「回车岩」。从这里往北走便是岱顶的北天门。]],
  exit = {
    nu = { to = '泰山北天门', },
    e = { to = '泰山玉皇顶', },
  },
},

['泰山东天门'] = {
  id = '泰山东天门',
  area = '泰山',
  name = '东天门',
  desc =  [[这里是岱顶的东面出口。往东依次经过伏虎门峡口、鹰愁涧等，便可下山。]],
  exit = {
    w = { to = '泰山探海石', },
  },
},

['泰山玉皇顶'] = {
  id = '泰山玉皇顶',
  area = '泰山',
  name = '玉皇顶',
  desc =  [[此处便是泰山绝顶。这里有一座玉帝观，观前为古登封台，厉代皇帝封禅的仪式都是在这里举行。台下有一无字碑，据说是汉武帝所立。不远处有一石碣，上书「孔子小天下处」。正中往上便是武林盟主所在之处—封禅台。]],
  exit = {
    u = { to = '泰山封禅台', },
    w = { to = '泰山丈人峰', },
    sd = { to = '泰山南天门', },
    ed = { to = '泰山日观峰', },
  },
},

['泰山海滩'] = {
  id = '泰山海滩',
  area = '泰山',
  name = '海滩',
  desc =  [[这里是东海之滨的一个小海滩。放眼望去，一片无际的的茫茫大海，远处海天一线，你隐隐看到几只海鸥在海上飞翔。]],
  exit = {
    w = { to = '泰山岱宗坊', },
  },
},

['泰山一天门'] = {
  id = '泰山一天门',
  area = '泰山',
  name = '一天门',
  desc =  [[从岱宗坊上山大约走四里，便来到一天门。北面有一座天阶坊，过了此坊便进入了登泰山的盘道。南面有一座更衣亭，士大夫们及其随从，都会在这里换上轻便的服装，才继续登山。从一天门向北眺望，南天门与十八盘在云雾明灭间或隐或现，登泰山的人到此已有观止之叹。附近有一牌坊，上写「孔子登临处」，相传为「孔子过泰山侧」的故事发生的地方。]],
  exit = {
    nu = { to = '泰山斗母宫', },
    sd = { to = '泰山白鹤泉', },
  },
},

['泰山二天门'] = {
  id = '泰山二天门',
  area = '泰山',
  name = '二天门',
  desc =  [[这里又叫「中天门」。一般的登山者来到这里都已累极，但是这里才是泰山的一半啊！面对前面险峻的十八盘，很多人都不禁犹豫起来。]],
  exit = {
    nu = { to = '泰山五大夫松', },
    sd = { to = '泰山回马岭', },
  },
},

['泰山龙门'] = {
  id = '泰山龙门',
  area = '泰山',
  name = '龙门',
  desc =  [[这里便是泰山十八盘的起点。此处山势陡峭，登山的人一个不小心很容易便会跌堕到崖谷之中。]],
  exit = {
    nu = { to = '泰山升仙坊', },
    sd = { to = '泰山五大夫松', },
  },
},

['泰山石经峪'] = {
  id = '泰山石经峪',
  area = '泰山',
  name = '石经峪',
  desc =  [[这里是一块大石坪，石面刻有篆文「金刚经」，字体其大如斗，但却没有记载刻石者的名字和刻石的年代。过了此处，渐入空山，山路越来越不好走了。]],
  exit = {
    nu = { to = '泰山回马岭', },
    wd = { to = '泰山斗母宫', },
  },
},

['泰山五大夫松'] = {
  id = '泰山五大夫松',
  area = '泰山',
  name = '五大夫松',
  desc =  [[相传当年秦始皇上泰山，来到这里下起雨来，他就到两棵松树底下避雨，结果没淋着。因此，他就封这两棵松树为「五大夫」。后来不知从哪里来了一块巨大的飞来石把两棵松树砸死了。后人再在旁补种五株松树。在不远处还有一个御帐坪，据说就是秦始皇当年结帐的位置。从这里再往山上走便会到达十八盘的入口。]],
  exit = {
    nu = { to = '泰山龙门', },
    sd = { to = '泰山二天门', },
  },
},

['泰山升仙坊'] = {
  id = '泰山升仙坊',
  area = '泰山',
  name = '升仙坊',
  desc =  [[这里是十八盘的中间，从龙门至此的一段称为缓十八，从这里直上南天门的一段称为紧十八。由此刻攀石而上，后面的人可以看到前面的人的鞋底，前面的人回头则可见到后面的人的发顶。在这里一般人每走十来步便要稍一休息。]],
  exit = {
    nu = { to = '泰山南天门', },
    sd = { to = '泰山龙门', },
  },
},

['泰山封禅台'] = {
  id = '泰山封禅台',
  area = '泰山',
  name = '封禅台',
  desc =  [[这里是临时推选天下武功第一人之处，各路英雄如能战胜「中神通」，便可成为统领中原武林的领袖。高台上摆放着汉白玉宝座，台上高高立着一竿旗，上书：替天行道。]],
  exit = {
    d = { to = '泰山玉皇顶', },
  },
},

['泰山北天门'] = {
  id = '泰山北天门',
  area = '泰山',
  name = '北天门',
  desc =  [[这里位于石马山的北麓，是岱顶的北面出口，路口树立有一石坊，上面写着「玄武」二字。]],
  exit = {
    sd = { to = '泰山丈人峰', },
  },
},

['泰山白鹤泉'] = {
  id = '泰山白鹤泉',
  area = '泰山',
  name = '白鹤泉',
  desc =  [[相传从前这里有一个白鹤泉，它的水清凉甘甜，为泰山之最。这泉水长年涌流不断，喷出的水象仙鹤扑扇着翅膀洗澡一样，因以为名。可惜后来有一个自私自利的小官，独霸了泉水，后来更因迷信风水之说，把泉眼堵塞，白鹤泉从此便干涸了。现在只剩下一座刻着「白鹤泉」三字的石坊以为纪念。从这里继续北上，便是上山之路。]],
  exit = {
    nu = { to = '泰山一天门', },
    sd = { to = '泰山岱宗坊', },
  },
},

['燕子坞长廊#4W'] = {
  id = '燕子坞长廊#4W',
  area = '燕子坞',
  name = '长廊',
  desc =  [[这是一条长廊，上面画着江南秀美的工笔画。绿色的柱子朱红色的琉璃瓦，使得你不由得对江南艺术工匠的创造惊叹不已。在长廊里面，丫鬟、家丁们走来走去，都忙着自己的事情，不敢有一点怠慢。长廊东面是静音阁。]],
  exit = {
    e = { to = '燕子坞静音阁', },
    n = { to = '燕子坞长廊#2W', },
  },
},

['燕子坞长廊#4S'] = {
  id = '燕子坞长廊#4S',
  area = '燕子坞',
  name = '长廊',
  desc =  [[这是一条长廊，上面画着江南秀美的工笔画。绿色的柱子朱红色的琉璃瓦，使得你不由得对江南艺术工匠的创造惊叹不已。在长廊里面，丫鬟、家丁们走来走去，都忙着自己的事情。西面是长廊的延伸，北面是赏月斋。]],
  exit = {
    e = { to = '燕子坞长廊#5S', },
    w = { to = '燕子坞长廊#3S', },
    n = { to = '燕子坞赏月斋', },
  },
},

['燕子坞墓地'] = {
  id = '燕子坞墓地',
  area = '燕子坞',
  name = '墓地',
  desc =  [[这里是慕容的坟场, 慕容氏的子孙死后都被安葬这里，世世代代, 无一例外。每到清明时分, 慕容后裔都要在这里祭祖。场中一座新坟格外引人住目, 坟前有一块墓碑(bei)。]],
  exit = {
    w = { to = '燕子坞小径#2SE', },
    hidden = { to = '燕子坞密室#1', no_wander = true, cmd = 'move bei', ignore = true, },
  },
},

['燕子坞密室#1'] = {
  id = '燕子坞密室#1',
  area = '燕子坞',
  name = '密室',
  desc =  [[这里是慕容博墓内的一个密室。地上放了几个金光闪闪的大箱子(box)。墙上挂满了大燕国历代皇帝的画像。正当中摆着一把龙椅(chair)。]],
  exit = {
    s = { to = '燕子坞墓地', },
    hidden = { to = '燕子坞密室#2', handler = 'yzw_mishi', cond = 'player.party == "姑苏慕容" and player.neili >= 6000', },
  },
},

['燕子坞密室#2'] = {
  id = '燕子坞密室#2',
  area = '燕子坞',
  name = '密室',
  desc =  [[这里是一个密室。]],
  exit = {
    u = { to = '燕子坞密室#1', },
  },
},

['燕子坞厨房'] = {
  id = '燕子坞厨房',
  area = '燕子坞',
  name = '厨房',
  desc =  [[这是一间小厨房, 虽然不大, 但是锅碗瓢盆, 油盐酱醋, 到很奇全。灶台上堆满了新鲜瓜果蔬菜, 活鱼活虾, 不仅不脏不乱, 还十分干净整齐。]],
  exit = {
    w = { to = '燕子坞长廊#1E', },
  },
},

['燕子坞小径#C'] = {
  id = '燕子坞小径#C',
  area = '燕子坞',
  name = '小径',
  desc =  [[一条曲曲折折用鹅卵石铺成的小径, 路两旁绿柳成阴, 一处处山石花木点缀在其中。你走在石地上，啪嗒啪嗒的发出清脆的响声，南面是燕子坞的大厅，专门接待来慕容的各路英雄豪杰。]],
  exit = {
    s = { to = '燕子坞大厅', },
    n = { to = '燕子坞院门', },
  },
},

['燕子坞观星台'] = {
  id = '燕子坞观星台',
  area = '燕子坞',
  name = '观星台',
  desc =  [[这里是小径旁树丛中央的一个大平台。平台呈圆形，地上按二十八宿的方位排布着一些木桩，其中一根最北边的木桩(zhuang)显得格外的粗壮。平台四周树丛掩映，正午的阳光透过树叶的缝隙在平台上留下了班驳的树影。]],
  exit = {
    s = { to = '燕子坞小径#2SE', },
  },
},

['燕子坞岸边#2'] = {
  id = '燕子坞岸边#2',
  area = '燕子坞',
  name = '岸边',
  desc =  [[从这里乘船可以到达曼佗罗山庄，一位上了年纪的老船夫正在岸边休息，你可以呼喊一声(yell)，船家就会摆船过来。]],
  exit = {
    e = { to = '燕子坞听香水榭', },
    enter = { to = '姑苏慕容渡船#YZW-MTL', unstable = true, no_wander = true, handler = 'embark', },
  },
},

['燕子坞长廊#2S'] = {
  id = '燕子坞长廊#2S',
  area = '燕子坞',
  name = '长廊',
  desc =  [[这是一条长廊，上面画着江南秀美的工笔画。绿色的柱子朱红色的琉璃瓦，使得你不由得对江南艺术工匠的创造惊叹不已。在长廊里面，丫鬟、家丁们走来走去，都忙着自己的事情。西面是长廊的延伸，北面是静音阁。]],
  exit = {
    e = { to = '燕子坞长廊#3S', },
    w = { to = '燕子坞长廊#1S', },
    n = { to = '燕子坞静音阁', },
  },
},

['燕子坞长廊#3S'] = {
  id = '燕子坞长廊#3S',
  area = '燕子坞',
  name = '长廊',
  desc =  [[这是一条长廊，上面画着江南秀美的工笔画。绿色的柱子朱红色的琉璃瓦，使得你不由得对江南艺术工匠的创造惊叹不已。在长廊里面，丫鬟、家丁们走来走去，都忙着自己的事情。西面是长廊的延伸。]],
  exit = {
    w = { to = '燕子坞长廊#2S', },
    e = { to = '燕子坞长廊#4S', },
  },
},

['燕子坞小门#W'] = {
  id = '燕子坞小门#W',
  area = '燕子坞',
  name = '小门',
  desc =  [[这里是一道圆形小门，小门的南面是一条长廊，长廊里面人来人往，所有的人都在忙着自己的事情。]],
  exit = {
    s = { to = '燕子坞长廊#1S', },
    n = { to = '燕子坞长廊#3W', },
  },
},

['燕子坞长廊#3E'] = {
  id = '燕子坞长廊#3E',
  area = '燕子坞',
  name = '长廊',
  desc =  [[这是一条长廊，上面画着江南秀美的工笔画。绿色的柱子朱红色的琉璃瓦，使得你不由得对江南艺术工匠的创造惊叹不已。在长廊里面，丫鬟、家丁们走来走去，都忙着自己的事情，南面是一座圆形小门。]],
  exit = {
    w = { to = '燕子坞长廊#2E', },
    s = { to = '燕子坞小门#E', },
  },
},

['燕子坞长廊#5S'] = {
  id = '燕子坞长廊#5S',
  area = '燕子坞',
  name = '长廊',
  desc =  [[这是一条长廊，上面画着江南秀美的工笔画。绿色的柱子朱红色的琉璃瓦，使得你不由得对江南艺术工匠的创造惊叹不已。在长廊里面，丫鬟、家丁们走来走去，都忙着自己的事情。西面是长廊的延伸，东面是一条小径。]],
  exit = {
    e = { to = '燕子坞小径#1SE', },
    w = { to = '燕子坞长廊#4S', },
    n = { to = '燕子坞小门#E', },
  },
},

['燕子坞岸边#1'] = {
  id = '燕子坞岸边#1',
  area = '燕子坞',
  name = '岸边',
  desc =  [[远远看去，只见一个小洲上八九间房间，其中两间是楼房。阁宇中隐约露出一个牌坊「听香水榭」。]],
  exit = {
    s = { to = '燕子坞听香水榭', },
  },
},

['燕子坞内堂'] = {
  id = '燕子坞内堂',
  area = '燕子坞',
  name = '内堂',
  desc =  [[这里是燕子坞的内堂，里面是平时慕容家眷呆的地方，丫鬟和婢女们在这里伺候着慕容一家。墙面上挂着一幅五寿图，房梁是用上好的楠木作的。屋子中间放着一张八仙桌，桌子上摆着水蜜桃和荔枝。]],
  exit = {
    e = { to = '燕子坞赏月斋', },
    w = { to = '燕子坞静音阁', },
    n = { to = '燕子坞后厅', },
  },
},

['燕子坞长廊#2W'] = {
  id = '燕子坞长廊#2W',
  area = '燕子坞',
  name = '长廊',
  desc =  [[这是一条长廊，上面画着江南秀美的油彩画。绿色的柱子朱红色的琉璃瓦，使得你不由得对江南工匠的艺术创造惊叹不已。在长廊里面，丫鬟、家丁们走来走去，正在忙着招呼客人，不敢有一点怠慢。长廊东面是厢房，南面和西面是长廊的延伸。]],
  exit = {
    e = { to = '燕子坞厢房#1W', },
    s = { to = '燕子坞长廊#4W', },
    w = { to = '燕子坞长廊#3W', },
    n = { to = '燕子坞长廊#1W', },
  },
},

['燕子坞听香水榭'] = {
  id = '燕子坞听香水榭',
  area = '燕子坞',
  name = '听香水榭',
  desc =  [[这间房舍小巧玲珑, 颇为精雅。小舍匾额上写着'听香水榭'四个大字, 笔致颇为潇洒。东边是一条小路，不知是通往哪里的。再往前走，就到了“燕子坞”。南边是水榭的后院。]],
  exit = {
    hidden = { to = '姑苏慕容地道#1', cmd = 'zuan didao', cond = 'player.party == "姑苏慕容"', },
    s = { to = '燕子坞后院', },
    w = { to = '燕子坞岸边#2', },
    n = { to = '燕子坞岸边#1', },
  },
},

['燕子坞后院'] = {
  id = '燕子坞后院',
  area = '燕子坞',
  name = '后院',
  desc =  [[这是水榭的后院，院中假山水石，无一不透出江南别具一格的风格。只见东西各有一道半月型的小门。东边就是举世闻名的燕子坞了。西面是一座通向湖中小岛的木桥，南面是岸边，可以坐船出太湖。]],
  exit = {
    e = { to = '燕子坞院门', },
    s = { to = '燕子坞岸边#3', },
    w = { to = '燕子坞木桥', },
    n = { to = '燕子坞听香水榭', },
  },
},

['燕子坞小径#2SE'] = {
  id = '燕子坞小径#2SE',
  area = '燕子坞',
  name = '小径',
  desc =  [[一条曲曲折折由鹅卵石铺成的小径, 路两旁绿柳成阴, 一处处山石花木点缀在其中。你走在石地上，啪嗒啪嗒的发出清脆的响声，顺着小径向东面方向望去有一处空场。]],
  exit = {
    e = { to = '燕子坞墓地', },
    w = { to = '燕子坞小径#1SE', },
    n = { to = '燕子坞观星台', },
  },
},

['燕子坞练武场'] = {
  id = '燕子坞练武场',
  area = '燕子坞',
  name = '练武场',
  desc =  [[这里是一个练武场，平常慕容家族的弟子、家丁都在这里练习武功。在练武场的四角，有几个专门个弟子用来练武的木桩(zhuang)，许多弟子都围在那里对着木桩击打。]],
  exit = {
    w = { to = '燕子坞院门', },
  },
},

['燕子坞局室'] = {
  id = '燕子坞局室',
  area = '燕子坞',
  name = '局室',
  desc =  [[这是大家平时休闲起居的地方，里面放着一具古筝，一张棋桌，上面的棋局(qiju)错综复杂，令人百思不得其解。局室的东面是大厅，西面是一条长廊，南面是一间厢房。]],
  exit = {
    e = { to = '燕子坞大厅', },
    w = { to = '燕子坞长廊#1W', },
    s = { to = '燕子坞厢房#1W', },
  },
},

['燕子坞后厅'] = {
  id = '燕子坞后厅',
  area = '燕子坞',
  name = '后厅',
  desc =  [[朱栏宝槛，曲砌峰山。奇花与丽日争妍，翠竹共青天斗碧。径铺彩石，径这里是慕容家里商议事情的地方，不是慕容弟子最好不要到这里来。在后堂正中摆放着一个香案，上面摆放着一个灵位牌子（paizi)，在正中墙上挂着一幅百鸟朝奉图，边墙上挂着一口宝剑。东西两面各是一间厢房，南面是内堂。]],
  exit = {
    e = { to = '燕子坞厢房#1E', },
    s = { to = '燕子坞内堂', },
    w = { to = '燕子坞厢房#1W', },
    n = { to = '燕子坞大厅', },
  },
},

['燕子坞静音阁'] = {
  id = '燕子坞静音阁',
  area = '燕子坞',
  name = '静音阁',
  desc =  [[这里是修身养性的好场所，这里静悄悄的，没有主人的吩咐，谁也不能够随便出入这里，在墙上挂着一幅图。]],
  exit = {
    e = { to = '燕子坞内堂', },
    w = { to = '燕子坞长廊#4W', },
    s = { to = '燕子坞长廊#2S', },
  },
},

['燕子坞长廊#1S'] = {
  id = '燕子坞长廊#1S',
  area = '燕子坞',
  name = '长廊',
  desc =  [[这是一条长廊，上面画着江南秀美的工笔画。绿色的柱子朱红色的琉璃瓦，使得你不由得对江南艺术工匠的创造惊叹不已。在长廊里面，丫鬟、家丁们走来走去，都忙着自己的事情。东面是长廊的延伸。]],
  exit = {
    e = { to = '燕子坞长廊#2S', },
    n = { to = '燕子坞小门#W', },
  },
},

['燕子坞小门#E'] = {
  id = '燕子坞小门#E',
  area = '燕子坞',
  name = '小门',
  desc =  [[这里是一道圆形小门，小门的南面是一条长廊，长廊里面人来人往，所有的人都在忙着自己的事情。]],
  exit = {
    s = { to = '燕子坞长廊#5S', },
    n = { to = '燕子坞长廊#3E', },
  },
},

['燕子坞长廊#4E'] = {
  id = '燕子坞长廊#4E',
  area = '燕子坞',
  name = '长廊',
  desc =  [[这是一条长廊，上面画着江南秀美的工笔画。绿色的柱子朱红色的琉璃瓦，使得你不由得对江南艺术工匠的创造惊叹不已。在长廊里面，丫鬟、家丁们走来走去，都忙着自己的事情，不敢有一点怠慢。长廊西面是赏月斋。]],
  exit = {
    w = { to = '燕子坞赏月斋', },
    n = { to = '燕子坞长廊#2E', },
  },
},

['燕子坞长廊#1E'] = {
  id = '燕子坞长廊#1E',
  area = '燕子坞',
  name = '长廊',
  desc =  [[这是一条长廊，上面画着江南秀美的工笔画。绿色的柱子朱红色的琉璃瓦，使得你不由得对江南艺术工匠的创造惊叹不已。在长廊里面，丫鬟、家丁们走来走去，都忙着自己的事情，不敢有一点怠慢。长廊西面是书房，南面是长廊的延伸。]],
  exit = {
    e = { to = '燕子坞厨房', },
    w = { to = '燕子坞书房', },
    s = { to = '燕子坞长廊#2E', },
  },
},

['燕子坞厢房#1W'] = {
  id = '燕子坞厢房#1W',
  area = '燕子坞',
  name = '厢房',
  desc =  [[这是一间厢房, 里面摆设简单, 只有一张床, 一张书桌和一把椅子。]],
  exit = {
    e = { to = '燕子坞后厅', },
    w = { to = '燕子坞长廊#2W', },
    n = { to = '燕子坞局室', },
  },
},

['燕子坞岸边#3'] = {
  id = '燕子坞岸边#3',
  area = '燕子坞',
  name = '岸边',
  desc =  [[这里是慕容家的家仆和丫鬟出入太湖的水上码头，只见人们来来往往，一个个风尘仆仆，码头边的老船夫见到你走过来，马上笑呵呵的迎了上去。湖面(humian)上有几只小舟正在游弋。]],
  exit = {
    enter = { to = '姑苏慕容渡船#YZW-SZ', unstable = true, no_wander = true, handler = 'embark', },
    n = { to = '燕子坞后院', },
  },
},

['燕子坞长廊#2E'] = {
  id = '燕子坞长廊#2E',
  area = '燕子坞',
  name = '长廊',
  desc =  [[这是一条长廊，上面画着江南秀美的工笔画。绿色的柱子朱红色的琉璃瓦，使得你不由得对江南艺术工匠的创造惊叹不已。在长廊里面，丫鬟、家丁们走来走去，都忙着自己的事情，不敢有一点怠慢。长廊西面是厢房，南面和东面是长廊的延伸。]],
  exit = {
    e = { to = '燕子坞长廊#3E', },
    s = { to = '燕子坞长廊#4E', },
    w = { to = '燕子坞厢房#1E', },
    n = { to = '燕子坞长廊#1E', },
  },
},

['燕子坞院门'] = {
  id = '燕子坞院门',
  area = '燕子坞',
  name = '院门',
  desc =  [[燕子坞是幕容氏世居之地, 幕容氏乃夕日大燕国的后裔, 后来日见式微，但其弟子却一心一意想光复大燕。其武功见长于以彼之道, 还施彼身, 端的十分厉害。]],
  exit = {
    e = { to = '燕子坞练武场', },
    w = { to = '燕子坞后院', },
    s = { to = '燕子坞小径#C', },
  },
},

['燕子坞长廊#1W'] = {
  id = '燕子坞长廊#1W',
  area = '燕子坞',
  name = '长廊',
  desc =  [[这是一条长廊，上面画着江南秀美的工笔画。绿色的柱子朱红色的琉璃瓦，使得你不由得对江南艺术工匠的创造惊叹不已。在长廊里面，丫鬟、家丁们走来走去，都忙着自己的事情，不敢有一点怠慢。长廊东面是书房，南面是长廊的延伸。]],
  exit = {
    e = { to = '燕子坞局室', },
    s = { to = '燕子坞长廊#2W', },
  },
},

['燕子坞厢房#1E'] = {
  id = '燕子坞厢房#1E',
  area = '燕子坞',
  name = '厢房',
  desc =  [[这是一间厢房, 里面摆设简单, 只有一张床, 一张书桌和一把椅子。]],
  exit = {
    e = { to = '燕子坞长廊#2E', },
    w = { to = '燕子坞后厅', },
    n = { to = '燕子坞书房', },
  },
},

['燕子坞私塾'] = {
  id = '燕子坞私塾',
  area = '燕子坞',
  name = '私塾',
  desc =  [[这里是慕容家里的书堂，为了让家里的孩子能够得到很好的教育，慕容家特意聘请了一位私塾先生来讲课。]],
  exit = {
    s = { to = '燕子坞书房', },
  },
},

['燕子坞小径#1SE'] = {
  id = '燕子坞小径#1SE',
  area = '燕子坞',
  name = '小径',
  desc =  [[一条曲曲折折用鹅卵石铺成的小径, 路两旁绿柳成阴, 一处处山石花木点缀在其中。你走在石地上，啪嗒啪嗒的发出清脆的响声，东面是小径的延伸。]],
  exit = {
    w = { to = '燕子坞长廊#5S', },
    e = { to = '燕子坞小径#2SE', },
  },
},

['燕子坞长廊#3W'] = {
  id = '燕子坞长廊#3W',
  area = '燕子坞',
  name = '长廊',
  desc =  [[这是一条长廊，上面画着江南秀美的工笔画。绿色的柱子朱红色的琉璃瓦，使得你不由得对江南艺术工匠的创造惊叹不已。在长廊里面，丫鬟、家丁们走来走去，都忙着自己的事情，南面是一座圆形小门。]],
  exit = {
    e = { to = '燕子坞长廊#2W', },
    s = { to = '燕子坞小门#W', },
  },
},

['燕子坞大厅'] = {
  id = '燕子坞大厅',
  area = '燕子坞',
  name = '大厅',
  desc =  [[这里是大厅，厅中陈设简单，无什摆设，正堂上挂着许多人物字画，画得都是慕容氏先祖的事迹，看来慕容氏对先人很尊敬。大厅的东边是书房，西边有一个局室，往南面走则是后厅了。]],
  exit = {
    e = { to = '燕子坞书房', },
    s = { to = '燕子坞后厅', },
    w = { to = '燕子坞局室', },
    n = { to = '燕子坞小径#C', },
  },
},

['燕子坞木桥'] = {
  id = '燕子坞木桥',
  area = '燕子坞',
  name = '木桥',
  desc =  [[这是通往湖中小亭的木桥，从这望去湖面碧波荡漾，景色宜人。木桥的扶手上雕刻着一尊尊小木头狮子，让人爱不释手。木桥往西面走能够看到一座湖中小亭。]],
  exit = {
    w = { to = '燕子坞碧水亭', },
    e = { to = '燕子坞后院', },
  },
},

['燕子坞碧水亭'] = {
  id = '燕子坞碧水亭',
  area = '燕子坞',
  name = '碧水亭',
  desc =  [[这是湖中的一个小亭子，从这望去，可以看到整个湖面的景色，令人心旷神怡。亭子壁上刻画着江南水乡的宜人风景，令人产生无限遐想。亭上有一根梁(liang)。]],
  exit = {
    e = { to = '燕子坞木桥', },
  },
},

['燕子坞赏月斋'] = {
  id = '燕子坞赏月斋',
  area = '燕子坞',
  name = '赏月斋',
  desc =  [[赏月斋是为慕容家每到中秋之夜而建造的。里面富丽堂皇，瓜果应有尽有，旁边有丫鬟伺候着，每到赏月之时，一家老小都在这里赏月，在赏月的同时，也念念不忘复兴大燕的使命。西面是内堂，东面和南面是一条长廊。]],
  exit = {
    e = { to = '燕子坞长廊#4E', },
    w = { to = '燕子坞内堂', },
    s = { to = '燕子坞长廊#4S', },
  },
},

['燕子坞书房'] = {
  id = '燕子坞书房',
  area = '燕子坞',
  name = '书房',
  desc =  [[这里是燕子坞的书房, 天下武功皆荟粹与此, 包罗万象, 屋子南边是一把坐椅，四周全是一排排高大的书架。好好学习，必可成为一代高手。书房的东面是一条长廊，西面是大厅，南面是一间厢房。]],
  exit = {
    e = { to = '燕子坞长廊#1E', },
    s = { to = '燕子坞厢房#1E', },
    w = { to = '燕子坞大厅', },
    n = { to = '燕子坞私塾', },
  },
},

['宁波城城中心'] = {
  id = '宁波城城中心',
  area = '宁波城',
  name = '城中心',
  desc =  [[这里是宁波城的城中心，宁波城是本府的大城，历来都是南北兵家必争之地，城中驻扎着重兵。士兵们除了负责盘查南来北往的行人，还负责翦灭附近山上的草寇。城门边贴着张告示(gaoshi)，写着官府通缉的逃犯。城内一队队官兵来来去去，一派森严气象。这里的海港是与外界交往的重要通道。]],
  exit = {
    e = { to = '宁波城东钱湖', },
    w = { to = '宁波城天童禅寺', },
    nw = { to = '宁波城阿育王寺', },
    s = { to = '宁波城客店', },
  },
},

['宁波城青石官道#1'] = {
  id = '宁波城青石官道#1',
  area = '宁波城',
  name = '青石官道',
  desc =  [[你走在一条青石大道上，人来人往非常繁忙，不时地有人骑着马匆匆而过。大道两旁有一些小货摊，似乎是一处集市。往西面就是杭州城了。你已看到一片春绿色，那里正是杭州方向。]],
  exit = {
    se = { to = '宁波城青石官道#2', },
    wu = { to = '杭州城山路#1S', },
  },
},

['宁波城东钱湖'] = {
  id = '宁波城东钱湖',
  area = '宁波城',
  name = '东钱湖',
  desc =  [[你走在一条青石路上，两旁是一片茂密的柳树林，头上小喜鹊唧唧喳喳的叫个不停。一阵微风吹过，使你感觉到一股潮湿的空气扑面而来，这时你已走到了东钱湖畔，只见水光空朦，四周山色如黛，湖光山色瑰丽多姿。几条小舟泛舟湖上，使你觉得更有诗情画意。]],
  exit = {
    s = { to = '宁波城雪窦山', },
    sw = { to = '宁波城客店', },
    w = { to = '宁波城城中心', },
    n = { to = '宁波城溪口', },
  },
},

['宁波城客店二楼#1'] = {
  id = '宁波城客店二楼#1',
  area = '宁波城',
  name = '客店二楼',
  desc =  [[你正走在客店二楼的走廊上，可以听到从客房里不时地呼呼的打酣声，一阵高过一阵。不时有睡意朦胧的旅客进进出出，到楼下的掌柜处付了钱再上来睡觉。]],
  exit = {
    enter = { to = '宁波城客店二楼#2', },
    d = { to = '宁波城客店', },
  },
},

['宁波城阿育王寺'] = {
  id = '宁波城阿育王寺',
  area = '宁波城',
  name = '阿育王寺',
  desc =  [[阿育王寺殿顶都复以黄色琉璃瓦，舍利殿中设七级舍利塔，非金非石。光芒四射。相传人们能从塔空中窥视舍利子，石塔后有释迦牟尼像。寺内环境十分幽静，是及好的禅修之所。]],
  exit = {
    e = { to = '宁波城溪口', },
    nw = { to = '宁波城天一阁', },
    w = { to = '宁波城天封塔', },
    se = { to = '宁波城城中心', },
  },
},

['宁波城石路'] = {
  id = '宁波城石路',
  area = '宁波城',
  name = '石路',
  desc =  [[你走在一条青石路上，两旁是一片茂密的柳树林，头上小喜鹊唧唧喳喳的叫个不停。一阵微风吹过，使你感觉到一股潮湿的空气扑面而来，也许是因为宁波城是个港口吧。不远处的山上就是鼎鼎有名的报国寺了。往南便是天封塔。]],
  exit = {
    e = { to = '宁波城天一阁', },
    s = { to = '宁波城天封塔', },
    nw = { to = '宁波城青石官道#2', },
    su = { to = '宁波城报国寺', },
  },
},

['宁波城报国寺'] = {
  id = '宁波城报国寺',
  area = '宁波城',
  name = '报国寺',
  desc =  [[你走进报国寺内，看到大殿内的全部结构不用一根钉子，完全靠着斗拱之间的巧妙支撑。天花板上并列着三个美丽的镂空藻井，你不禁为能工巧匠的精湛技艺所折服。]],
  exit = {
    nd = { to = '宁波城石路', },
  },
},

['宁波城青石官道#2'] = {
  id = '宁波城青石官道#2',
  area = '宁波城',
  name = '青石官道',
  desc =  [[你走在一条青石大道上，人来人往非常繁忙，不时地有人骑着马匆匆而过。大道两旁有一些小货摊，似乎是一处集市。往西北面就是杭州城了。]],
  exit = {
    nw = { to = '宁波城青石官道#1', },
    se = { to = '宁波城石路', },
  },
},

['宁波城客店'] = {
  id = '宁波城客店',
  area = '宁波城',
  name = '客店',
  desc =  [[这是宁波城里的一个小客店，客店的门口站着一位店小二，看到你走过来，笑呵呵的向你打招呼。客店的西面是一个马厩，专门为骑马而来的过往旅客们换马，喂马而设的。墙上挂着一个牌子(paizi)。]],
  exit = {
    ne = { to = '宁波城东钱湖', },
    u = { to = '宁波城客店二楼#1', },
    w = { to = '宁波城马厩', },
    n = { to = '宁波城城中心', },
  },
},

['宁波城客店二楼#2'] = {
  id = '宁波城客店二楼#2',
  area = '宁波城',
  name = '客店二楼',
  desc =  [[这是一间很大的客房，陈设十分简陋。靠墙放了十几张小木床，不少客人正和衣而卧，满屋子都是呼呼的打酣声。西边有张床是空的，你蹑手蹑脚地走了过去。]],
  exit = {
    out = { to = '宁波城客店二楼#1', },
  },
},

['宁波城天一阁'] = {
  id = '宁波城天一阁',
  area = '宁波城',
  name = '天一阁',
  desc =  [[天一阁名字相传为《易经》中“天一生水，地六成之”之说而来，取以水火克之意。阁旁垒石为山，环植竹木，依墙立一半亭，旁边池中小桥穿越林石之间，垒石似狮、象、羊、虎等动物，山似“福”、“禄”、“寿”之型。令人遐想，意趣无穷。]],
  exit = {
    w = { to = '宁波城石路', },
    se = { to = '宁波城阿育王寺', },
  },
},

['宁波城溪口'] = {
  id = '宁波城溪口',
  area = '宁波城',
  name = '溪口',
  desc =  [[你迎着阵阵海风来到了溪口，这里是自古代以来兵家必争之地，这里连接着与海外的贸易，岸边停泊着的几艘大帆船在夕阳的照射下，船帆显得分外美丽。岸边有几个老艄公正等着拉客人，也许你上前询问一下就能雇船出海。]],
  exit = {
    w = { to = '宁波城阿育王寺', },
    s = { to = '宁波城东钱湖', },
    hidden = { to = '大海船', handler = 'nb_onboard', },
  },
},

['宁波城雪窦山'] = {
  id = '宁波城雪窦山',
  area = '宁波城',
  name = '雪窦山',
  desc =  [[你走上雪窦山，看到山上松樟翠竹蔽日，山岩奇突多姿，峰峦突兀雄奇，银瀑飞撒如雪，景色绮丽如画。东西两涧的水在锦镜池汇聚，经过崖口顿然凌空怒泻，形成溅喷如雪的巨瀑。登台远眺，无数秀美风景宛如绢画般动人。]],
  exit = {
    n = { to = '宁波城东钱湖', },
  },
},

['宁波城天封塔'] = {
  id = '宁波城天封塔',
  area = '宁波城',
  name = '天封塔',
  desc =  [[天封塔是宁波城附近最高的建筑物了，凡是到了宁波的文人、名士和游客总要登上塔顶，一览全城风光，在塔壁上留下不少题咏。]],
  exit = {
    e = { to = '宁波城阿育王寺', },
    s = { to = '宁波城天童禅寺', },
    n = { to = '宁波城石路', },
  },
},

['宁波城天童禅寺'] = {
  id = '宁波城天童禅寺',
  area = '宁波城',
  name = '天童禅寺',
  desc =  [[天童禅寺有“东南佛国”之称。寺庙依地傍山，规模宏大，气势非凡，寺周群山环抱，古木参天，景色秀丽多姿。寺庙西面的玲珑岩奇石嶙峋，古木葱茏，山径曲折，流水淙淙，环境十分幽雅。]],
  exit = {
    e = { to = '宁波城城中心', },
    sw = { to = '福州城山路#4N', },
    n = { to = '宁波城天封塔', },
  },
},

['宁波城马厩'] = {
  id = '宁波城马厩',
  area = '宁波城',
  name = '马厩',
  desc =  [[这是北大街边上的马厩，常年供应新鲜草料。据说此地民风淳朴，客人要住店，马夫们就会把马牵到马厩好生照看，将它们喂饱饮足，再洗刷得干乾净净。一直伺候到客人离店上路。马厩中堆放著几堆草料，正中有一口泔槽。]],
  exit = {
    ne = { to = '宁波城城中心', },
    e = { to = '宁波城客店', },
  },
},

['终南山果林#5'] = {
  id = '终南山果林#5',
  area = '终南山',
  name = '果林',
  desc =  [[转过山腰，出现一大片果林。果树高大茂盛，枝叶繁密，累累鲜果，鲜嫩诱人。清风拂叶，沙沙作响，更令这群果随风招摇起舞，送来阵阵果香。但听密林深处，杜鹃儿间或轻啼。]],
  exit = {
    e = { to = '终南山红花丛', },
    s = { to = '终南山果林#5', },
    w = { to = '终南山果林#5', },
    n = { to = '终南山果林#5', },
  },
},

['终南山金莲阁'] = {
  id = '终南山金莲阁',
  area = '终南山',
  name = '金莲阁',
  desc =  [[金莲阁是全真教为武林人士和进香香客准备茶水和膳食的地方，可供登山者稍作休憩。此阁建于北宋初年，由于近年全真的鼎盛香火，已修茸一新，阁心一朵七彩金莲，卓然生辉。]],
  exit = {
    nu = { to = '终南山中天门', },
    su = { to = '终南山日月岩', },
  },
},

['终南山果林#3'] = {
  id = '终南山果林#3',
  area = '终南山',
  name = '果林',
  desc =  [[转过山腰，出现一大片果林。果树高大茂盛，枝叶繁密，累累鲜果，鲜嫩诱人。清风拂叶，沙沙作响，更令这群果随风招摇起舞，送来阵阵果香。但听密林深处，杜鹃儿间或轻啼。]],
  exit = {
    e = { to = '终南山果林#4', },
    s = { to = '终南山果林#3', },
    w = { to = '终南山果林#3', },
    n = { to = '终南山果林#3', },
  },
},

['终南山储藏室'] = {
  id = '终南山储藏室',
  area = '终南山',
  name = '储藏室',
  desc =  [[古墓生活甚是清苦，储藏室堆着些日常用品，都整整齐齐堆放在墙角，看来经常有古墓弟子前来打扫，其余别无他物。]],
  exit = {
    n = { to = '终南山石室#S', },
  },
},

['终南山石室#E'] = {
  id = '终南山石室#E',
  area = '终南山',
  name = '石室',
  desc =  [[此地供各弟子打坐静修之用。地上仅有几个蒲团，几个古墓弟子正在闭目领悟。正面的石墙( qiang)上刻着不少文字, 仔细一看，原来都抄录着四书五经等古籍，用来给古墓弟子提高修养。]],
  exit = {
    s = { to = '终南山药房', },
    w = { to = '终南山琴室', door = 'open door', },
    n = { to = '终南山练功房#E', },
  },
},

['终南山集市'] = {
  id = '终南山集市',
  area = '终南山',
  name = '集市',
  desc =  [[一片开阔地上零散地排着不少摊位，有自制的当地土产，也有从老远的大城市弄来的各类物品。摊主正忙着吆喝兜售。]],
  exit = {
    nw = { to = '终南山终南广场', },
  },
},

['终南山山坡#1'] = {
  id = '终南山山坡#1',
  area = '终南山',
  name = '山坡',
  desc =  [[此处的山路显得稍有陡峭，四周杂草丛生，看上去危机四伏。由于江湖上传闻古墓以前叛逆妄想前来偷取古墓秘籍，所以古墓弟子加强了巡防。一些古墓弟子正在山坡附近巡逻。]],
  exit = {
    ne = { to = '终南山山坡#2', },
    wd = { to = '终南山果园', },
  },
},

['终南山田间小路'] = {
  id = '终南山田间小路',
  area = '终南山',
  name = '田间小路',
  desc =  [[这是一条田拢小陌，弯弯曲曲通往上岗的山路，路边的田地一片郁郁葱葱，好一派丰收光景。]],
  exit = {
    e = { to = '终南山樊川', },
    s = { to = '终南山终南小道', },
  },
},

['终南山古墓'] = {
  id = '终南山古墓',
  area = '终南山',
  name = '古墓',
  desc =  [[你顿了顿神，发现自己已身处深谷之中，雾气蒙蒙，寒意逼人。四下是片不小的开阔地，一座一人高的白色球型圆冢孤立其中，墓后是阴森森的松林古木，更平添十分凄清落寞的萧瑟之意。墓门仅齐肩高，往内是古墓派所在。古墓传人历来不轻出江湖，但不少痴情男女仰慕杨龙二人双剑合壁快意江湖的豪情，历尽千般磨难后终成眷属惊世恋情。不远千里往来投拜。]],
  exit = {
    enter = { to = '终南山前厅', },
    s = { to = '终南山悬崖', },
    n = { to = '终南山果园', },
  },
},

['终南山悬崖'] = {
  id = '终南山悬崖',
  area = '终南山',
  name = '悬崖',
  desc =  [[此处已是绝路，光秃秃的石壁，下面则是云雾弥漫的万丈深崖(xuanya)，传闻中有个古墓弟子因受不了古墓之清苦寡欲，从此处一跃而下，了却一生，近悬崖边有棵摩天大树(tree)，枝叶极盛，如大伞一张遮掩住方圆之地。]],
  exit = {
    n = { to = '终南山古墓', },
  },
},

['终南山石室#1'] = {
  id = '终南山石室#1',
  area = '终南山',
  name = '石室',
  desc =  [[这是一间密闭的石室，室中点着灯火，石室奇小，仅容一人周转，此处供古墓弟子修炼入门武功，天罗地网势。室内有三只麻雀。]],
  exit = {
    enter = { to = '终南山石室#2', },
    n = { to = '终南山中堂', door = 'open door', },
  },
},

['终南山果林#4'] = {
  id = '终南山果林#4',
  area = '终南山',
  name = '果林',
  desc =  [[转过山腰，出现一大片果林。果树高大茂盛，枝叶繁密，累累鲜果，鲜嫩诱人。清风拂叶，沙沙作响，更令这群果随风招摇起舞，送来阵阵果香。但听密林深处，杜鹃儿间或轻啼。]],
  exit = {
    e = { to = '终南山果林#4', },
    s = { to = '终南山果林#5', },
    w = { to = '终南山果林#4', },
    n = { to = '终南山果林#4', },
  },
},

['终南山石室#3'] = {
  id = '终南山石室#3',
  area = '终南山',
  name = '石室',
  desc =  [[这石室比之先前捉麻雀的石室长阔均约大了一倍，室中已有多只麻雀在内。地方大了这麽多，捕捉麻雀自然远为艰难。石室密闭，墙上两只火把照得整个石室灯火通明。]],
  exit = {
    n = { to = '终南山石室#2', },
  },
},

['终南山抱子岩'] = {
  id = '终南山抱子岩',
  area = '终南山',
  name = '抱子岩',
  desc =  [[过了日月岩，你不由气喘吁吁。没有几分身手实是再难攀登。这抱子岩生得甚是奇怪，就如一个妇人抱着个孩子一般。鬼斧神工，卓然天成，令人叹服。]],
  exit = {
    ed = { to = '终南山日月岩', },
    su = { to = '终南山老妪岩', },
  },
},

['终南山终南山下'] = {
  id = '终南山终南山下',
  area = '终南山',
  name = '终南山下',
  desc =  [[这里是终南山下，四周一片清寂，只闻泉声鸟语，杳无人迹。四下里山石嶙峋，树木茂密，隐蔽之处甚多。在不远处的灌木丛中，隐隐约约的好象有个小山洞(dong)。]],
  exit = {
    nw = { to = '终南山乡间小道', },
    enter = { to = '终南山洞口', },
  },
},

['终南山后堂'] = {
  id = '终南山后堂',
  area = '终南山',
  name = '后堂',
  desc =  [[堂上也是空荡荡的没什么摆设，正前方写着一行大字（zi），东西两壁都挂着一幅画。西首 (westpic)的画像是两个女郎，正是古墓派的师尊林朝英和师祖婆婆的肖像，东侧（eastpic）画像中却是一个道士。 ]],
  exit = {
    e = { to = '终南山琴室', },
    s = { to = '终南山休息室', door = 'open door', },
    w = { to = '终南山中堂', },
    n = { to = '终南山卧室', },
  },
},

['终南山卧室'] = {
  id = '终南山卧室',
  area = '终南山',
  name = '卧室',
  desc =  [[这里是小龙女以前居住的卧室，房中空空洞洞，还保持着以前老模样。一块长条青石作床（bed)，床上铺了张草席，一幅白布当作薄被，此外除了一根人高的绳索横过室中，别无他物。]],
  exit = {
    s = { to = '终南山后堂', },
    hidden = { to = '终南山石室#1D', cmd = 'tang bed;move shiban', },
  },
},

['终南山黑林'] = {
  id = '终南山黑林',
  area = '终南山',
  name = '黑林',
  desc =  [[树林里参天古木，遮蔽了大部分日光，地上积了厚厚的落叶残木，加之不少小动物的尸体，空气中透出腐臭和抑闷。你走着走着，便迷失了道路。]],
  exit = {
    e = { to = '终南山黑林', },
    s = { to = '终南山黑林', },
    w = { to = '终南山黑林', },
    n = { to = '终南山黑林', },
    hidden1 = { to = '终南山灌木丛', cost = 10, handler = 'cord', },
    hidden2 = { to = '终南山树林', cost = 10, handler = 'cord', },
  },
},

['终南山灌木丛'] = {
  id = '终南山灌木丛',
  area = '终南山',
  name = '灌木丛',
  desc =  [[好不容易走出了大树林，你已置身于一片灌木丛中，荆棘满地，蛇虫遍布，令你举步维艰。你茫然四顾，依稀一条小路蜿蜒下行。]],
  exit = {
    w = { to = '终南山黑林', handler = 'reset_data', },
    e = { to = '终南山深沟', },
  },
},

['终南山石室#M'] = {
  id = '终南山石室#M',
  area = '终南山',
  name = '石室',
  desc =  [[古墓中阴沉的石室，只听见远远传来你脚步的回音，空荡荡的感觉使你心中只有恐惧，甚至忘记孤独。你不知身处何地，四周如此漆黑一片，只能靠摸索前行。]],
  exit = {
    s = { to = '终南山石室#M', },
    e = { to = '终南山石室#M', },
    n = { to = '终南山石室#M', },
    w = { to = '终南山石室#M', },
    hidden = { to = '终南山石室#2D', cost = 14, handler = 'fixed_step', cond = 'player.jingli > 400', },
  },
},

['终南山终南广场'] = {
  id = '终南山终南广场',
  area = '终南山',
  name = '终南广场',
  desc =  [[此处原是乡村小镇村民们打谷晒粮的地方，来了戏团或每年正月庙会，更是乡镇的集会所，后来由于全真教与古墓派声名日盛，掌教将山下此处场所修葺整理，于林荫森森中扩开一片平整洁净的广场，成为了武林人物常来拜山论技的场所，平日里常有老人做清洁打理的活计，也有孩子在此玩耍，东南面有个小集市。]],
  exit = {
    nw = { to = '终南山终南小道', },
    se = { to = '终南山集市', },
  },
},

['终南山果林#1'] = {
  id = '终南山果林#1',
  area = '终南山',
  name = '果林',
  desc =  [[转过山腰，出现一大片果林。果树高大茂盛，枝叶繁密，累累鲜果，鲜嫩诱人。清风拂叶，沙沙作响，更令这群果随风招摇起舞，送来阵阵果香。但听密林深处，杜鹃儿间或轻啼。正前方的一棵果树上挂着个蜂巢(fengchao)。]],
  exit = {
    e = { to = '终南山果园', },
  },
},

['终南山暗河#1'] = {
  id = '终南山暗河#1',
  area = '终南山',
  name = '暗河',
  desc =  [[原来这正是一条地下暗河，此处水声已是轰轰，声势极为骇人。你脚下一处踏空，便有水流直冲咽喉。此潜流不知来自何处，更不知通往何方。]],
  exit = {
    nu = { to = '终南山石室#3D', },
    wd = { to = '终南山潜流#1', },
  },
},

['终南山中堂'] = {
  id = '终南山中堂',
  area = '终南山',
  name = '中堂',
  desc =  [[这处是古墓派弟子参见掌门之处，此刻古墓传人小龙女及神雕大侠杨过早已名颂江湖，这对壁人不但武功已成一派宗师，两人矢志不渝之深情更令世人倾慕不已。厅内只一张长桌，两把石椅。厅上方有一块匾额(bian).]],
  exit = {
    e = { to = '终南山后堂', },
    s = { to = '终南山石室#1', door = 'open door', },
    w = { to = '终南山前厅', },
    n = { to = '终南山练功房#W', },
  },
},

['终南山石室#2'] = {
  id = '终南山石室#2',
  area = '终南山',
  name = '石室',
  desc =  [[这石室比之先前捉麻雀的石室长阔均约大了一倍，室中已有六只麻雀在内。地方大了这麽多，捕捉麻雀自然远为艰难。石室密闭，墙上两只火把照得整个石室灯火通明。]],
  exit = {
    s = { to = '终南山石室#3', },
    out = { to = '终南山石室#1', },
  },
},

['终南山切磋室'] = {
  id = '终南山切磋室',
  area = '终南山',
  name = '切磋室',
  desc =  [[这是古墓派弟子切磋武技的地方，空旷的一间石室，没有任何摆设。四周点亮不少火把，倒也灯火通明，石壁上留有几个骇人的掌印，入石数分，显见是高手相交所为。]],
  exit = {
    n = { to = '终南山前厅', },
  },
},

['终南山暗河#2'] = {
  id = '终南山暗河#2',
  area = '终南山',
  name = '暗河',
  desc =  [[原来这正是一条地下暗河，此处水声已是轰轰，声势极为骇人。你脚下一处踏空，便有水流直冲咽喉。此潜流不知来自何处，更不知通往何方。慢慢你已感觉水势渐缓，地势渐高。]],
  exit = {
    nu = { to = '终南山洞口', },
    ed = { to = '终南山潜流#2', },
  },
},

['终南山药房'] = {
  id = '终南山药房',
  area = '终南山',
  name = '药房',
  desc =  [[这里是一间石室，周围的火把将石室照的灯火通明，石室里面摆满了很多瓶瓶罐罐，上面都贴好了标签，一瓶瓶玉蜂浆被古墓弟子制成后放在此处。你能看见几个古墓弟子正在忙碌的干活。]],
  exit = {
    w = { to = '终南山石室#S', },
    n = { to = '终南山石室#E', },
  },
},

['终南山领悟室'] = {
  id = '终南山领悟室',
  area = '终南山',
  name = '领悟室',
  desc =  [[此地供各弟子打坐静修之用。地上仅有几个蒲团，几对少男少女正在闭目领悟。东面石壁上有一方凸起，刻着不少文字(wall), 西面地上有一方凹陷，刻着些古怪的图形(ground), 顶上有一些美女图形(top)。]],
  exit = {
    s = { to = '终南山前厅', },
  },
},

['终南山潜流#2'] = {
  id = '终南山潜流#2',
  area = '终南山',
  name = '潜流',
  desc =  [[你没在水中，只觉水势甚急，冲得你无法立足。你气闷异常，只得屏气摸索潜行，当真是进退维谷。]],
  exit = {
    e = { to = '终南山潜流#1', },
    wu = { to = '终南山暗河#2', },
  },
},

['终南山石室#2D'] = {
  id = '终南山石室#2D',
  area = '终南山',
  name = '石室',
  desc =  [[你觉得眼前一亮，前方石室透过来一丝微弱的光，给了你一丝希望。但还是只听见远远传来你脚步的回音，空荡荡的感觉使你心中只有恐惧，甚至忘记孤独。四周如此寂然无声。只能靠摸索前行。]],
  exit = {
    w = { to = '终南山石室#M', handler = 'reset_data', },
    enter = { to = '终南山灵室', },
  },
},

['终南山山路'] = {
  id = '终南山山路',
  area = '终南山',
  name = '山路',
  desc =  [[继续南行，此处的山路显得稍有陡峭，路边松林里有一块石碑(shibei)，远望过去，可见“长春”字样，正是全真七子之长春子丘处机有感苍生劳苦所题词句。]],
  exit = {
    eu = { to = '终南山中天门', },
    nd = { to = '终南山岗顶', },
  },
},

['终南山琴室'] = {
  id = '终南山琴室',
  area = '终南山',
  name = '琴室',
  desc =  [[一张石桌(table)，一条石凳，桌上放着一把古琴(qin)，是小龙女休憩时刻抚琴抒怀的地方。每每琴音袅袅，平淡清和，直引人心弛神往，与世无争。]],
  exit = {
    e = { to = '终南山石室#E', door = 'open door', },
    s = { to = '终南山石室#S', },
    w = { to = '终南山后堂', },
    n = { to = '终南山剑室', },
  },
},

['终南山前厅'] = {
  id = '终南山前厅',
  area = '终南山',
  name = '前厅',
  desc =  [[这是入墓的第一间石室，四壁俱是坚硬的岩石，古墓内光线十分阴暗，寒气更为逼人，和室外有天壤之别，让你瑟瑟发抖，正前方的石壁上刻着不少文字(zi)，乃拜师必读。北面通往领悟室，往南则是切磋室。]],
  exit = {
    e = { to = '终南山中堂', },
    out = { to = '终南山古墓', },
    s = { to = '终南山切磋室', },
    n = { to = '终南山领悟室', },
  },
},

['终南山红花丛'] = {
  id = '终南山红花丛',
  area = '终南山',
  name = '红花丛',
  desc =  [[这丛红花排开来长达数丈，密密层层，奇香扑鼻，但见花丛有如一座大屏风，红瓣绿枝，煞是好看，四下里树荫垂盖，便似天然结成的一座花房树屋。四周都是一片清幽，只闻泉声鸟语，杳无人迹，确是个上好的练功所在。]],
  exit = {
    w = { to = '终南山果林#5', },
    s = { to = '终南山果林#1', },
  },
},

['终南山休息室'] = {
  id = '终南山休息室',
  area = '终南山',
  name = '休息室',
  desc =  [[这里是古墓弟子的休息室，房中空空洞洞，一如古墓无异。一块长条青石作床，床上铺了张草席，一幅白布当作薄被，此外除了一根人高的绳索横过室中，别无他物。]],
  exit = {
    n = { to = '终南山后堂', door = 'open door', },
  },
},

['终南山乡间小道'] = {
  id = '终南山乡间小道',
  area = '终南山',
  name = '乡间小道',
  desc =  [[终南山下的小道，由于全真掌教王重阳技镇华山，全真派的声势如日中天，招来一派生气，不少百姓诚心向道，也不乏武林人士奔走其间。]],
  exit = {
    se = { to = '终南山终南山下', },
    su = { to = '终南山山麓', },
    n = { to = '终南山终南小道', },
  },
},

['终南山终南小道'] = {
  id = '终南山终南小道',
  area = '终南山',
  name = '终南小道',
  desc =  [[终南山下的小道，由于全真掌教王重阳技镇华山，全真派的声势如日中天，招来一派生气，不少百姓诚心向道，也不乏武林人士奔走其间。东南边是终南广场。]],
  exit = {
    se = { to = '终南山终南广场', },
    s = { to = '终南山乡间小道', },
    n = { to = '终南山田间小路', },
  },
},

['终南山石室#1D'] = {
  id = '终南山石室#1D',
  area = '终南山',
  name = '石室',
  desc =  [[头顶的石壁(shibi)又恢复了原状，你发现自己置身于一间阴沉的石室中，空荡荡的感觉使你心中只有恐惧，甚至忘记孤独。你不知身处何地，四周如此漆黑一片，只能靠摸索前行。]],
  exit = {
    out = { to = '终南山石室#M', handler = 'reset_data', },
    u = { to = '终南山卧室', door = 'tui shibi', },
  },
},

['终南山树林'] = {
  id = '终南山树林',
  area = '终南山',
  name = '树林',
  desc =  [[黑压压的一座大树林，一条小径绵延通幽。林中一片寂静，更无半点声息，朦胧中见地下立着一块石碑(bei)。]],
  exit = {
    w = { to = '终南山老妪岩', },
    e = { to = '终南山黑林', handler = 'reset_data', },
  },
},

['终南山樊川'] = {
  id = '终南山樊川',
  area = '终南山',
  name = '樊川',
  desc =  [[此处便是樊川，已是终南山的所在，汉初开国大将军樊哙曾食邑于此，因而得名。沿途冈峦回绕，松柏森映,水田蔬圃连绵其间，宛然有江南景色。]],
  exit = {
    w = { to = '终南山田间小路', },
    e = { to = '襄阳城土路#1NW', },
  },
},

['终南山潜流#1'] = {
  id = '终南山潜流#1',
  area = '终南山',
  name = '潜流',
  desc =  [[你没在水中，只觉水势甚急，冲得你无法立足。你气闷异常，只得屏气摸索潜行，当真是进退维谷。]],
  exit = {
    w = { to = '终南山潜流#2', },
    eu = { to = '终南山暗河#1', },
  },
},

['终南山果园'] = {
  id = '终南山果园',
  area = '终南山',
  name = '果园',
  desc =  [[转过山腰，出现一大片果林。一棵棵果树长得高大茂盛，枝叶繁密，累累鲜果(guo)，鲜嫩诱人。清风拂叶，沙沙作响，更令这群果随风招摇起舞，送来阵阵果香，看来你可以大大的饱餐一顿了。但听见密林深处，杜鹃鸟间或轻啼。林子边上从地底下涌出一汪清泉(quan)。]],
  exit = {
    s = { to = '终南山古墓', },
    eu = { to = '终南山山坡#1', },
    w = { to = '终南山果林#1', },
    n = { to = '终南山果林#2', },
  },
},

['终南山练功房#E'] = {
  id = '终南山练功房#E',
  area = '终南山',
  name = '练功房',
  desc =  [[这是古墓内的一间石室。周围的火把将石室照的灯火通明，空旷的一间石室，没有任何摆设。石壁上留有几个骇人的掌印，入石数分，显见是高手相交所为。石室中央放着一个石人，供古墓弟子闲来练功所用。]],
  exit = {
    s = { to = '终南山石室#E', },
  },
},

['终南山石棺内'] = {
  id = '终南山石棺内',
  area = '终南山',
  name = '石棺内',
  desc =  [[棺盖内侧似乎写得有字，凝目瞧去，果见是十六个大字：「玉女心经，技压全真。重阳一生，不弱於人。」这十六个字以浓墨所书，笔力苍劲，字体甚大。其时棺盖只推开了一半，但斜眼看去，仍是清清楚楚。]],
  exit = {
    hidden = { to = '终南山石室#3D', cmd = 'use fire;#9 search;turn ao left;#wb 1500;ti up', },
    out = { to = '终南山灵室', },
  },
},

['终南山深沟'] = {
  id = '终南山深沟',
  area = '终南山',
  name = '深沟',
  desc =  [[匆匆地穿过树林，眼前出现一道深沟(gou)，不知是深谷还是山溪的所在，此外已无去路。低头一看，地下立着一块石碑(shibei)。]],
  exit = {
    w = { to = '终南山灌木丛', },
    hidden = { to = '终南山古墓', cmd = 'tiao gou', no_wander = true, cond = 'player.party == "古墓派" or player.party == "普通百姓"', },
  },
},

['终南山山坡#2'] = {
  id = '终南山山坡#2',
  area = '终南山',
  name = '山坡',
  desc =  [[此处的山路显得稍有陡峭，四周杂草丛生，看上去危机四伏。由于江湖上传闻古墓以前叛逆妄想前来偷取古墓秘籍，所以古墓弟子加强了巡防。一些古墓弟子正在山坡附近巡逻。]],
  exit = {
    sw = { to = '终南山山坡#1', },
  },
},

['终南山剑室'] = {
  id = '终南山剑室',
  area = '终南山',
  name = '剑室',
  desc =  [[一间摆满兵器的石室，很多种剑都整齐地堆放在地上。周围的火把照的整个石室灯火通明，几个古墓弟子正站在室中仔细挑选自己合手的兵刃。墙角放着一个木制的护具架(jia)，上面挂着些古墓弟子平时防身用的护具。]],
  exit = {
    s = { to = '终南山琴室', },
  },
},

['终南山石室#S'] = {
  id = '终南山石室#S',
  area = '终南山',
  name = '石室',
  desc =  [[一间空荡荡的石室，正前方放着一个祭坛，上面呈放着一些瓜果，两边香烛散发出摇曳的火光，一些古墓弟子正将侵犯古墓的叛逆的首级呈放在祭坛两侧用来告慰先祖的英灵。]],
  exit = {
    e = { to = '终南山药房', },
    s = { to = '终南山储藏室', },
    n = { to = '终南山琴室', },
  },
},

['终南山石室#3D'] = {
  id = '终南山石室#3D',
  area = '终南山',
  name = '石室',
  desc =  [[室中也无特异之处，你抬头仰望，但见室顶密密麻麻的写满了字迹符号，你看了一会，但觉奥妙难解。室顶西南角绘著一幅图，似与武功无关，凝神细看，倒像是幅地图。石室右下方好象可以往下(down)走。]],
  exit = {
    u = { to = '终南山石棺内', },
    hidden = { to = '终南山暗河#1', cmd = 'walk down', cond = 'player.qi > 200 and player.jing > 200', },
  },
},

['终南山练功房#W'] = {
  id = '终南山练功房#W',
  area = '终南山',
  name = '练功房',
  desc =  [[一间石室，形状甚是奇特，前（frontwall)窄后(backwall)宽，成为梯形，东(eastwall)边半圆，西(westwall)边却作三角型。室顶石板上刻满诸般花纹符号，均是已利器刻成，或深或浅，殊无规则。此处供古墓弟子修炼入门外功。]],
  exit = {
    s = { to = '终南山中堂', },
  },
},

['终南山洞口'] = {
  id = '终南山洞口',
  area = '终南山',
  name = '洞口',
  desc =  [[又行了一柱香时刻，越走眼前越亮，终於在一个山洞里钻了出来。但见阳光耀眼，浓荫匝地，花光浮动，当真是重见天日。原来这山洞是在终南山山脚一处极为荒僻的所在。]],
  exit = {
    out = { to = '终南山终南山下', },
  },
},

['终南山灵室'] = {
  id = '终南山灵室',
  area = '终南山',
  name = '灵室',
  desc =  [[只见空空旷旷的一座大厅上并列放著五具石棺。凝神细看，见两具石棺棺盖已密密盖著，原来是古墓派祖师林朝英和小龙女师傅的安身之处。另外二具的棺盖(guangai)却只推上一半，也不知其中有无尸体。]],
  exit = {
    hidden = { to = '终南山石棺内', cmd = 'tui guangai;tang guan', },
    out = { to = '终南山石室#2D', },
  },
},

['终南山日月岩'] = {
  id = '终南山日月岩',
  area = '终南山',
  name = '日月岩',
  desc =  [[此去道路陡然险峻，乱石悬崖，屈曲而上。高处森然腾越出两石，遥相呼应，一石浑圆仿如天日，一石曲弯恍若新月。正是日月岩所在。]],
  exit = {
    wu = { to = '终南山抱子岩', },
    nd = { to = '终南山金莲阁', },
  },
},

['终南山中天门'] = {
  id = '终南山中天门',
  area = '终南山',
  name = '中天门',
  desc =  [[此地已是全真的中天门，一块高大的牌坊耸立于半山的开阔地上，全真教的俗事道士于此发符传道，故此处已是香火缭绕，不少善男信女诚心供奉，修道宁心。]],
  exit = {
    wd = { to = '终南山山路', },
    sd = { to = '终南山金莲阁', },
  },
},

['终南山岗顶'] = {
  id = '终南山岗顶',
  area = '终南山',
  name = '岗顶',
  desc =  [[你走了半日，终于来到岗顶，此处有一座庙宇，庙门横额写着“普光寺”三个大字。环庙是几株高大的松树，栓着几匹骡马。]],
  exit = {
    su = { to = '终南山山路', },
    nd = { to = '终南山山麓', },
  },
},

['终南山山麓'] = {
  id = '终南山山麓',
  area = '终南山',
  name = '山麓',
  desc =  [[崎岖的山路，不是十分陡峭，倒是多几分绵长，由于全真教兴旺的香火，山路的石阶也因此而工整。]],
  exit = {
    su = { to = '终南山岗顶', },
    nd = { to = '终南山乡间小道', },
  },
},

['终南山果林#2'] = {
  id = '终南山果林#2',
  area = '终南山',
  name = '果林',
  desc =  [[转过山腰，出现一大片果林。果树高大茂盛，枝叶繁密，累累鲜果，鲜嫩诱人。清风拂叶，沙沙作响，更令这群果随风招摇起舞，送来阵阵果香。但听密林深处，杜鹃儿间或轻啼。]],
  exit = {
    e = { to = '终南山果林#2', },
    s = { to = '终南山果园', },
    w = { to = '终南山果林#3', },
    n = { to = '终南山果林#2', },
  },
},

['终南山老妪岩'] = {
  id = '终南山老妪岩',
  area = '终南山',
  name = '老妪岩',
  desc =  [[山道此处遽然变窄，遮天古木令天地顿暗。迎面又一大岩石当道，形状阴森可怖，自空凭临，宛似一个老妪弯腰俯视。说不出的鬼气弥漫，岩后昏黑中不知藏有多少杀机。]],
  exit = {
    e = { to = '终南山树林', },
    nd = { to = '终南山抱子岩', },
  },
},

['大理城东观景楼'] = {
  id = '大理城东观景楼',
  area = '大理城东',
  name = '观景楼',
  desc =  [[观景楼依石壁而造，如西蜀栈道，奇巧、艰险。观景楼，曾几经修葺。新修后的观景楼，朱檐瓦，画栋雕梁，画幅多以动物花草以及历史故事为题村，采用写意笔法，寥寥数笔，就勾勒出一个栩栩如生的形象。楼台之中设有茶室、小卖部，游人可一面在此静坐休息，一面观赏周围风光。]],
  exit = {
    w = { to = '大理城东第三天', },
    e = { to = '大理城东观景楼边', },
  },
},

['大理城东燕子洞'] = {
  id = '大理城东燕子洞',
  area = '大理城东',
  name = '燕子洞',
  desc =  [[燕子洞，位于古城建水东面三十公里的群山之中。以它独特的景色，瑰丽的风采，吸引着无数游人。燕子洞紧靠鸡街至建水的公路旁。洞前古木参天，绿荫匝地，石芽丛生，石骨嶙峋。到山不知门何处，洞口白云自吞吐。]],
  exit = {
    enter = { to = '大理城东燕子洞口', },
    nd = { to = '大理城东澄江抚仙湖', },
  },
},

['大理城东山间小路#3NE'] = {
  id = '大理城东山间小路#3NE',
  area = '大理城东',
  name = '山间小路',
  desc =  [[你前面一个山岗，路开始逐渐平坦，但是仍不好走，你不断的拨开挡在路上的杂草，荆棘。偶尔听到一阵阵的野兽叫声，头顶有一些不知名的小鸟在跳来跳去，四周丛林密布，鲜花绿草若隐若现。]],
  exit = {
    wd = { to = '大理城东山间小路#2NE', },
    se = { to = '大理城东山间小路#4NE', },
  },
},

['大理城东洞顶'] = {
  id = '大理城东洞顶',
  area = '大理城东',
  name = '洞顶',
  desc =  [[洞的顶端，悬挂着许多大大小小的钟乳石：有的壮丽如倒挂的宝塔，似接非接，若断若继；有的秀拨如孤峰峭壁，突兀峥嵘，跌宕多姿；有的艳丽如朵朵石莲挺秀，傲视群芳。]],
  exit = {
    e = { to = '大理城东燕子窝', },
    d = { to = '大理城东观景楼边', },
  },
},

['大理城东第三天'] = {
  id = '大理城东第三天',
  area = '大理城东',
  name = '第三天',
  desc =  [[进入小门，又别有景观，一条狭窄的小径沿着壁缝向前伸延。小径右边的石壁上，两个半人高的天然圆形小洞，玲珑剔透，奇幻通幽。左边是几道天然屏障，如神工鬼斧，巧缕精雕。游人至此，不禁赞叹大自然的神异魅力转过屏障，眼界豁然开朗，无边的天际，缕缕白云飘浮，近处一字形的一排阁楼，名叫观景楼。三“天”之景，以此最为壮观。]],
  exit = {
    u = { to = '大理城东第二天', },
    e = { to = '大理城东观景楼', },
  },
},

['大理城东寺间小路#1'] = {
  id = '大理城东寺间小路#1',
  area = '大理城东',
  name = '寺间小路',
  desc =  [[你举步入寺，只听得叮叮两声清磬，悠悠从后院传出，霎时之间，只感遍体清凉，意静神闲。]],
  exit = {
    out = { to = '大理城东拈花寺', },
    n = { to = '大理城东寺间小路#2', },
  },
},

['大理城东寺间小路#2'] = {
  id = '大理城东寺间小路#2',
  area = '大理城东',
  name = '寺间小路',
  desc =  [[你踏实着寺院中落叶，走在院内的石路上，眼见庭中一株公孙树上一片黄叶缓缓飞落。　]],
  exit = {
    s = { to = '大理城东寺间小路#1', },
    n = { to = '大理城东大殿', },
  },
},

['大理城东石林'] = {
  id = '大理城东石林',
  area = '大理城东',
  name = '石林',
  desc =  [[主要包括大石林、乃古石林、大叠水瀑布、芝云洞、奇风洞、长湖、月湖等七个景区。景区内石峰林立、万峰迭嶂，千姿百态的石峰、石柱、石花石坪、石流----犹如一片莽壮黝黑的森林，被誉为“天下第一奇观”。石林奇观世所罕见，它以宏大奇伟的喀斯特地貌向世人展现了其独特的风采。]],
  exit = {
    w = { to = '大理城东路南大叠水', },
  },
},

['大理城东路南大叠水'] = {
  id = '大理城东路南大叠水',
  area = '大理城东',
  name = '路南大叠水',
  desc =  [[巴江流到这里，经过一条断层，江水从峭岩上跌落下来，落差有一百二十米，形成大理最大、最壮观的瀑布。身临其地，但见悬岩如刀削斧，瀑布从天而降，有如绢帛悬空，轻柔飘拂，下临深潭，烟波弥漫，水雾升腾，其声则如雷过顶，山谷响应，数里之外可闻；附近林木葱郁，翠竹掩映，山花杂陈。正是：山色水光，画意诗情，景致独特，令人神往。]],
  exit = {
    e = { to = '大理城东石林', },
    s = { to = '大理城东澄江抚仙湖', },
    n = { to = '大理城东西山森林', },
  },
},

['大理城东第一天'] = {
  id = '大理城东第一天',
  area = '大理城东',
  name = '第一天',
  desc =  [[步入洞内，只见彩塑的丈八观音，端坐在路旁石龛之上，体态自然，衣纹流畅，神采奕奕，面容端庄。站在此处回首洞口：一棵苍劲古虬的万年青树依石而上，树的顶端为嶙刚的巨石所环绕，露出古木掩映下的第一天。]],
  exit = {
    u = { to = '大理城东燕子洞口', },
    d = { to = '大理城东第二天', },
  },
},

['大理城东山间小路#1NE'] = {
  id = '大理城东山间小路#1NE',
  area = '大理城东',
  name = '山间小路',
  desc =  [[你走在山上的一条小道上，这里十分荒僻，你不断的拨开挡在路上的杂草，荆棘。偶尔听到一阵阵的野兽叫声，头顶有一些不知名的小鸟在跳来跳去，四周丛林密布，鲜花绿草若隐若现。]],
  exit = {
    sw = { to = '大理城东山路#1E', },
    eu = { to = '大理城东山间小路#2NE', },
  },
},

['大理城东澄江抚仙湖'] = {
  id = '大理城东澄江抚仙湖',
  area = '大理城东',
  name = '澄江抚仙湖',
  desc =  [[这里三面环山，湖面北部宽阔而深，南部狭小而浅，中部细而长，似如葫芦。湖底不平，到处是岩石暗礁起伏很大。湖水主要来处雨水聚积，并南受上游星支湖注入，北有澄江梁王河、东大河、西大河及西龙潭，热水塘的泉水流入，东面的海口河是唯一的出水口，汇南盘江，归南海。]],
  exit = {
    e = { to = '大理城东阳宗海', },
    su = { to = '大理城东燕子洞', },
    n = { to = '大理城东路南大叠水', },
  },
},

['大理城东燕子洞口'] = {
  id = '大理城东燕子洞口',
  area = '大理城东',
  name = '燕子洞口',
  desc =  [[沿着石阶，经过林木荫翳的小道宛转前行，便到了燕子洞的入口。洞似大厅，四面透光，宽敞明亮。洞壁刻有“境绝人寰”，“胜景无双”，“灵谷涵春”等题词。其中“洞锁三天”四字颇有奇趣。千百万年的漫长岁月里地下水、雨水的溶蚀，使这里的石岩产生了奇异的变化，洞内不仅曲折幽深奇幻美观，而且洞中有洞，天外有天。站在洞中三个不同的地点，可以看见三块不同形状的天。故谓之“洞锁三天”。]],
  exit = {
    out = { to = '大理城东燕子洞', },
    d = { to = '大理城东第一天', },
  },
},

['大理城东山间小路#4NE'] = {
  id = '大理城东山间小路#4NE',
  area = '大理城东',
  name = '山间小路',
  desc =  [[转过一个山岗，路逐渐平坦，前面隐约传来一阵钟声。]],
  exit = {
    nw = { to = '大理城东山间小路#3NE', },
    se = { to = '大理城东拈花寺', },
  },
},

['大理城东第二天'] = {
  id = '大理城东第二天',
  area = '大理城东',
  name = '第二天',
  desc =  [[再往下行，左右岩壁扩开，光线逐渐明亮，岩壁对峙的上空，露出块狭长的天，浑雅恬适，独具一格， 这就是第二天。 继续向前走，一道石壁挡住去路，壁上刻满了“灵谷涌春”、“胜景无双”、“天地同流”之类的前人题词，壁下一扇方形小门，宛似天开。]],
  exit = {
    u = { to = '大理城东第一天', },
    d = { to = '大理城东第三天', },
  },
},

['大理城东拈花寺'] = {
  id = '大理城东拈花寺',
  area = '大理城东',
  name = '拈花寺',
  desc =  [[你站在一座小小的古庙前，庙门上檐写着「拈花寺」三字。佛教是大理国教。大理京城内外，大寺数十，小庙以百计，这座「拈花寺」地处偏僻，无甚香火，即是世居大理之人，多半也不知晓。]],
  exit = {
    nw = { to = '大理城东山间小路#4NE', },
    enter = { to = '大理城东寺间小路#1', },
  },
},

['大理城东西山森林'] = {
  id = '大理城东西山森林',
  area = '大理城东',
  name = '西山森林',
  desc =  [[这里位于大大小小的峰峦间。主要由华亭寺、太华寺、三清阁、龙门等风景点组成。华亭寺位于海拔2050米的山间，创建于14世纪，寺内殿宇规模宏伟壮观，是昆明著名的佛教圣地。太华寺建于14世纪初，花木繁盛，幽香袭人。]],
  exit = {
    s = { to = '大理城东路南大叠水', },
    nw = { to = '大理城东山路#1E', },
    n = { to = '大理城东望海楼', },
  },
},

['大理城东望海楼'] = {
  id = '大理城东望海楼',
  area = '大理城东',
  name = '望海楼',
  desc =  [[这里是观在滇池日出的好地方。三清阁和龙门是一组构建在西山主峰罗汉山悬崖峭壁上的建筑群，有九层十一阁。龙门石雕工程，包括石道、古室古栏、古窟、古佛等，是西山胜境的精华所在。登上龙门，凭栏下视，为百丈之悬崖峭壁。举目远望，海天一色，五百里滇池尽收眼底。]],
  exit = {
    s = { to = '大理城东西山森林', },
  },
},

['大理城东阳宗海'] = {
  id = '大理城东阳宗海',
  area = '大理城东',
  name = '阳宗海',
  desc =  [[阳宗海位于宜良、呈贡和澄江三县间，古称明湖，宋、元大理国段氏在此设强宗部，后强宗讹为阳宗，故叫阳宗海。阳宗海形如草，两头宽，中部略窄。南北长约十二公里，东西宽三公里左右，湖面积为三十平方公里，最深为三十米，仅次于抚仙湖和泸沽湖，为大理第三深水湖泊。东北面的汤池河为出水口，汇南盘江，归南海。阳宗海景色秀丽，碧波粼粼，沿湖岩壑嶙峋，陡险峻美。每遇消放，湖面显得非常恬静、动人。这时敛静影，碧水如镜，鱼船往来，宛若图画。景谓“明湖澄碧”，阳宗海为高原断陷湖泊，湖内盛产有名的金线鱼外，还产鲤鱼、青鱼、白鱼、杆条鱼等十多种鱼类。]],
  exit = {
    w = { to = '大理城东澄江抚仙湖', },
  },
},

['大理城东山间小路#2NE'] = {
  id = '大理城东山间小路#2NE',
  area = '大理城东',
  name = '山间小路',
  desc =  [[你走在山上的一条小道上，这里十分荒僻，你不断的拨开挡在路上的杂草，荆棘。偶尔听到一阵阵的野兽叫声，头顶有一些不知名的小鸟在跳来跳去，四周丛林密布，鲜花绿草若隐若现。]],
  exit = {
    wd = { to = '大理城东山间小路#1NE', cost = 2, handler = 'go_straight', },
    eu = { to = '大理城东山间小路#3NE', cost = 2, handler = 'go_straight', },
  },
},

['大理城东观景楼边'] = {
  id = '大理城东观景楼边',
  area = '大理城东',
  name = '观景楼边',
  desc =  [[如果凭栏俯瞰，只见几十丈深的危谷中，一条清澈见底的小河，象是抖动着的一条银链，缓缓从远方流来，进入斜对面一个巨大深邃的洞中，发出潺潺的响声。]],
  exit = {
    u = { to = '大理城东洞顶', },
    w = { to = '大理城东观景楼', },
  },
},

['大理城东后院'] = {
  id = '大理城东后院',
  area = '大理城东',
  name = '后院',
  desc =  [[进了后院小舍，这是间简陋的小房子，地上放着几个蒲团，西首的蒲团上坐着一个满脸皱纹，身行高大的老僧。]],
  exit = {
    s = { to = '大理城东大殿', },
  },
},

['大理城东燕子窝'] = {
  id = '大理城东燕子窝',
  area = '大理城东',
  name = '燕子窝',
  desc =  [[洞上边的悬岩侧壁上，无数石穴密如蛛网，成千上万的岩燕，结巢其上每当春夏之间，千万只燕子进入洞内，生儿育女，繁衍后代。每年，人们都要从这些绝壁上采集为数可观的燕窝，作为滋补佳品。]],
  exit = {
    w = { to = '大理城东洞顶', },
  },
},

['大理城东大殿'] = {
  id = '大理城东大殿',
  area = '大理城东',
  name = '大殿',
  desc =  [[你走进了一间大殿，殿内供奉着佛祖拈花微笑示法的金身塑像，殿内较昏暗，香火也不是很旺，想来是因为香客太少的缘故吧，东西各有一扇紧闭的大门，北面有一个小门通向后院。]],
  exit = {
    s = { to = '大理城东寺间小路#2', },
    n = { to = '大理城东后院', },
  },
},

['大理城东山路#1E'] = {
  id = '大理城东山路#1E',
  area = '大理城东',
  name = '山路',
  desc =  [[你正走在一条崎岖不平的山路上，偶尔听到一阵阵的野兽叫声，头顶有一些不知名的小鸟在跳来跳去，四周丛林密布，鲜花绿草若隐若现，随着山谷里吹来的阵阵清风，传来哗哗的松涛声和一些淡淡的花香，身临其境，古朴、幽静之感油然而生。]],
  exit = {
    ne = { to = '大理城东山间小路#1NE', },
    w = { to = '大理城东门', },
    se = { to = '大理城东西山森林', },
  },
},

['华山村民房#1'] = {
  id = '华山村民房#1',
  area = '华山村',
  name = '民房',
  desc =  [[这是一个泥土夹草堆起的民房，可见房屋的主人并不是十分富裕，屋子不大，靠墙摆着张大床，床头有个小梳妆台。]],
  exit = {
    e = { to = '华山村碎石路#2S', },
  },
},

['华山村碎石路#2S'] = {
  id = '华山村碎石路#2S',
  area = '华山村',
  name = '碎石路',
  desc =  [[这是一个宁静的小村子，稀稀落落的分布着几十间土坯泥房，看来村中人家不多，而且大都生活很艰辛。这是一条南北向的碎石路，西面是间结实的民宅。]],
  exit = {
    s = { to = '华山村南村口', },
    w = { to = '华山村民房#1', },
    n = { to = '华山村碎石路#1S', },
  },
},

['华山村碎石路#2W'] = {
  id = '华山村碎石路#2W',
  area = '华山村',
  name = '碎石路',
  desc =  [[这是一个宁静的小村子，稀稀落落的分布着几十间土坯泥房，看来村中人家不多，而且大都生活很艰辛。北面是间小庙，每年发生灾害的时候村民门都到这里来祈求老天保佑。]],
  exit = {
    e = { to = '华山村碎石路#1W', },
    nw = { to = '华山村土路', },
    s = { to = '华山村玄坛庙', },
  },
},

['华山村碎石路#2E'] = {
  id = '华山村碎石路#2E',
  area = '华山村',
  name = '碎石路',
  desc =  [[这是一个宁静的小村子，稀稀落落的分布着几十间土坯泥房，看来村中人家不多，而且大都生活很艰辛。这是一条东西向的碎石路，南面是间普通的民房。]],
  exit = {
    e = { to = '华山村东村口', },
    w = { to = '华山村碎石路#1E', },
    s = { to = '华山村民房#2', },
  },
},

['华山村民房#2'] = {
  id = '华山村民房#2',
  area = '华山村',
  name = '民房',
  desc =  [[这是一个泥土夹草堆起的民房，可见房屋的主人并不是十分富裕，屋子不大，弥漫着一股刺鼻的味道。]],
  exit = {
    n = { to = '华山村碎石路#2E', },
  },
},

['华山村南村口'] = {
  id = '华山村南村口',
  area = '华山村',
  name = '南村口',
  desc =  [[这是一个小村庄，看来村子里人家不多，村民们过着日出而作，日落而息的宁静生活。穿过这个小村子，就是上华山的山路了。]],
  exit = {
    s = { to = '华山村黄土路', },
    n = { to = '华山村碎石路#2S', },
  },
},

['华山村碎石路#1E'] = {
  id = '华山村碎石路#1E',
  area = '华山村',
  name = '碎石路',
  desc =  [[这是一个宁静的小村子，稀稀落落的分布着几十间土坯泥房，看来村中人家不多，而且大都生活很艰辛。这是一条东西向的碎石路，北面是间杂货铺，主要是卖一些游客上山用的东西。]],
  exit = {
    e = { to = '华山村碎石路#2E', },
    w = { to = '华山村村中心', },
    n = { to = '华山村杂货铺', },
  },
},

['华山村杂货铺'] = {
  id = '华山村杂货铺',
  area = '华山村',
  name = '杂货铺',
  desc =  [[这是一间小小的杂货店，墙角摆著一堆堆的货物，上山的游客可以在这买些上山用品。墙上贴着个牌子，是个价目表。    门前立了个牌子(sign)。]],
  exit = {
    s = { to = '华山村碎石路#1E', },
  },
},

['华山村玄坛庙'] = {
  id = '华山村玄坛庙',
  area = '华山村',
  name = '玄坛庙',
  desc =  [[这是一间十分破旧的小庙，庙里供着赵玄坛的神像。神像看起来很残破，神案上也积了很多尘土，似乎已经很久没有人来上香进供了。大概村民贫困得太久，已不再寄望于老天降福。]],
  exit = {
    n = { to = '华山村碎石路#2W', },
  },
},

['华山村东村口'] = {
  id = '华山村东村口',
  area = '华山村',
  name = '东村口',
  desc =  [[这里是华山脚下，往东就是上山的路了。西边是一个小村庄，村子里人家并不多，村民们过着日出而作，日落而息的宁静生活。]],
  exit = {
    w = { to = '华山村碎石路#2E', },
    e = { to = '华山山脚下', },
  },
},

['华山村村中心'] = {
  id = '华山村村中心',
  area = '华山村',
  name = '村中心',
  desc =  [[这里是村子的中心，一个平坦的广场，每年秋收打谷就在这。广场东角有棵大槐树，平日茶余饭後，村里的男女老少都爱聚在这里谈天说地。角上有几个大谷堆。]],
  exit = {
    ne = { to = '华山村菜地', },
    s = { to = '华山村碎石路#1S', },
    e = { to = '华山村碎石路#1E', },
    w = { to = '华山村碎石路#1W', },
    nw = { to = '华山村菜地', },
  },
},

['华山村菜地'] = {
  id = '华山村菜地',
  area = '华山村',
  name = '菜地',
  desc =  [[这里是华山村民们赖以为生的菜地，空旷的一片，你一眼忘不到头，你走着走着，忽然忘记了来时的路了。]],
  exit = {
    n = { to = '华山村菜地', },
    s = { to = '华山村菜地', },
    e = { to = '华山村菜地', },
    w = { to = '华山村菜地', },
    hidden = { to = '华山村村中心', cost = 30, cmd = 's', handler = 'go_straight', },
  },
},

['华山村铁匠铺'] = {
  id = '华山村铁匠铺',
  area = '华山村',
  name = '铁匠铺',
  desc =  [[这是一间甚是简陋的铁匠铺，入门正中是个大铁砧，满地煤渣碎铁，墙上挂着几张犁头，屋子的角落里堆着几把破锄头、镰刀，靠墙放着几把新出炉的铁锤。]],
  exit = {
    w = { to = '华山村碎石路#1S', },
  },
},

['华山村土路'] = {
  id = '华山村土路',
  area = '华山村',
  name = '土路',
  desc =  [[这是一条尘土飞扬的土路，土路很宽，足可容得下十马并驰。四周人来人往，熙熙攘攘，非常热闹。东面就是华山，山下一个小村落，炊烟袅袅。西面便是长安城了。]],
  exit = {
    w = { to = '长安城官道#2E', },
    se = { to = '华山村碎石路#2W', },
  },
},

['华山村酒肆'] = {
  id = '华山村酒肆',
  area = '华山村',
  name = '酒肆',
  desc =  [[这里是村子西面的一个小酒肆，平时供村民们闲暇的时候来这里消遣。一进门，一股劣质水酒的刺鼻味道直向你扑过来。屋子的中央摆着几张桌子，店家在一旁忙碌着。]],
  exit = {
    s = { to = '华山村碎石路#1W', },
  },
},

['华山村碎石路#1S'] = {
  id = '华山村碎石路#1S',
  area = '华山村',
  name = '碎石路',
  desc =  [[这是一个宁静的小村子，稀稀落落的分布着几十间土坯泥房，看来村中人家不多，而且大都生活很艰辛。这是一条南北向的碎石路，东面是间铁匠铺，主人冯铁匠打铁为生。]],
  exit = {
    e = { to = '华山村铁匠铺', },
    s = { to = '华山村碎石路#2S', },
    n = { to = '华山村村中心', },
  },
},

['华山村碎石路#1W'] = {
  id = '华山村碎石路#1W',
  area = '华山村',
  name = '碎石路',
  desc =  [[这是一个宁静的小村子，稀稀落落的分布着几十间土坯泥房，看来村中人家不多，而且大都生活很艰辛。这是一条东西走向的碎石路，北面是间小酒馆，一个幌子挂在房檐下。]],
  exit = {
    e = { to = '华山村村中心', },
    w = { to = '华山村碎石路#2W', },
    n = { to = '华山村酒肆', },
  },
},

['华山村黄土路'] = {
  id = '华山村黄土路',
  area = '华山村',
  name = '黄土路',
  desc =  [[一条坑坑洼洼的土路，弯弯曲曲的不知道通向何方。前方不远好象有一个小村庄，看来村子里人家不多，都过着日出而作，日落而息的宁静生活。]],
  exit = {
    s = { to = '襄阳城土路#2NW', },
    n = { to = '华山村南村口', },
  },
},

['梅庄庄院大门'] = {
  id = '梅庄庄院大门',
  area = '梅庄',
  name = '庄院大门',
  desc =  [[眼前是高高的白石墙，石墙围绕着的是一座气派的庄院。大门上高高挂着块匾额（bian），匾上写着【梅庄】两个烫金大字，字写得笔力苍劲，儒雅之中透着勃勃英气。前面是两扇朱红色的大门（gate），门上的大铜环擦得精光雪亮。]],
  exit = {
    n = { to = '梅庄青石板大路', },
  },
},

['梅庄青石板大路'] = {
  id = '梅庄青石板大路',
  area = '梅庄',
  name = '青石板大路',
  desc =  [[这里已经到了梅林前面，只见遍地都是梅树，枝叶茂密。想象初春梅花盛开之时，香雪如海，定然观赏不尽。南面是一座朱门白墙的大庄院。]],
  exit = {
    s = { to = '梅庄庄院大门', },
    n = { to = '梅庄梅林', handler = 'plum_entry', },
  },
},

['梅庄小路#2'] = {
  id = '梅庄小路#2',
  area = '梅庄',
  name = '小路',
  desc =  [[这里已经到了梅林前面，只见遍地都是梅树，枝叶茂密。想象初春梅花盛开之时，香雪如海，定然观赏不尽。北面的一条小路折向西方。]],
  exit = {
    s = { to = '梅庄梅林', handler = 'plum_entry', },
    n = { to = '梅庄小路#1', },
  },
},

['梅庄西湖边'] = {
  id = '梅庄西湖边',
  area = '梅庄',
  name = '西湖边',
  desc =  [[这是西湖孤山的一个所在，一边倚着小山，和外边湖水相隔一条长堤，更是幽静。湖边有几株垂柳，倒影映在碧绿的湖水里，微风吹过，倒垂下来的柳条拂过水面，带出一层层的涟漪。东边是一条蜿蜒曲折的石级，不知道通向哪里。]],
  exit = {
    w = { to = '杭州城孤山', },
    e = { to = '梅庄石级', },
  },
},

['梅庄小路#1'] = {
  id = '梅庄小路#1',
  area = '梅庄',
  name = '小路',
  desc =  [[这是一条折向南边的小路，前面不远处是一大片梅林，放眼望去，遍地都是梅树，老干横斜，枝叶茂密，想像初春梅花盛开之日，香雪如海，定然观赏不尽。]],
  exit = {
    w = { to = '梅庄石级', },
    s = { to = '梅庄小路#2', },
  },
},

['梅庄梅林'] = {
  id = '梅庄梅林',
  area = '梅庄',
  name = '梅林',
  desc =  { [[这是梅林中的一条小路。举目望去，四处遍地都是梅树，枝叶茂密地连天空都被遮住了，很难看清周围的情况。]], [[这是梅林中的一条小路，你已经走到了小路的尽头，只有回头了。四处遍地都是梅树，枝叶茂密地连天空都被遮住了，很难看清周围的情况。]], [[这是梅林中的一条小路，小路往南就出了梅林，远处隐约现出白墙，似乎是一个大庄院。四处遍地都是梅树，枝叶茂密地连天空都被遮住了，很难看清周围的情况。]], [[这是梅林中的一条小路，小路往北就出了梅林，在远处似乎折向了西边。四处遍地都是梅树，枝叶茂密地连天空都被遮住了，很难看清周围的情况。]], },
  exit = {
    e = { to = '梅庄梅林', unstable = true, },
    w = { to = '梅庄梅林', unstable = true, },
    s = { to = '梅庄梅林', unstable = true, },
    n = { to = '梅庄梅林', unstable = true, },
    hidden1 = { to = '梅庄青石板大路', cmd = 's', unstable = true, handler = 'plum', },
    hidden2 = { to = '梅庄小路#2', cmd = 'n', unstable = true, handler = 'plum', },
  },
},

['梅庄石级'] = {
  id = '梅庄石级',
  area = '梅庄',
  name = '石级',
  desc =  [[这条山边的石级蜿蜒曲折，不知拐了多少个弯。走到石级尽头，可以看到东边有条小路，折向南边。远处是大片的梅林。]],
  exit = {
    w = { to = '梅庄西湖边', },
    e = { to = '梅庄小路#1', },
  },
},

['平定州平定客店'] = {
  id = '平定州平定客店',
  area = '平定州',
  name = '平定客店',
  desc =  [[这里就是平定客店，老板的生意非常兴隆。外地游客多选择这里落脚。店小二里里外外忙得团团转，接待着南腔北调的客人。当你走了进来，店小二连忙迎上前去。客栈正面的墙上挂着一块醒目的牌子(paizi)。]],
  exit = {
    u = { to = '平定州二楼走廊', },
    nw = { to = '平定州长街#C', },
    n = { to = '平定州客房#1', },
  },
},

['平定州长街#N'] = {
  id = '平定州长街#N',
  area = '平定州',
  name = '长街',
  desc =  [[这是平定州内的一条长街，路上人来人往，热闹非凡。因为此地和日月教总坛黑木崖相去不远，所以城中有颇多教众来往。再往北走就出平定州了。]],
  exit = {
    s = { to = '平定州长街#C', },
    n = { to = '平定州北门', },
  },
},

['平定州西门'] = {
  id = '平定州西门',
  area = '平定州',
  name = '西门',
  desc =  [[这里是平定州的西城门，再往东就是平定州城内了，一条长街直通过来。西边是一条通往恒山的干道。]],
  exit = {
    w = { to = '平定州土路#1W', },
    e = { to = '平定州长街#W', },
  },
},

['平定州土路#2E'] = {
  id = '平定州土路#2E',
  area = '平定州',
  name = '土路',
  desc =  [[这是一条去黑木崖的必经之路，路上不断有人骑马经过，掀起了阵阵黄沙，伸手难见五指。]],
  exit = {
    e = { to = '平定州土路#3E', },
    wd = { to = '平定州土路#1E', },
  },
},

['平定州土路#1E'] = {
  id = '平定州土路#1E',
  area = '平定州',
  name = '土路',
  desc =  [[这是一条去黑木崖的必经之路，路上黄沙弥漫。你努力向西边望去，发现有一座小城，那就是日月神教管辖的平定州了。]],
  exit = {
    w = { to = '平定州东门', },
    eu = { to = '平定州土路#2E', },
  },
},

['平定州土路#1N'] = {
  id = '平定州土路#1N',
  area = '平定州',
  name = '土路',
  desc =  [[这是一条去黑木崖的必经之路，路上黄沙弥漫。南边是平定州的北城门，北边不远处有一个浅滩。]],
  exit = {
    nw = { to = '平定州土路#2N', },
    s = { to = '平定州北门', },
  },
},

['平定州小吃店'] = {
  id = '平定州小吃店',
  area = '平定州',
  name = '小吃店',
  desc =  [[这是一家小店，生意倒是挺兴隆的，座位坐得满满的，还有些人在站着等座。看来多等也是无益，不如买点包子、鸡腿、烤鸭、米酒赶路吧。]],
  exit = {
    n = { to = '平定州长街#S', },
  },
},

['平定州土路#2N'] = {
  id = '平定州土路#2N',
  area = '平定州',
  name = '土路',
  desc =  [[这是一条去黑木崖的必经之路，路上黄沙弥漫。北边不远处有不少行人在接受日月神教教众的盘查。]],
  exit = {
    nw = { to = '黑木崖石道#1', },
    se = { to = '平定州土路#1N', },
  },
},

['平定州长街#W'] = {
  id = '平定州长街#W',
  area = '平定州',
  name = '长街',
  desc =  [[这是平定州内的一条长街，路上人来人往，热闹非凡。因为此地和日月教总坛黑木崖相去不远，所以城中有颇多教众来往。东边是平定州郊外。]],
  exit = {
    w = { to = '平定州西门', },
    e = { to = '平定州长街#S', },
  },
},

['平定州长街#E'] = {
  id = '平定州长街#E',
  area = '平定州',
  name = '长街',
  desc =  [[这是平定州内的一条长街，路上人来人往，热闹非凡。因为此地和日月教总坛黑木崖相去不远，所以城中有颇多教众来往。东边是平定州郊外。]],
  exit = {
    w = { to = '平定州长街#C', },
    e = { to = '平定州东门', },
  },
},

['平定州土路#4E'] = {
  id = '平定州土路#4E',
  area = '平定州',
  name = '土路',
  desc =  [[这是一条去黑木崖的必经之路。路上不断有人骑马经过，掀起阵阵黄沙，行人伸手难见五指。往西北方向可达平定州，东边则通往沧州。]],
  exit = {
    nw = { to = '平定州土路#3E', },
    e = { to = '沧州城路口', },
  },
},

['平定州土路#3E'] = {
  id = '平定州土路#3E',
  area = '平定州',
  name = '土路',
  desc =  [[这是一条去黑木崖的必经之路，路上不断有人骑马经过，掀起了阵阵黄沙，伸手难见五指。]],
  exit = {
    w = { to = '平定州土路#2E', },
    se = { to = '平定州土路#4E', },
  },
},

['平定州土路#1W'] = {
  id = '平定州土路#1W',
  area = '平定州',
  name = '土路',
  desc =  [[这是一条去黑木崖的必经之路，路上黄沙弥漫。你努力向东边望去，发现有一座小城，那就是日月神教管辖的平定州了。]],
  exit = {
    e = { to = '平定州西门', },
    wd = { to = '平定州土路#2W', },
  },
},

['平定州客房#1'] = {
  id = '平定州客房#1',
  area = '平定州',
  name = '客房',
  desc =  [[这是一间已经被人包下的客房，里面有一名看起来似乎心事重重的女子坐在火盆旁，火盆里的熊熊火光映在她的脸上，更增娇艳。]],
  exit = {
    s = { to = '平定州平定客店', },
  },
},

['平定州客房#2'] = {
  id = '平定州客房#2',
  area = '平定州',
  name = '客房',
  desc =  [[这是一间很大的客房，陈设十分简陋。靠墙放了十几张小木床，不少客人正和衣而卧，满屋子都是呼呼的打酣声。西边有张床是空的，你蹑手蹑脚地走了过去。]],
  exit = {
    out = { to = '平定州二楼走廊', },
  },
},

['平定州长街#S'] = {
  id = '平定州长街#S',
  area = '平定州',
  name = '长街',
  desc =  [[这是平定州内的一条长街，路上人来人往，热闹非凡。因为此地和日月教总坛黑木崖相去不远，所以城中有颇多教众来往。南边是一个小吃店，里面有不少食客在喝酒猜拳。]],
  exit = {
    ne = { to = '平定州长街#C', },
    w = { to = '平定州长街#W', },
    s = { to = '平定州小吃店', },
  },
},

['平定州东门'] = {
  id = '平定州东门',
  area = '平定州',
  name = '东门',
  desc =  [[这里是平定州的东城门，再往西就是平定州城内了，一条长街直通过来。东边是一条通往东面的干道。]],
  exit = {
    w = { to = '平定州长街#E', },
    e = { to = '平定州土路#1E', },
  },
},

['平定州二楼走廊'] = {
  id = '平定州二楼走廊',
  area = '平定州',
  name = '二楼走廊',
  desc =  [[你正走在客店二楼的走廊上，可以听到从客房里不时地呼呼的打酣声，一阵高过一阵。不时有睡意朦胧的旅客进进出出，到楼下的掌柜处付了钱再上来睡觉。]],
  exit = {
    enter = { to = '平定州客房#2', },
    d = { to = '平定州平定客店', },
  },
},

['平定州土路#3W'] = {
  id = '平定州土路#3W',
  area = '平定州',
  name = '土路',
  desc =  [[这是一条去黑木崖的必经之路，路上不断有人骑马经过，掀起了阵阵黄沙，伸手难见五指。]],
  exit = {
    ne = { to = '平定州土路#2W', },
    w = { to = '长安城大道#2N', },
  },
},

['平定州药铺'] = {
  id = '平定州药铺',
  area = '平定州',
  name = '药铺',
  desc =  [[这是一家药铺，一股浓浓的药味让你几欲窒息，那是从药柜上的几百个小抽屉里散发出来的。药铺老板坐在茶几旁，独自喝着茶。一名小伙计站在柜台后招呼着顾客。]],
  exit = {
    e = { to = '平定州长街#C', },
  },
},

['平定州长街#C'] = {
  id = '平定州长街#C',
  area = '平定州',
  name = '长街',
  desc =  [[这是平定州内的一条长街，路上人来人往，热闹非凡。因为此地和日月教总坛黑木崖相去不远，所以城中有颇多教众来往。西边有一家药铺，不断飘出一股浓烈的药味。东边是平定客店，客店门口站着几个日月神教的教众，在盘查来往客商。]],
  exit = {
    se = { to = '平定州平定客店', },
    e = { to = '平定州长街#E', },
    sw = { to = '平定州长街#S', },
    w = { to = '平定州药铺', },
    n = { to = '平定州长街#N', },
  },
},

['平定州北门'] = {
  id = '平定州北门',
  area = '平定州',
  name = '北门',
  desc =  [[这里是平定州的北城门，再往南走就是平定州城内了，一条长街直通过来。北边是一条通往黑木崖的土路，除了一些教众在那里走动外，基本看不见别的人了。]],
  exit = {
    s = { to = '平定州长街#N', },
    n = { to = '平定州土路#1N', },
  },
},

['平定州土路#2W'] = {
  id = '平定州土路#2W',
  area = '平定州',
  name = '土路',
  desc =  [[这是一条去黑木崖的必经之路，路上不断有人骑马经过，掀起了阵阵黄沙，伸手难见五指。]],
  exit = {
    sw = { to = '平定州土路#3W', },
    eu = { to = '平定州土路#1W', },
  },
},

['长安城西城墙#2N'] = {
  id = '长安城西城墙#2N',
  area = '长安城',
  name = '西城墙',
  desc =  [[丈许宽的城墙又高又厚，给人一种安全的感觉。整个城墙是用石灰、土和糯米汁混合砌成，而且上面布满了垛口作了望、射击之用。城墙上，可清晰看到墙外护城河对面的一举一动。]],
  exit = {
    s = { to = '长安城西城墙#1N', },
    n = { to = '长安城了望台#NW', },
  },
},

['长安城内街#1W'] = {
  id = '长安城内街#1W',
  area = '长安城',
  name = '内街',
  desc =  [[这是是长安城的居民区，住的都是平常百姓，所以和那些大街比起来，这里就不那么整洁了。店铺也都是小小门面，比邻而立，但见人来人往、川流不息，依然一片繁华的景象。南面是一家小酒馆。]],
  exit = {
    e = { to = '长安城北大街#3', },
    s = { to = '长安城酒馆', },
    w = { to = '长安城市集', },
    n = { to = '长安城民居#1W', },
  },
},

['长安城兵器铺'] = {
  id = '长安城兵器铺',
  area = '长安城',
  name = '兵器铺',
  desc =  [[这是一家由城中虎威镖局开办的兵器铺。店里到处银光闪闪，让人眼花缭乱。兵器架上摆着各种兵器，十八般武器是应有尽有，样样俱全。柜台后面站着一位神态严肃的壮汉，据说曾是镖局中身手不凡的一位镖师，因在护送一次重要的镖队中失手，被总镖头周虎威扁到这里卖起了兵器。]],
  exit = {
    w = { to = '长安城南大街#2', },
  },
},

['长安城陕晋渡口#S'] = {
  id = '长安城陕晋渡口#S',
  area = '长安城',
  name = '陕晋渡口',
  desc =  [[这里是黄河大渡口，是通往晋西的必经之路。宽阔的黄河江面上飘荡着几只轻帆。渡口处正停着一艘渡船，几个乘客正在和船家讨论价钱。你可以由此上(yell)船渡过黄河。]],
  exit = {
    enter = { to = '长安城渡船', cmd = 'duhe', unstable = true, handler = 'fly_across', no_wander = true, },
    s = { to = '长安城土路#5', },
    se = { to = '黄河流域黄土高原', },
  },
},

['长安城当铺'] = {
  id = '长安城当铺',
  area = '长安城',
  name = '当铺',
  desc =  [[这是一家素以买卖公平著称的老字号当铺，一个四尺高的柜台摆在你的面前，柜台上摆着一个牌子(paizi)， 柜台后坐着当铺的老板，一双鬼溜溜的眼睛上上下下打量着你。]],
  exit = {
    w = { to = '长安城南大街#1', },
  },
},

['长安城温泉'] = {
  id = '长安城温泉',
  area = '长安城',
  name = '温泉',
  desc =  [[走到这里，一股热气腾腾的白雾将你团团围住，你已经来到了温泉边。泉中清水碧波荡漾，异常清澈，水面雾气缭绕。相传在此温泉浴后，白发变黑，返老还童。有许多人正在里面闭目坐浴。]],
  exit = {
    w = { to = '长安城柏树林#2', },
  },
},

['长安城大道#1'] = {
  id = '长安城大道#1',
  area = '长安城',
  name = '大道',
  desc =  [[这是一条尘土飞扬的大道，道路很宽，足可容得下十马并驰。四周人来人往，熙熙攘攘，非常热闹。南边远远望过去可以看得到巍峨的长安城墙。]],
  exit = {
    ne = { to = '长安城土路#1', },
    s = { to = '长安城官道#2N', },
  },
},

['长安城市集'] = {
  id = '长安城市集',
  area = '长安城',
  name = '市集',
  desc =  [[走到内街的尽头，是一个热闹非凡的市集，里面叫卖声、砍价声、说笑声乱做一团。市集里面人挤人，地上扔满了烂菜叶等脏物，根本无从下脚。有两名巡捕在市集里面仔细的巡视，防止有人在这里贩卖私盐。]],
  exit = {
    e = { to = '长安城内街#1W', },
    s = { to = '长安城民居#3W', },
    w = { to = '长安城黑市', },
    n = { to = '长安城民居#2W', },
  },
},

['长安城清池'] = {
  id = '长安城清池',
  area = '长安城',
  name = '清池',
  desc =  [[这里是长安城的清池。地板是上好的檀香木，光滑而略带潮湿。四面的墙壁挂满了风干的花环，散发出醉人的香气。几个如花似玉的小丫环正在忙碌，望向窗外，一个巨大的青铜缸架在烈火上，丫环们正在慢慢的加入清泉水。]],
  exit = {
    e = { to = '长安城凤池', no_wander = true, },
    w = { to = '长安城龙池', no_wander = true, },
    n = { to = '长安城东大街#2', },
  },
},

['长安城土路#4'] = {
  id = '长安城土路#4',
  area = '长安城',
  name = '土路',
  desc =  [[这是一条黄土飞扬的路，不算太宽，路上几乎没有行人，给人一种落寞的感觉，路边零零散散的分布着几片小田地，偶然也能看得见一些炊烟。四周一片的荒寂。]],
  exit = {
    ne = { to = '长安城土路#5', },
    su = { to = '长安城土路#3', },
  },
},

['长安城兵营大门'] = {
  id = '长安城兵营大门',
  area = '长安城',
  name = '兵营大门',
  desc =  [[这里是长安城临街而建的兵营，距离长安的东城门只有几步之遥。兵营门口旌旗飘扬，守门的兵士不动声色地寻视着四周。兵营里面到处都有官兵来回走动，有两名武将正在指挥士兵操练，不时地传来呐喊声。老百姓是不允许在此观看的，你最好赶快走开。]],
  exit = {
    s = { to = '长安城兵营', },
    n = { to = '长安城东大街#4', },
  },
},

['长安城内街#5'] = {
  id = '长安城内街#5',
  area = '长安城',
  name = '内街',
  desc =  [[这是是长安城的居民区，住的都是平常百姓，所以和那些大街比起来，这里就不那么整洁了。店铺也都是小小门面，比邻而立，但见人来人往、川流不息，依然一片繁华的景象。南面有一扇虚掩的木门，几个半大孩子趴门向里面偷看着什么。]],
  exit = {
    e = { to = '长安城内街#4', },
    s = { to = '长安城土嫖馆', },
    w = { to = '长安城内街#6', },
    n = { to = '长安城民居#2E', },
  },
},

['长安城南城墙#1E'] = {
  id = '长安城南城墙#1E',
  area = '长安城',
  name = '南城墙',
  desc =  [[丈许宽的城墙又高又厚，给人一种安全的感觉。整个城墙是用石灰、土和糯米汁混合砌成，而且上面布满了垛口作了望、射击之用。城墙上，可清晰看到墙外护城河对面的一举一动。]],
  exit = {
    w = { to = '长安城箭楼#SE', },
    e = { to = '长安城南城墙#2E', },
  },
},

['长安城大道#2N'] = {
  id = '长安城大道#2N',
  area = '长安城',
  name = '大道',
  desc =  [[这是一条由青石铺成的大道，东面一座孤城耸立在茫茫荒野之上，那便是由黑木教控制的平定州，再往北前进就是北岳恒山了。]],
  exit = {
    e = { to = '平定州土路#3W', },
    s = { to = '长安城大道#1N', },
    nu = { to = '恒山金龙峡', },
  },
},

['长安城柏树林#2'] = {
  id = '长安城柏树林#2',
  area = '长安城',
  name = '柏树林',
  desc =  [[这是一片郁郁葱葱的柏树林。浓密宽厚的树叶遮蔽了日月星辰，使人分不出昼夜。四下如死一般的寂静，只有风吹过树梢的沙沙之声。走到这里，你努力的辨认着四周的方向，寻找出去的路。]],
  exit = {
    ne = { to = '长安城始皇陵', cost = 25, handler = 'go_straight', },
    ne2 = { to = '长安城柏树林#2', },
    e = { to = '长安城温泉', cost = 25, handler = 'go_straight', },
    e2 = { to = '长安城柏树林#2', },
    w = { to = '长安城长街#2', cost = 25, handler = 'go_straight', },
    w2 = { to = '长安城柏树林#2', },
    nw = { to = '长安城柏树林#1', cost = 25, handler = 'go_straight', },
    nw2 = { to = '长安城柏树林#2', },
  },
},

['长安城安定门'] = {
  id = '长安城安定门',
  area = '长安城',
  name = '安定门',
  desc =  [[这里是长安城的西城门。护城河既深又阔，而且城高墙厚，有一夫当关，万夫莫开之势。仰望城楼，只见城楼高处满布哨兵，戒备森严。城墙上贴着官府的告示(gaoshi)，官兵们正在认真地检查每一个过往的行人。]],
  exit = {
    u = { to = '长安城西门城楼', },
    w = { to = '长安城官道#1W', },
    e = { to = '长安城西大街#4', },
  },
},

['长安城东大街#4'] = {
  id = '长安城东大街#4',
  area = '长安城',
  name = '东大街',
  desc =  [[这是一条宽阔的青石街道，向东西两头延伸。东边是东城门通向城外。西边则是城中心的钟楼。南边是长安城的兵营，门口有官兵在站岗放哨。北面是一条内街，平常百姓家都住在里面。]],
  exit = {
    e = { to = '长安城长乐门', },
    s = { to = '长安城兵营大门', },
    w = { to = '长安城东大街#3', },
    n = { to = '长安城内街#1', },
  },
},

['长安城聚豪客栈'] = {
  id = '长安城聚豪客栈',
  area = '长安城',
  name = '聚豪客栈',
  desc =  [[这是长安城里的聚豪客栈，老板是城中的首富李员外，街对面的酒楼也是他开的。外地游客大多选择这里落脚，江湖人物更是把这里当成聚会碰头的场所，不时有江湖豪客进进出出。店小二里里外外忙得团团转，接待着南腔北调的客人。客栈正面的墙上挂着一块醒目的牌子(paizi)。]],
  exit = {
    u = { to = '长安城走廊', no_wander = true, },
    e = { to = '长安城北大街#1', },
  },
},

['长安城南大街#3'] = {
  id = '长安城南大街#3',
  area = '长安城',
  name = '南大街',
  desc =  [[这是一条宽阔的青石街道，向南北两头延伸。南边是南城门通向城外。北边则是城中心的钟楼。西边是城中的镜湖，景色十分优美。东边是一条长长的街，一眼望不到头，不知道通向哪里。]],
  exit = {
    e = { to = '长安城长街#1', },
    s = { to = '长安城永宁门', },
    w = { to = '长安城镜湖', },
    n = { to = '长安城南大街#2', },
  },
},

['长安城鼓楼'] = {
  id = '长安城鼓楼',
  area = '长安城',
  name = '鼓楼',
  desc =  [[这里是长安城的鼓楼。楼上置一大鼓，击鼓报时，故称鼓楼。与东南方向的钟楼遥相呼应，晨钟暮鼓，昭示祥和。青砖灰瓦的鼓楼重檐斗拱，攒顶高耸，屋檐微翘，华丽庄严，在四周建筑的映衬下显得十分雄伟庄严。]],
  exit = {
    s = { to = '长安城西大街#1', },
    se = { to = '长安城钟楼', },
  },
},

['长安城西门城楼'] = {
  id = '长安城西门城楼',
  area = '长安城',
  name = '西门城楼',
  desc =  [[西门上的城楼，呈正方形，与左右两侧的箭楼共同组成西安定门。往下望是出城进城川流不息的人群。城中的房屋连绵不断，在这里还可以依稀的看到城中心的钟楼。城楼上有流动的岗哨，严密监守着城周围一切动态。]],
  exit = {
    d = { to = '长安城安定门', },
    s = { to = '长安城箭楼#WS', },
    n = { to = '长安城箭楼#WN', },
  },
},

['长安城东大街#3'] = {
  id = '长安城东大街#3',
  area = '长安城',
  name = '东大街',
  desc =  [[这是一条宽阔的青石街道，向东西两头延伸。东边是东城门通向城外。西边则是城中心的钟楼。南边是一家花店，门口摆着很多五彩缤纷的花篮，北边是一家水果店。走到这里你便可闻到一种幽香，但根本分不清是果香还是花香。]],
  exit = {
    e = { to = '长安城东大街#4', },
    s = { to = '长安城花店', },
    w = { to = '长安城东大街#2', },
    n = { to = '长安城水果店', },
  },
},

['长安城蔡邕墓'] = {
  id = '长安城蔡邕墓',
  area = '长安城',
  name = '蔡邕墓',
  desc =  [[蔡邕死后葬于此地，他是东汉末年人士，不知是否保存有那些自晋以后就失传了的古物。]],
  exit = {
    s = { to = '长安城蔡邕庄', },
  },
},

['长安城南城墙#3E'] = {
  id = '长安城南城墙#3E',
  area = '长安城',
  name = '南城墙',
  desc =  [[丈许宽的城墙又高又厚，给人一种安全的感觉。整个城墙是用石灰、土和糯米汁混合砌成，而且上面布满了垛口作了望、射击之用。城墙上，可清晰看到墙外护城河对面的一举一动。]],
  exit = {
    w = { to = '长安城南城墙#2E', },
    e = { to = '长安城了望台#SE', },
  },
},

['长安城官道#1W'] = {
  id = '长安城官道#1W',
  area = '长安城',
  name = '官道',
  desc =  [[这是一条宽阔笔直的官道，足可容得下十马并驰。四周人来人往。挑担子的行商，赶着大车的马夫，上京赶考的书生，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。道路两旁是整整齐齐的杨树林。东面已可以隐隐看到长安城的西城门了。]],
  exit = {
    w = { to = '长安城官道#2W', },
    e = { to = '长安城安定门', },
  },
},

['长安城大道#1N'] = {
  id = '长安城大道#1N',
  area = '长安城',
  name = '大道',
  desc =  [[这是一条由青石铺成的大道，南方可通向著名的长安城了，向北方走便接近北岳恒山了。]],
  exit = {
    s = { to = '长安城陕晋渡口#N', },
    n = { to = '长安城大道#2N', },
  },
},

['长安城西大街#1'] = {
  id = '长安城西大街#1',
  area = '长安城',
  name = '西大街',
  desc =  [[这是一条宽阔的青石街道，向东西两头延伸。西边是西城门通向城外。东边则是城中心的钟楼。南边是一家富丽堂皇的珠宝店，出来进去的都是有头有脸的富商。北边高高耸立的建筑便是长安城的鼓楼。]],
  exit = {
    e = { to = '长安城钟楼', },
    s = { to = '长安城珠宝行', },
    w = { to = '长安城西大街#2', },
    n = { to = '长安城鼓楼', },
  },
},

['长安城北城墙#3E'] = {
  id = '长安城北城墙#3E',
  area = '长安城',
  name = '北城墙',
  desc =  [[丈许宽的城墙又高又厚，给人一种安全的感觉。整个城墙是用石灰、土和糯米汁混合砌成，而且上面布满了垛口作了望、射击之用。城墙上，可清晰看到墙外护城河对面的一举一动。]],
  exit = {
    w = { to = '长安城北城墙#2E', },
    e = { to = '长安城了望台#NE', },
  },
},

['长安城民居#3E'] = {
  id = '长安城民居#3E',
  area = '长安城',
  name = '民居',
  desc =  [[这里是一家民居住房，窗台上放着大大小的小陶盆瓷罐，里面种着花草之类的东西，两扇窗子大开，飘出一股花草的清香味。民居里十分热闹，一张大木桌子，周围放着几把椅子，几个邻里凑在一起，不知在谈什么。]],
  exit = {
    s = { to = '长安城内街#4', },
  },
},

['长安城箭楼#EN'] = {
  id = '长安城箭楼#EN',
  area = '长安城',
  name = '箭楼',
  desc =  [[东门两侧负责保护城门的军事堡垒，与中间的城楼共同组成东长乐门。除面向城内的西侧外，东、南、北侧都开设了许多箭窗，作为守城时对外的射击孔，还便于观察敌情，作战时可以三面杀敌。]],
  exit = {
    s = { to = '长安城东门城楼', },
    n = { to = '长安城东城墙#1N', },
  },
},

['长安城兵马俑坑#2'] = {
  id = '长安城兵马俑坑#2',
  area = '长安城',
  name = '兵马俑坑',
  desc =  [[你来到一个巨大的兵马俑阵中，成千上万个兵马俑排列成几十路纵队，有将军俑、武官俑、战袍俑、铠甲俑、跪射俑、立射俑、御手俑等等，俑像造型生动，服饰神态多具特色，栩栩如生。仿佛正在从四面八方呼啸而来，你不禁被这个宏伟的场面惊倒。]],
  exit = {
    s = { to = '长安城始皇陵', },
  },
},

['长安城慈恩寺'] = {
  id = '长安城慈恩寺',
  area = '长安城',
  name = '慈恩寺',
  desc =  [[你来到慈恩寺，高大的寺门挺立，门两旁还立了两个大石狮子。据说门上的横匾还是出自皇上的御笔。寺院内的大雁塔高高耸立。七层突兀于灵空，甚是壮观。寺内古柏森森，绿阴成片，左右钟鼓楼遥遥相对。院内有两组石碑群，为一些著名进士所题刻。]],
  exit = {
    nw = { to = '长安城长街#2', },
    e = { to = '长安城大雁塔', },
  },
},

['长安城清真寺'] = {
  id = '长安城清真寺',
  area = '长安城',
  name = '清真寺',
  desc =  [[这里是长安城内的清真寺，因其位于鼓楼西北的化觉巷内，故又称化觉巷清真大寺，是长安规模最大的伊斯兰教寺院。寺中一非常醒目的大牌楼，精镂细雕，飞檐翘角，刻着“敕赐礼拜寺”，颇为壮观。]],
  exit = {
    s = { to = '长安城西大街#4', },
    n = { to = '长安城大殿', },
  },
},

['长安城凉亭'] = {
  id = '长安城凉亭',
  area = '长安城',
  name = '凉亭',
  desc =  [[凉亭造得颇为精致，中间一石桌，桌上刻着横十九，纵十九的一张棋盘，残局还未撤去。清晨来这里读书，夕阳西下时品茗谈天，当是人生一大快事。]],
  exit = {
    e = { to = '长安城后花园', },
  },
},

['长安城后花园'] = {
  id = '长安城后花园',
  area = '长安城',
  name = '后花园',
  desc =  [[一个小花园，虽然比不上富豪大院里的万紫千红，但也布置得精致可人。将军府里显然不乏高雅之士。春天里桃花盛开，夏日池塘里荷花田田，秋天里菊花争艳，冬天则是一片香雪海。]],
  exit = {
    w = { to = '长安城凉亭', },
    n = { to = '长安城后门', },
  },
},

['长安城永宁门'] = {
  id = '长安城永宁门',
  area = '长安城',
  name = '永宁门',
  desc =  [[这里是长安城的南城门。护城河既深又阔，而且城高墙厚，有一夫当关，万夫莫开之势。仰望城楼，只见城楼高处满布哨兵，戒备森严。城墙上贴着官府的告示(gaoshi)，官兵们正在认真地检查每一个过往的行人。]],
  exit = {
    u = { to = '长安城南门城楼', },
    s = { to = '长安城官道#1S', },
    n = { to = '长安城南大街#3', },
  },
},

['长安城酒馆'] = {
  id = '长安城酒馆',
  area = '长安城',
  name = '酒馆',
  desc =  [[这是长安城居民区里的一家小酒馆。屋子并不是很宽敞，但酒水是长安城里最廉价的，正适合居民区里的普通百姓，生意很是不错。老板原也是城中的居民，今天不知与何人喝得酩酊大醉，连买卖也不管了。]],
  exit = {
    n = { to = '长安城内街#1W', },
  },
},

['长安城酒楼二楼'] = {
  id = '长安城酒楼二楼',
  area = '长安城',
  name = '酒楼二楼',
  desc =  [[这里是聚豪酒楼的二楼，大堂内宽敞明亮，墙上挂满了文人学士的字画。聚豪酒楼生意红火，平时便高朋满座，一到节日更要提前来定下酒席。站在楼上眺望，只觉得心旷神怡。]],
  exit = {
    d = { to = '长安城聚豪酒楼', },
  },
},

['长安城北大街#1'] = {
  id = '长安城北大街#1',
  area = '长安城',
  name = '北大街',
  desc =  [[这是一条宽阔的青石街道，向南北两头延伸。北边是北城门通向城外。南边则是城中心的钟楼。东边是一座两层的楼阁，门额上悬挂着一方横匾，“聚豪酒楼”四字擦得闪闪发亮。西边是一家与酒楼同名的客栈。]],
  exit = {
    e = { to = '长安城聚豪酒楼', },
    s = { to = '长安城钟楼', },
    w = { to = '长安城聚豪客栈', },
    n = { to = '长安城北大街#2', },
  },
},

['长安城长街#1'] = {
  id = '长安城长街#1',
  area = '长安城',
  name = '长街',
  desc =  [[这是一条长长的街，一眼望不到头，不知道通向哪里。]],
  exit = {
    w = { to = '长安城南大街#3', cost = 8, handler = 'go_straight', },
    w2 = { to = '长安城长街#1', },
    e = { to = '长安城长街#2', cost = 8, handler = 'go_straight', },
    e2 = { to = '长安城长街#1', },
  },
},

['长安城了望台#NW'] = {
  id = '长安城了望台#NW',
  area = '长安城',
  name = '了望台',
  desc =  [[守城的重要哨岗。中间有一个巨大的烟炉，里面装满了狼粪，一侧挂着一口铜钟，每当有紧急情况，守城卫兵就放狼烟、鸣钟为警，调动官兵，以备外族来犯。几名值勤的岗哨仔细的观察着城外的动静。]],
  exit = {
    e = { to = '长安城北城墙#3W', },
    s = { to = '长安城西城墙#2N', },
  },
},

['长安城后门'] = {
  id = '长安城后门',
  area = '长安城',
  name = '后门',
  desc =  [[这里是将军府的后门。再往里走就是后花园了，还没进门，你便闻到一股淡淡的花香。]],
  exit = {
    s = { to = '长安城后花园', },
    n = { to = '长安城正厅#1', },
  },
},

['长安城西城墙#1N'] = {
  id = '长安城西城墙#1N',
  area = '长安城',
  name = '西城墙',
  desc =  [[丈许宽的城墙又高又厚，给人一种安全的感觉。整个城墙是用石灰、土和糯米汁混合砌成，而且上面布满了垛口作了望、射击之用。城墙上，可清晰看到墙外护城河对面的一举一动。]],
  exit = {
    s = { to = '长安城箭楼#WN', },
    n = { to = '长安城西城墙#2N', },
  },
},

['长安城南大街#2'] = {
  id = '长安城南大街#2',
  area = '长安城',
  name = '南大街',
  desc =  [[这是一条宽阔的青石街道，向南北两头延伸。南边是南城门通向城外。北边则是城中心的钟楼。东边一家兵器铺，从里面出来的人个个手里拎个家伙，那刀光剑影很是让人心惊胆颤。西边的德文堂则不同，出来进去的都是长安城中的风流才子。]],
  exit = {
    e = { to = '长安城兵器铺', },
    s = { to = '长安城南大街#3', },
    w = { to = '长安城德文堂', },
    n = { to = '长安城南大街#1', },
  },
},

['长安城东城墙#2N'] = {
  id = '长安城东城墙#2N',
  area = '长安城',
  name = '东城墙',
  desc =  [[丈许宽的城墙又高又厚，给人一种安全的感觉。整个城墙是用石灰、土和糯米汁混合砌成，而且上面布满了垛口作了望、射击之用。城墙上，可清晰看到墙外护城河对面的一举一动。]],
  exit = {
    s = { to = '长安城东城墙#1N', },
    n = { to = '长安城了望台#NE', },
  },
},

['长安城大雁塔'] = {
  id = '长安城大雁塔',
  area = '长安城',
  name = '大雁塔',
  desc =  [[大雁塔为一座七层方形塔，塔身为青砖砌成，这种楼阁式砖塔，造型简洁庄严神秘，气势雄伟。底座宽大有门，门楣上有石刻画。大雁塔内结构精洁宽敞，塔内布置精美，给人以清静肃穆之感。四周开有龛窗，塔内有楼梯直通上下。]],
  exit = {
    u = { to = '长安城大雁塔二层', },
    w = { to = '长安城慈恩寺', },
  },
},

['长安城大雁塔五层'] = {
  id = '长安城大雁塔五层',
  area = '长安城',
  name = '大雁塔五层',
  desc =  [[大雁塔内结构精洁宽敞，塔内布置精美，给人以清静肃穆之感。四周开有龛窗，塔内有楼梯直通上下。这里似乎是非同寻常的场所。]],
  exit = {
    u = { to = '长安城大雁塔六层', },
    d = { to = '长安城大雁塔四层', },
  },
},

['长安城小雁塔十一层'] = {
  id = '长安城小雁塔十一层',
  area = '长安城',
  name = '小雁塔十一层',
  desc =  [[小雁塔是一座典型的密檐式砖构佛塔，塔形秀丽，从底下向上看去，庄严而玲珑，塔身檐角密布，一共有十五层之高，与东边的大雁塔遥遥相望。塔内气氛静而神秘，光线有些昏暗朦胧。四周墙壁上有数盏龛灯，周围绘有彩色壁画。塔内有楼梯供人上下，从龛形门窗可以纵目远眺。]],
  exit = {
    u = { to = '长安城小雁塔十二层', },
    d = { to = '长安城小雁塔十层', },
  },
},

['长安城官道#1E'] = {
  id = '长安城官道#1E',
  area = '长安城',
  name = '官道',
  desc =  [[这是一条宽阔笔直的官道，足可容得下十马并驰。四周人来人往。挑担子的行商，赶着大车的马夫，上京赶考的书生，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。道路两旁是整整齐齐的杨树林。西面已可以隐隐看到长安城的东城门了。]],
  exit = {
    w = { to = '长安城长乐门', },
    e = { to = '长安城官道#2E', },
  },
},

['长安城长街#2'] = {
  id = '长安城长街#2',
  area = '长安城',
  name = '长街',
  desc =  [[终于走到了长街的尽头，东面是一片茂密的柏树林，里面阴森森的。南边可看到寺院，隐约一个塔影闪在寺后。]],
  exit = {
    ne = { to = '长安城柏树林#1', },
    e = { to = '长安城柏树林#2', },
    w = { to = '长安城长街#1', },
    se = { to = '长安城慈恩寺', },
  },
},

['长安城小雁塔十层'] = {
  id = '长安城小雁塔十层',
  area = '长安城',
  name = '小雁塔十层',
  desc =  [[小雁塔是一座典型的密檐式砖构佛塔，塔形秀丽，从底下向上看去，庄严而玲珑，塔身檐角密布，一共有十五层之高，与东边的大雁塔遥遥相望。塔内气氛静而神秘，光线有些昏暗朦胧。四周墙壁上有数盏龛灯，周围绘有彩色壁画。塔内有楼梯供人上下，从龛形门窗可以纵目远眺。]],
  exit = {
    u = { to = '长安城小雁塔十一层', },
    d = { to = '长安城小雁塔九层', },
  },
},

['长安城南城墙#3W'] = {
  id = '长安城南城墙#3W',
  area = '长安城',
  name = '南城墙',
  desc =  [[丈许宽的城墙又高又厚，给人一种安全的感觉。整个城墙是用石灰、土和糯米汁混合砌成，而且上面布满了垛口作了望、射击之用。城墙上，可清晰看到墙外护城河对面的一举一动。]],
  exit = {
    w = { to = '长安城了望台#SW', },
    e = { to = '长安城南城墙#2W', },
  },
},

['长安城小雁塔五层'] = {
  id = '长安城小雁塔五层',
  area = '长安城',
  name = '小雁塔五层',
  desc =  [[小雁塔是一座典型的密檐式砖构佛塔，塔形秀丽，从底下向上看去，庄严而玲珑，塔身檐角密布，一共有十五层之高，与东边的大雁塔遥遥相望。塔内气氛静而神秘，光线有些昏暗朦胧。四周墙壁上有数盏龛灯，周围绘有彩色壁画。塔内有楼梯供人上下，从龛形门窗可以纵目远眺。]],
  exit = {
    u = { to = '长安城小雁塔六层', },
    d = { to = '长安城小雁塔四层', },
  },
},

['长安城蔡邕庄'] = {
  id = '长安城蔡邕庄',
  area = '长安城',
  name = '蔡邕庄',
  desc =  [[这里以前曾是汉末名人蔡邕所居的庄院，其女蔡文姬亦曾居于此。曹操拒蜀时曾拜访过这里，如今事过境迁，早已物是而人非了。]],
  exit = {
    e = { to = '长安城官道#3S', },
    n = { to = '长安城蔡邕墓', },
  },
},

['长安城小雁塔九层'] = {
  id = '长安城小雁塔九层',
  area = '长安城',
  name = '小雁塔九层',
  desc =  [[小雁塔是一座典型的密檐式砖构佛塔，塔形秀丽，从底下向上看去，庄严而玲珑，塔身檐角密布，一共有十五层之高，与东边的大雁塔遥遥相望。塔内气氛静而神秘，光线有些昏暗朦胧。四周墙壁上有数盏龛灯，周围绘有彩色壁画。塔内有楼梯供人上下，从龛形门窗可以纵目远眺。]],
  exit = {
    u = { to = '长安城小雁塔十层', },
    d = { to = '长安城小雁塔八层', },
  },
},

['长安城德文堂'] = {
  id = '长安城德文堂',
  area = '长安城',
  name = '德文堂',
  desc =  [[德文堂乃是一家书局。大堂里摆了一排排的书柜，书架上整整齐齐地放着一些卷轴，堂内还悬挂着几盆花花草草，红绿相间，疏密有致，令人赏心悦目。这里不但有风骚文人喜欢的诗词，还有些粗浅的功夫书，供城中居民练来强身健体。]],
  exit = {
    e = { to = '长安城南大街#2', },
  },
},

['长安城西大街#4'] = {
  id = '长安城西大街#4',
  area = '长安城',
  name = '西大街',
  desc =  [[这是一条宽阔的青石街道，向东西两头延伸。西边是西城门通向城外。东边则是城中心的钟楼。北边是清真寺，南边则是城隍庙，里面香烟缭绕，善男信女们进进出出，颇为喧闹。]],
  exit = {
    e = { to = '长安城西大街#3', },
    s = { to = '长安城城隍庙', },
    w = { to = '长安城安定门', },
    n = { to = '长安城清真寺', },
  },
},

['长安城大雁塔三层'] = {
  id = '长安城大雁塔三层',
  area = '长安城',
  name = '大雁塔三层',
  desc =  [[大雁塔内结构精洁宽敞，塔内布置精美，给人以清静肃穆之感。四周开有龛窗，塔内有楼梯直通上下。这里似乎是非同寻常的场所。]],
  exit = {
    u = { to = '长安城大雁塔四层', },
    d = { to = '长安城大雁塔二层', },
  },
},

['长安城箭楼#SE'] = {
  id = '长安城箭楼#SE',
  area = '长安城',
  name = '箭楼',
  desc =  [[南门两侧负责保护城门的军事堡垒，与中间的城楼共同组成南永宁门。除面向城内的北侧外，东、南、西侧都开设了许多箭窗，作为守城时对外的射击孔，还便于观察敌情，作战时可以三面杀敌。]],
  exit = {
    w = { to = '长安城南门城楼', },
    e = { to = '长安城南城墙#1E', },
  },
},

['长安城东城墙#1N'] = {
  id = '长安城东城墙#1N',
  area = '长安城',
  name = '东城墙',
  desc =  [[丈许宽的城墙又高又厚，给人一种安全的感觉。整个城墙是用石灰、土和糯米汁混合砌成，而且上面布满了垛口作了望、射击之用。城墙上，可清晰看到墙外护城河对面的一举一动。]],
  exit = {
    s = { to = '长安城箭楼#EN', },
    n = { to = '长安城东城墙#2N', },
  },
},

['长安城长乐门'] = {
  id = '长安城长乐门',
  area = '长安城',
  name = '长乐门',
  desc =  [[这里是长安城的东城门。护城河既深又阔，而且城高墙厚，有一夫当关，万夫莫开之势。仰望城楼，只见城楼高处满布哨兵，戒备森严。城墙上贴着官府的告示(gaoshi)，官兵们正在认真地检查每一个过往的行人。]],
  exit = {
    u = { to = '长安城东门城楼', },
    w = { to = '长安城东大街#4', },
    e = { to = '长安城官道#1E', },
  },
},

['长安城假山'] = {
  id = '长安城假山',
  area = '长安城',
  name = '假山',
  desc =  [[黄色的山拔地而起，山峰俊俏，山间古柏，山顶小亭，山中还有小院、石桥、石室等，气势磅礴。湖面小小的白石拱桥。桥下碧绿的湖水正荡着微波。远处的湖面上传来阵阵歌声，岸边的柳树随着湖面上吹来的微风时不时地摇摆着。]],
  exit = {
    e = { to = '长安城镜湖', },
  },
},

['长安城驿站'] = {
  id = '长安城驿站',
  area = '长安城',
  name = '驿站',
  desc =  [[这里是长安驿站，负责传送和京城往来的公文和居民的信件。每天快马三匹，早午晚各传递书信三次。不管你的书信要寄到哪里，只要放到这里，一天之内绝对可以送到。]],
  exit = {
    s = { to = '长安城西大街#3', },
  },
},

['长安城官道#2E'] = {
  id = '长安城官道#2E',
  area = '长安城',
  name = '官道',
  desc =  [[这是一条宽阔笔直的官道，足可容得下十马并驰。四周人来人往。挑担子的行商，赶着大车的马夫，上京赶考的书生，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。道路两旁是整整齐齐的杨树林。]],
  exit = {
    w = { to = '长安城官道#1E', },
    e = { to = '华山村土路', },
  },
},

['长安城箭楼#WN'] = {
  id = '长安城箭楼#WN',
  area = '长安城',
  name = '箭楼',
  desc =  [[西门两侧负责保护城门的军事堡垒，与中间的城楼共同组成西安定门。除面向城内的西侧外，东、南、北侧都开设了许多箭窗，作为守城时对外的射击孔，还便于观察敌情，作战时可以三面杀敌。]],
  exit = {
    s = { to = '长安城西门城楼', },
    n = { to = '长安城西城墙#1N', },
  },
},

['长安城民居#1E'] = {
  id = '长安城民居#1E',
  area = '长安城',
  name = '民居',
  desc =  [[这是一户长安城里普普通通的民宅，男主人常年经商在外，妻子在家主持家务。屋中并没有什么好的摆设，木桌上的玻璃瓶中插了几朵野花。如同长安城大多数人家一样，屋里供着南海观音和关王爷的神像。]],
  exit = {
    s = { to = '长安城内街#6', },
  },
},

['长安城镖局大厅'] = {
  id = '长安城镖局大厅',
  area = '长安城',
  name = '镖局大厅',
  desc =  [[这里是虎威镖局的大厅。堂中的陈设，全是十分精致的紫檀木家具，单是那扇巨大的八摺屏风，上面镶了各色宝玉，砌成极其生动的八仙图，已是罕见的古物，表明这里的主人不但性情豪爽，广交朋友，且非大字不识，目中无人之辈。上首一虎皮交椅，上面坐着一个相貌威猛的汉子。]],
  exit = {
    n = { to = '长安城虎威镖局', },
  },
},

['长安城箭楼#NW'] = {
  id = '长安城箭楼#NW',
  area = '长安城',
  name = '箭楼',
  desc =  [[北门两侧负责保护城门的军事堡垒，与中间的城楼共同组成北安远门。除面向城内的南侧外，东、西、北侧都开设了许多箭窗，作为守城时对外的射击孔，还便于观察敌情，作战时可以三面杀敌。]],
  exit = {
    w = { to = '长安城北城墙#1W', },
    e = { to = '长安城北门城楼', },
  },
},

['长安城了望台#SE'] = {
  id = '长安城了望台#SE',
  area = '长安城',
  name = '了望台',
  desc =  [[守城的重要哨岗。中间有一个巨大的烟炉，里面装满了狼粪，一侧挂着一口铜钟，每当有紧急情况，守城卫兵就放狼烟、鸣钟为警，调动官兵，以备外族来犯。几名值勤的岗哨仔细的观察着城外的动静。]],
  exit = {
    w = { to = '长安城南城墙#3E', },
    n = { to = '长安城东城墙#2S', },
  },
},

['长安城茶馆'] = {
  id = '长安城茶馆',
  area = '长安城',
  name = '茶馆',
  desc =  [[这间茶馆是长安的闲人杂聚的场所，里面横七竖八的摆放着一些木制的桌椅。一个说书人正滔滔不绝的讲书。一些茶客一边品茶，一边听书，一边交头接耳小声议论着什么。]],
  exit = {
    s = { to = '长安城东大街#2', },
  },
},

['长安城土嫖馆'] = {
  id = '长安城土嫖馆',
  area = '长安城',
  name = '土嫖馆',
  desc =  [[这是一间简陋的，用泥坯砌起来的低矮小房。东面的墙上有条裂缝，从右上角一直裂到左边的墙角里。西边有一张和泥屋连为一体的土炕。炕头挂着厚布蚊帐，炕上的被褥脏兮兮的，而且散发着难闻的气味。]],
  exit = {
    n = { to = '长安城内街#5', },
  },
},

['长安城碑林'] = {
  id = '长安城碑林',
  area = '长安城',
  name = '碑林',
  desc =  [[你走进柏树林西侧的碑林之中，这里荟萃了举世闻名的碑帖，有王羲之，颜真卿，柳公泉，欧阳询，诸遂良所书的碑刻。也有石经，石台孝经，大秦景教流行中国碑。还有圆雕、浮雕、线刻各种手法的石刻、石雕等等。]],
  exit = {
    e = { to = '长安城柏树林#1', },
  },
},

['长安城民居#3W'] = {
  id = '长安城民居#3W',
  area = '长安城',
  name = '民居',
  desc =  [[这所房子看起来好像已经很久没人住了。雕花漆彩的门窗已是破败不堪，满目蛛丝鼠粪，墙上地下到处都是灰尘，几只老鼠跑来跑去。院子里杂草丛生，宅外墙满是青苔蜘网，显得既荒凉又阴森。四周死一般的沉寂。]],
  exit = {
    n = { to = '长安城市集', },
  },
},

['长安城大雁塔六层'] = {
  id = '长安城大雁塔六层',
  area = '长安城',
  name = '大雁塔六层',
  desc =  [[大雁塔内结构精洁宽敞，塔内布置精美，给人以清静肃穆之感。四周开有龛窗，塔内有楼梯直通上下。这里似乎是非同寻常的场所。]],
  exit = {
    u = { to = '长安城大雁塔七层', },
    d = { to = '长安城大雁塔五层', },
  },
},

['长安城南城墙#2W'] = {
  id = '长安城南城墙#2W',
  area = '长安城',
  name = '南城墙',
  desc =  [[丈许宽的城墙又高又厚，给人一种安全的感觉。整个城墙是用石灰、土和糯米汁混合砌成，而且上面布满了垛口作了望、射击之用。城墙上，可清晰看到墙外护城河对面的一举一动。]],
  exit = {
    w = { to = '长安城南城墙#3W', },
    e = { to = '长安城南城墙#1W', },
  },
},

['长安城东城墙#1S'] = {
  id = '长安城东城墙#1S',
  area = '长安城',
  name = '东城墙',
  desc =  [[丈许宽的城墙又高又厚，给人一种安全的感觉。整个城墙是用石灰、土和糯米汁混合砌成，而且上面布满了垛口作了望、射击之用。城墙上，可清晰看到墙外护城河对面的一举一动。]],
  exit = {
    s = { to = '长安城东城墙#2S', },
    n = { to = '长安城箭楼#ES', },
  },
},

['长安城大殿'] = {
  id = '长安城大殿',
  area = '长安城',
  name = '大殿',
  desc =  [[这里是清真寺内规模宏伟的大殿，由前廓、礼拜殿、后殿三部分组成，可容纳千余人礼拜。但见殿门单檐歇山顶，灰筒板瓦覆盖，脊上浮雕莲花，朝脊前端置有云盘。朱红大门镶有金色门钉，门前方砖漫地。整个大殿，古朴肃穆。]],
  exit = {
    s = { to = '长安城清真寺', },
    n = { to = '长安城后殿', },
  },
},

['长安城客房'] = {
  id = '长安城客房',
  area = '长安城',
  name = '客房',
  desc =  [[这是一间很大的客房，陈设十分华丽。靠墙放了几张大床，客人们盖着大被子睡的正香，满屋子都是呼呼的打酣声。西边有张床是空的，你蹑手蹑脚地走了过去。]],
  exit = {
    s = { to = '长安城走廊', },
  },
},

['长安城钟楼'] = {
  id = '长安城钟楼',
  area = '长安城',
  name = '钟楼',
  desc =  [[这里是长安城东、西、南、北四条大街交会处的钟楼。钟楼整体为木质结构，上有深绿色琉璃瓦覆盖，重檐复屋，楼内贴金绘彩，画栋雕梁。楼上大圆金顶，表面贴有金箔，金光闪闪，灿烂夺目。由于地处中心，街上人来人往，一片繁荣的景象。]],
  exit = {
    s = { to = '长安城南大街#1', },
    e = { to = '长安城东大街#1', },
    w = { to = '长安城西大街#1', },
    nw = { to = '长安城鼓楼', },
    n = { to = '长安城北大街#1', },
  },
},

['长安城官道#2N'] = {
  id = '长安城官道#2N',
  area = '长安城',
  name = '官道',
  desc =  [[这是一条宽阔笔直的官道，足可容得下十马并驰。四周人来人往。挑担子的行商，赶着大车的马夫，上京赶考的书生，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。道路两旁是整整齐齐的杨树林。]],
  exit = {
    s = { to = '长安城官道#1N', },
    n = { to = '长安城大道#1', },
  },
},

['长安城卧室#2'] = {
  id = '长安城卧室#2',
  area = '长安城',
  name = '卧室',
  desc =  [[这里是李员外的休息所在。屋子里的光线很暗，满屋子弥漫着一种醉人的香气。一张宽大柔软的床上铺着被褥，让人不觉昏昏欲睡。]],
  exit = {
    e = { to = '长安城正厅#2', },
  },
},

['长安城宴厅#2'] = {
  id = '长安城宴厅#2',
  area = '长安城',
  name = '宴厅',
  desc =  [[屋子中间有一张大桌子，足足可以坐下三十来人。房子的一边通向正厅。李员外为人豪爽，光交天下豪杰，客人多时，往往这里都坐不下，干脆在前院空地上露天设宴。]],
  exit = {
    s = { to = '长安城正厅#2', },
  },
},

['长安城东城墙#2S'] = {
  id = '长安城东城墙#2S',
  area = '长安城',
  name = '东城墙',
  desc =  [[丈许宽的城墙又高又厚，给人一种安全的感觉。整个城墙是用石灰、土和糯米汁混合砌成，而且上面布满了垛口作了望、射击之用。城墙上，可清晰看到墙外护城河对面的一举一动。]],
  exit = {
    s = { to = '长安城了望台#SE', },
    n = { to = '长安城东城墙#1S', },
  },
},

['长安城小雁塔七层'] = {
  id = '长安城小雁塔七层',
  area = '长安城',
  name = '小雁塔七层',
  desc =  [[小雁塔是一座典型的密檐式砖构佛塔，塔形秀丽，从底下向上看去，庄严而玲珑，塔身檐角密布，一共有十五层之高，与东边的大雁塔遥遥相望。塔内气氛静而神秘，光线有些昏暗朦胧。四周墙壁上有数盏龛灯，周围绘有彩色壁画。塔内有楼梯供人上下，从龛形门窗可以纵目远眺。]],
  exit = {
    u = { to = '长安城小雁塔八层', },
    d = { to = '长安城小雁塔六层', },
  },
},

['长安城箭楼#WS'] = {
  id = '长安城箭楼#WS',
  area = '长安城',
  name = '箭楼',
  desc =  [[西门两侧负责保护城门的军事堡垒，与中间的城楼共同组成西安定门。除面向城内的西侧外，东、南、北侧都开设了许多箭窗，作为守城时对外的射击孔，还便于观察敌情，作战时可以三面杀敌。]],
  exit = {
    s = { to = '长安城西城墙#1S', },
    n = { to = '长安城西门城楼', },
  },
},

['长安城正厅#2'] = {
  id = '长安城正厅#2',
  area = '长安城',
  name = '正厅',
  desc =  [[这里是李员外家的的正厅，正厅里各种古玩琳琅满目，商周青铜、汉瓦当、唐三彩……，应有尽有，只要拥有一件，就够你吃一辈子了。名人的字画也挂得满墙都是，厅中正中一把太师椅，李员外平时就坐在那里。]],
  exit = {
    e = { to = '长安城李家大院', },
    w = { to = '长安城卧室#2', },
    n = { to = '长安城宴厅#2', },
  },
},

['长安城官道#1S'] = {
  id = '长安城官道#1S',
  area = '长安城',
  name = '官道',
  desc =  [[这是一条宽阔笔直的官道，足可容得下十马并驰。四周人来人往。挑担子的行商，赶着大车的马夫，上京赶考的书生，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。道路两旁是整整齐齐的杨树林。北面已可以隐隐看到长安城的南城门了。]],
  exit = {
    s = { to = '长安城官道#2S', },
    n = { to = '长安城永宁门', },
  },
},

['长安城民居#2E'] = {
  id = '长安城民居#2E',
  area = '长安城',
  name = '民居',
  desc =  [[房间里甚是宽敞，里面摆设朴素而自然，左侧是一个古色古色的精雅梳妆台，前面摆有两张红木圆椅。右侧墙壁上挂有一幅美女抚琴图，上面配有几行笔迹清秀的隶体小字，内侧则是一张红色帐幔垂挂的低矮木榻。]],
  exit = {
    s = { to = '长安城内街#5', },
  },
},

['长安城北城墙#3W'] = {
  id = '长安城北城墙#3W',
  area = '长安城',
  name = '北城墙',
  desc =  [[丈许宽的城墙又高又厚，给人一种安全的感觉。整个城墙是用石灰、土和糯米汁混合砌成，而且上面布满了垛口作了望、射击之用。城墙上，可清晰看到墙外护城河对面的一举一动。]],
  exit = {
    w = { to = '长安城了望台#NW', },
    e = { to = '长安城北城墙#2W', },
  },
},

['长安城西城墙#1S'] = {
  id = '长安城西城墙#1S',
  area = '长安城',
  name = '西城墙',
  desc =  [[丈许宽的城墙又高又厚，给人一种安全的感觉。整个城墙是用石灰、土和糯米汁混合砌成，而且上面布满了垛口作了望、射击之用。城墙上，可清晰看到墙外护城河对面的一举一动。]],
  exit = {
    s = { to = '长安城西城墙#2S', },
    n = { to = '长安城箭楼#WS', },
  },
},

['长安城聚豪酒楼'] = {
  id = '长安城聚豪酒楼',
  area = '长安城',
  name = '聚豪酒楼',
  desc =  [[这里是长安城最大的酒楼，店主是城中的首富李员外。李员外为人豪爽，广交天下豪杰，酒楼因此得名。楼上正中，挂着一块黑漆漆的横匾，上面的四个绣金大字“聚豪酒楼”，是以“大隶”书成，笔力雄劲，气势磅礴。]],
  exit = {
    u = { to = '长安城酒楼二楼', },
    w = { to = '长安城北大街#1', },
  },
},

['长安城南大街#1'] = {
  id = '长安城南大街#1',
  area = '长安城',
  name = '南大街',
  desc =  [[这是一条宽阔的青石街道，向南北两头延伸。南边是南城门通向城外。北边则是城中心的钟楼。东边一家店铺门口挂着一很大的“當”字，看来是家当铺，西边是则是一家老字号的钱庄，可以听到叮叮当当的金银声音。]],
  exit = {
    e = { to = '长安城当铺', },
    s = { to = '长安城南大街#2', },
    w = { to = '长安城威信钱庄', },
    n = { to = '长安城钟楼', },
  },
},

['长安城走廊'] = {
  id = '长安城走廊',
  area = '长安城',
  name = '走廊',
  desc =  [[你正走在客栈的走廊上，北面是一排装修精美的客房。不时有睡意朦胧的旅客进进出出，到楼下的掌柜处付了钱才能上来睡觉。]],
  exit = {
    d = { to = '长安城聚豪客栈', },
    n = { to = '长安城客房', },
  },
},

['长安城杂货铺'] = {
  id = '长安城杂货铺',
  area = '长安城',
  name = '杂货铺',
  desc =  [[一间老字号的杂货铺。祖孙三代经营下来，在长安城北一带已经有了一些小名气。这里无论是油盐酱醋，还是大米白面，老百姓日常生活需要的东西一样都不少。再加上这里的老掌柜待客如宾，杂货铺的生意看来一天比一天好。    门前立了个牌子(sign)。]],
  exit = {
    n = { to = '长安城内街#4', },
  },
},

['长安城大雁塔七层'] = {
  id = '长安城大雁塔七层',
  area = '长安城',
  name = '大雁塔七层',
  desc =  [[大雁塔内结构精洁宽敞，塔内布置精美，给人以清静肃穆之感。四周开有龛窗，塔内有楼梯直通上下。这里似乎是非同寻常的场所。]],
  exit = {
    d = { to = '长安城大雁塔六层', },
  },
},

['长安城小雁塔八层'] = {
  id = '长安城小雁塔八层',
  area = '长安城',
  name = '小雁塔八层',
  desc =  [[小雁塔是一座典型的密檐式砖构佛塔，塔形秀丽，从底下向上看去，庄严而玲珑，塔身檐角密布，一共有十五层之高，与东边的大雁塔遥遥相望。塔内气氛静而神秘，光线有些昏暗朦胧。四周墙壁上有数盏龛灯，周围绘有彩色壁画。塔内有楼梯供人上下，从龛形门窗可以纵目远眺。]],
  exit = {
    u = { to = '长安城小雁塔九层', },
    d = { to = '长安城小雁塔七层', },
  },
},

['长安城土路#2'] = {
  id = '长安城土路#2',
  area = '长安城',
  name = '土路',
  desc =  [[这是一条黄土飞扬的路，不算太宽，路上几乎没有行人，给人一种落寞的感觉，路边零零散散的分布着几片小田地，偶然也能看得见一些炊烟。四周一片的荒寂。]],
  exit = {
    ne = { to = '长安城土路#3', },
    sd = { to = '长安城土路#1', },
  },
},

['长安城土路#5'] = {
  id = '长安城土路#5',
  area = '长安城',
  name = '土路',
  desc =  [[这是一条黄土飞扬的路，不算太宽，路上几乎没有行人，给人一种落寞的感觉，路边零零散散的分布着几片小田地，偶然也能看得见一些炊烟。四周一片的荒寂。]],
  exit = {
    sw = { to = '长安城土路#4', },
    n = { to = '长安城陕晋渡口#S', },
  },
},

['长安城织布坊'] = {
  id = '长安城织布坊',
  area = '长安城',
  name = '织布坊',
  desc =  [[这是间到处飞满棉絮的房间，纺织女工们正紧张的在里屋忙碌着。终日都可以听到编织机运作的声音，纺织女们以纤细的手指捏着纺梭在编织机上忙碌的身影也甚是优美。你可以在这里买卖布匹，和编织自己的布匹。]],
  exit = {
    w = { to = '长安城北大街#2', },
  },
},

['长安城渡船'] = {
  id = '长安城渡船',
  area = '长安城',
  name = '渡船',
  desc =  [[黄河上的小舟都是这种很简陋的小舟。一位中年艄公正站在船尾吃力地掌舵，一位膀子壮硕的小伙子也在船头用劲地划水撑船。黄河水流湍急，船下滑很快，横渡却很慢。]],
  exit = {
    out2 = { to = '长安城陕晋渡口#N', unstable = true, handler = 'disembark', cost = 50, },
    out = { to = '长安城陕晋渡口#S', unstable = true, handler = 'disembark', cost = 50, },
  },
},

['长安城陕晋渡口#N'] = {
  id = '长安城陕晋渡口#N',
  area = '长安城',
  name = '陕晋渡口',
  desc =  [[这里是黄河大渡口，是通往长安的必经之路。宽阔的黄河江面上飘荡着几只轻帆。渡口处正停着一艘渡船，几个乘客正在和船家讨论价钱。你可以由此上(yell)船渡过黄河。]],
  exit = {
    enter = { to = '长安城渡船', cmd = 'duhe', unstable = true, handler = 'fly_across', no_wander = true, },
    n = { to = '长安城大道#1N', },
  },
},

['长安城北大街#3'] = {
  id = '长安城北大街#3',
  area = '长安城',
  name = '北大街',
  desc =  [[这是一条宽阔的青石街道，向南北两头延伸。北边是北城门通向城外。南边则是城中心的钟楼。街的旁边是一条东西延伸的内街，内街很长，里面也有许多小型的店铺，平常百姓家都住在里面。]],
  exit = {
    e = { to = '长安城内街#6', },
    s = { to = '长安城北大街#2', },
    w = { to = '长安城内街#1W', },
    n = { to = '长安城安远门', },
  },
},

['长安城箭楼#ES'] = {
  id = '长安城箭楼#ES',
  area = '长安城',
  name = '箭楼',
  desc =  [[东门两侧负责保护城门的军事堡垒，与中间的城楼共同组成东长乐门。除面向城内的西侧外，东、南、北侧都开设了许多箭窗，作为守城时对外的射击孔，还便于观察敌情，作战时可以三面杀敌。]],
  exit = {
    s = { to = '长安城东城墙#1S', },
    n = { to = '长安城东门城楼', },
  },
},

['长安城官道#1N'] = {
  id = '长安城官道#1N',
  area = '长安城',
  name = '官道',
  desc =  [[这是一条宽阔笔直的官道，足可容得下十马并驰。四周人来人往。挑担子的行商，赶着大车的马夫，上京赶考的书生，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。道路两旁是整整齐齐的杨树林。南面已可以隐隐看到长安城的北城门了。]],
  exit = {
    s = { to = '长安城安远门', },
    n = { to = '长安城官道#2N', },
  },
},

['长安城东大街#2'] = {
  id = '长安城东大街#2',
  area = '长安城',
  name = '东大街',
  desc =  [[这是一条宽阔的青石街道，向东西两头延伸。东边是东城门通向城外。西边则是城中心的钟楼。南边是一家门面很大的澡塘，牌匾上书“清池”二字。北边熙熙攘攘的则是一家茶馆，里面不时传出叫好之声。]],
  exit = {
    e = { to = '长安城东大街#3', },
    s = { to = '长安城清池', },
    w = { to = '长安城东大街#1', },
    n = { to = '长安城茶馆', },
  },
},

['长安城正厅#1'] = {
  id = '长安城正厅#1',
  area = '长安城',
  name = '正厅',
  desc =  [[这里是将军府的正厅。厅门口挂着一块横匾，上书「铁面无私」四个大字，看来还是御笔亲书，气氛很是严肃。正面墙上挂着一幅巨大的工笔画，画中一座大城，山环水绕，还点缀有亭台楼阁、园林人物，看来是江南的一处名城。将军不在家，大概去城内巡视了。府内的管家一人在厅里打点着事务。]],
  exit = {
    e = { to = '长安城宴厅#1', },
    s = { to = '长安城后门', },
    w = { to = '长安城卧室#1', },
    n = { to = '长安城将军府', },
  },
},

['长安城北门城楼'] = {
  id = '长安城北门城楼',
  area = '长安城',
  name = '北门城楼',
  desc =  [[北门上的城楼，呈正方形，与左右两侧的箭楼共同组成北安远门。往下望是出城进城川流不息的人群。城中的房屋连绵不断，在这里还可以依稀的看到城中心的钟楼。城楼上有流动的岗哨，严密监守着城周围一切动态。]],
  exit = {
    e = { to = '长安城箭楼#NE', },
    d = { to = '长安城安远门', },
    w = { to = '长安城箭楼#NW', },
  },
},

['长安城官道#3S'] = {
  id = '长安城官道#3S',
  area = '长安城',
  name = '官道',
  desc =  [[这是一条宽阔笔直的官道，足可容得下十马并驰。四周人来人往。挑担子的行商，赶着大车的马夫，上京赶考的书生，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。道路两旁是整整齐齐的杨树林。]],
  exit = {
    w = { to = '长安城蔡邕庄', },
    s = { to = '襄阳城蓝田', },
    n = { to = '长安城官道#2S', },
  },
},

['长安城北大街#2'] = {
  id = '长安城北大街#2',
  area = '长安城',
  name = '北大街',
  desc =  [[这是一条宽阔的青石街道，向南北两头延伸。北边是北城门通向城外。南边则是城中心的钟楼。东边是一家织布坊，里面不时传来织布机织布的声音。西边是一家裁缝铺，顾客有进有出，生意不错。]],
  exit = {
    e = { to = '长安城织布坊', },
    s = { to = '长安城北大街#1', },
    w = { to = '长安城裁缝铺', },
    n = { to = '长安城北大街#3', },
  },
},

['长安城珠宝行'] = {
  id = '长安城珠宝行',
  area = '长安城',
  name = '珠宝行',
  desc =  [[这是一家装饰豪华的珠宝店。珠光宝气四射，眩的人有些睁不开眼睛。精致的长柜中陈设着各类首饰珠宝玉器，将四周映得金碧辉煌。几个富商模样的人正在低头仔细地挑拣着，老板在不厌其烦地推销着。]],
  exit = {
    n = { to = '长安城西大街#1', },
  },
},

['长安城城隍庙'] = {
  id = '长安城城隍庙',
  area = '长安城',
  name = '城隍庙',
  desc =  [[城隍庙里香火极盛。大多是来保佑家里平安，生意兴隆之类。正中前方一座白白胖胖，满脸福相的城隍，左边有一位手持帐簿和毛笔的判官。一位庙祝走前走后，和大家打着招呼。]],
  exit = {
    n = { to = '长安城西大街#4', },
  },
},

['长安城箭楼#NE'] = {
  id = '长安城箭楼#NE',
  area = '长安城',
  name = '箭楼',
  desc =  [[北门两侧负责保护城门的军事堡垒，与中间的城楼共同组成北安远门。除面向城内的南侧外，东、西、北侧都开设了许多箭窗，作为守城时对外的射击孔，还便于观察敌情，作战时可以三面杀敌。]],
  exit = {
    w = { to = '长安城北门城楼', },
    e = { to = '长安城北城墙#1E', },
  },
},

['长安城西大街#2'] = {
  id = '长安城西大街#2',
  area = '长安城',
  name = '西大街',
  desc =  [[这是一条宽阔的青石街道，向东西两头延伸。西边是西城门通向城外。东边则是城中心的钟楼。北面就是长安府的衙门了，因为有它建在这里，所以这里的治安很好。南面则是守城将军非常气派的府宅。]],
  exit = {
    e = { to = '长安城西大街#1', },
    s = { to = '长安城将军府', },
    w = { to = '长安城西大街#3', },
    n = { to = '长安城衙门大门', },
  },
},

['长安城大雁塔四层'] = {
  id = '长安城大雁塔四层',
  area = '长安城',
  name = '大雁塔四层',
  desc =  [[大雁塔内结构精洁宽敞，塔内布置精美，给人以清静肃穆之感。四周开有龛窗，塔内有楼梯直通上下。这里似乎是非同寻常的场所。]],
  exit = {
    u = { to = '长安城大雁塔五层', },
    d = { to = '长安城大雁塔三层', },
  },
},

['长安城内街#3'] = {
  id = '长安城内街#3',
  area = '长安城',
  name = '内街',
  desc =  [[这是是长安城的居民区，住的都是平常百姓，所以和那些大街比起来，这里就不那么整洁了。店铺也都是小小门面，比邻而立，但见人来人往、川流不息，依然一片繁华的景象。南面是一家杂货铺。]],
  exit = {
    s = { to = '长安城内街#2', },
    w = { to = '长安城内街#4', },
    n = { to = '长安城民居#4E', },
  },
},

['长安城南门城楼'] = {
  id = '长安城南门城楼',
  area = '长安城',
  name = '南门城楼',
  desc =  [[南门上的城楼，呈正方形，与左右两侧的箭楼共同组成南永宁门。往下望是出城进城川流不息的人群。城中的房屋连绵不断，在这里还可以依稀的看到城中心的钟楼。城楼上有流动的岗哨，严密监守着城周围一切动态。]],
  exit = {
    e = { to = '长安城箭楼#SE', },
    d = { to = '长安城永宁门', },
    w = { to = '长安城箭楼#SW', },
  },
},

['长安城民居#1W'] = {
  id = '长安城民居#1W',
  area = '长安城',
  name = '民居',
  desc =  [[这里是一家民居住房，窗台上放着大大小的小陶盆瓷罐，里面种着花草之类的东西，两扇窗子大开，飘出一股花草的清香味。民居里十分热闹，一张大木桌子，周围放着几把椅子，几个邻里凑在一起，不知在谈什么。]],
  exit = {
    s = { to = '长安城内街#1W', },
  },
},

['长安城卧室#1'] = {
  id = '长安城卧室#1',
  area = '长安城',
  name = '卧室',
  desc =  [[这里是将军府的休息所在。屋子里的光线很暗，满屋子弥漫着一种醉人的香气。一张宽大柔软的床上铺着被褥，让人不觉昏昏欲睡。]],
  exit = {
    e = { to = '长安城正厅#1', },
  },
},

['长安城兵营'] = {
  id = '长安城兵营',
  area = '长安城',
  name = '兵营',
  desc =  [[这里就是长安城的兵营了。这里密密麻麻到处都是官兵，有的在武将的指挥下进行操练，有的独自在练功，还有的坐着、躺着正在休息。]],
  exit = {
    n = { to = '长安城兵营大门', },
  },
},

['长安城内街#1'] = {
  id = '长安城内街#1',
  area = '长安城',
  name = '内街',
  desc =  [[这是是长安城的居民区，住的都是平常百姓，所以和那些大街比起来，这里就不那么整洁了。店铺也都是小小门面，比邻而立，但见人来人往、川流不息，依然一片繁华的景象。西首一扇红漆大门，看起来是一个大富人家。]],
  exit = {
    s = { to = '长安城东大街#4', },
    w = { to = '长安城李家大院', },
    n = { to = '长安城内街#2', },
  },
},

['长安城北城墙#2E'] = {
  id = '长安城北城墙#2E',
  area = '长安城',
  name = '北城墙',
  desc =  [[丈许宽的城墙又高又厚，给人一种安全的感觉。整个城墙是用石灰、土和糯米汁混合砌成，而且上面布满了垛口作了望、射击之用。城墙上，可清晰看到墙外护城河对面的一举一动。]],
  exit = {
    w = { to = '长安城北城墙#1E', },
    e = { to = '长安城北城墙#3E', },
  },
},

['长安城宴厅#1'] = {
  id = '长安城宴厅#1',
  area = '长安城',
  name = '宴厅',
  desc =  [[这里是将军府的饭厅。厅堂很大，足足可以容得下三十来人。房子中央有张红木桌，上面沏了一壶好茶，摆着几盘点心。屋角香炉里传来一阵阵似有似无的暗香。]],
  exit = {
    w = { to = '长安城正厅#1', },
  },
},

['长安城安远门'] = {
  id = '长安城安远门',
  area = '长安城',
  name = '安远门',
  desc =  [[这里是长安城的北城门。护城河既深又阔，而且城高墙厚，有一夫当关，万夫莫开之势。仰望城楼，只见城楼高处满布哨兵，戒备森严。城墙上贴着官府的告示(gaoshi)，官兵们正在认真地检查每一个过往的行人。]],
  exit = {
    u = { to = '长安城北门城楼', },
    s = { to = '长安城北大街#3', },
    n = { to = '长安城官道#1N', },
  },
},

['长安城内街#4'] = {
  id = '长安城内街#4',
  area = '长安城',
  name = '内街',
  desc =  [[这是是长安城的居民区，住的都是平常百姓，所以和那些大街比起来，这里就不那么整洁了。店铺也都是小小门面，比邻而立，但见人来人往、川流不息，依然一片繁华的景象。南面是一家杂货铺。]],
  exit = {
    e = { to = '长安城内街#3', },
    s = { to = '长安城杂货铺', },
    w = { to = '长安城内街#5', },
    n = { to = '长安城民居#3E', },
  },
},

['长安城东门城楼'] = {
  id = '长安城东门城楼',
  area = '长安城',
  name = '东门城楼',
  desc =  [[东门上的城楼，呈正方形，与左右两侧的箭楼共同组成东长乐门。往下望是出城进城川流不息的人群。城中的房屋连绵不断，在这里还可以依稀的看到城中心的钟楼。城楼上有流动的岗哨，严密监守着城周围一切动态。]],
  exit = {
    d = { to = '长安城长乐门', },
    s = { to = '长安城箭楼#ES', },
    n = { to = '长安城箭楼#EN', },
  },
},

['长安城李家大院'] = {
  id = '长安城李家大院',
  area = '长安城',
  name = '李家大院',
  desc =  [[这里便是长安城首富李员外的私宅。迎面是一个假山水池，池上摆着一块奇形怪状的石头，据说是当年花石纲的遗石。水池的两旁种满了花草。东边是一棵槐树，郁郁葱葱，遮盖了大半个院子。整个院子里阴阴凉凉的。几个家丁在收拾着院子。]],
  exit = {
    e = { to = '长安城内街#1', },
    w = { to = '长安城正厅#2', },
    n = { to = '长安城账房', },
  },
},

['长安城万红楼'] = {
  id = '长安城万红楼',
  area = '长安城',
  name = '万红楼',
  desc =  [[万红楼是长安城首屈一指的大妓院。这里不是普通人能来的地方，如果你没有腰缠万贯，根本别想进这个门。楼中雇的打手个个高大威猛，没钱没势的见了这场面早就绕了开去。]],
  exit = {
    s = { to = '长安城东大街#1', },
  },
},

['长安城威信钱庄'] = {
  id = '长安城威信钱庄',
  area = '长安城',
  name = '威信钱庄',
  desc =  [[这是长安城的一家老字号钱庄，老板是山西人，这家钱庄从他的祖先来到这里时就开始办起，一直传到他的手里。钱庄的信誉非常好，而且在全国各地都开了分店。它发行的银票通行全国。店内摆设十分简单，一个高高的柜台上面装了铁栅栏。]],
  exit = {
    e = { to = '长安城南大街#1', },
  },
},

['长安城东大街#1'] = {
  id = '长安城东大街#1',
  area = '长安城',
  name = '东大街',
  desc =  [[这是一条宽阔的青石街道，向东西两头延伸。东边是东城门通向城外。西边则是城中心的钟楼。南边是一家赌场，对面就是万红楼，沸沸嚷嚷的男喊女叫只一街所隔，街上人来人往、出来进去，好不热闹！]],
  exit = {
    e = { to = '长安城东大街#2', },
    s = { to = '长安城赌场', },
    w = { to = '长安城钟楼', },
    n = { to = '长安城万红楼', },
  },
},

['长安城衙门大门'] = {
  id = '长安城衙门大门',
  area = '长安城',
  name = '衙门大门',
  desc =  [[这里是长安城的衙门大门，两扇朱木大门紧紧关闭着。门口放着两个青铜狮。“肃静”“回避”的牌子分放在两旁。前面有一个大鼓，显然是供小民鸣冤用的。几名衙役在门前巡逻。]],
  exit = {
    s = { to = '长安城西大街#2', },
    n = { to = '长安城衙门正厅', },
  },
},

['长安城小雁塔十二层'] = {
  id = '长安城小雁塔十二层',
  area = '长安城',
  name = '小雁塔十二层',
  desc =  [[小雁塔是一座典型的密檐式砖构佛塔，塔形秀丽，从底下向上看去，庄严而玲珑，塔身檐角密布，一共有十五层之高，与东边的大雁塔遥遥相望。塔内气氛静而神秘，光线有些昏暗朦胧。四周墙壁上有数盏龛灯，周围绘有彩色壁画。塔内有楼梯供人上下，从龛形门窗可以纵目远眺。]],
  exit = {
    u = { to = '长安城小雁塔十三层', },
    d = { to = '长安城小雁塔十一层', },
  },
},

['长安城后殿'] = {
  id = '长安城后殿',
  area = '长安城',
  name = '后殿',
  desc =  [[这里是清真寺的后殿。红漆木棱门上端悬有“无方净域”、“其尊无对、”“泽被苍生”的匾额。殿内的雕刻藻饰、蔓草花纹装饰都由阿拉伯文套雕组成。后殿灰筒板瓦盖顶，脊上均为浮雕花草纹饰。]],
  exit = {
    s = { to = '长安城大殿', },
  },
},

['长安城赌场'] = {
  id = '长安城赌场',
  area = '长安城',
  name = '赌场',
  desc =  [[这是长安城中的的赌场。大厅里摆满大大小小的赌桌，只要能说出名的赌具，这里都有。几个赌徒围在一起，满头大汗的推着牌九，一些人在旁边看着，多半是输光了又不想走的人。]],
  exit = {
    n = { to = '长安城东大街#1', },
  },
},

['长安城北城墙#1E'] = {
  id = '长安城北城墙#1E',
  area = '长安城',
  name = '北城墙',
  desc =  [[丈许宽的城墙又高又厚，给人一种安全的感觉。整个城墙是用石灰、土和糯米汁混合砌成，而且上面布满了垛口作了望、射击之用。城墙上，可清晰看到墙外护城河对面的一举一动。]],
  exit = {
    w = { to = '长安城箭楼#NE', },
    e = { to = '长安城北城墙#2E', },
  },
},

['长安城始皇陵'] = {
  id = '长安城始皇陵',
  area = '长安城',
  name = '始皇陵',
  desc =  [[这是座落在柏树林中的一个大丘陵，呈覆斗型。站在丘陵上极目远眺，不禁心旷神怡。旁边有一座高大的石碑：“秦始皇陵”。碑前祭亭，四角微翘，绿檐红柱，雕梁画栋。皇陵雄伟壮丽，庄严肃穆，莽莽桥山古柏参天。]],
  exit = {
    e = { to = '长安城兵马俑坑#1', },
    sw = { to = '长安城柏树林#2', },
    w = { to = '长安城柏树林#1', },
    n = { to = '长安城兵马俑坑#2', },
  },
},

['长安城小雁塔二层'] = {
  id = '长安城小雁塔二层',
  area = '长安城',
  name = '小雁塔二层',
  desc =  [[小雁塔是一座典型的密檐式砖构佛塔，塔形秀丽，从底下向上看去，庄严而玲珑，塔身檐角密布，一共有十五层之高，与东边的大雁塔遥遥相望。塔内气氛静而神秘，光线有些昏暗朦胧。四周墙壁上有数盏龛灯，周围绘有彩色壁画。塔内有楼梯供人上下，从龛形门窗可以纵目远眺。]],
  exit = {
    u = { to = '长安城小雁塔三层', },
    d = { to = '长安城小雁塔', },
  },
},

['长安城土路#3'] = {
  id = '长安城土路#3',
  area = '长安城',
  name = '土路',
  desc =  [[这是一条黄土飞扬的路，不算太宽，路上几乎没有行人，给人一种落寞的感觉，路边零零散散的分布着几片小田地，偶然也能看得见一些炊烟。四周一片的荒寂。]],
  exit = {
    sw = { to = '长安城土路#2', },
    nd = { to = '长安城土路#4', },
  },
},

['长安城小雁塔六层'] = {
  id = '长安城小雁塔六层',
  area = '长安城',
  name = '小雁塔六层',
  desc =  [[小雁塔是一座典型的密檐式砖构佛塔，塔形秀丽，从底下向上看去，庄严而玲珑，塔身檐角密布，一共有十五层之高，与东边的大雁塔遥遥相望。塔内气氛静而神秘，光线有些昏暗朦胧。四周墙壁上有数盏龛灯，周围绘有彩色壁画。塔内有楼梯供人上下，从龛形门窗可以纵目远眺。]],
  exit = {
    u = { to = '长安城小雁塔七层', },
    d = { to = '长安城小雁塔五层', },
  },
},

['长安城了望台#NE'] = {
  id = '长安城了望台#NE',
  area = '长安城',
  name = '了望台',
  desc =  [[守城的重要哨岗。中间有一个巨大的烟炉，里面装满了狼粪，一侧挂着一口铜钟，每当有紧急情况，守城卫兵就放狼烟、鸣钟为警，调动官兵，以备外族来犯。几名值勤的岗哨仔细的观察着城外的动静。]],
  exit = {
    w = { to = '长安城北城墙#3E', },
    s = { to = '长安城东城墙#2N', },
  },
},

['长安城账房'] = {
  id = '长安城账房',
  area = '长安城',
  name = '账房',
  desc =  [[这里是李员外家的的账房，李家大大小小的收入支出都要通过这里。整间屋子是由坚硬的花岗石砌成的。连唯一的一个小窗上都镶满拇指粗细的钢条。不但如此，房中还有黄铜警铃，铃声一响，李家的家丁便会蜂拥而至。]],
  exit = {
    s = { to = '长安城李家大院', },
  },
},

['长安城镜湖'] = {
  id = '长安城镜湖',
  area = '长安城',
  name = '镜湖',
  desc =  [[这里就是长安城的镜湖了。镜湖的面积并不是很大，但亭台楼阁，假山长廊却也是有的。建筑的朴素简单，而不奢华。湖水叮叮咚咚的流，世人的烦恼在这里似乎都消失了。夕阳西下时悠闲的人们总是到这来散步，聊天小憩。]],
  exit = {
    w = { to = '长安城假山', },
    e = { to = '长安城南大街#3', },
  },
},

['长安城西大街#3'] = {
  id = '长安城西大街#3',
  area = '长安城',
  name = '西大街',
  desc =  [[这是一条宽阔的青石街道，向东西两头延伸。西边是西城门通向城外。东边则是城中心的钟楼。北面就是长安的驿站，长安城里的居民可以在那儿免费和外地书信来往。南面则是很有名号的虎威镖局。]],
  exit = {
    e = { to = '长安城西大街#2', },
    s = { to = '长安城虎威镖局', },
    w = { to = '长安城西大街#4', },
    n = { to = '长安城驿站', },
  },
},

['长安城了望台#SW'] = {
  id = '长安城了望台#SW',
  area = '长安城',
  name = '了望台',
  desc =  [[守城的重要哨岗。中间有一个巨大的烟炉，里面装满了狼粪，一侧挂着一口铜钟，每当有紧急情况，守城卫兵就放狼烟、鸣钟为警，调动官兵，以备外族来犯。几名值勤的岗哨仔细的观察着城外的动静。]],
  exit = {
    e = { to = '长安城南城墙#3W', },
    n = { to = '长安城西城墙#2S', },
  },
},

['长安城西城墙#2S'] = {
  id = '长安城西城墙#2S',
  area = '长安城',
  name = '西城墙',
  desc =  [[丈许宽的城墙又高又厚，给人一种安全的感觉。整个城墙是用石灰、土和糯米汁混合砌成，而且上面布满了垛口作了望、射击之用。城墙上，可清晰看到墙外护城河对面的一举一动。]],
  exit = {
    s = { to = '长安城了望台#SW', },
    n = { to = '长安城西城墙#1S', },
  },
},

['长安城北城墙#2W'] = {
  id = '长安城北城墙#2W',
  area = '长安城',
  name = '北城墙',
  desc =  [[丈许宽的城墙又高又厚，给人一种安全的感觉。整个城墙是用石灰、土和糯米汁混合砌成，而且上面布满了垛口作了望、射击之用。城墙上，可清晰看到墙外护城河对面的一举一动。]],
  exit = {
    w = { to = '长安城北城墙#3W', },
    e = { to = '长安城北城墙#1W', },
  },
},

['长安城黑市'] = {
  id = '长安城黑市',
  area = '长安城',
  name = '黑市',
  desc =  [[这里曾经是一间民宅，因长期无人居住，年久失修倒塌了，现在成了一片废墟，很少有人到这里来，于是就成了一些人贩卖古董、私盐的交易场所。最近官府抓得很紧，那些黑贩都远远的围聚在一起望着这边，小声议论着什么。]],
  exit = {
    e = { to = '长安城市集', },
  },
},

['长安城民居#4E'] = {
  id = '长安城民居#4E',
  area = '长安城',
  name = '民居',
  desc =  [[这是一户长安城里普普通通的民宅，男主人常年经商在外，妻子在家主持家务。屋中并没有什么好的摆设，木桌上的玻璃瓶中插了几朵野花。如同长安城大多数人家一样，屋里供着南海观音和关王爷的神像。]],
  exit = {
    s = { to = '长安城内街#3', },
  },
},

['长安城内街#2'] = {
  id = '长安城内街#2',
  area = '长安城',
  name = '内街',
  desc =  [[这是是长安城的居民区，住的都是平常百姓，所以和那些大街比起来，这里就不那么整洁了。店铺也都是小小门面，比邻而立，但见人来人往、川流不息，依然一片繁华的景象。]],
  exit = {
    s = { to = '长安城内街#1', },
    n = { to = '长安城内街#3', },
  },
},

['长安城兵马俑坑#1'] = {
  id = '长安城兵马俑坑#1',
  area = '长安城',
  name = '兵马俑坑',
  desc =  [[你来到一个巨大的兵马俑阵中，成千上万个兵马俑排列成几十路纵队，有将军俑、武官俑、战袍俑、铠甲俑、跪射俑、立射俑、御手俑等等，俑像造型生动，服饰神态多具特色，栩栩如生。仿佛正在从四面八方呼啸而来，你不禁被这个宏伟的场面惊倒。]],
  exit = {
    w = { to = '长安城始皇陵', },
  },
},

['长安城内街#6'] = {
  id = '长安城内街#6',
  area = '长安城',
  name = '内街',
  desc =  [[这是是长安城的居民区，住的都是平常百姓，所以和那些大街比起来，这里就不那么整洁了。店铺也都是小小门面，比邻而立，但见人来人往、川流不息，依然一片繁华的景象。南面是一家戏院。]],
  exit = {
    e = { to = '长安城内街#5', },
    s = { to = '长安城戏院', },
    w = { to = '长安城北大街#3', },
    n = { to = '长安城民居#1E', },
  },
},

['长安城小雁塔'] = {
  id = '长安城小雁塔',
  area = '长安城',
  name = '小雁塔',
  desc =  [[小雁塔是一座典型的密檐式砖构佛塔，塔形秀丽，从底下向上看去，庄严而玲珑，塔身檐角密布，一共有十五层之高，与东边的大雁塔遥遥相望。塔内气氛静而神秘，光线有些昏暗朦胧。四周墙壁上有数盏龛灯，周围绘有彩色壁画。塔内有楼梯供人上下，从龛形门窗可以纵目远眺。]],
  exit = {
    u = { to = '长安城小雁塔二层', },
    s = { to = '长安城柏树林#1', },
  },
},

['长安城戏院'] = {
  id = '长安城戏院',
  area = '长安城',
  name = '戏院',
  desc =  [[这里屋深幽暗，屋子西端搭有一座精巧但已有点退色的戏台。戏台两边挂有数盏明亮的灯笼。台下横七竖八的摆了很多长凳、方桌，前几排有些矮凳，后面是一些红油茶桌和宽背扶手椅。]],
  exit = {
    n = { to = '长安城内街#6', },
  },
},

['长安城官道#2S'] = {
  id = '长安城官道#2S',
  area = '长安城',
  name = '官道',
  desc =  [[这是一条宽阔笔直的官道，足可容得下十马并驰。四周人来人往。挑担子的行商，赶着大车的马夫，上京赶考的书生，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。道路两旁是整整齐齐的杨树林。]],
  exit = {
    s = { to = '长安城官道#3S', },
    n = { to = '长安城官道#1S', },
  },
},

['长安城南城墙#1W'] = {
  id = '长安城南城墙#1W',
  area = '长安城',
  name = '南城墙',
  desc =  [[丈许宽的城墙又高又厚，给人一种安全的感觉。整个城墙是用石灰、土和糯米汁混合砌成，而且上面布满了垛口作了望、射击之用。城墙上，可清晰看到墙外护城河对面的一举一动。]],
  exit = {
    w = { to = '长安城南城墙#2W', },
    e = { to = '长安城箭楼#SW', },
  },
},

['长安城虎威镖局'] = {
  id = '长安城虎威镖局',
  area = '长安城',
  name = '虎威镖局',
  desc =  [[这是一座建构宏伟的宅第，左右两座石坛中各竖一根两丈来高的旗杆。旗上黄色丝线绣著一头张牙舞爪的猛虎，旗子随风招展，显得猛虎更奕奕若生。旗首绣著「虎威镖局」四个黑字，银钩铁划，刚劲非凡。几名劲装汉子在院中练武，但见个个腰板笔挺，显出一股英悍之气。]],
  exit = {
    s = { to = '长安城镖局大厅', },
    n = { to = '长安城西大街#3', },
  },
},

['长安城小雁塔十三层'] = {
  id = '长安城小雁塔十三层',
  area = '长安城',
  name = '小雁塔十三层',
  desc =  [[小雁塔是一座典型的密檐式砖构佛塔，塔形秀丽，从底下向上看去，庄严而玲珑，塔身檐角密布，一共有十五层之高，与东边的大雁塔遥遥相望。塔内气氛静而神秘，光线有些昏暗朦胧。四周墙壁上有数盏龛灯，周围绘有彩色壁画。塔内有楼梯供人上下，从龛形门窗可以纵目远眺。]],
  exit = {
    u = { to = '长安城小雁塔十四层', },
    d = { to = '长安城小雁塔十二层', },
  },
},

['长安城箭楼#SW'] = {
  id = '长安城箭楼#SW',
  area = '长安城',
  name = '箭楼',
  desc =  [[南门两侧负责保护城门的军事堡垒，与中间的城楼共同组成南永宁门。除面向城内的北侧外，东、南、西侧都开设了许多箭窗，作为守城时对外的射击孔，还便于观察敌情，作战时可以三面杀敌。]],
  exit = {
    w = { to = '长安城南城墙#1W', },
    e = { to = '长安城南门城楼', },
  },
},

['长安城民居#2W'] = {
  id = '长安城民居#2W',
  area = '长安城',
  name = '民居',
  desc =  [[房间里甚是宽敞，里面摆设朴素而自然，左侧是一个古色古色的精雅梳妆台，前面摆有两张红木圆椅。右侧墙壁上挂有一幅美女抚琴图，上面配有几行笔迹清秀的隶体小字，内侧则是一张红色帐幔垂挂的低矮木榻。]],
  exit = {
    s = { to = '长安城市集', },
  },
},

['长安城北城墙#1W'] = {
  id = '长安城北城墙#1W',
  area = '长安城',
  name = '北城墙',
  desc =  [[丈许宽的城墙又高又厚，给人一种安全的感觉。整个城墙是用石灰、土和糯米汁混合砌成，而且上面布满了垛口作了望、射击之用。城墙上，可清晰看到墙外护城河对面的一举一动。]],
  exit = {
    w = { to = '长安城北城墙#2W', },
    e = { to = '长安城箭楼#NW', },
  },
},

['长安城土路#1'] = {
  id = '长安城土路#1',
  area = '长安城',
  name = '土路',
  desc =  [[这是一条黄土飞扬的路，不算太宽，路上行人不多，给人一种落寞的感觉。南面是一大片的农田，北面则是一眼看不到尽头的桑树林。]],
  exit = {
    nu = { to = '长安城土路#2', },
    sw = { to = '长安城大道#1', },
    s = { to = '长安城农田口', },
    n = { to = '长安城桑林外', },
  },
},

['长安城厢房'] = {
  id = '长安城厢房',
  area = '长安城',
  name = '厢房',
  desc =  [[这里是长安城将军府中的厢房，是专门为客人准备的。房间摆设得很朴素，窗口一盆小小盆景，绿意盎然。转过屏风，迎面只见一幅写意山水，笔势纵横。旁边就是卧榻，垂着水红纱帐，绣了些花鸟。]],
  exit = {
    e = { to = '长安城将军府', },
  },
},

['长安城小雁塔三层'] = {
  id = '长安城小雁塔三层',
  area = '长安城',
  name = '小雁塔三层',
  desc =  [[小雁塔是一座典型的密檐式砖构佛塔，塔形秀丽，从底下向上看去，庄严而玲珑，塔身檐角密布，一共有十五层之高，与东边的大雁塔遥遥相望。塔内气氛静而神秘，光线有些昏暗朦胧。四周墙壁上有数盏龛灯，周围绘有彩色壁画。塔内有楼梯供人上下，从龛形门窗可以纵目远眺。]],
  exit = {
    u = { to = '长安城小雁塔四层', },
    d = { to = '长安城小雁塔二层', },
  },
},

['长安城柏树林#1'] = {
  id = '长安城柏树林#1',
  area = '长安城',
  name = '柏树林',
  desc =  [[这是一片郁郁葱葱的柏树林。浓密宽厚的树叶遮蔽了日月星辰，使人分不出昼夜。四下如死一般的寂静，只有风吹过树梢的沙沙之声。走到这里，你努力的辨认着四周的方向，寻找出去的路。]],
  exit = {
    se = { to = '长安城柏树林#2', cost = 25, handler = 'go_straight', },
    se2 = { to = '长安城柏树林#1', },
    e = { to = '长安城始皇陵', cost = 25, handler = 'go_straight', },
    e2 = { to = '长安城柏树林#1', },
    sw = { to = '长安城长街#2', cost = 25, handler = 'go_straight', },
    sw2 = { to = '长安城柏树林#1', },
    w = { to = '长安城碑林', cost = 25, handler = 'go_straight', },
    w2 = { to = '长安城柏树林#1', },
    n = { to = '长安城小雁塔', cost = 25, handler = 'go_straight', },
    n2 = { to = '长安城柏树林#1', },
  },
},

['长安城水果店'] = {
  id = '长安城水果店',
  area = '长安城',
  name = '水果店',
  desc =  [[这是长安城里唯一的一家水果店。店里面摆满了一排排的竹筐，筐里有各式各样的水果。这儿的水果为了保持新鲜，都是每天清晨从城外的果园用快车运来的。水果店的女店主胖嫂正热情的招呼着客人。]],
  exit = {
    s = { to = '长安城东大街#3', },
  },
},

['长安城小雁塔十五层'] = {
  id = '长安城小雁塔十五层',
  area = '长安城',
  name = '小雁塔十五层',
  desc =  [[小雁塔是一座典型的密檐式砖构佛塔，塔形秀丽，从底下向上看去，庄严而玲珑，塔身檐角密布，一共有十五层之高，与东边的大雁塔遥遥相望。塔内气氛静而神秘，光线有些昏暗朦胧。四周墙壁上有数盏龛灯，周围绘有彩色壁画。塔内有楼梯供人上下，从龛形门窗可以纵目远眺。]],
  exit = {
    d = { to = '长安城小雁塔十四层', },
  },
},

['长安城小雁塔十四层'] = {
  id = '长安城小雁塔十四层',
  area = '长安城',
  name = '小雁塔十四层',
  desc =  [[小雁塔是一座典型的密檐式砖构佛塔，塔形秀丽，从底下向上看去，庄严而玲珑，塔身檐角密布，一共有十五层之高，与东边的大雁塔遥遥相望。塔内气氛静而神秘，光线有些昏暗朦胧。四周墙壁上有数盏龛灯，周围绘有彩色壁画。塔内有楼梯供人上下，从龛形门窗可以纵目远眺。]],
  exit = {
    u = { to = '长安城小雁塔十五层', },
    d = { to = '长安城小雁塔十三层', },
  },
},

['长安城官道#2W'] = {
  id = '长安城官道#2W',
  area = '长安城',
  name = '官道',
  desc =  [[这是一条宽阔笔直的官道，足可容得下十马并驰。四周人来人往。挑担子的行商，赶着大车的马夫，上京赶考的书生，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。道路两旁是整整齐齐的杨树林。]],
  exit = {
    nw = { to = '兰州城六盘山', },
    e = { to = '长安城官道#1W', },
  },
},

['长安城大雁塔二层'] = {
  id = '长安城大雁塔二层',
  area = '长安城',
  name = '大雁塔二层',
  desc =  [[大雁塔内结构精洁宽敞，塔内布置精美，给人以清静肃穆之感。四周开有龛窗，塔内有楼梯直通上下。这里似乎是非同寻常的场所。]],
  exit = {
    u = { to = '长安城大雁塔三层', },
    d = { to = '长安城大雁塔', },
  },
},

['长安城小雁塔四层'] = {
  id = '长安城小雁塔四层',
  area = '长安城',
  name = '小雁塔四层',
  desc =  [[小雁塔是一座典型的密檐式砖构佛塔，塔形秀丽，从底下向上看去，庄严而玲珑，塔身檐角密布，一共有十五层之高，与东边的大雁塔遥遥相望。塔内气氛静而神秘，光线有些昏暗朦胧。四周墙壁上有数盏龛灯，周围绘有彩色壁画。塔内有楼梯供人上下，从龛形门窗可以纵目远眺。]],
  exit = {
    u = { to = '长安城小雁塔五层', },
    d = { to = '长安城小雁塔三层', },
  },
},

['长安城将军府'] = {
  id = '长安城将军府',
  area = '长安城',
  name = '将军府',
  desc =  [[这里是长安城守城将军的府宅。大门两侧有两头高大的石狮子，还有几名官兵把守着。东边是一棵槐树，郁郁葱葱，遮盖了大半个院子，整个院子里阴阴凉凉的。]],
  exit = {
    s = { to = '长安城正厅#1', },
    w = { to = '长安城厢房', },
    n = { to = '长安城西大街#2', },
  },
},

['长安城花店'] = {
  id = '长安城花店',
  area = '长安城',
  name = '花店',
  desc =  [[这里是长安城唯一的花店。走进这里，宛如步入了花的世界，从房顶到地面都是五颜六色的鲜花，清新的花香沁人心裨。店中各种名花玲琅满目，不乏珍奇异种。来客不分高低贵贱，这里的主人总是笑脸相迎。]],
  exit = {
    n = { to = '长安城东大街#3', },
  },
},

['长安城南城墙#2E'] = {
  id = '长安城南城墙#2E',
  area = '长安城',
  name = '南城墙',
  desc =  [[丈许宽的城墙又高又厚，给人一种安全的感觉。整个城墙是用石灰、土和糯米汁混合砌成，而且上面布满了垛口作了望、射击之用。城墙上，可清晰看到墙外护城河对面的一举一动。]],
  exit = {
    w = { to = '长安城南城墙#1E', },
    e = { to = '长安城南城墙#3E', },
  },
},

['长安城衙门正厅'] = {
  id = '长安城衙门正厅',
  area = '长安城',
  name = '衙门正厅',
  desc =  [[这里是衙门的正堂，堂上东西有两根楹住，挂着一幅对联，但是你无心细看。正面墙上悬挂一个横匾，上书“正大光明”四个金光闪闪的大字。两旁衙役们手持板子侧立两旁，长安城的知府大人正坐在文案后批阅文书。]],
  exit = {
    s = { to = '长安城衙门大门', },
  },
},

['长安城裁缝铺'] = {
  id = '长安城裁缝铺',
  area = '长安城',
  name = '裁缝铺',
  desc =  [[这是家装璜豪华的裁缝铺，店堂里到处挂满了刚刚做好的衣服、帽子、鞋子等等物件。这家裁缝铺的名扬长安城，达官贵人络绎不绝，十分兴旺。在屋角还放着张很大的裁缝桌，不少年轻的裁缝正在桌子边忙碌着。]],
  exit = {
    e = { to = '长安城北大街#2', },
  },
},

['大雪山千步岭#2'] = {
  id = '大雪山千步岭#2',
  area = '大雪山',
  name = '千步岭',
  desc =  [[脚下山势逐渐陡峭，石阶也窄了许多，道路两旁都是黑压压的树林。真是：    万壑有声含晚籁，数峰无语立斜阳。    已恨碧山相阻隔，碧山还被碧云遮。]],
  exit = {
    wd = { to = '大雪山入幽口', },
    ed = { to = '大雪山千步岭#1', },
  },
},

['大雪山藤筐'] = {
  id = '大雪山藤筐',
  area = '大雪山',
  name = '藤筐',
  desc =  [[这个巨大的藤筐是用十年以上的树藤密密编织而成。为了不使树藤干裂，树藤都在油中浸泡过，时间一长，显出油亮的黑色。底部铺了些干草，踩上去软绵绵的。]],
  exit = {
    out2 = { to = '大雪山湖边', cost = 50, unstable = true, handler = 'disembark', },
    out = { to = '大雪山绞盘', cost = 50, unstable = true, handler = 'disembark', },
  },
},

['大雪山招财大车店'] = {
  id = '大雪山招财大车店',
  area = '大雪山',
  name = '招财大车店',
  desc =  [[这是一间大车店，中间一个大院子，停了不少马拉车、手推车之类的运输工具。迎面一间正房，里面灯火通明，一阵阵嘈杂的声音传了出来。门边立着个牌子(sign)。左手一溜的马厩，马槽旁除了骡子、马以外还卧着两头少见的骆驼。右手看来是厨房，热气腾腾的，不时有人断着饭菜走进正房中去。]],
  exit = {
    w = { to = '大雪山街道#1', },
    enter = { to = '大雪山正房', },
  },
},

['大雪山善禅渡'] = {
  id = '大雪山善禅渡',
  area = '大雪山',
  name = '善禅渡',
  desc =  [[前望一道石阶蜿蜒而上，在峰峦中时隐时现，直没入山腰云端之中。真是：    身游万死一生地，路入千峰百障中。    一径入松雪，数峰生暮寒。]],
  exit = {
    nw = { to = '大雪山千步岭#1', },
    e = { to = '大雪山天湖', },
  },
},

['大雪山藏民部落'] = {
  id = '大雪山藏民部落',
  area = '大雪山',
  name = '藏民部落',
  desc =  [[在这片宽广的草原上有几个帐篷，原来是几户靠游牧为生的藏民。他们通常由几户到上百户不等，组成部落，由部落头人带领，逐水草而居，居无定所，游牧四方。性格一般大都粗犷豪放，非常好客。]],
  exit = {
    e = { to = '大雪山牧场#SE', },
    wu = { to = '大雪山采石场', },
    w = { to = '大雪山牧场#SW', },
    n = { to = '大雪山藏民村落', },
  },
},

['大雪山藏民村落'] = {
  id = '大雪山藏民村落',
  area = '大雪山',
  name = '藏民村落',
  desc =  [[面前这几座帐篷里没人，显得静悄悄地，看来人们都出去干活了，想打听个路都没处问。帐篷帘门虚掩着，这里地广人稀，民风质朴，看来没有小偷强盗什么的。远处传来牧民的吆喝声和牛羊的啼叫，还是到那里找找吧。]],
  exit = {
    e = { to = '大雪山牧场#E', },
    s = { to = '大雪山藏民部落', },
    w = { to = '大雪山牧场#W', },
    n = { to = '大雪山牧场#N', },
  },
},

['大雪山牧场#E'] = {
  id = '大雪山牧场#E',
  area = '大雪山',
  name = '牧场',
  desc =  [[这里是一片茫茫无际的牧场，一眼望不到边的草原，远处能看到高耸的雪山。附近能看到藏民们正在放牧牛马，小孩子们在奔跑玩耍。]],
  exit = {
    e = { to = '大雪山牧场#E', },
    s = { to = '大雪山牧场#SE', },
    w = { to = '大雪山藏民村落', },
    n = { to = '大雪山牧场#NE', },
  },
},

['大雪山牧场#NE'] = {
  id = '大雪山牧场#NE',
  area = '大雪山',
  name = '牧场',
  desc =  [[这里是一片茫茫无际的牧场，一眼望不到边的草原，远处能看到高耸的雪山。附近能看到藏民们正在放牧牛马，小孩子们在奔跑玩耍。]],
  exit = {
    e = { to = '大雪山牧场#NE', },
    s = { to = '大雪山牧场#E', },
    w = { to = '大雪山牧场#N', },
    n = { to = '大雪山牧场#NE', },
  },
},

['大雪山牧场#SE'] = {
  id = '大雪山牧场#SE',
  area = '大雪山',
  name = '牧场',
  desc =  [[这里是一片茫茫无际的牧场，一眼望不到边的草原，远处能看到高耸的雪山。附近能看到藏民们正在放牧牛马，小孩子们在奔跑玩耍。]],
  exit = {
    e = { to = '大雪山牧场#SE', },
    s = { to = '大雪山牧场#SE', },
    w = { to = '大雪山藏民部落', },
    n = { to = '大雪山牧场#E', },
  },
},

['大雪山牧场#N'] = {
  id = '大雪山牧场#N',
  area = '大雪山',
  name = '牧场',
  desc =  [[这里是一片茫茫无际的牧场，一眼望不到边的草原，远处能看到高耸的雪山。附近能看到藏民们正在放牧牛马，小孩子们在奔跑玩耍。]],
  exit = {
    e = { to = '大雪山牧场#NE', },
    s = { to = '大雪山藏民村落', },
    w = { to = '大雪山牧场#NW', },
    n = { to = '大雪山牧场#N', },
  },
},

['大雪山牧场#W'] = {
  id = '大雪山牧场#W',
  area = '大雪山',
  name = '牧场',
  desc =  [[这里是一片茫茫无际的牧场，一眼望不到边的草原，远处能看到高耸的雪山。附近能看到藏民们正在放牧牛马，小孩子们在奔跑玩耍。]],
  exit = {
    e = { to = '大雪山藏民村落', },
    s = { to = '大雪山牧场#SW', },
    w = { to = '大雪山牧场#W', },
    n = { to = '大雪山牧场#NW', },
  },
},

['大雪山牧场#NW'] = {
  id = '大雪山牧场#NW',
  area = '大雪山',
  name = '牧场',
  desc =  [[这里是一片茫茫无际的牧场，一眼望不到边的草原，远处能看到高耸的雪山。附近能看到藏民们正在放牧牛马，小孩子们在奔跑玩耍。]],
  exit = {
    e = { to = '大雪山牧场#N', },
    s = { to = '大雪山牧场#W', },
    w = { to = '大雪山牧场#NW', },
    n = { to = '大雪山牧场#NW', },
  },
},

['大雪山牧场#SW'] = {
  id = '大雪山牧场#SW',
  area = '大雪山',
  name = '牧场',
  desc =  [[这里是一片茫茫无际的牧场，一眼望不到边的草原，远处能看到高耸的雪山。附近能看到藏民们正在放牧牛马，小孩子们在奔跑玩耍。]],
  exit = {
    e = { to = '大雪山藏民部落', },
    s = { to = '大雪山牧场#SW', },
    w = { to = '大雪山牧场#SW', },
    n = { to = '大雪山牧场#W', },
  },
},

['大雪山厨房'] = {
  id = '大雪山厨房',
  area = '大雪山',
  name = '厨房',
  desc =  [[屋中蒸气缭绕，灶堂中填着不少柴草和牛粪，燃烧着熊熊烈火，柴草劈啪作响，暖暖照人。饭菜香气和牛粪味混在一起，飘荡在空气中。几名杂役在一个喇嘛的带领下来回忙碌，一派繁忙景象。]],
  exit = {
    s = { to = '大雪山斋堂', },
  },
},

['大雪山千步岭#1'] = {
  id = '大雪山千步岭#1',
  area = '大雪山',
  name = '千步岭',
  desc =  [[这里山势平缓，拾阶而上不甚费力，前面山岭据说走一千步就可越过。真是：    千里断肠关山古道，回首高城似天杳。    天涯倦旅，此时心事良苦。]],
  exit = {
    se = { to = '大雪山善禅渡', },
    wu = { to = '大雪山千步岭#2', },
  },
},

['大雪山结缘堂'] = {
  id = '大雪山结缘堂',
  area = '大雪山',
  name = '结缘堂',
  desc =  [[这里是间普通的配房，是供普通香客休息的地方。门上挂着厚厚的门帘，屋内升着一盆炭火。靠墙摆放了一溜的木凳，中间有两张木桌，桌上放着一把茶壶和几个茶杯。墙上挂着几本功德簿。]],
  exit = {
    e = { to = '大雪山遮雨廊#2W', },
  },
},

['大雪山萨迦法堂'] = {
  id = '大雪山萨迦法堂',
  area = '大雪山',
  name = '萨迦法堂',
  desc =  [[这座法堂重檐盔顶，纯木结构，四面环以明廊，腰檐设有平座，建筑精湛，精巧别致。廊下环栽着长青松柏，庭中更有一株几抱粗的百年梅花树，树干黝黑似铁，苍劲挺拔。]],
  exit = {
    u = { to = '大雪山法堂二楼', },
    s = { to = '大雪山梵音阁', },
  },
},

['大雪山镜庐佛堂'] = {
  id = '大雪山镜庐佛堂',
  area = '大雪山',
  name = '镜庐佛堂',
  desc =  [[一座不大的小佛堂。歇山顶，脊吻作龙象禽兽饰，四角垂有铜铃，每当风动，铃声清脆。窗外一泓泉水，深约三丈，水平如镜，可鉴毛发，泉边松柏掩映，极尽清幽雅静。堂外小路一头通向后山，另一条尽头是扇黑漆木门。]],
  exit = {
    w = { to = '大雪山灵塔林', door = 'open door', },
    se = { to = '大雪山梵音阁', },
  },
},

['大雪山雪灵泉'] = {
  id = '大雪山雪灵泉',
  area = '大雪山',
  name = '雪灵泉',
  desc =  [[这是由雪山积雪融化汇流而成的一条小溪，流到这里，地势平坦，蓄成了一汪泉水(quanshui)，清澈甘冽，冰凉透骨。真是：    水穷行到处，云起坐看时。    千山遮不住，毕竟东流去。    水远，怎知流水外，却是乱山更远。]],
  exit = {
    ne = { to = '大雪山雪积古道#1', },
    sd = { to = '大雪山风见台', },
    hidden = { to = '大雪山泉水中', cmd = 'tiao quanshui', },
  },
},

['大雪山泉水中'] = {
  id = '大雪山泉水中',
  area = '大雪山',
  name = '泉水中',
  desc =  [[及膝深的泉水在你身边缓缓流过，清澈见底，水中不时有小鱼在鹅卵石中游来游去。]],
  exit = {
    hidden = { to = '大雪山雪灵泉', cmd = 'tiao out', },
  },
},

['大雪山梵音阁'] = {
  id = '大雪山梵音阁',
  area = '大雪山',
  name = '梵音阁',
  desc =  [[阁为三间单体高台建筑，阁内四面均有砖砌成的许多个方形小佛龛，龛内各供泥塑佛像一尊。均身披袈裟，盘足坐莲台上，头部冒出佛光。是寺内诵经礼佛的地方。在东南角有扇不大起眼的黑漆木门。]],
  exit = {
    sd = { to = '大雪山护法扎仓', },
    e = { to = '大雪山大经堂', },
    w = { to = '大雪山金刚院', },
    nw = { to = '大雪山镜庐佛堂', },
    n = { to = '大雪山萨迦法堂', },
  },
},

['大雪山遮雨廊#4E'] = {
  id = '大雪山遮雨廊#4E',
  area = '大雪山',
  name = '遮雨廊',
  desc =  [[一道不算太宽的长廊，通向几座主要的大殿，廊顶和廊柱上满布壁画，描写了历史人物事迹和佛教故事，色彩艳丽，形象逼真。]],
  exit = {
    e = { to = '大雪山波罗蜜院', },
    s = { to = '大雪山遮雨廊#3E', },
    wu = { to = '大雪山珠都巴殿', },
  },
},

['大雪山炽阳门'] = {
  id = '大雪山炽阳门',
  area = '大雪山',
  name = '炽阳门',
  desc =  [[这里是座石砌的圆形小角门，门楣上正中雕刻着一轮当空红日，下面层层云海衬托，从红日向四方放射出霞光万道。门上阳刻梵文咒语，用金漆色。门口左右分别镇着一只神兽，为铜铸金象，一为昂首扬鼻迈步状，一为前倾发力状。]],
  exit = {
    w = { to = '大雪山日木伦殿', },
    enter = { to = '大雪山清心舍', },
  },
},

['大雪山月亮门'] = {
  id = '大雪山月亮门',
  area = '大雪山',
  name = '月亮门',
  desc =  [[这里是座石砌的小角门，门成奇特的半月形，门楣上正中雕刻着一弯新月，旁边雕刻些星辰和新月交相辉映。门上阴刻梵文咒语，用金泥填充。门口左右分别镇着一只神兽，为铜铸金翅鸟，一只作飞腾状，一只盘踞状。]],
  exit = {
    e = { to = '大雪山日木伦殿', },
    enter = { to = '大雪山绝尘院', },
  },
},

['大雪山猛虎营'] = {
  id = '大雪山猛虎营',
  area = '大雪山',
  name = '猛虎营',
  desc =  [[这里驻扎的是吐蕃国皇家的亲兵卫队，负责皇城内外的防务。营内中间有一大快平整的教练场，一个威风凛凛的将官正大声吆喝着训练一小队士兵。营门右首的墙上贴着张微微泛黄的告示(gaoshi)。]],
  exit = {
    e = { to = '大雪山街道#1', },
  },
},

['大雪山金刚院'] = {
  id = '大雪山金刚院',
  area = '大雪山',
  name = '金刚院',
  desc =  [[院内阔数十丈，主殿重檐琉璃金瓦。木横枋镂雕蟠龙，极其生动精美，殿内龛内供有一尊石刻金刚( jingang)殿前有四根汉白玉石柱，石阶前有石狮、石象各一对，角落两边各放着一排兵器架( jia)。]],
  exit = {
    e = { to = '大雪山梵音阁', },
    s = { to = '大雪山苦修扎仓', },
  },
},

['大雪山巨水门'] = {
  id = '大雪山巨水门',
  area = '大雪山',
  name = '巨水门',
  desc =  [[这里是吐蕃国皇城的北门，吐蕃是边陲小国，但历年重视军备城防，城墙修筑得坚实高阔，比起中原重镇来竟也毫不逊色。出了城门就是天云马场了。]],
  exit = {
    s = { to = '大雪山街道#3', },
    n = { to = '大雪山天云马场', },
  },
},

['大雪山皇宫'] = {
  id = '大雪山皇宫',
  area = '大雪山',
  name = '皇宫',
  desc =  [[这里是正在建筑中的新吐蕃皇宫，虽然刚刚建到一半，也可以看出规模之大。到处是一堆堆的石料和木料，几百名戴着镣铐的囚犯在士兵的监督下和各地聚集来的工匠在辛勤的劳作。寒冷的北风呼啸而过，卷起漫天的尘土，可工作的人们个个却是干得满头大汗。]],
  exit = {
    w = { to = '大雪山赞普广场', },
  },
},

['大雪山斋堂'] = {
  id = '大雪山斋堂',
  area = '大雪山',
  name = '斋堂',
  desc =  [[这里整整齐齐地码放着几溜长条桌子和凳子，一阵阵食物的香气传来，原来这里是大轮寺的斋堂，现在不是吃饭的时间，大堂里空荡荡的，只有几个杂役喇嘛有的在收拾桌子，有的在扫地，一切看来井井有条。]],
  exit = {
    nw = { to = '大雪山日木伦殿', },
    n = { to = '大雪山厨房', },
  },
},

['大雪山玲珑舍利塔'] = {
  id = '大雪山玲珑舍利塔',
  area = '大雪山',
  name = '玲珑舍利塔',
  desc =  [[进得塔林迎面是一座八角玲珑塔，塔高九层，塔身正面浮雕有佛龛，四周有浮云环绕。塔角挂风铃，风过铃动，声音清脆悦耳。其中宝塔二层( tower)为阁楼式，内设平台，四周围以石栏。造型别致，与众不同。]],
  exit = {
    out = { to = '大雪山灵塔林', },
  },
},

['大雪山猴子洞'] = {
  id = '大雪山猴子洞',
  area = '大雪山',
  name = '猴子洞',
  desc =  [[这里传说是观世音菩萨点化的猕猴和岩洞女妖结合、繁衍后代的地方。岩洞深处的壁上雕有猴子像，形态活泼，亲切可爱。洞外到处都是光秃秃的岩石，石缝中挤出的几颗杂草在寒风中瑟瑟发抖。]],
  exit = {
    se = { to = '大雪山绞盘', },
    wu = { to = '大雪山雪积古道#3', },
  },
},

['大雪山却日殿'] = {
  id = '大雪山却日殿',
  area = '大雪山',
  name = '却日殿',
  desc =  [[大殿面阔九间，进深五间，单檐四柱，耸立在高台上。殿内并列七坐佛像，连莲坐高约八米。梁架和内槽斗拱上有彩画，四壁有壁画，画了十佛，八菩萨，十八罗汉等等，形象逼真，栩栩如生。]],
  exit = {
    ed = { to = '大雪山遮雨廊#3E', },
    s = { to = '大雪山礼佛大殿', },
    wd = { to = '大雪山遮雨廊#3W', },
    n = { to = '大雪山珠都巴殿', },
  },
},

['大雪山洛微堂'] = {
  id = '大雪山洛微堂',
  area = '大雪山',
  name = '洛微堂',
  desc =  [[堂分前、中、后三进，前堂两侧设角门及八字形雕花砖墙，后两进为两层重檐轿子顶的阁楼。与前堂左右重檐角门相衬托，堂皇庄重。檐下廊内皆有浮雕飞天鸟兽等图案。这里是大轮寺弟子和外来僧侣讲经论佛的地方。本寺方丈鸠摩智就经常在这里开坛论法。]],
  exit = {
    w = { to = '大雪山遮雨廊#2E', },
    e = { to = '大雪山大日法堂', },
  },
},

['大雪山大日法堂'] = {
  id = '大雪山大日法堂',
  area = '大雪山',
  name = '大日法堂',
  desc =  [[这是一间气势雄伟的法堂，法堂正中立着大日如来佛法象，四壁上端坐着座座比规模较小的法象，是如来的十二大弟子。黄缦低垂，庄严肃穆。一座香炉，香烟缭绕，袅袅上升。炉前跌坐着一位须发全白的老僧，喃喃低语，似乎   正在念诵什么佛]],
  exit = {
    w = { to = '大雪山洛微堂', },
  },
},

['大雪山天溪'] = {
  id = '大雪山天溪',
  area = '大雪山',
  name = '天溪',
  desc =  [[一条小溪静静流过，带着浮冰残雪，叮咚作响，沿溪水蜿蜒而上地势渐高，两岸具是陡峭的山峰，山上白雪皑皑。]],
  exit = {
    s = { to = '大雪山天湖', },
  },
},

['大雪山御圣殿'] = {
  id = '大雪山御圣殿',
  area = '大雪山',
  name = '御圣殿',
  desc =  [[这里是专供吐蕃国王族来寺朝佛时休息的地方。屋内陈设华丽，四面墙壁都挂有绚烂的墙幔，家具用品非常精美，在吐蕃国内堪称一流。正中摆了一张巨大的三层雕花台案，上面放满了历次吐蕃王族供奉的各种器物，在牛油粗蜡照耀下烁烁生辉。]],
  exit = {
    e = { to = '大雪山遮雨廊#4W', },
  },
},

['大雪山风见台'] = {
  id = '大雪山风见台',
  area = '大雪山',
  name = '风见台',
  desc =  [[走到这里，眼前豁然开朗，只见一个方圆几十丈旷坪，四周光秃秃的只有些杂草，坑洼处露出一片片残雪。四下一片寂静，只有凛冽的山风呼啸而过，发出狼嚎般的怪响。]],
  exit = {
    nu = { to = '大雪山雪灵泉', },
    w = { to = '大雪山落风岗', },
    ed = { to = '大雪山入幽口', },
  },
},

['大雪山落风岗'] = {
  id = '大雪山落风岗',
  area = '大雪山',
  name = '落风岗',
  desc =  [[这里是个向阳的山冈，一面是几十丈高的陡坡，另一面是峡谷。陡坡上厚厚的雪层被阳光照耀而渐渐融化，加上常年山风猛烈的吹拂，这里经常发生大大小小的雪崩，平日这里轻易是没人来的。]],
  exit = {
    e = { to = '大雪山风见台', },
    hidden = { to = '大雪山雪谷', cmd = 'tiao down', },
  },
},

['大雪山遮雨廊#2W'] = {
  id = '大雪山遮雨廊#2W',
  area = '大雪山',
  name = '遮雨廊',
  desc =  [[一道不算太宽的长廊，通向几座主要的大殿，廊顶和廊柱上满布壁画，描写了历史人物事迹和佛教故事，色彩艳丽，形象逼真。]],
  exit = {
    s = { to = '大雪山遮雨廊#1W', },
    eu = { to = '大雪山礼佛大殿', },
    w = { to = '大雪山结缘堂', },
    n = { to = '大雪山遮雨廊#3W', },
  },
},

['大雪山遮雨廊#1E'] = {
  id = '大雪山遮雨廊#1E',
  area = '大雪山',
  name = '遮雨廊',
  desc =  [[一道不算太宽的长廊，通向几座主要的大殿，廊顶和廊柱上满布壁画，描写了历史人物事迹和佛教故事，色彩艳丽，形象逼真。]],
  exit = {
    e = { to = '大雪山鼓楼', },
    w = { to = '大雪山殿前广场', },
    n = { to = '大雪山遮雨廊#2E', },
  },
},

['大雪山精进扎仓'] = {
  id = '大雪山精进扎仓',
  area = '大雪山',
  name = '精进扎仓',
  desc =  [[一座罕见的半圆形的大殿堂，以淡红色砖砌成。殿顶及两壁满布大幅彩色壁画，内容均为佛经中勉励修炼的题材。殿内墙边摆些练功所用的器具，几个弟子正在你来我往的练习。]],
  exit = {
    w = { to = '大雪山护法扎仓', },
    n = { to = '大雪山大经堂', },
  },
},

['大雪山赞普广场'] = {
  id = '大雪山赞普广场',
  area = '大雪山',
  name = '赞普广场',
  desc =  [[这里是皇城中心的一片广场，广场中心有座吐蕃赞普的石雕像，是名。雕像下面有不少买卖人起劲的吆喝着。广场东面是正在建筑中的吐蕃新皇宫，一队队的民夫推着装满石料木料的推车走过去，几名吐蕃武士把守着路口，警惕的注视着来来往往的行人。西边是佛照门，是通往吐蕃护国禅寺大轮寺的毕经之路。]],
  exit = {
    e = { to = '大雪山皇宫', },
    s = { to = '大雪山街道#2', },
    w = { to = '大雪山佛照门', },
    n = { to = '大雪山街道#3', },
  },
},

['大雪山日木伦殿'] = {
  id = '大雪山日木伦殿',
  area = '大雪山',
  name = '日木伦殿',
  desc =  [[大殿高四层，上覆金顶，辉煌壮观。不但有中原的建筑风格，也吸收了天竺和回纥等建筑艺术特色。正殿大柱上斗拱架梁浮雕精美，有人物、天鹅、象等鸟兽。殿前围墙正中有扇黑漆小门通向寺前各处。]],
  exit = {
    se = { to = '大雪山斋堂', },
    e = { to = '大雪山炽阳门', },
    out = { to = '大雪山谢客亭', },
    w = { to = '大雪山月亮门', },
    n = { to = '大雪山护法扎仓', },
  },
},

['大雪山藏边土路#1'] = {
  id = '大雪山藏边土路#1',
  area = '大雪山',
  name = '藏边土路',
  desc =  [[这里已经进入了西藏，地势越来越高，空气稀薄，连呼吸都困难起来。阳光分外刺眼，晒得人皮肤发紧，口干舌燥。遥遥往见远处一座城池，让人不由得振奋精神，加快了脚步。]],
  exit = {
    ne = { to = '大雪山川西土路', },
    sw = { to = '大雪山藏边土路#2', },
  },
},

['大雪山天云马场'] = {
  id = '大雪山天云马场',
  area = '大雪山',
  name = '天云马场',
  desc =  [[这里有一大片广阔的草原，是吐蕃国家的军马场，放眼过去，草原上滚滚而过的马群只怕有上千匹之多，匹匹膘肥体壮，神骏非常。由于这里是禁止普通百姓放牧的，所以除了马匹看不到别的什么牲畜。]],
  exit = {
    e = { to = '大雪山采石场', },
    s = { to = '大雪山巨水门', },
  },
},

['大雪山护法扎仓'] = {
  id = '大雪山护法扎仓',
  area = '大雪山',
  name = '护法扎仓',
  desc =  [[这座大殿重檐九脊，青瓦丹墙，色调和谐，体态庄重，檐下悬匾额一方，藏文书写，边框浮雕游龙，飞金走彩，颇为富丽。内供九天二十四大护法，四周殿壁上有壁画，讲述了这二十四大护法宏扬我佛，降伏妖邪的事迹。]],
  exit = {
    nu = { to = '大雪山梵音阁', },
    w = { to = '大雪山苦修扎仓', },
    s = { to = '大雪山日木伦殿', },
    e = { to = '大雪山精进扎仓', },
  },
},

['大雪山殿前广场'] = {
  id = '大雪山殿前广场',
  area = '大雪山',
  name = '殿前广场',
  desc =  [[这是大殿前的广场，方圆一百多丈，一色的青石板漫地，许多大轮寺的喇嘛正在忙忙碌碌的穿梭不停，更有许多进香客在这里一步一个头的磕进大殿去。大殿里传来众喇嘛讼经和法器敲打的声音。一股浓郁的香火味道飘散在空中。]],
  exit = {
    nu = { to = '大雪山礼佛大殿', },
    w = { to = '大雪山遮雨廊#1W', },
    sd = { to = '大雪山大轮寺山门', door = 'pull gate', },
    e = { to = '大雪山遮雨廊#1E', },
  },
},

['大雪山遮雨廊#3W'] = {
  id = '大雪山遮雨廊#3W',
  area = '大雪山',
  name = '遮雨廊',
  desc =  [[一道不算太宽的长廊，通向几座主要的大殿，廊顶和廊柱上满布壁画，描写了历史人物事迹和佛教故事，色彩艳丽，形象逼真。]],
  exit = {
    s = { to = '大雪山遮雨廊#2W', },
    eu = { to = '大雪山却日殿', },
    w = { to = '大雪山积善堂', },
    n = { to = '大雪山遮雨廊#4W', },
  },
},

['大雪山街道#2'] = {
  id = '大雪山街道#2',
  area = '大雪山',
  name = '街道',
  desc =  [[吐蕃国皇城的街道比起中原大城来要窄小些，也冷清许多。青石漫铺的路两边已经被压出两道深深的车辙。压碎的青石板下裸露出的泥土呈现出脏乎乎的黑色，被冻得硬邦邦的。看来吐蕃当今赞普大大重视军备于民生。东边漂来一阵酒香，看来有家酒馆。西面是织造作坊。]],
  exit = {
    e = { to = '大雪山溢香楼', },
    s = { to = '大雪山街道#1', },
    w = { to = '大雪山吐蕃织造作坊', },
    n = { to = '大雪山赞普广场', },
  },
},

['大雪山来福杂货'] = {
  id = '大雪山来福杂货',
  area = '大雪山',
  name = '来福杂货',
  desc =  [[这间杂货铺铺面不大，货架上、地面上、甚至角落里都见缝插针地摆放着些各式各样的货物，显得有些凌乱。不过从大到小，日常里用得着的这里都能买到，附近居民还真离不开这间小店。墙上挂着个价目表(sign)。]],
  exit = {
    e = { to = '大雪山街道#3', },
  },
},

['大雪山街道#3'] = {
  id = '大雪山街道#3',
  area = '大雪山',
  name = '街道',
  desc =  [[吐蕃国皇城的街道比起中原大城来要窄小些，也冷清许多。青石漫铺的路两边已经被压出两道深深的车辙。压碎的青石板下裸露出的泥土呈现出脏乎乎的黑色，被冻得硬邦邦的。看来吐蕃当今赞普大大重视军备于民生。东边是个工匠铺。西面是本城唯一的来福杂货。]],
  exit = {
    e = { to = '大雪山王大力记', },
    s = { to = '大雪山赞普广场', },
    w = { to = '大雪山来福杂货', },
    n = { to = '大雪山巨水门', },
  },
},

['大雪山遮雨廊#3E'] = {
  id = '大雪山遮雨廊#3E',
  area = '大雪山',
  name = '遮雨廊',
  desc =  [[一道不算太宽的长廊，通向几座主要的大殿，廊顶和廊柱上满布壁画，描写了历史人物事迹和佛教故事，色彩艳丽，形象逼真。]],
  exit = {
    e = { to = '大雪山怡摩宫', },
    wu = { to = '大雪山却日殿', },
    s = { to = '大雪山遮雨廊#2E', },
    n = { to = '大雪山遮雨廊#4E', },
  },
},

['大雪山湖边'] = {
  id = '大雪山湖边',
  area = '大雪山',
  name = '湖边',
  desc =  [[走到这里，小路已经到了尽头，一道刀削似的峭壁(qiaobi)横在面前。抬头看去，峭壁间云雾缭绕，石壁光滑，无可攀缘之处，看来只能回头了。]],
  exit = {
    s = { to = '大雪山湖边小路#1', },
    enter = { to = '大雪山藤筐', cmd = 'yell tengkuang', unstable = true, handler = 'embark', no_wander = true, },
  },
},

['大雪山入幽口'] = {
  id = '大雪山入幽口',
  area = '大雪山',
  name = '入幽口',
  desc =  [[此处已在群山环绕之中，山路去处就是巍峨的大雪山，抬头了望，峰顶云雾缭绕，宛如仙境。真是：    天山相连苍茫外，碧云去尽山无数。    云山万重，寸心千里。    望极天涯不见家。 ]],
  exit = {
    eu = { to = '大雪山千步岭#2', cost = 5, cmd = '#wa 2000;eu', },
    wu = { to = '大雪山风见台', cost = 5, cmd = '#wa 2000;wu', cond = 'player.enable.dodge and player.enable.dodge.level >= 10', },
  },
},

['大雪山苦修扎仓'] = {
  id = '大雪山苦修扎仓',
  area = '大雪山',
  name = '苦修扎仓',
  desc =  [[一座罕见的三角形的大殿堂，以青砖砌成。殿顶及两壁满布大幅彩色壁画，内容均为佛经中勉励修炼的题材。殿内墙边摆些练功所用的器具，几个弟子正在你来我往的练习。]],
  exit = {
    e = { to = '大雪山护法扎仓', },
    n = { to = '大雪山金刚院', },
  },
},

['大雪山雪谷'] = {
  id = '大雪山雪谷',
  area = '大雪山',
  name = '雪谷',
  desc =  [[这里是群山环绕中的一个山谷，人迹罕至。仰面向上看，四面山峰高耸入云，覆盖着冰雪。周围茫茫雪原，甚至连野兽的足迹都看不到。]],
  exit = {
    ed = { to = '大雪山千步岭#1', },
    hidden = { to = '大雪山岩石', no_wander = true, cmd = 'jump down', cond = 'player.enable.dodge and player.enable.dodge.level >= 150', },
  },
},

['大雪山岩石'] = {
  id = '大雪山岩石',
  area = '大雪山',
  name = '岩石',
  desc =  [[这里是群山环绕中的一个山谷，人迹罕至。仰面向上看，四面山峰高耸入云，覆盖着冰雪。这里正巧一块巨大的岩石，遮蔽了许多风雪。]],
  exit = {
    hidden = { to = '大雪山雪谷', handler = 'xs_leave_rock', cond = 'player.enable.dodge and player.enable.dodge.level >= 150', },
  },
},

['大雪山雪积古道#3'] = {
  id = '大雪山雪积古道#3',
  area = '大雪山',
  name = '雪积古道',
  desc =  [[  峰回路转。  远望山顶，冰雕雪塑，隐约有庙舍。  近踩积雪，深可及膝，举步为艰。  风势尤劲，夹杂着冰雪，如刀割面。]],
  exit = {
    ed = { to = '大雪山猴子洞', },
    wd = { to = '大雪山雪积古道#2', },
    nw = { to = '大雪山大轮寺山门', },
  },
},

['大雪山清心舍'] = {
  id = '大雪山清心舍',
  area = '大雪山',
  name = '清心舍',
  desc =  [[这里是大轮寺男弟子休息的地方。屋内陈设简单，墙壁上挂着张手织毛毯，做工颇为精细。墙边有几张硬木板床，床边放着两个旧得泛黄的柜子。]],
  exit = {
    out = { to = '大雪山炽阳门', },
  },
},

['大雪山吐蕃织造作坊'] = {
  id = '大雪山吐蕃织造作坊',
  area = '大雪山',
  name = '吐蕃织造作坊',
  desc =  [[由于吐蕃国内盛产优质皮毛，所以丝毛手工艺品业发达。这里是吐蕃国官办的作坊，无论从规模还是技术都是一流的。作坊内长年点着粗大的牛油蜡烛，房间的一角加工好的皮毛堆得象小山一样，几十名女工低头飞快的织着花色不同的毛毯，手法娴熟，其中有不少还是十几岁的孩子。一个监工模样的人来回走动巡视着。]],
  exit = {
    e = { to = '大雪山街道#2', },
  },
},

['大雪山正房'] = {
  id = '大雪山正房',
  area = '大雪山',
  name = '正房',
  desc =  [[房内灯火通明，靠墙一面一张好大的通炕，挤挤睡四、五十个人不成问题。现在上面横七竖八的已经躺着不少人。喧闹声此起彼伏，东头有堆人大呼小叫的好象在赌博。西边一个老头正嘣嘣的弹着把不知名的琴，边上围了几个小孩。不远处一个孩子哭闹不休，抱着他的妇女背转了身子要哄他喂奶。空气中飘荡着饭香、汗臭、脂粉、牛马粪混合而成的一股怪味。看来只好将就将就了。]],
  exit = {
    out = { to = '大雪山招财大车店', },
  },
},

['大雪山法堂二楼'] = {
  id = '大雪山法堂二楼',
  area = '大雪山',
  name = '法堂二楼',
  desc =  [[这里是大轮寺掌门居所，四面清幽，修禅证道最妙不过。真是：    戏招西塞山前月，来听东林寺里钟。    悠然万虑忘，有此一楼足。    西窗外，群山万壑，望尽天地。    东窗外，楼台错落，几尽悠闲。]],
  exit = {
    d = { to = '大雪山萨迦法堂', },
  },
},

['大雪山湖边小店'] = {
  id = '大雪山湖边小店',
  area = '大雪山',
  name = '湖边小店',
  desc =  [[这是一间简陋的土坯房，门口挂着块裂了几个口子的木招牌。屋中凌乱不堪，东倒西歪地散落着几件破旧的桌椅，蒙着厚厚的灰尘，墙角结着个蜘蛛网。]],
  exit = {
    n = { to = '大雪山天湖', },
  },
},

['大雪山王大力记'] = {
  id = '大雪山王大力记',
  area = '大雪山',
  name = '王大力记',
  desc =  [[这里是间工匠作坊，已经有几十年的历史。创始人是个叫王大力的人，父子世代相传至今已有三代，个个都是巧手匠人，代代青出于蓝而胜于蓝。现在规模扩大，又招募了些人才，木工、瓦工、玉器、石料、铁匠样样在行。]],
  exit = {
    w = { to = '大雪山街道#3', },
  },
},

['大雪山礼佛大殿'] = {
  id = '大雪山礼佛大殿',
  area = '大雪山',
  name = '礼佛大殿',
  desc =  [[这里是雪山大轮寺大殿，虽然是远在雪山，但大殿气势确在中原也难得一见。正面矗立一座数十尺高的金身大佛，大殿内烟雾缭绕几个喇嘛正在念佛颂经，另外还有喇嘛有节奏的敲打法器。大殿中央有一盏长明灯，一般来此朝奉的人都要先在此供奉(gongfeng)酥油。殿两侧是遮雨廊。绕过大佛，可以走到却日殿去。]],
  exit = {
    ed = { to = '大雪山遮雨廊#2E', },
    sd = { to = '大雪山殿前广场', },
    wd = { to = '大雪山遮雨廊#2W', },
    n = { to = '大雪山却日殿', },
  },
},

['大雪山街道#1'] = {
  id = '大雪山街道#1',
  area = '大雪山',
  name = '街道',
  desc =  [[吐蕃国皇城的街道比起中原大城来要窄小些，也冷清许多。青石漫铺的路两边已经被压出两道深深的车辙。压碎的青石板下裸露出的泥土呈现出脏乎乎的黑色，被冻得硬邦邦的。看来吐蕃当今赞普大大重视军备于民生。东边是家大车店，有不少来往客商在那里歇脚。西面是个兵营。]],
  exit = {
    e = { to = '大雪山招财大车店', },
    s = { to = '大雪山明霞门', },
    w = { to = '大雪山猛虎营', },
    n = { to = '大雪山街道#2', },
  },
},

['大雪山明霞门'] = {
  id = '大雪山明霞门',
  area = '大雪山',
  name = '明霞门',
  desc =  [[这里是吐蕃国皇城的南门，吐蕃是边陲小国，但历年重视军备城防，城墙修筑得坚实高阔，比起中原重镇来竟也毫不逊色。此刻城门吊桥落下，由城门洞下经过的行人熙熙攘攘，看形貌服色大多是在附近聚居的少数民族。]],
  exit = {
    e = { to = '大雪山藏边土路#2', },
    n = { to = '大雪山街道#1', },
  },
},

['大雪山藏边土路#2'] = {
  id = '大雪山藏边土路#2',
  area = '大雪山',
  name = '藏边土路',
  desc =  [[这里已经进入了西藏，地势越来越高，空气稀薄，连呼吸都困难起来。阳光分外刺眼，晒得人皮肤发紧，口干舌燥。遥遥往见远处一座城池，让人不由得振奋精神，加快了脚步。]],
  exit = {
    ne = { to = '大雪山藏边土路#1', },
    w = { to = '大雪山明霞门', },
  },
},

['大雪山雪积古道#1'] = {
  id = '大雪山雪积古道#1',
  area = '大雪山',
  name = '雪积古道',
  desc =  [[  天，阴郁，铅灰而低沉。  雪，漫天，狂风迷人眼。  左侧是万丈的高崖，陡峭不见顶；  右侧是不测的山谷，深邃不见底。  小径，上雪山必经之路。]],
  exit = {
    se = { to = '大雪山雪积古道#2', },
    sw = { to = '大雪山雪灵泉', },
  },
},

['大雪山大经堂'] = {
  id = '大雪山大经堂',
  area = '大雪山',
  name = '大经堂',
  desc =  [[殿为十字歇山顶，形制峻瑰，殿堂规模宏大，内有大柱上千根，可同时容纳几百名僧人同时诵经。殿前有跃马、伏虎、卧牛、怪兽、等许多石雕像。殿内大柱和四面墙壁上刻满经文，有几个僧人正在柱下禅定(chanding)，还有些僧人对着墙壁上的经文冥思苦想(mingxiang)。]],
  exit = {
    w = { to = '大雪山梵音阁', },
    s = { to = '大雪山精进扎仓', },
  },
},

['大雪山遮雨廊#1W'] = {
  id = '大雪山遮雨廊#1W',
  area = '大雪山',
  name = '遮雨廊',
  desc =  [[一道不算太宽的长廊，通向几座主要的大殿，廊顶和廊柱上满布壁画，描写了历史人物事迹和佛教故事，色彩艳丽，形象逼真。]],
  exit = {
    e = { to = '大雪山殿前广场', },
    w = { to = '大雪山钟楼', },
    n = { to = '大雪山遮雨廊#2W', },
  },
},

['大雪山湖边小路#1'] = {
  id = '大雪山湖边小路#1',
  area = '大雪山',
  name = '湖边小路',
  desc =  [[天湖湖边的一条小路，向前望不到尽头，不知道通向那里。路边野花芬芳，蝴蝶飞舞，除了你自己的脚步声，四下里只听见一声高一声低的鸟鸣。]],
  exit = {
    e = { to = '大雪山佛照门', },
    w = { to = '大雪山湖边小路#2', },
    n = { to = '大雪山湖边', },
  },
},

['大雪山钟楼'] = {
  id = '大雪山钟楼',
  area = '大雪山',
  name = '钟楼',
  desc =  [[这里是大轮寺钟楼，每逢早、中、晚，或者要召集众喇嘛的时候，都要和鼓楼同时敲响。钟楼内挂一口千斤大钟( zhong)，厚约有一寸，钟旁悬有一个巨大的钟槌(chui)，看来也有上百斤。如果没有一定的外功修为和相当的内功是无法敲响的。]],
  exit = {
    e = { to = '大雪山遮雨廊#1W', },
  },
},

['大雪山佛照门'] = {
  id = '大雪山佛照门',
  area = '大雪山',
  name = '佛照门',
  desc =  [[这里是吐蕃国皇城的西门，吐蕃是边陲小国，但历年重视军备城防，城墙修筑得坚实高阔，比起中原重镇来竟也毫不逊色。出了城门是通向大雪山的道路。]],
  exit = {
    w = { to = '大雪山湖边小路#1', },
    e = { to = '大雪山赞普广场', },
  },
},

['大雪山湖边小路#2'] = {
  id = '大雪山湖边小路#2',
  area = '大雪山',
  name = '湖边小路',
  desc =  [[天湖湖边的一条小路，向前望不到尽头，不知道通向那里。路边野花芬芳，蝴蝶飞舞，除了你自己的脚步声，四下里只听见一声高一声低的鸟鸣。]],
  exit = {
    nw = { to = '大雪山湖边小路#3', },
    e = { to = '大雪山湖边小路#1', },
  },
},

['大雪山湖边小路#3'] = {
  id = '大雪山湖边小路#3',
  area = '大雪山',
  name = '湖边小路',
  desc =  [[天湖湖边的一条小路，向前望不到尽头，不知道通向那里。路边野花芬芳，蝴蝶飞舞，除了你自己的脚步声，四下里只听见一声高一声低的鸟鸣。]],
  exit = {
    ne = { to = '大雪山天湖', },
    se = { to = '大雪山湖边小路#2', },
  },
},

['大雪山天湖'] = {
  id = '大雪山天湖',
  area = '大雪山',
  name = '天湖',
  desc =  [[这里是一片广阔的淡水湖，天空一望无垠，湖水清澈湛蓝，呈现出一幅独特的高原风光。真是：    长风怒卷高浪，飞洒日光寒，    无风水面琉璃滑，不觉船移，微动涟漪，惊起沙禽掠岸飞。    一千五百年间事，只有滩声似旧时。]],
  exit = {
    s = { to = '大雪山湖边小店', },
    sw = { to = '大雪山湖边小路#3', },
    w = { to = '大雪山善禅渡', },
    n = { to = '大雪山天溪', },
  },
},

['大雪山雪积古道#2'] = {
  id = '大雪山雪积古道#2',
  area = '大雪山',
  name = '雪积古道',
  desc =  [[   略显开阔，已入深山。   积雪松林，屏蔽在道边。   怪鸟掠过头顶，阵阵怪叫，不绝于耳；   异兽躲于林中，暗中窥视，杀机四伏。]],
  exit = {
    nw = { to = '大雪山雪积古道#1', },
    eu = { to = '大雪山雪积古道#3', },
  },
},

['大雪山绞盘'] = {
  id = '大雪山绞盘',
  area = '大雪山',
  name = '绞盘',
  desc =  [[面前是个方圆几十丈的平台。是借着山势，经过人工开凿而成的。平台边建造了一个大绞盘，绞盘绳子一端连着个巨大的藤筐(tengkuang)。 一个高大的番僧(fanseng)走来走去，指挥着众人。]],
  exit = {
    nw = { to = '大雪山猴子洞', },
    enter = { to = '大雪山藤筐', cmd = 'zhaohu fanseng', unstable = true, handler = 'embark', no_wander = true, },
  },
},

['大雪山积善堂'] = {
  id = '大雪山积善堂',
  area = '大雪山',
  name = '积善堂',
  desc =  [[这里是间宽敞的大配房，是专供贵客休息的地方。正中修砌了一座暖炕，炕上铺着软垫，炕上放了张矮几，几上有金茶壶和玉石茶杯。四周还摆了几张软榻，墙上挂着一些图画，主要都是佛教典故。]],
  exit = {
    e = { to = '大雪山遮雨廊#3W', },
  },
},

['大雪山遮雨廊#4W'] = {
  id = '大雪山遮雨廊#4W',
  area = '大雪山',
  name = '遮雨廊',
  desc =  [[一道不算太宽的长廊，通向几座主要的大殿，廊顶和廊柱上满布壁画，描写了历史人物事迹和佛教故事，色彩艳丽，形象逼真。]],
  exit = {
    eu = { to = '大雪山珠都巴殿', },
    w = { to = '大雪山御圣殿', },
    s = { to = '大雪山遮雨廊#3W', },
  },
},

['大雪山鼓楼'] = {
  id = '大雪山鼓楼',
  area = '大雪山',
  name = '鼓楼',
  desc =  [[这里是大轮寺鼓楼，每逢早、中、晚，或者要召集众喇嘛的时候，都要和钟楼同时敲响。鼓楼内架着一面大鼓(gu)，用厚厚的牦牛皮包裹着侧面用几百枚金钉钉牢。旁边悬挂一个鼓槌(chui)。]],
  exit = {
    w = { to = '大雪山遮雨廊#1E', },
  },
},

['大雪山怡摩宫'] = {
  id = '大雪山怡摩宫',
  area = '大雪山',
  name = '怡摩宫',
  desc =  [[正面为八层斗拱的屏风，中庭有南北配殿。殿堂前有宽敞明亮的月台，围以透花砖栏。主殿殿内四壁绘有壁画，尤其南壁绘有巨幅《天宫图》，共绘有人物五十多人，其神态各异，栩栩如生。]],
  exit = {
    w = { to = '大雪山遮雨廊#3E', },
  },
},

['大雪山波罗蜜院'] = {
  id = '大雪山波罗蜜院',
  area = '大雪山',
  name = '波罗蜜院',
  desc =  [[院内正殿气势雄伟，顶覆黄琉璃瓦，重檐歇山顶。内供飞天之神，形象狰狞，虬髯连鬓，矫健有力，荷戟而视，气势非凡。神脚下踩蟠龙，龙身云纹采用高浮雕和浅浮雕并用，犹如飞腾于波涛云海之中，极富变化。]],
  exit = {
    w = { to = '大雪山遮雨廊#4E', },
  },
},

['大雪山谢客亭'] = {
  id = '大雪山谢客亭',
  area = '大雪山',
  name = '谢客亭',
  desc =  [[前面一溜细青石覆檐砖墙，中间一扇黑漆木门，门额上有流云、仙鹤、行龙、双凤等深浮雕图案，雕工细致，构思巧妙。正中匾额书“谢客亭”三字。门旁立着个小牌子(sign)。]],
  exit = {
    enter = { to = '大雪山日木伦殿', },
    su = { to = '大雪山珠都巴殿', },
  },
},

['大雪山绝尘院'] = {
  id = '大雪山绝尘院',
  area = '大雪山',
  name = '绝尘院',
  desc =  [[这里是大轮寺女弟子安寝的所在，屋内陈设简单，打扫的一尘不染。真是：    一桁珠帘闲不卷，有暗香盈盈。    木床竹几，错落有至。    窗明几净，清净无寂。]],
  exit = {
    out = { to = '大雪山月亮门', },
  },
},

['大雪山溢香楼'] = {
  id = '大雪山溢香楼',
  area = '大雪山',
  name = '溢香楼',
  desc =  [[这里是家小小的酒馆，房间四壁被长年的油烟熏得全成了黑色，桌椅早被摩擦得失去了漆色，坐上去会摇晃着发出吱拗吱拗的怪响。柜台边上摆着个大酒缸，里面盛的是这里远近闻名的青稞烧酒，散发出一股刺鼻的酒气。这里的老板好象是从中原搬到这里来的，就是凭着这手酿酒的绝活，在这里生活了多年。西墙上挂着个写着毛笔字的木牌(sign)。]],
  exit = {
    w = { to = '大雪山街道#2', },
  },
},

['大雪山珠都巴殿'] = {
  id = '大雪山珠都巴殿',
  area = '大雪山',
  name = '珠都巴殿',
  desc =  [[大殿面阔五间，进深三间。明间重檐歇山顶，两梢见则用硬山顶。殿内功三十六根大木柱，其金柱呈梭柱形式，两端有卷煞。主殿二三层檐下，有成排的木雕伏兽和狮身人面泥质半圆塑像。]],
  exit = {
    ed = { to = '大雪山遮雨廊#4E', },
    nd = { to = '大雪山谢客亭', },
    wd = { to = '大雪山遮雨廊#4W', },
    s = { to = '大雪山却日殿', },
  },
},

['大雪山遮雨廊#2E'] = {
  id = '大雪山遮雨廊#2E',
  area = '大雪山',
  name = '遮雨廊',
  desc =  [[一道不算太宽的长廊，通向几座主要的大殿，廊顶和廊柱上满布壁画，描写了历史人物事迹和佛教故事，色彩艳丽，形象逼真。]],
  exit = {
    e = { to = '大雪山洛微堂', },
    wu = { to = '大雪山礼佛大殿', },
    s = { to = '大雪山遮雨廊#1E', },
    n = { to = '大雪山遮雨廊#3E', },
  },
},

['大雪山川西土路'] = {
  id = '大雪山川西土路',
  area = '大雪山',
  name = '川西土路',
  desc =  [[这里已经到了四川最西面，再往前走就要进藏了，气候比川中要冷许多，路边越渐荒凉，偶尔在草丛中露出一堆白骨，在寒风中闪着刺眼的白光，令人触目惊心。]],
  exit = {
    e = { to = '成都城大道#2W', },
    sw = { to = '大雪山藏边土路#1', },
  },
},

['大雪山大轮寺山门'] = {
  id = '大雪山大轮寺山门',
  area = '大雪山',
  name = '大轮寺山门',
  desc =  { [[阶梯尽处是座高大华美的山门，一扇朱红嵌铜钉的大门敞开着，门上的包金铜钉被擦的亮闪闪的。高约十几丈的门楼及山门两侧均为白玉砌成，上有精美的浮雕，中间横匾上金漆着			※※※※※※※※※			※  大  轮  寺  ※			※※※※※※※※※		三个字，显得气派非凡。门两旁各有一只神兽镇门。远处隐约传来山寺钟鸣，惊起几只寒鸦在树梢间纷飞，方有脱离世俗的感觉。]], [[阶梯尽处是座高大华美的建筑，两扇朱红嵌铜钉的大门(gate)，门上的包金铜钉被擦的亮闪闪的。高约十几丈的门楼及山门两侧均为白玉砌成，上有精美的浮雕，中间横匾上金漆着			※※※※※※※※※			※  大  轮  寺  ※			※※※※※※※※※		三个字，显得气派非凡。门两旁各有一只神兽镇门。远处隐约传来山寺钟鸣，惊起几只寒鸦在树梢间纷飞，方有脱离世俗的感觉。]], },
  exit = {
    nu = { to = '大雪山殿前广场', door = 'knock gate;#wa 1000', },
    se = { to = '大雪山雪积古道#3', },
  },
},

['大雪山采石场'] = {
  id = '大雪山采石场',
  area = '大雪山',
  name = '采石场',
  desc =  [[在这里，平坦的草原突然隆起一座高山。脚下踩着一堆堆散碎的砾石，山脚下老远就可以听到乒乒乓乓的声音，原来这里是个采石场。三四十个工匠正抡着大锤打石头，不远的小丘上站着个喇嘛，监视着他们。]],
  exit = {
    w = { to = '大雪山天云马场', },
    ed = { to = '大雪山藏民部落', },
  },
},

['大雪山灵塔林'] = {
  id = '大雪山灵塔林',
  area = '大雪山',
  name = '灵塔林',
  desc =  [[这里有历代主持灵塔九座，塔高七、八，十几层不等，造型优美，雄伟坚实。塔身以金皮包裹，宝玉镶嵌，金光灿烂。]],
  exit = {
    e = { to = '大雪山镜庐佛堂', },
    enter = { to = '大雪山玲珑舍利塔', },
    wu = { to = '大雪山积雪小路#1', },
  },
},

['大雪山积雪小路#1'] = {
  id = '大雪山积雪小路#1',
  area = '大雪山',
  name = '积雪小路',
  desc = [[这是一条积满雪的小路，蜿蜒向上，本来就陡峭难行，现在满覆冰雪，一步一滑。路一侧是看不到底的山谷，山风呼啸而过，吹得人遥遥欲坠，如果一个不小心摔了下去......]],
  exit = {
    nu = { to = '大雪山积雪小路#2', },
    ed = { to = '大雪山灵塔林', },
  },
},

['大雪山积雪小路#2'] = {
  id = '大雪山积雪小路#2',
  area = '大雪山',
  name = '积雪小路',
  desc = [[这是一条积满雪的小路，蜿蜒向上，本来就陡峭难行，现在满覆冰雪，一步一滑。路一侧是看不到底的山谷，山风呼啸而过，吹得人遥遥欲坠，如果一个不小心摔了下去......]],
  exit = {
    wu = { to = '大雪山积雪小路#3', },
    sd = { to = '大雪山积雪小路#1', },
  },
},

['大雪山积雪小路#3'] = {
  id = '大雪山积雪小路#3',
  area = '大雪山',
  name = '积雪小路',
  desc = [[这是一条积满雪的小路，蜿蜒向上，本来就陡峭难行，现在满覆冰雪，一步一滑。路一侧是看不到底的山谷，山风呼啸而过，吹得人遥遥欲坠，如果一个不小心摔了下去......]],
  exit = {
    nu = { to = '大雪山问天台', },
    ed = { to = '大雪山积雪小路#2', },
  },
},

['大雪山问天台'] = {
  id = '大雪山问天台',
  area = '大雪山',
  name = '问天台',
  desc = [[这是个方圆不过四五丈的天然平台，此处已接近大雪山顶峰，俯瞰脚下，群山银妆素裹，白云片片环绕，令人心胸开阔，豪气顿生。传说这里接近天界，大声说话可以直达天庭。仰头望向凌霄绝顶，就在眼前不远，可峭壁直耸，没有路了。]],
  exit = {
    e = { to = '大雪山冰林峰', },
    sd = { to = '大雪山积雪小路#3', },
    hidden = { to = '大雪山绝顶', cmd = 'climb up', },
  },
},

['大雪山冰林峰'] = {
  id = '大雪山冰林峰',
  area = '大雪山',
  name = '冰林峰',
  desc = [[这里是大雪山最高的山峰，终年覆盖在冰雪之中，气候寒冷。在凛冽的山风积年累月的吹拂下，形成了高约几丈到十几丈不等的座座冰柱，远远望去，犹如冰雪林海。每当晴天，阳光照耀下就会幻发出种种奇特的光晕，景色美不胜收。]],
  exit = {
    e = { to = '大雪山问天台', },
  },
},

['大雪山绝顶'] = {
  id = '大雪山绝顶',
  area = '大雪山',
  name = '绝顶',
  desc = { [[这里是大雪山顶峰，人迹罕至，连鸟兽都不见踪影。四面寂静，惟闻风声。凛冽的山风刮脸如刀，透骨冰凉，平常人只待上一小会就得被冻僵。]], [[这里是大雪山顶峰，人迹罕至，连鸟兽都不见踪影。四面寂静，惟闻风声。凛冽的山风刮脸如刀，透骨冰凉，平常人只待上一小会就得被冻僵。你欣喜地发现一朵生长在西藏高原上极其罕见的藏红花（hua）。]], },
  exit = {
    d = { to = '大雪山问天台', },
  },
},

['玉虚观书房#1NW'] = {
  id = '玉虚观书房#1NW',
  area = '玉虚观',
  name = '书房',
  desc =  [[这里就是玉虚观内的书房。看不出这一个小观内竟然有如此多的道家经典。房间四周都是大书架，上面放满了书，书房中间有张桌子和几张椅子，供观内道姑使用。]],
  exit = {
    e = { to = '玉虚观玉虚观', },
  },
},

['玉虚观玉虚观门'] = {
  id = '玉虚观玉虚观门',
  area = '玉虚观',
  name = '玉虚观门',
  desc =  [[走到近处，见那黄墙原来是所寺观，匾额上写的似乎是‘玉虚观’三字，黄墙红瓦，这观看起来很是简陋，门口站着两个小道童。]],
  exit = {
    e = { to = '玉虚观大道#1NW', },
    enter = { to = '玉虚观玉虚观', },
  },
},

['玉虚观大道#1NW'] = {
  id = '玉虚观大道#1NW',
  area = '玉虚观',
  name = '大道',
  desc =  [[你在大道上，两边都是杨柳树，这条路上来往的人并不多，偶尔看见有几道姑走过，只见西首绿柳丛中，小湖旁有一角黄墙露出。]],
  exit = {
    w = { to = '玉虚观玉虚观门', },
    se = { to = '玉虚观山岗', },
  },
},

['玉虚观道旁田野#1'] = {
  id = '玉虚观道旁田野#1',
  area = '玉虚观',
  name = '道旁田野',
  desc =  [[你走在了田间野地上，这里充满田园风光，你不由深深吸了一口这带有泥土芳香的空气。]],
  exit = {
    ne = { to = '大理城大道#4N', },
    w = { to = '玉虚观道旁田野#2', },
  },
},

['玉虚观山岗'] = {
  id = '玉虚观山岗',
  area = '玉虚观',
  name = '山岗',
  desc =  [[你转过了一道山岗，迎面的是一条笔直大道，道边种有青青杨柳树，随风飘扬。]],
  exit = {
    nw = { to = '玉虚观大道#1NW', },
    e = { to = '玉虚观道旁田野#2', },
  },
},

['玉虚观道旁田野#2'] = {
  id = '玉虚观道旁田野#2',
  area = '玉虚观',
  name = '道旁田野',
  desc =  [[你走在田间野地上，不时的传来鸟鸣声，脚边也跳出许多青蛙之类的小动物。走在路上，你觉得心况神怡。]],
  exit = {
    w = { to = '玉虚观山岗', },
    e = { to = '玉虚观道旁田野#1', },
  },
},

['玉虚观睡房'] = {
  id = '玉虚观睡房',
  area = '玉虚观',
  name = '睡房',
  desc =  [[这里就是玉虚观内的睡房。几张小床，床上挂着帐子，房间很是简朴，没有什么多的东西，房间角落有一个柜子。靠墙挂了张很大的画。]],
  exit = {
    w = { to = '玉虚观玉虚观', },
  },
},

['玉虚观玉虚观'] = {
  id = '玉虚观玉虚观',
  area = '玉虚观',
  name = '玉虚观',
  desc =  [[这里就是玉虚观内了，迎面大亭供着元始天尊的金身塑像，左手边还有一尊略小点的太乙真人金身塑像，大厅中央站着一位中年道姑。]],
  exit = {
    e = { to = '玉虚观睡房', },
    w = { to = '玉虚观书房#1NW', },
    out = { to = '玉虚观玉虚观门', },
  },
},

['峨嵋山藏经楼#HZA'] = {
  id = '峨嵋山藏经楼#HZA',
  area = '峨嵋山',
  name = '藏经楼',
  desc =  [[小阁楼上便是峨嵋派的藏经阁了。这里都是密密麻麻，高及顶棚的书架。窗口下有一张大桌子，桌上放了几本佛经。有个小师太正在向静道师太借书。]],
  exit = {
    d = { to = '峨嵋山储物间', },
  },
},

['峨嵋山青石阶'] = {
  id = '峨嵋山青石阶',
  area = '峨嵋山',
  name = '青石阶',
  desc =  [[已经是峨嵋山脚下了。南面一条通往峨嵋的青石阶，两旁绿树荫蔽，空气十分清新。西南方通向南诏的大理国。西边好象有人搭了个小草棚。]],
  exit = {
    e = { to = '峨嵋山峨嵋山脚下', },
    w = { to = '峨嵋山草棚', },
    su = { to = '峨嵋山报国寺山门', },
  },
},

['峨嵋山玉女峰'] = {
  id = '峨嵋山玉女峰',
  area = '峨嵋山',
  name = '玉女峰',
  desc =  [[这是归云阁边的玉女峰，峰顶有一个四尺见方的小池，深亦四尺，四季不枯，传为天女沐浴之器。古时州刺史冯楫，曾在此结茅而居，发奋诵读《华严经》，不食人间烟火，于是玉女下凡，为他馈赠食物。]],
  exit = {
    nd = { to = '峨嵋山归云阁', },
  },
},

['峨嵋山神水庵'] = {
  id = '峨嵋山神水庵',
  area = '峨嵋山',
  name = '神水庵',
  desc =  [[神水庵位于宝掌峰下，庵前有大峨石和玉液泉，泉出石下，清澈无比，终年不涸。一株大海棠树，已是数百苍龄，抱可数围，高达十余丈。旁边有福寿庵；由此西上中峰寺，东下纯阳殿。]],
  exit = {
    ed = { to = '峨嵋山纯阳殿', },
    s = { to = '峨嵋山福寿庵', },
    wu = { to = '峨嵋山中峰寺', },
  },
},

['峨嵋山东侧廊'] = {
  id = '峨嵋山东侧廊',
  area = '峨嵋山',
  name = '东侧廊',
  desc =  [[这里是峨嵋华藏庵东廊。走廊往南通往斋堂，西边通往广场。]],
  exit = {
    w = { to = '峨嵋山华藏庵广场', },
    s = { to = '峨嵋山斋堂', },
  },
},

['峨嵋山报国寺禅房'] = {
  id = '峨嵋山报国寺禅房',
  area = '峨嵋山',
  name = '报国寺禅房',
  desc =  [[这是报国寺的禅房，峨嵋男弟子回山之前通常在此借宿一宿，好备足体力上山。房内摆有一张长桌，靠墙设有几张木床。]],
  exit = {
    e = { to = '峨嵋山大雄殿', },
  },
},

['峨嵋山接引殿'] = {
  id = '峨嵋山接引殿',
  area = '峨嵋山',
  name = '接引殿',
  desc =  [[接引殿右边濒崖，是金钢嘴。崖下有一块巨石，形状似钟，故名「钟石」。对面有一石，高耸十余丈，叫「仙人石」。由此向上仰攀即到万行庵，北下经「八十四盘」至洗象池。]],
  exit = {
    nw = { to = '峨嵋山八十四盘#3', },
    wu = { to = '峨嵋山万行庵', },
  },
},

['峨嵋山报国寺'] = {
  id = '峨嵋山报国寺',
  area = '峨嵋山',
  name = '报国寺',
  desc =  [[报国寺是峨眉山最大寺院之一。寺庙倚山建造，弥勒殿、大雄殿、七佛殿逐级升高，规模宏大。殿内佛像金光闪闪，气宇轩昂。寺内芳草迷径，花开不绝。这里有一座华严塔(ta)。寺门上面高悬一块九尺见长的牌匾，上书五个斗大字“天下第一派”。这里向西，约二里可达伏虎寺。]],
  exit = {
    e = { to = '峨嵋山报国寺山门', },
    sw = { to = '峨嵋山密林#1', },
    w = { to = '峨嵋山报国寺西墙', },
    enter = { to = '峨嵋山大雄殿', },
  },
},

['峨嵋山仙峰寺'] = {
  id = '峨嵋山仙峰寺',
  area = '峨嵋山',
  name = '仙峰寺',
  desc =  [[这里是仙峰寺。寺前古木参天，茂密浓郁，寺后长寿岩高插入云。迎面华严顶宛如翠玉屏风，时有朵朵白云飘绕，恰似一幅爽心悦目的山水画。]],
  exit = {
    wd = { to = '峨嵋山华严顶', },
  },
},

['峨嵋山清音阁'] = {
  id = '峨嵋山清音阁',
  area = '峨嵋山',
  name = '清音阁',
  desc =  [[这里是峨嵋山的清音阁。此阁位于牛心岭下，东有白龙江，西有黑龙江，两江之水交汇于清音阁下。江上有拱桥两座，分夸黑龙白龙二江，这就是双飞桥。两江合流处，有一数米高的黑褐色巨石傲然挺立，形似牛心，名之为「牛心石」。桥边立有一石碑(shibei)。由此向西上，左行是黑龙江栈道，右路至白龙洞，东去中峰寺。]],
  exit = {
    sw = { to = '峨嵋山黑龙江栈道#1', },
    nw = { to = '峨嵋山白龙洞', },
    se = { to = '峨嵋山中峰寺', },
  },
},

['峨嵋山解脱坡'] = {
  id = '峨嵋山解脱坡',
  area = '峨嵋山',
  name = '解脱坡',
  desc =  [[这里是峨嵋胜地解脱坡。坡下一座小桥，叫解脱桥。行人至此，坐桥上听泉声甚美。当此良辰美景，心无芥蒂，心即解脱。坡上一座庵堂，东下一片密林。桥下山溪向东流淌到报国寺的西面。]],
  exit = {
    w = { to = '峨嵋山观音桥', },
    ed = { to = '峨嵋山密林#2', },
  },
},

['峨嵋山十二盘#4'] = {
  id = '峨嵋山十二盘#4',
  area = '峨嵋山',
  name = '十二盘',
  desc =  [[这里石阶陡折多弯，号称「十二盘」。由此西上可达华严顶，东下则到万年庵。]],
  exit = {
    ne = { to = '峨嵋山十二盘#3', },
    u = { to = '峨嵋山华严顶', },
  },
},

['峨嵋山九十九道拐#4'] = {
  id = '峨嵋山九十九道拐#4',
  area = '峨嵋山',
  name = '九十九道拐',
  desc =  [[这是著名的「九十九道拐」，道路纡曲陡竖，千折百回。据说过去曾有个百余岁的疯僧至此，见一巨蟒挡路，便念咒驱蟒。但人们得知此处有巨蟒出没后，便再也无人敢碰这里的草木，并以「龙居」名之。由此东可至千佛庵，西达九老洞。]],
  exit = {
    ed = { to = '峨嵋山九十九道拐#3', },
    sw = { to = '峨嵋山九老洞#1', },
  },
},

['峨嵋山密林#2'] = {
  id = '峨嵋山密林#2',
  area = '峨嵋山',
  name = '密林',
  desc =  [[这是黑森森的一片密林，楠木参天，浓阴蔽日。这里西上是报国寺，东边林间隐藏着一座庙宇。]],
  exit = {
    ed = { to = '峨嵋山伏虎寺', },
    wu = { to = '峨嵋山解脱坡', },
  },
},

['峨嵋山十二盘#1'] = {
  id = '峨嵋山十二盘#1',
  area = '峨嵋山',
  name = '十二盘',
  desc =  [[这里石阶陡折多弯，号称「十二盘」。由此西上可达华严顶，东下则到万年庵。]],
  exit = {
    ed = { to = '峨嵋山万年庵', },
    sw = { to = '峨嵋山十二盘#2', },
  },
},

['峨嵋山休息室#FSA'] = {
  id = '峨嵋山休息室#FSA',
  area = '峨嵋山',
  name = '休息室',
  desc =  [[这是福寿庵接待峨嵋女侠们的休息室，峨嵋女弟子回山之前通常在此借宿一宿，好备足体力上山。房内摆有一张长桌，靠墙设有几张木床。]],
  exit = {
    sd = { to = '峨嵋山福寿庵斋堂', },
  },
},

['峨嵋山炭窑'] = {
  id = '峨嵋山炭窑',
  area = '峨嵋山',
  name = '炭窑',
  desc =  [[这里是一座用来烧炭的炭窑。但由于峨嵋弟子吃苦耐劳，这里没有像别的炭窑那样一片零乱、黑得一塌糊涂，而是一切都井井有条。几个峨嵋俗家弟子在这里忙忙碌碌。]],
  exit = {
    sw = { to = '峨嵋山后山', },
  },
},

['峨嵋山华藏庵'] = {
  id = '峨嵋山华藏庵',
  area = '峨嵋山',
  name = '华藏庵',
  desc =  [[华藏庵是金顶的主要建筑，规模宏大，中祀普贤菩萨，旁列万佛。华藏庵后边是睹光台，旁边是卧云庵。]],
  exit = {
    enter = { to = '峨嵋山华藏庵正殿', },
    nd = { to = '峨嵋山金顶', },
    s = { to = '峨嵋山睹光台', },
  },
},

['峨嵋山卧云庵'] = {
  id = '峨嵋山卧云庵',
  area = '峨嵋山',
  name = '卧云庵',
  desc =  [[卧云庵旁边有个井络泉，据说以前曾因饮水人多而干涸，众尼为之诵经，于是泉水复出。出了卧云庵便是睹光台，旁边是华藏庵。]],
  exit = {
    ne = { to = '峨嵋山金顶', },
    su = { to = '峨嵋山睹光台', },
  },
},

['峨嵋山黑龙江栈道#1'] = {
  id = '峨嵋山黑龙江栈道#1',
  area = '峨嵋山',
  name = '黑龙江栈道',
  desc =  [[黑龙江栈道沿黑龙江而建。这里一山中开，两崖并立，形成一道宽仅数尺，长达几百米的深峡——白云峡。黑龙江栈道就从狭窄的白云峡中转折穿过，架设在绝壁上。走在栈道上，只觉道窄人危；俯视深涧，急流飞旋，山静而觉动；仰观头顶，天光如隙，崖开而欲合。这就是天开画图的「一线天」。栈道南通千佛庵，北至清音阁。]],
  exit = {
    ne = { to = '峨嵋山清音阁', },
    s = { to = '峨嵋山黑龙江栈道#2', },
  },
},

['峨嵋山万佛顶'] = {
  id = '峨嵋山万佛顶',
  area = '峨嵋山',
  name = '万佛顶',
  desc =  [[这里是峨嵋山上的万佛顶，由于已经是在万丈高山之巅，气候是比较寒冷的。北面有几间木棚，大概是峨嵋派的男弟子们自己动手搭建的安身之所。里面是万佛顶上的万佛塔，西面是九老洞。]],
  exit = {
    enter = { to = '峨嵋山万佛塔', cond = 'player.party == "峨嵋派" or player.is_bonze', },
    w = { to = '峨嵋山九老洞#1', },
    n = { to = '峨嵋山木棚', cond = 'player.gender ~= "female"', },
  },
},

['峨嵋山灌木丛#1'] = {
  id = '峨嵋山灌木丛#1',
  area = '峨嵋山',
  name = '灌木丛',
  desc =  [[这里是一片一人多高的灌木丛，这里已经罕见足迹。一阵风吹过，灌木丛发出沙沙的声音。东南西北都是矮树灌木，这里没有路，每走一步，荆棘都会钩刺到衣裤，划破你的身体。]],
  exit = {
    ne = { to = '峨嵋山灌木丛#1', },
    wu = { to = '峨嵋山灌木丛#1', },
    sw = { to = '峨嵋山灌木丛#1', },
    ed = { to = '峨嵋山灌木丛#1', },
    hidden = { to = '峨嵋山灌木丛#2', cost = 20, cond = 'player.jingli > 1000', handler = 'fixed_step', },
  },
},

['峨嵋山灌木丛#2'] = {
  id = '峨嵋山灌木丛#2',
  area = '峨嵋山',
  name = '灌木丛',
  desc =  [[这里是一片一人多高的灌木丛，这里已经罕见足迹。一阵风吹过，灌木丛发出沙沙的声音。东南西北都是矮树灌木，这里没有路，每走一步，荆棘都会钩刺到衣裤，划破你的身体。前面是一面很高的峭壁，隐约地似乎看到有一个不大的洞口，峭壁下面是一个水潭。]],
  exit = {
    hidden = { to = '峨嵋山洞口', cmd = 'yue 洞口', },
    wu = { to = '峨嵋山灌木丛#1', handler = 'reset_data', },
  },
},

['峨嵋山万年庵砖殿'] = {
  id = '峨嵋山万年庵砖殿',
  area = '峨嵋山',
  name = '万年庵砖殿',
  desc =  [[这里是万年庵的拱顶无梁砖殿。砖殿四壁为正方形，顶为穹窿圆拱形，殿内有普贤菩萨骑六牙白象的铜铸像一尊。拱顶无梁砖殿四壁下方，有小龛二十四个，内各供铁铸佛像一尊。四壁上方则有横龛六道，列置铜铸小佛三百零七个。]],
  exit = {
    e = { to = '峨嵋山禅房#WNA', door ='open door', },
    out = { to = '峨嵋山万年庵', },
  },
},

['峨嵋山金顶'] = {
  id = '峨嵋山金顶',
  area = '峨嵋山',
  name = '金顶',
  desc =  [[这就是峨嵋山的主峰金顶了。此峰耸立大地，高入云表，秀丽而又壮美，李白赞颂它：『青冥倚天开，彩错疑画出。』登上金顶，视野豁然开朗，鸟看脚下，但见群峰涌绿叠翠，三江如丝如带；回首远眺，则见大雪山横亘天际，贡嘎山直插苍穹。]],
  exit = {
    nd = { to = '峨嵋山万行庵', },
    sw = { to = '峨嵋山卧云庵', },
    su = { to = '峨嵋山华藏庵', },
  },
},

['峨嵋山莲花石'] = {
  id = '峨嵋山莲花石',
  area = '峨嵋山',
  name = '莲花石',
  desc =  [[这是莲花石。此处岩石纹理纵横，形似莲花，颜如芙蓉，仿佛萼瓣层叠，细蕊欲绽。上有一庵，叫「莲花社」。由此往西上直达洗象池，东下左通华严顶，右通九老洞。]],
  exit = {
    ed = { to = '峨嵋山华严顶', },
    se = { to = '峨嵋山九老洞#1', },
    wu = { to = '峨嵋山钻天坡#1', },
  },
},

['峨嵋山千佛庵'] = {
  id = '峨嵋山千佛庵',
  area = '峨嵋山',
  name = '千佛庵',
  desc =  [[此处是洪椿坪千佛庵。山间小坪坝，四面层峦叠障，峰环岭护；两侧深谷幽岚，溪涧玲叮。坪上古木扶疏，亭亭如盖，山阴沁透，白雾飘游，极为幽静清凉。此处常见雨雾霏霏，林中迷迷蒙蒙，乃山中雾气所为。正所谓「山行本无雨，空翠湿人衣」。这就是誉为奇观的「洪椿晓雨」。此处殿美景幽，气象新异，令人心醉。沿途南上是「九十九道拐」，北下经黑龙江栈道至清音阁。]],
  exit = {
    enter = { to = '峨嵋山千佛庵大殿', },
    sw = { to = '峨嵋山九十九道拐#1', },
    n = { to = '峨嵋山黑龙江栈道#2', },
  },
},

['峨嵋山万佛塔'] = {
  id = '峨嵋山万佛塔',
  area = '峨嵋山',
  name = '万佛塔',
  desc =  [[这里就是万佛顶上的万佛塔了，塔内供奉着很多牌位。]],
  exit = {
    out = { to = '峨嵋山万佛顶', },
  },
},

['峨嵋山观音堂'] = {
  id = '峨嵋山观音堂',
  area = '峨嵋山',
  name = '观音堂',
  desc =  [[观音堂高踞坡岗，近临危崖，环境幽静，四周树木蓊郁，悦目赏心。传说入山于此，解脱尘凡；出山于此，解脱险阻，又故名解脱庵。进山的人在此焚香洗心，入山方可化险为夷，步步平安。这里东下可达伏虎寺，西上行约二里可到归云阁。]],
  exit = {
    e = { to = '峨嵋山观音桥', },
    wu = { to = '峨嵋山归云阁', },
  },
},

['峨嵋山八十四盘#3'] = {
  id = '峨嵋山八十四盘#3',
  area = '峨嵋山',
  name = '八十四盘',
  desc =  [[八十四盘，道路艰险陡峭，迂回盘折，令人不能喘息。路左是蔽日遮天的冷杉林，路右是深不见底的绝壁峡谷。由此往上至接引殿，北下到洗象池。]],
  exit = {
    nd = { to = '峨嵋山八十四盘#2', },
    nw = { to = '峨嵋山冷杉林#3', },
    se = { to = '峨嵋山接引殿', },
  },
},

['峨嵋山雷洞坪'] = {
  id = '峨嵋山雷洞坪',
  area = '峨嵋山',
  name = '雷洞坪',
  desc =  [[雷洞坪一带，道路艰险骇人，路左是蔽日遮天的冷杉林，路右是深不见底的绝壁峡谷。这里长年云遮雾罩，空蒙黑暗。岩上建有雷神殿，旁边竖一铁碑。由此往上是「八十四盘」至接引殿，北下到洗象池。]],
  exit = {
    su = { to = '峨嵋山八十四盘#1', },
    nd = { to = '峨嵋山凌云梯', },
  },
},

['峨嵋山后山树林'] = {
  id = '峨嵋山后山树林',
  area = '峨嵋山',
  name = '后山树林',
  desc =  [[这里是峨嵋后山上的一片成材的树林，这里的林木茂密，有很多树木可以用作炭材。西面是一块空地，北面是一条通往山下的一条小路。]],
  exit = {
    w = { to = '峨嵋山后山', },
    nd = { to = '峨嵋山后山小路#3', },
  },
},

['峨嵋山密林#1'] = {
  id = '峨嵋山密林#1',
  area = '峨嵋山',
  name = '密林',
  desc =  [[这是黑森森的一片密林，楠木参天，浓阴蔽日。这里东下二里是报国寺，西边林间隐藏着一座庙宇。]],
  exit = {
    ne = { to = '峨嵋山报国寺', },
    w = { to = '峨嵋山伏虎寺', },
  },
},

['峨嵋山洗象池边#N'] = {
  id = '峨嵋山洗象池边#N',
  area = '峨嵋山',
  name = '洗象池边',
  desc =  [[洗象池原只是一亭，亭前有一个石砌的小池(pool)，池边不远就是危岩。洗象池寓于一片冷杉林中，有若白云深处的仙山琼阁。若是云收雾敛、碧空万里、月朗中天时，便觉万籁俱寂，清光无限，宛若身在天宫，彻体生凉。这正是著名的「象池夜月」。]],
  exit = {
    s = { to = '峨嵋山洗象池边#S', },
    hidden = { to = '峨嵋山洗象池', no_wander = true, handler = 'em_enter_pool', cond = 'player.con >= 25', },
  },
},

['峨嵋山洗象池'] = {
  id = '峨嵋山洗象池',
  area = '峨嵋山',
  name = '洗象池',
  desc = [[这是一个石砌的六角小池，相传古时佛教始祖释迦牟尼的大弟子普贤菩萨每次路过此地必在池中洗象。“象池夜月”即是这里的著名景色，入夜，皓月当空，月光映入池中，水天一色，景色幽美。这一带常有猴群出没。]],
  exit = {
    hidden = { to = '峨嵋山洗象池边#N', cmd = 'halt', },
  },
},

['峨嵋山千佛庵大殿'] = {
  id = '峨嵋山千佛庵大殿',
  area = '峨嵋山',
  name = '千佛庵大殿',
  desc =  [[千佛庵殿宇高广宏阔，清洁庄严。庵内有一具七万千佛莲灯，有纹龙七条环于灯体，并有佛像数百周匝排列，雕缕精致无比。]],
  exit = {
    e = { to = '峨嵋山禅房#QFA', door ='open door', },
    out = { to = '峨嵋山千佛庵', },
  },
},

['峨嵋山伏虎寺'] = {
  id = '峨嵋山伏虎寺',
  area = '峨嵋山',
  name = '伏虎寺',
  desc =  [[伏虎寺是入山第一大宝刹，隐伏在高大的乔木林间，四周楠木参天，多达十万余株。伏虎寺气象庄严，规模宏盛，殿堂宽敞，势度巍峨。寺刹虽掩覆于翠绿浓黛之中，但屋瓦却无一片落叶。出寺西上解脱坡便是观音堂。]],
  exit = {
    e = { to = '峨嵋山密林#1', },
    wu = { to = '峨嵋山密林#2', },
  },
},

['峨嵋山后山'] = {
  id = '峨嵋山后山',
  area = '峨嵋山',
  name = '后山',
  desc =  [[这里是峨嵋后山上的一块空地，东面是一片成材的树林，东北面是一座用来烧炭的炭窑。由于峨嵋派地处寒冷，经常有一些俗家弟子在那里烧炭。]],
  exit = {
    e = { to = '峨嵋山后山树林', },
    ne = { to = '峨嵋山炭窑', },
    su = { to = '峨嵋山后山小路#2', },
  },
},

['峨嵋山十二盘#2'] = {
  id = '峨嵋山十二盘#2',
  area = '峨嵋山',
  name = '十二盘',
  desc =  [[这里石阶陡折多弯，号称「十二盘」。由此西上可达华严顶，东下则到万年庵。]],
  exit = {
    ne = { to = '峨嵋山十二盘#1', },
    wu = { to = '峨嵋山十二盘#3', },
  },
},

['峨嵋山峨嵋山脚下'] = {
  id = '峨嵋山峨嵋山脚下',
  area = '峨嵋山',
  name = '峨嵋山脚下',
  desc =  [[这是一条尘土飞扬的小路，四川自古就是富庶之地，号称天府之国，放眼望去，四周的田垅郁郁青青。远处有座大山，凝目望去但见秀丽雄奇，莫非就是有名的峨嵋山吗？]],
  exit = {
    ne = { to = '成都城土路#2', },
    w = { to = '峨嵋山青石阶', },
  },
},

['峨嵋山草棚'] = {
  id = '峨嵋山草棚',
  area = '峨嵋山',
  name = '草棚',
  desc =  [[这是峨嵋山脚下一个简单的草棚，地上堆著些上货。很多上山的游客都在这里买些上山用品。]],
  exit = {
    e = { to = '峨嵋山青石阶', },
  },
},

['峨嵋山报国寺西墙'] = {
  id = '峨嵋山报国寺西墙',
  area = '峨嵋山',
  name = '报国寺西墙',
  desc =  [[这里是峨眉山报国寺的西墙。寺院里的钟声从墙那边飘来，在空气中回响。一条山溪从西面山上的解脱桥下流经这里，向山下淌去。]],
  exit = {
    e = { to = '峨嵋山报国寺', },
  },
},

['峨嵋山大雄殿'] = {
  id = '峨嵋山大雄殿',
  area = '峨嵋山',
  name = '大雄殿',
  desc =  [[这里是报国寺大雄殿。报国寺是峨嵋山最大寺院之一。大雄殿内供着金光灿灿的佛像，气宇轩昂。]],
  exit = {
    e = { to = '峨嵋山休息室#BGS', },
    enter = { to = '峨嵋山藏经楼#BGS', },
    w = { to = '峨嵋山报国寺禅房', },
    out = { to = '峨嵋山报国寺', },
  },
},

['峨嵋山休息室#BGS'] = {
  id = '峨嵋山休息室#BGS',
  area = '峨嵋山',
  name = '休息室',
  desc =  [[这里是峨嵋报国寺的休息室。窗帘拉下来，房里整整齐齐放了很多木床。有几个夜晚守庵的小师太正在睡觉。]],
  exit = {
    w = { to = '峨嵋山大雄殿', },
  },
},

['峨嵋山观音桥'] = {
  id = '峨嵋山观音桥',
  area = '峨嵋山',
  name = '观音桥',
  desc =  [[这里是观音桥。从这里往前看，恰好可以看见一块大岩石，由于酷似观音菩萨，故名观音岩。一道瀑布从岩上流下，又好似滴水观音。造化之工，实在令人赞叹不已。]],
  exit = {
    w = { to = '峨嵋山观音堂', },
    e = { to = '峨嵋山解脱坡', },
  },
},

['峨嵋山归云阁'] = {
  id = '峨嵋山归云阁',
  area = '峨嵋山',
  name = '归云阁',
  desc =  [[归云阁，原是唐代福昌达道禅师的道场。宋代绍兴年间，僧人士性又率众重建。归云阁左有玉女峰，西上可抵纯阳殿，东下是观音堂。]],
  exit = {
    ed = { to = '峨嵋山观音堂', },
    su = { to = '峨嵋山玉女峰', },
    wu = { to = '峨嵋山纯阳殿', },
  },
},

['峨嵋山纯阳殿'] = {
  id = '峨嵋山纯阳殿',
  area = '峨嵋山',
  name = '纯阳殿',
  desc =  [[纯阳殿海拔一千余米，四面古木苍翠，幽静宜人。殿前有一石，叫普贤石，据说普贤菩萨登山时曾坐在这里休息过。在此可纵观峨嵋诸峰，仰望金顶，悬崖峭壁，离天咫尺。这里西上至神水庵，东下是归云阁。]],
  exit = {
    ed = { to = '峨嵋山归云阁', },
    wu = { to = '峨嵋山神水庵', },
  },
},

['峨嵋山福寿庵斋堂'] = {
  id = '峨嵋山福寿庵斋堂',
  area = '峨嵋山',
  name = '福寿庵斋堂',
  desc =  [[这里便是峨嵋福寿庵的斋堂。福寿庵本不大，但由于经常接待其他庵的弟子，斋堂倒也不小。只见厅内摆满了长长的餐桌和长凳，几位小师太正来回忙碌着布置素斋。桌上摆了几盆豆腐，花生，青菜以及素鸭等美味素食。北面有一扇门(door)。]],
  exit = {
    nu = { to = '峨嵋山休息室#FSA', door = 'open door', cond = 'player.gender == "female"', },
    e = { to = '峨嵋山灵文阁', },
  },
},

['峨嵋山禅房#FSA'] = {
  id = '峨嵋山禅房#FSA',
  area = '峨嵋山',
  name = '禅房',
  desc =  [[这里是一间安静宽敞的禅房，乃是福寿庵中弟子打坐修行之所。地下整整齐齐地放着许多蒲团。几位年轻师太和俗家女弟子正肃容入定。]],
  exit = {
    w = { to = '峨嵋山灵文阁', },
  },
},

['峨嵋山中峰寺'] = {
  id = '峨嵋山中峰寺',
  area = '峨嵋山',
  name = '中峰寺',
  desc =  [[中峰寺在白云峰下，始建于晋代，原为道观。传说观内的道人每年在三月三日都献身给山中一条大蟒，以为可以升仙。后来有个从资州来的明果禅师，杀了那条大蟒，道士们始知上当，感激不已，自愿改信佛教，从此改观为寺。这里往北可到清音阁，东下至神水庵。]],
  exit = {
    nw = { to = '峨嵋山清音阁', },
    ed = { to = '峨嵋山神水庵', },
  },
},

['峨嵋山黑龙江栈道#2'] = {
  id = '峨嵋山黑龙江栈道#2',
  area = '峨嵋山',
  name = '黑龙江栈道',
  desc =  [[黑龙江栈道沿黑龙江而建。这里一山中开，两崖并立，形成一道宽仅数尺，长达几百米的深峡——白云峡。黑龙江栈道就从狭窄的白云峡中转折穿过，架设在绝壁上。走在栈道上，只觉道窄人危；俯视深涧，急流飞旋，山静而觉动；仰观头顶，天光如隙，崖开而欲合。这就是天开画图的「一线天」。栈道南通千佛庵，北至清音阁。]],
  exit = {
    s = { to = '峨嵋山千佛庵', },
    n = { to = '峨嵋山黑龙江栈道#1', },
  },
},

['峨嵋山禅房#QFA'] = {
  id = '峨嵋山禅房#QFA',
  area = '峨嵋山',
  name = '禅房',
  desc =  [[这里是一间安静宽敞的禅房，乃是千佛庵中弟子打坐修行之所。地下整整齐齐放着许多蒲团。几位年轻师太和俗家女弟子正肃容入定。]],
  exit = {
    w = { to = '峨嵋山千佛庵大殿', door = 'open door', },
  },
},

['峨嵋山九十九道拐#1'] = {
  id = '峨嵋山九十九道拐#1',
  area = '峨嵋山',
  name = '九十九道拐',
  desc =  [[这是著名的「九十九道拐」，道路纡曲陡竖，千折百回。据说过去曾有个百余岁的疯僧至此，见一巨蟒挡路，便念咒驱蟒。但人们得知此处有巨蟒出没后，便再也无人敢碰这里的草木，并以「龙居」名之。由此东可至千佛庵，西达九老洞。]],
  exit = {
    ne = { to = '峨嵋山千佛庵', },
    wu = { to = '峨嵋山九十九道拐#2', },
  },
},

['峨嵋山九十九道拐#2'] = {
  id = '峨嵋山九十九道拐#2',
  area = '峨嵋山',
  name = '九十九道拐',
  desc =  [[这是著名的「九十九道拐」，道路纡曲陡竖，千折百回。据说过去曾有个百余岁的疯僧至此，见一巨蟒挡路，便念咒驱蟒。但人们得知此处有巨蟒出没后，便再也无人敢碰这里的草木，并以「龙居」名之。由此东可至千佛庵，西达九老洞。]],
  exit = {
    ed = { to = '峨嵋山九十九道拐#1', },
    sw = { to = '峨嵋山九十九道拐#3', },
  },
},

['峨嵋山木棚'] = {
  id = '峨嵋山木棚',
  area = '峨嵋山',
  name = '木棚',
  desc =  [[这里是峨嵋派的男弟子们自己动手搭建的安身之所。峨嵋派自郭襄建派以来，以女弟子居多，因此男弟子们把它们建到了这么偏僻的地方。里面的东西都很朴素，除了几张木板床以外就没有什么别的东西了。]],
  exit = {
    s = { to = '峨嵋山万佛顶', },
    hidden = { to = '峨嵋山后山小路#1', cmd = 'xian chuang;zuan dong', },
  },
},

['峨嵋山水潭'] = {
  id = '峨嵋山水潭',
  area = '峨嵋山',
  name = '水潭',
  desc =  [[这是一个大水潭，潭中水清凉无比，一下就把你激醒了。潭水正缓缓向东流去。两岸山石峻峭，山上绿树荫蔽。不知道这是哪里呢？]],
  exit = {
    hidden = { to = '峨嵋山清音阁', cmd = 'pa up', },
  },
},

['峨嵋山九老洞#1'] = {
  id = '峨嵋山九老洞#1',
  area = '峨嵋山',
  name = '九老洞',
  desc =  [[这就是峨嵋第一大洞，洞内深窈无比，神秘难测。你一走进来，便发觉洞中叉洞多如迷宫，怪异莫测，似乎黝黑无底。还是快快离开吧。]],
  exit = {
    ne = { to = '峨嵋山九十九道拐#4', },
    enter = { to = '峨嵋山九老洞口', },
    w = { to = '峨嵋山万佛顶', },
    nw = { to = '峨嵋山莲花石', },
  },
},

['峨嵋山九老洞口'] = {
  id = '峨嵋山九老洞口',
  area = '峨嵋山',
  name = '九老洞口',
  desc =  [[这就是峨嵋第一大洞，洞内深窈无比，神秘难测。你一走进来，便发觉洞中叉洞多如迷宫，怪异莫测，似乎黝黑无底。还是快快离开吧。]],
  exit = {
    enter = { to = '峨嵋山九老洞#M', },
    out = { to = '峨嵋山九老洞#1', },
  },
},

['峨嵋山九老洞#M'] = {
  id = '峨嵋山九老洞#M',
  area = '峨嵋山',
  name = '九老洞',
  desc =  [[这就是峨嵋第一大洞，洞内深窈无比，神秘难测。你一走进来，便发觉洞中叉洞多如迷宫，怪异莫测，似乎黝黑无底。还是快快离开吧。]],
  exit = {
    ne = { to = '峨嵋山九老洞#M', unstable = true, },
    s = { to = '峨嵋山九老洞#M', unstable = true, },
    e = { to = '峨嵋山九老洞#M', unstable = true, },
    sw = { to = '峨嵋山九老洞#M', unstable = true, },
    w = { to = '峨嵋山九老洞#M', unstable = true, },
    se = { to = '峨嵋山九老洞#M', unstable = true, },
    nw = { to = '峨嵋山九老洞#M', unstable = true, },
    n = { to = '峨嵋山九老洞#M', unstable = true, },
    hidden = { to = '峨嵋山九老洞口', cmd = 'leave', },
  },
},

['峨嵋山白龙洞'] = {
  id = '峨嵋山白龙洞',
  area = '峨嵋山',
  name = '白龙洞',
  desc =  [[    白龙洞据说是《白蛇传》中的白娘子修炼成仙之处。这里楠木参天，林荫夹道，株株秀挺俊拔，枝叶分披上捧，如两手拥佛，传为古时一高僧按《法华经》口诵一字，植树一株，共植六万九千七百七十七株，时称古德林。这里北上至万年庵，南下是清音阁。]],
  exit = {
    nu = { to = '峨嵋山万年庵', },
    w = { to = '峨嵋山古德林#1', },
    se = { to = '峨嵋山清音阁', },
  },
},

['峨嵋山马厩'] = {
  id = '峨嵋山马厩',
  area = '峨嵋山',
  name = '马厩',
  desc =  [[这是一间马厩，常年供应新鲜草料。此地民风淳朴，马夫们把马牵到马厩好生照看，将它们喂饱饮足，再洗刷得干乾净净，一直伺候到客人离店上路。马厩中堆放著几堆草料，正中有一口泔槽(gancao)。]],
  exit = {
    s = { to = '峨嵋山华严顶', },
    hidden = { to = '峨嵋山后山小路#1', cmd = 'xian gancao;zuan dong', },
  },
},

['峨嵋山后山小路#1'] = {
  id = '峨嵋山后山小路#1',
  area = '峨嵋山',
  name = '后山小路',
  desc =  [[这里是峨嵋后山上的山间小路，这里别有一番景色。由于已经是在万丈高山之巅，气候是比较寒冷的。]],
  exit = {
    ne = { to = '峨嵋山后山小路#2', },
  },
},

['峨嵋山后山小路#3'] = {
  id = '峨嵋山后山小路#3',
  area = '峨嵋山',
  name = '后山小路',
  desc =  [[这里虽说是小路，但周围除了不高的小树，就是绊脚的灌木，很难再找到下山的路了。]],
  exit = {
    nd = { to = '峨嵋山后山小路#4', },
    su = { to = '峨嵋山后山树林', },
    hidden = { to = '峨嵋山灌木丛#1', no_wander = true, cmd = 'get axe;wield axe;cut 灌木丛;drop axe', handler = 'reset_data', },
  },
},

['峨嵋山后山小路#4'] = {
  id = '峨嵋山后山小路#4',
  area = '峨嵋山',
  name = '后山小路',
  desc =  [[这里虽说是小路，但灌木丛生，很难再找到下山的路了。前面一块大石头(stone)挡住了下山的去路。]],
  exit = {
    su = { to = '峨嵋山后山小路#3', },
    nd = { to = '峨嵋山清音阁', door = 'move stone', cond = 'player.str >= 15', handler = 'emei_move_stone', },
  },
},

['峨嵋山洞口'] = {
  id = '峨嵋山洞口',
  area = '峨嵋山',
  name = '洞口',
  desc =  [[这里是峭壁上的洞口，洞口边插满了刀剑，里面黑乎乎的，你仔细定了定神，好像洞里有一个人影正在研究武学。]],
  exit = {
    enter = { to = '峨嵋山山洞', },
  },
},

['峨嵋山山洞'] = {
  id = '峨嵋山山洞',
  area = '峨嵋山',
  name = '山洞',
  desc =  [[这里是峭壁上的山洞，里面黑乎乎的，一个老人满头白发，正在里面打坐。]],
  exit = {
    ed = { to = '峨嵋山清音阁', },
    out = { to = '峨嵋山洞口', },
  },
},

['峨嵋山凌云梯'] = {
  id = '峨嵋山凌云梯',
  area = '峨嵋山',
  name = '凌云梯',
  desc =  [[这是凌云梯，最早是一位叫阿婆多的外国和尚在此缚木架石，以渡行人，又叫「胡僧梯」。路边有梅子坡，可见满坡青梅如豆，于疏枝密叶中逗引行人，甚有「望梅止渴」之功用。此梯北通洗象池，南至雷洞坪。]],
  exit = {
    su = { to = '峨嵋山雷洞坪', },
    nd = { to = '峨嵋山洗象池边#S', },
  },
},

['峨嵋山冷杉林#2'] = {
  id = '峨嵋山冷杉林#2',
  area = '峨嵋山',
  name = '冷杉林',
  desc =  [[这是一片遮天蔽日的冷杉林。数人也合抱不过来的冷杉树簇在一块，棵棵枝繁叶茂，象一蓬蓬巨伞般伸向天空，把阳光遮得丝毫也无。看地上厚厚的枯枝烂叶，显然游客很少踏足此处。]],
  exit = {
    ne = { to = '峨嵋山小竹林', no_wander = true, handler = 'reset_data', },
    sw = { to = '峨嵋山冷杉林#3', },
    nw = { to = '峨嵋山冷杉林#2', },
    se = { to = '峨嵋山冷杉林#2', },
  },
},

['峨嵋山睹光台舍身崖'] = {
  id = '峨嵋山睹光台舍身崖',
  area = '峨嵋山',
  name = '睹光台舍身崖',
  desc =  [[从卧云庵出来，这里是看日出、云海、佛光、神灯之地。台下深崖万丈，陡彻无底，云遮雾掩。极目四望，数百里外的大小雪山皆历历在目。因为这里至高至洁，至险至奇，又至美至幻，常有人在这里投身云海，舍此肉身尘世。]],
  exit = {
    e = { to = '峨嵋山睹光台', },
    hidden = { to = '峨嵋山半空中', no_wander = true, cmd = 'tiao cliff', ignore = true, },
  },
},

['峨嵋山半空中'] = {
  id = '峨嵋山半空中',
  area = '峨嵋山',
  name = '半空中',
  desc =  [[你从一团团云雾中穿过，急速向下坠落。]],
  exit = {
    hidden1 = { to = '峨嵋山万年松', handler = 'wait', },
    hidden2 = { to = '峨嵋山水潭', handler = 'wait', },
  },
},

['峨嵋山万年松'] = {
  id = '峨嵋山万年松',
  area = '峨嵋山',
  name = '万年松',
  desc =  [[这是一只大树枝，从一棵万年松上伸出。这棵树生得高大苍劲，年代古远，树根由石缝中长出，紧紧攀着崖壁。上边就是舍身崖了。]],
  exit = {
    hidden = { to = '峨嵋山万年松下', cmd = 'pa tree', },
  },
},

['峨嵋山万年松下'] = {
  id = '峨嵋山万年松下',
  area = '峨嵋山',
  name = '万年松下',
  desc =  [[你已经到了万年松树下。这棵松树年代古远，树根由石缝中长出，紧紧攀着崖壁。]],
  exit = {
    hidden = { to = '峨嵋山崖壁#1', cmd = 'pa left', },
  },
},

['峨嵋山崖壁#1'] = {
  id = '峨嵋山崖壁#1',
  area = '峨嵋山',
  name = '崖壁',
  desc =  [[崖壁这边不那么光秃秃的，有许多立足之处，石缝间长着小花小草。]],
  exit = {
    hidden = { to = '峨嵋山崖壁#2', cmd = 'pa down', },
  },
},

['峨嵋山崖壁#2'] = {
  id = '峨嵋山崖壁#2',
  area = '峨嵋山',
  name = '崖壁',
  desc =  [[你站在崖壁上的石缝间，要紧紧扒住崖壁突出的地方才不至于摔下去。石缝里除了沙石草木，什么也没有。]],
  exit = {
    hidden = { to = '峨嵋山山谷', cmd = 'pa down', },
  },
},

['峨嵋山山谷'] = {
  id = '峨嵋山山谷',
  area = '峨嵋山',
  name = '山谷',
  desc =  [[眼前豁然开朗，你来到一个小山谷。谷中花草丛生，鸟语间关。一条小径曲曲折折地通向草木幽深之处。]],
  exit = {
    e = { to = '峨嵋山山谷小径', },
  },
},

['峨嵋山山谷小径'] = {
  id = '峨嵋山山谷小径',
  area = '峨嵋山',
  name = '山谷小径',
  desc =  [[这是山谷中的小径，通向草木幽深之处。两旁生着各种花草树木，冬青草，木槿，木莲花，莎椤花，蕙兰，木芙蓉¨¨¨散发着清幽的香气。]],
  exit = {
    w = { to = '峨嵋山山谷', },
    ne = { to = '峨嵋山草地', },
  },
},

['峨嵋山草地'] = {
  id = '峨嵋山草地',
  area = '峨嵋山',
  name = '草地',
  desc =  [[眼前出现一片草地，草地上开着各色小花，微风吹过，频频点头。一条山涧从石壁流下，几株果树上挂满红红绿绿的瓜果。草地尽头有一座墓，后面好象有间小茅屋。]],
  exit = {
    e = { to = '峨嵋山小屋', },
    ne = { to = '峨嵋山小径', },
    sw = { to = '峨嵋山山谷小径', },
    n = { to = '峨嵋山郭襄之墓', },
  },
},

['峨嵋山小屋'] = {
  id = '峨嵋山小屋',
  area = '峨嵋山',
  name = '小屋',
  desc =  [[这是一间小茅屋，屋内摆设简单，一张木床，一张石几，一只木书架，架上摆着几本旧书。墙上挂着一幅峨眉山的山水画，墙角放着一个小包袱，上面盖了顶大斗笠，门外堆放了些锄头，扫帚等工具。一个年轻小师太正坐在几前专心读书。]],
  exit = {
    w = { to = '峨嵋山草地', },
  },
},

['峨嵋山郭襄之墓'] = {
  id = '峨嵋山郭襄之墓',
  area = '峨嵋山',
  name = '郭襄之墓',
  desc =  [[这里是一座规模不大的墓，墓碑上刻着几个大字：峨嵋派祖师郭襄之墓。原来这是峨嵋派创派祖师郭襄的墓。郭女侠乃是大侠郭靖的小女儿。她晚年在峨嵋山定居，创立了峨嵋派，死后峨嵋弟子将她安葬在此处。这里四季如春，常年鲜花盛开，十分幽静。]],
  exit = {
    s = { to = '峨嵋山草地', },
    e = { to = '峨嵋山小径', },
    d = { to = '峨嵋山墓室', unstable = true, handler = 'em_tomb', },
  },
},

['峨嵋山墓室'] = {
  id = '峨嵋山墓室',
  area = '峨嵋山',
  name = '墓室',
  desc =  [[这里是郭襄墓下的墓室。墓室不大，正面是一具白玉石棺，旁边放着一盏长明灯。石棺一尘不染，看来经常有人进来打扫。]],
  exit = {
    u = { to = '峨嵋山郭襄之墓', unstable = true, },
  },
},

['峨嵋山小径'] = {
  id = '峨嵋山小径',
  area = '峨嵋山',
  name = '小径',
  desc =  [[这是一条蜿蜒的山间小径，一边通往峨眉山后山，另一边不知通到哪里。这一路人迹罕见，只有些不知名的小虫在吱吱叽叽唱着。]],
  exit = {
    ne = { to = '峨嵋山九十九道拐#3', },
    sw = { to = '峨嵋山草地', },
    w = { to = '峨嵋山郭襄之墓', },
  },
},

['峨嵋山华藏庵正殿'] = {
  id = '峨嵋山华藏庵正殿',
  area = '峨嵋山',
  name = '华藏庵正殿',
  desc =  [[这里是峨嵋山金顶华藏庵的正殿。华藏庵规模宏大，殿内青砖铺地，中间有普贤菩萨像，两旁列有万佛。正前方放一红木供桌，陈列香烛，以供叩拜。自此左右各有一间侧殿，是接待香客的地方。南面是通往一个大广场，只有峨嵋弟子才能过去。]],
  exit = {
    e = { to = '峨嵋山东侧殿', },
    s = { to = '峨嵋山华藏庵广场', },
    w = { to = '峨嵋山西侧殿', },
    out = { to = '峨嵋山华藏庵', },
  },
},

['峨嵋山西侧殿'] = {
  id = '峨嵋山西侧殿',
  area = '峨嵋山',
  name = '西侧殿',
  desc =  [[这里是金顶华藏庵西侧殿，是接待香客及来宾的地方。殿内摆着几张桌子，桌旁围放数把椅子。墙上悬着几幅字画，墙边一排书架，架上摆满经书。有几位进香客正在品茶养神，欣赏墙上的字画或翻阅架上的经书。还有两个二十来岁的姑娘在向一位师太打听有关出家的事。一个十来岁的小师太正在忙前忙后招待客人。南边有扇窗子(chuang)。]],
  exit = {
    e = { to = '峨嵋山华藏庵正殿', },
  },
},

['峨嵋山华藏庵广场'] = {
  id = '峨嵋山华藏庵广场',
  area = '峨嵋山',
  name = '华藏庵广场',
  desc =  [[这里是峨嵋华藏庵的广场，地上铺着青砖。正前方有一道台阶，通往大雄宝殿。殿前有个丈许高的大香炉，香炉前的香台上，红烛高烧，香烟飘绕。广场上有几个小师太正在练功。自此左右各有一条走廊通向后殿。]],
  exit = {
    e = { to = '峨嵋山东侧廊', },
    su = { to = '峨嵋山华藏庵大雄宝殿', },
    w = { to = '峨嵋山西侧廊', },
    n = { to = '峨嵋山华藏庵正殿', },
  },
},

['峨嵋山西侧廊'] = {
  id = '峨嵋山西侧廊',
  area = '峨嵋山',
  name = '西侧廊',
  desc =  [[这里是峨嵋华藏庵东廊。走廊往南通往禅房，东边通往广场。]],
  exit = {
    e = { to = '峨嵋山华藏庵广场', },
    s = { to = '峨嵋山禅房#HZA', },
  },
},

['峨嵋山斋堂'] = {
  id = '峨嵋山斋堂',
  area = '峨嵋山',
  name = '斋堂',
  desc =  [[这里便是峨嵋华藏庵的斋堂。斋堂里摆满了长长的餐桌和长凳，几位小师太正来回忙碌着布置素斋。桌上摆了几盆豆腐，花生，青菜以及素鸭等美味素食。斋堂后面有一道门通往华藏庵储物间，北边的走廊通向广场。]],
  exit = {
    s = { to = '峨嵋山储物间', },
    w = { to = '峨嵋山华藏庵大雄宝殿', },
    n = { to = '峨嵋山东侧廊', },
  },
},

['峨嵋山藏经楼#BGS'] = {
  id = '峨嵋山藏经楼#BGS',
  area = '峨嵋山',
  name = '藏经楼',
  desc =  [[这里是报国寺的藏经楼。阁楼上密密麻麻排了好多书架，架上摆满了经书。有两个身穿白衣的小师太正在一角静静地读着经书。]],
  exit = {
    out = { to = '峨嵋山大雄殿', },
  },
},

['峨嵋山洗象池边#S'] = {
  id = '峨嵋山洗象池边#S',
  area = '峨嵋山',
  name = '洗象池边',
  desc =  [[洗象池原只是一亭，亭前有一个石砌的小池(pool)，池边不远就是危岩。洗象池寓于一片冷杉林中，有若白云深处的仙山琼阁。若是云收雾敛、碧空万里、月朗中天时，便觉万籁俱寂，清光无限，宛若身在天宫，彻体生凉。这正是著名的「象池夜月」。由此向南上攀，便至雷洞坪，东下至莲花石。]],
  exit = {
    ed = { to = '峨嵋山钻天坡#2', },
    su = { to = '峨嵋山凌云梯', },
    n = { to = '峨嵋山洗象池边#N', },
  },
},

['峨嵋山万年庵'] = {
  id = '峨嵋山万年庵',
  area = '峨嵋山',
  name = '万年庵',
  desc =  [[万年庵建在一座突起的山峰上，周围古木森森，清泉淙淙，闲步无坎，吟游无坷，景色非常迷人。由此西上过十二盘可达华严顶，南下至白龙洞。]],
  exit = {
    enter = { to = '峨嵋山万年庵砖殿', },
    sd = { to = '峨嵋山白龙洞', },
    wu = { to = '峨嵋山十二盘#1', },
  },
},

['峨嵋山储物间'] = {
  id = '峨嵋山储物间',
  area = '峨嵋山',
  name = '储物间',
  desc =  [[这里便是峨嵋华藏庵的储物间，四周都是架子。一个架上放满了各样兵器，有长剑，拂尘，长鞭等，琳琅满目。另一个架上放了各种防具。还有一个架上摆了许多小柜子，原来是装满药品的药柜。一位师太负责管理这里的物品，正忙碌着整理防具。后面好象有个小楼梯。门外就是斋堂了。]],
  exit = {
    u = { to = '峨嵋山藏经楼#HZA', },
    n = { to = '峨嵋山斋堂', },
  },
},

['峨嵋山八十四盘#1'] = {
  id = '峨嵋山八十四盘#1',
  area = '峨嵋山',
  name = '八十四盘',
  desc =  [[八十四盘，道路艰险陡峭，迂回盘折，令人不能喘息。路左是蔽日遮天的冷杉林，路右是深不见底的绝壁峡谷。由此往上至接引殿，北下到洗象池。]],
  exit = {
    nd = { to = '峨嵋山雷洞坪', },
    nw = { to = '峨嵋山冷杉林#1', },
    sw = { to = '峨嵋山八十四盘#2', },
  },
},

['峨嵋山八十四盘#2'] = {
  id = '峨嵋山八十四盘#2',
  area = '峨嵋山',
  name = '八十四盘',
  desc =  [[八十四盘，道路艰险陡峭，迂回盘折，令人不能喘息。路左是蔽日遮天的冷杉林，路右是深不见底的绝壁峡谷。由此往上至接引殿，北下到洗象池。]],
  exit = {
    ne = { to = '峨嵋山八十四盘#1', },
    su = { to = '峨嵋山八十四盘#3', },
    se = { to = '峨嵋山冷杉林#2', },
  },
},

['峨嵋山禅房#HZA'] = {
  id = '峨嵋山禅房#HZA',
  area = '峨嵋山',
  name = '禅房',
  desc =  [[这里便是峨嵋华藏庵的禅房。地下散乱地放着许多蒲团，木鱼等，此处正是本派弟子打坐修行之所。几位年轻师太和俗家女弟子正肃容入定。]],
  exit = {
    e = { to = '峨嵋山华藏庵大雄宝殿', },
    s = { to = '峨嵋山休息室#HZA', door = 'open door', cond = 'player.gender ~= "male"', },
    n = { to = '峨嵋山西侧廊', },
  },
},

['峨嵋山后殿'] = {
  id = '峨嵋山后殿',
  area = '峨嵋山',
  name = '后殿',
  desc =  [[这是峨嵋山华藏庵的后殿。是峨嵋派掌门人传教弟子功夫的地方。这里供有一尊普贤菩萨像。两旁靠墙放着几张太师椅，地上放着几个蒲团。掌门人正在向几个女弟子传授武功。]],
  exit = {
    n = { to = '峨嵋山华藏庵大雄宝殿', door = 'open door', },
  },
},

['峨嵋山小竹林'] = {
  id = '峨嵋山小竹林',
  area = '峨嵋山',
  name = '小竹林',
  desc =  [[这是一片密密的竹林。这里人迹罕至，惟闻足底叩击路面，有僧敲木鱼声；微风吹拂竹叶，又如簌簌禅唱。令人尘心为之一涤，真是绝佳的静修所在。]],
  exit = {
    s = { to = '峨嵋山小竹林', },
    s2 = { to = '峨嵋山九老洞口', ignore = true, },
    e = { to = '峨嵋山小竹林', },
    e2 = { to = '峨嵋山万佛顶', ignore = true, },
    w = { to = '峨嵋山小竹林', },
    w2 = { to = '峨嵋山八十四盘#3', ignore = true, },
    n = { to = '峨嵋山小竹林', },
    n2 = { to = '峨嵋山冷杉林#1', ignore = true, },
    hidden1 = { to = '峨嵋山冷杉林#1', cost = 11, handler = 'twisted_cord', },
    hidden2 = { to = '峨嵋山九老洞口', cost = 11, handler = 'twisted_cord', },
    hidden3 = { to = '峨嵋山万佛顶', cost = 11, handler = 'twisted_cord', },
    hidden4 = { to = '峨嵋山八十四盘#3', cost = 11, handler = 'twisted_cord', },
  },
},

['峨嵋山冷杉林#3'] = {
  id = '峨嵋山冷杉林#3',
  area = '峨嵋山',
  name = '冷杉林',
  desc =  [[这是一片遮天蔽日的冷杉林。数人也合抱不过来的冷杉树簇在一块，棵棵枝繁叶茂，象一蓬蓬巨伞般伸向天空，把阳光遮得丝毫也无。看地上厚厚的枯枝烂叶，显然游客很少踏足此处。]],
  exit = {
    ne = { to = '峨嵋山冷杉林#1', },
    sw = { to = '峨嵋山冷杉林#3', },
    nw = { to = '峨嵋山冷杉林#2', },
    se = { to = '峨嵋山八十四盘#3', },
  },
},

['峨嵋山福寿庵'] = {
  id = '峨嵋山福寿庵',
  area = '峨嵋山',
  name = '福寿庵',
  desc =  [[福寿庵在神水庵南，是一个名叫天性的僧人建造的。庵前有九曲渠、流杯池，古人曾据在此饮酒流杯，观景赋诗，歌咏兴叹，不知夕日。庵旁有株大海棠树，数百苍龄，高达十余丈。]],
  exit = {
    enter = { to = '峨嵋山灵文阁', },
    n = { to = '峨嵋山神水庵', },
  },
},

['峨嵋山古德林#1'] = {
  id = '峨嵋山古德林#1',
  area = '峨嵋山',
  name = '古德林',
  desc =  [[这是一片密密的楠木林，株株秀挺俊拔，枝叶分披上捧，如两手拥佛，据说有七万株之多，要是不熟悉地形很容易迷路。]],
  exit = {
    e = { to = '峨嵋山古德林#1', },
    s = { to = '峨嵋山古德林#1', },
    w = { to = '峨嵋山古德林#1', },
    n = { to = '峨嵋山古德林#1', },
    hidden = { to = '峨嵋山古德林#2', handler = 'alternate_step', },
  },
},

['峨嵋山古德林#2'] = {
  id = '峨嵋山古德林#2',
  area = '峨嵋山',
  name = '古德林',
  desc =  [[这是一片密密的楠木林，株株秀挺俊拔，枝叶分披上捧，如两手拥佛，据说有七万株之多，要是不熟悉地形很容易迷路。]],
  exit = {
    s = { to = '峨嵋山白龙洞', },
    e = { to = '峨嵋山古德林#2', },
    w = { to = '峨嵋山古德林#2', },
    hidden = { to = '峨嵋山梅花桩', cmd = 'jump zhuang', },
    n = { to = '峨嵋山古德林#2', },
  },
},

['峨嵋山梅花桩'] = {
  id = '峨嵋山梅花桩',
  area = '峨嵋山',
  name = '梅花桩',
  desc =  [[你纵身跳上木桩，发现这里是一个练习轻功的绝佳场所。]],
  exit = {
    d = { to = '峨嵋山古德林#2', },
  },
},

['峨嵋山万行庵'] = {
  id = '峨嵋山万行庵',
  area = '峨嵋山',
  name = '万行庵',
  desc =  [[太子坪万行庵是古智禅师创建的。庵外满山长满莎椤花，花数芭合成一朵，叶子包在花外，古人以其根坚难易而盛赞之，以喻洁身自好之高贵品质。由此向南上便至金顶，下至接引殿。]],
  exit = {
    ed = { to = '峨嵋山接引殿', },
    su = { to = '峨嵋山金顶', },
  },
},

['峨嵋山后山小路#2'] = {
  id = '峨嵋山后山小路#2',
  area = '峨嵋山',
  name = '后山小路',
  desc =  [[这里是峨嵋后山上的山间小路，这里别有一番景色。由于已经是在万丈高山之巅，气候是比较寒冷的。]],
  exit = {
    sw = { to = '峨嵋山后山小路#1', },
    nd = { to = '峨嵋山后山', },
  },
},

['峨嵋山休息室#HZA'] = {
  id = '峨嵋山休息室#HZA',
  area = '峨嵋山',
  name = '休息室',
  desc =  [[这里是峨嵋华藏庵的休息室。窗帘拉下来，房里整整齐齐放了很多木床。有几个夜晚守庵的小师太正在睡觉。]],
  exit = {
    n = { to = '峨嵋山禅房#HZA', },
  },
},

['峨嵋山灵文阁'] = {
  id = '峨嵋山灵文阁',
  area = '峨嵋山',
  name = '灵文阁',
  desc =  [[这里是福寿庵的灵文阁，是主持静照师太传授佛法的地方。两名青衣小尼随侍在旁，似乎在聆听师太的教晦。阁内布置简陋，靠墙放着几把竹椅，地上放着几个蒲团。东首有一禅房。西面是一个斋厅。]],
  exit = {
    e = { to = '峨嵋山禅房#FSA', },
    w = { to = '峨嵋山福寿庵斋堂', },
    out = { to = '峨嵋山福寿庵', },
  },
},

['峨嵋山九十九道拐#3'] = {
  id = '峨嵋山九十九道拐#3',
  area = '峨嵋山',
  name = '九十九道拐',
  desc =  [[这是著名的「九十九道拐」，道路纡曲陡竖，千折百回。据说过去曾有个百余岁的疯僧至此，见一巨蟒挡路，便念咒驱蟒。但人们得知此处有巨蟒出没后，便再也无人敢碰这里的草木，并以「龙居」名之。由此东可至千佛庵，西达九老洞。]],
  exit = {
    ne = { to = '峨嵋山九十九道拐#2', },
    wu = { to = '峨嵋山九十九道拐#4', },
  },
},

['峨嵋山十二盘#3'] = {
  id = '峨嵋山十二盘#3',
  area = '峨嵋山',
  name = '十二盘',
  desc =  [[这里石阶陡折多弯，号称「十二盘」。你见路边有个八音池，有人正在向池中击掌(clap)。由此西上可达华严顶，东下则到万年庵。]],
  exit = {
    ed = { to = '峨嵋山十二盘#2', },
    sw = { to = '峨嵋山十二盘#4', },
  },
},

['峨嵋山东侧殿'] = {
  id = '峨嵋山东侧殿',
  area = '峨嵋山',
  name = '东侧殿',
  desc =  [[这里是金顶华藏庵东侧殿，是接待香客及来宾的地方。殿内摆着几张桌子，桌旁围放数把椅子。墙上悬着几幅字画，墙边一排书架，架上摆满经书。有几位进香客正在品茶养神，欣赏墙上的字画或翻阅架上的经书。还有两个二十来岁的姑娘在向一位师太打听有关出家的事。一个十来岁的小师太正在忙前忙后招待客人。]],
  exit = {
    w = { to = '峨嵋山华藏庵正殿', },
  },
},

['峨嵋山钻天坡#2'] = {
  id = '峨嵋山钻天坡#2',
  area = '峨嵋山',
  name = '钻天坡',
  desc =  [[莲花石与洗象池之间，道路陡绝，石栈若齿，直上蓝天，石蹬达一千三百多级，是在陡峭山壁上开凿出来的坡道。人行其上，前后顶踵相接，一如登天。这段路叫「鹁鸽钻天」，这段陡坡也因此而叫「钻天坡」。这里西上坡顶便到洗象池，东下可达莲花石。]],
  exit = {
    ed = { to = '峨嵋山钻天坡#1', },
    wu = { to = '峨嵋山洗象池边#S', },
  },
},

['峨嵋山树上'] = {
  id = '峨嵋山树上',
  area = '峨嵋山',
  name = '树上',
  desc =  [[一股腥臭之气扑面而来。你抬头一看，顿时毛骨悚然，一条碗口粗细的巨蟒倒悬在树干上，张开大口，正要向你扑来！]],
  exit = {
    d = { to = '峨嵋山九十九道拐#3', },
  },
},

['峨嵋山报国寺山门'] = {
  id = '峨嵋山报国寺山门',
  area = '峨嵋山',
  name = '报国寺山门',
  desc =  [[报国寺为峨嵋出入之门户。山门(gate)上有一块大匾。寺外苍楠环卫，翠柏掩映。由此一路向西上开始登峨嵋山，北面下山是一条弯弯的石阶路。]],
  exit = {
    w = { to = '峨嵋山报国寺', },
    nd = { to = '峨嵋山青石阶', },
  },
},

['峨嵋山睹光台'] = {
  id = '峨嵋山睹光台',
  area = '峨嵋山',
  name = '睹光台',
  desc =  [[ 这里是看日出、云海、佛光、神灯之地。台下深崖万丈，陡彻无底，云遮雾掩。极目四望，数百里外的大小雪山皆历历在目。]],
  exit = {
    nd = { to = '峨嵋山卧云庵', },
    w = { to = '峨嵋山睹光台舍身崖', },
    n = { to = '峨嵋山华藏庵', },
  },
},

['峨嵋山冷杉林#1'] = {
  id = '峨嵋山冷杉林#1',
  area = '峨嵋山',
  name = '冷杉林',
  desc =  [[这是一片遮天蔽日的冷杉林。数人也合抱不过来的冷杉树簇在一块，棵棵枝繁叶茂，象一蓬蓬巨伞般伸向天空，把阳光遮得丝毫也无。看地上厚厚的枯枝烂叶，显然游客很少踏足此处。]],
  exit = {
    ne = { to = '峨嵋山冷杉林#2', },
    sw = { to = '峨嵋山冷杉林#1', },
    nw = { to = '峨嵋山冷杉林#2', },
    se = { to = '峨嵋山八十四盘#1', },
  },
},

['峨嵋山华藏庵大雄宝殿'] = {
  id = '峨嵋山华藏庵大雄宝殿',
  area = '峨嵋山',
  name = '华藏庵大雄宝殿',
  desc =  [[这是峨嵋山华藏庵的大雄宝殿。正中供奉着普贤菩萨。一群青衣小师太正在地上诵经。后面有道小门通往后殿。]],
  exit = {
    e = { to = '峨嵋山斋堂', },
    nd = { to = '峨嵋山华藏庵广场', },
    w = { to = '峨嵋山禅房#HZA', },
    s = { to = '峨嵋山后殿', door = 'open door', },
  },
},

['峨嵋山禅房#WNA'] = {
  id = '峨嵋山禅房#WNA',
  area = '峨嵋山',
  name = '禅房',
  desc =  [[这里是一间安静宽敞的禅房，乃是庵中弟子打坐修行之所。地下整整齐齐地放着许多蒲团。几位年轻师太和俗家女弟子正肃容入定。]],
  exit = {
    w = { to = '峨嵋山万年庵砖殿', door ='open door', },
  },
},

['峨嵋山华严顶'] = {
  id = '峨嵋山华严顶',
  area = '峨嵋山',
  name = '华严顶',
  desc =  [[华严顶挺拔高峭，古刹云深，殿宇孤耸，风景奇险。这里视野开阔，仰可见金顶巍巍，俯可望群峰罗列，许多蹲伏山间的寺院也在眼底。由此向西过数坡，即到莲花石，东下过十二盘可到万年寺。北面是一间马厩。]],
  exit = {
    wu = { to = '峨嵋山莲花石', },
    d = { to = '峨嵋山十二盘#4', },
    eu = { to = '峨嵋山仙峰寺', },
    n = { to = '峨嵋山马厩', },
  },
},

['峨嵋山钻天坡#1'] = {
  id = '峨嵋山钻天坡#1',
  area = '峨嵋山',
  name = '钻天坡',
  desc =  [[莲花石与洗象池之间，道路陡绝，石栈若齿，直上蓝天，石蹬达一千三百多级，是在陡峭山壁上开凿出来的坡道。人行其上，前后顶踵相接，一如登天。这段路叫「鹁鸽钻天」，这段陡坡也因此而叫「钻天坡」。这里西上坡顶便到洗象池，东下可达莲花石。]],
  exit = {
    ed = { to = '峨嵋山莲花石', },
    wu = { to = '峨嵋山钻天坡#2', },
  },
},

['天山山径#5'] = {
  id = '天山山径#5',
  area = '天山',
  name = '山径',
  desc =  [[这里是一条石弄堂也似的窄道，越走越高，云遮雾罩，隐约可见，两侧是高耸的石壁，青天只得一线，你不由的加快了步伐。]],
  exit = {
    nu = { to = '天山山径#6', },
    w = { to = '天山山径#4', },
  },
},

['天山青石大道#2'] = {
  id = '天山青石大道#2',
  area = '天山',
  name = '青石大道',
  desc =  [[这是一条青石板铺成的大道，每块青石都是长约八尺，宽约三尺，甚是整齐，要铺成这样的大道，工程浩大之极，不知是何年何代何人所造。大道两旁树立着些石人，皆面目狰狞，手持各色神器让人望之心惊。]],
  exit = {
    nu = { to = '天山赤天部', },
    s = { to = '天山青石大道#1', },
  },
},

['天山缥缈峰'] = {
  id = '天山缥缈峰',
  area = '天山',
  name = '缥缈峰',
  desc =  [[这里是天山绝峰，山峰终年云封雾锁，非天即海，茫茫一片，险峻之极，远远望去，若有若无，因此叫作缥缈峰。]],
  exit = {
    sd = { to = '天山山径#6', },
    nd = { to = '天山青石大道#1', },
  },
},

['天山山径#1'] = {
  id = '天山山径#1',
  area = '天山',
  name = '山径',
  desc =  [[这里是一条石弄堂也似的窄道，越走越高，云遮雾罩，隐约可见，两侧是高耸的石壁，青天只得一线，你不由的加快了步伐。]],
  exit = {
    nu = { to = '天山山径#2', },
    sd = { to = '天山仙愁门', },
  },
},

['天山走廊#2E'] = {
  id = '天山走廊#2E',
  area = '天山',
  name = '走廊',
  desc =  [[这是灵鹫宫的一条走廊，只见每根枋梁都绘有精美的彩画，风景、人物、山水、花鸟，应有尽有。]],
  exit = {
    s = { to = '天山练功房', },
    w = { to = '天山走廊#1E', },
    n = { to = '天山百草堂', },
  },
},

['天山半山'] = {
  id = '天山半山',
  area = '天山',
  name = '半山',
  desc =  [[爬了半天的你终于来到半山。身边已经若有若无地出现了丝丝云雾，脚下也开始有积雪。山下是一望无垠的大草原，远处的星宿海和明教圣山都尽收眼底。你不由得一股豪情壮志涌上来，生出天下英雄，舍我其谁的念头。山路至此似乎已经到了尽头。左手的山壁上杂乱地钉着几根木粱。]],
  exit = {
    w = { to = '天山断魂崖', },
    sd = { to = '天山山路#3', },
  },
},

['天山寝室'] = {
  id = '天山寝室',
  area = '天山',
  name = '寝室',
  desc =  [[这里是一间精致的小舍，一进门便闻到一阵浓烈的花香，椅上铺了绣花锦垫，似乎是天山童姥的寝室。]],
  exit = {
    n = { to = '天山走廊#2W', },
  },
},

['天山灵心斋'] = {
  id = '天山灵心斋',
  area = '天山',
  name = '灵心斋',
  desc =  [[这里是灵心斋，内有几明椅净，散著袅袅檀香，怡神舒畅，正是天山童姥平日静坐寻思之地。]],
  exit = {
    n = { to = '天山走廊#1W', },
  },
},

['天山鸾天部'] = {
  id = '天山鸾天部',
  area = '天山',
  name = '鸾天部',
  desc =  [[眼前是一个可容纳数百人的大厅，为鸾天部的所在地，大厅墙壁上画满了浮雕，天顶上是一个女子，骑在一只头上长着个大瘤的怪鸟上，向天上的一个黑洞飞去，她身下的地面隐隐可见流火处处。地面以绿岩石磨就，分毫无缝，浑然天成。大厅四角点着数盏明灯，弥漫在大厅里的香气好象就是从灯里发出。]],
  exit = {
    sw = { to = '天山青石大道#NE', },
  },
},

['天山断水桥'] = {
  id = '天山断水桥',
  area = '天山',
  name = '断水桥',
  desc =  [[这里是断水桥，乃是观雨亭和后园假山的一道分水线。]],
  exit = {
    e = { to = '天山假山', },
    w = { to = '天山花园', },
    s = { to = '天山观雨亭', },
  },
},

['天山幽天部'] = {
  id = '天山幽天部',
  area = '天山',
  name = '幽天部',
  desc =  [[眼前是一个可容纳数百人的大厅，是幽天部的所在地，大厅墙壁上画满了浮雕，天顶上是一个双面人，人做两性，一头为男，状及丑陋，一头为女，状及美丽。地面以红色岩石磨就，分毫无缝，浑然天成。大厅四角点着数盏明灯，弥漫在大厅里的香气好象就是从灯里发出。]],
  exit = {
    se = { to = '天山青石大道#NW', },
  },
},

['天山朱天部'] = {
  id = '天山朱天部',
  area = '天山',
  name = '朱天部',
  desc =  [[眼前是一个可容纳数百人的大厅，是朱天部的所在地，大厅墙壁上画满了浮雕，天顶上是一条赤龙出没于火红的云雾之中。不知是那位高人手笔，只见那龙如活物一般，直要破顶飞去。地面以锗色岩石磨就，分毫无缝，浑然天成。大厅四角点着数盏明灯，弥漫在大厅里的香气好象就是从灯里发出。]],
  exit = {
    ne = { to = '天山青石大道#SW', },
  },
},

['天山走廊#S'] = {
  id = '天山走廊#S',
  area = '天山',
  name = '走廊',
  desc =  [[这是灵鹫宫的一条走廊，只见每根枋梁都绘有精美的彩画，风景、人物、山水、花鸟，应有尽有。]],
  exit = {
    s = { to = '天山前殿', },
    n = { to = '天山大殿', },
  },
},

['天山青石大道#W'] = {
  id = '天山青石大道#W',
  area = '天山',
  name = '青石大道',
  desc =  [[这是一条青石板铺成的大道，每块青石都是长约八尺，宽约三尺，甚是整齐，要铺成这样的大道，工程浩大之极，不知是何年何代何人所造。大道两旁树立着些石人，皆面目狰狞，手持各色神器让人望之心惊。]],
  exit = {
    wu = { to = '天山成天部', },
    eu = { to = '天山钧天部', },
    s = { to = '天山青石大道#SW', },
    n = { to = '天山青石大道#NW', },
  },
},

['天山仙愁门'] = {
  id = '天山仙愁门',
  area = '天山',
  name = '仙愁门',
  desc =  [[这里是仙愁门，仙愁门三面环海，云天无际，凛冽北风掠过身边，吹得人如腾云驾雾，彷佛这里真的是与天接壤之处。]],
  exit = {
    nu = { to = '天山山径#1', },
    hidden = { to = '天山百丈涧', cmd = 'tiao duimian;#wb 3500', cond = 'player.skill["基本轻功"] and player.skill["基本轻功"].level >= 100', },
  },
},

['天山断魂崖'] = {
  id = '天山断魂崖',
  area = '天山',
  name = '断魂崖',
  desc =  [[爬上悬崖，是一片很小的立足之地，寒风呼啸，吹的你的身体不由的左右摇摆。你不由的擦了把汗，回头看看来路，已经湮没在云雾之中了。右手上三个大字断魂崖正是你现实心情的写照。当面一块巨岩，有四、五丈高，因长时间在这里受风雪侵蚀，已是滑不留手，上面有一行小字(zi)。    ]],
  exit = {
    e = { to = '天山半山', },
    wd = { to = '天山山涧', },
    nu = { to = '天山失足岩', },
  },
},

['天山山涧'] = {
  id = '天山山涧',
  area = '天山',
  name = '山涧',
  desc = [[这是天山里的一个山涧，旁边是由于上面的山泉常年累月冲击形成的一个很深的水潭。这里周围长满了灌木，北上方似乎能走过去，你不由的加快了步伐。]],
  exit = {
    ne = { to = '天山山涧', },
    nd = { to = '天山山涧', },
    s = { to = '天山山涧', },
    wu = { to = '天山山涧', },
    e = { to = '天山山涧', },
    sw = { to = '天山山涧', },
    w = { to = '天山山涧', },
    su = { to = '天山山涧', },
    ed = { to = '天山山涧', },
    wd = { to = '天山山涧', },
    sd = { to = '天山山涧', },
    se = { to = '天山山涧', },
    nu = { to = '天山山涧', },
    eu = { to = '天山山涧', },
    nw = { to = '天山山涧', },
    n = { to = '天山山涧', },
    hidden = { to = '天山龙潭', handler = 'ts_longtan', },
  },
},

['天山龙潭'] = {
  id = '天山龙潭',
  area = '天山',
  name = '龙潭',
  desc =  [[拨开灌木，你眼前忽然一阵五色眩迷，不闻水声，但见水影，却是山谷中一湾深不见底的藏青色水潭，令人不寒而栗的是，潭水居然呈通透的黑墨色，潭中怪石林立，遮掩勾连，仿佛是一条乌金的石龙，盘绕在水潭上，而龙头，正是斜插在潭水中央一方怪石。整个水潭宁静如死寂之河，只有风吹过竹林，吹来阵阵的寒意。你凑近一看，潭水虽然漆黑，竟是黑得犹如一面墨色的水镜，仿佛可以照见深深的幽冥……]],
  exit = {
    u = { to = '天山断魂崖', },
  },
},

['天山练功房'] = {
  id = '天山练功房',
  area = '天山',
  name = '练功房',
  desc =  [[这里是灵鹫宫弟子修身养性、打熬气力的地方。为了方便练功，桌椅都没有摆放，仅仅在地下丢了几个小蒲团。]],
  exit = {
    n = { to = '天山走廊#2E', },
  },
},

['天山成天部'] = {
  id = '天山成天部',
  area = '天山',
  name = '成天部',
  desc =  [[眼前是一个可容纳数百人的大厅，是成天部的所在地，大厅墙壁上画满了浮雕，天顶上画的是一个青衫男子，头上有角，左手持长剑，右手握剑诀，骑着一只青龙，冲天而起。地面以青色岩石磨就，分毫无缝，浑然天成。大厅四角点着数盏明灯，弥漫在大厅里的香气好象就是从灯里发出。]],
  exit = {
    ed = { to = '天山青石大道#W', },
  },
},

['天山客房'] = {
  id = '天山客房',
  area = '天山',
  name = '客房',
  desc =  [[这里是灵鹫宫的客房，陈设十分简陋，靠墙放了十几张小木床，不少客人正和衣而卧。]],
  exit = {
    s = { to = '天山走廊#1W', },
  },
},

['天山青石大道#E'] = {
  id = '天山青石大道#E',
  area = '天山',
  name = '青石大道',
  desc =  [[这是一条青石板铺成的大道，每块青石都是长约八尺，宽约三尺，甚是整齐，要铺成这样的大道，工程浩大之极，不知是何年何代何人所造。大道两旁树立着些石人，皆面目狰狞，手持各色神器让人望之心惊。]],
  exit = {
    wu = { to = '天山钧天部', },
    eu = { to = '天山昊天部', },
    s = { to = '天山青石大道#SE', },
    n = { to = '天山青石大道#NE', },
  },
},

['天山青石大道#NW'] = {
  id = '天山青石大道#NW',
  area = '天山',
  name = '青石大道',
  desc =  [[这是一条青石板铺成的大道，每块青石都是长约八尺，宽约三尺，甚是整齐，要铺成这样的大道，工程浩大之极，不知是何年何代何人所造。大道两旁树立着些石人，皆面目狰狞，手持各色神器让人望之心惊。]],
  exit = {
    e = { to = '天山青石大道#N', },
    nw = { to = '天山幽天部', },
    s = { to = '天山青石大道#W', },
  },
},

['天山走廊#N'] = {
  id = '天山走廊#N',
  area = '天山',
  name = '走廊',
  desc =  [[这是灵鹫宫的一条走廊，只见每根枋梁都绘有精美的彩画，风景、人物、山水、花鸟，应有尽有。]],
  exit = {
    s = { to = '天山大殿', },
    n = { to = '天山后园', },
  },
},

['天山青石大道#S'] = {
  id = '天山青石大道#S',
  area = '天山',
  name = '青石大道',
  desc =  [[这是一条青石板铺成的大道，每块青石都是长约八尺，宽约三尺，甚是整齐，要铺成这样的大道，工程浩大之极，不知是何年何代何人所造。大道两旁树立着些石人，皆面目狰狞，手持各色神器让人望之心惊。]],
  exit = {
    nu = { to = '天山钧天部', },
    e = { to = '天山青石大道#SE', },
    w = { to = '天山青石大道#SW', },
    su = { to = '天山赤天部', },
  },
},

['天山山径#3'] = {
  id = '天山山径#3',
  area = '天山',
  name = '山径',
  desc =  [[这里是一条石弄堂也似的窄道，越走越高，云遮雾罩，隐约可见，两侧是高耸的石壁，青天只得一线，你不由的加快了步伐。]],
  exit = {
    w = { to = '天山山径#2', },
    e = { to = '天山山径#4', },
  },
},

['天山山径#2'] = {
  id = '天山山径#2',
  area = '天山',
  name = '山径',
  desc =  [[这里是一条石弄堂也似的窄道，越走越高，云遮雾罩，隐约可见，两侧是高耸的石壁，青天只得一线，你不由的加快了步伐。]],
  exit = {
    e = { to = '天山山径#3', },
    sd = { to = '天山山径#1', },
  },
},

['天山青石大道#N'] = {
  id = '天山青石大道#N',
  area = '天山',
  name = '青石大道',
  desc =  [[这是一条青石板铺成的大道，每块青石都是长约八尺，宽约三尺，甚是整齐，要铺成这样的大道，工程浩大之极，不知是何年何代何人所造。大道两旁树立着些石人，皆面目狰狞，手持各色神器让人望之心惊。]],
  exit = {
    nu = { to = '天山玄天部', },
    e = { to = '天山青石大道#NE', },
    w = { to = '天山青石大道#NW', },
    su = { to = '天山钧天部', },
  },
},

['天山假山'] = {
  id = '天山假山',
  area = '天山',
  name = '假山',
  desc =  [[这里是断水桥尽头的假山，四周的野花野草在寒风中依旧长得生气勃勃，散发着阵阵的独特的味道。你看着看着，越觉得这地方的古怪。但什么原因你又说不上来。]],
  exit = {
    w = { to = '天山断水桥', },
  },
},

['天山前殿'] = {
  id = '天山前殿',
  area = '天山',
  name = '前殿',
  desc =  [[这里是灵鹫宫的前殿，厅堂不大，但气势非凡，一般灵鹫宫的客人都在此听童姥的安排。中间上首是两张用天山特殊木材制成的太师椅，当中一张大理石面的八仙桌，下首两边是八张椅子。]],
  exit = {
    s = { to = '天山灵鹫宫', },
    w = { to = '天山厨房', },
    n = { to = '天山走廊#S', },
  },
},

['天山大殿'] = {
  id = '天山大殿',
  area = '天山',
  name = '大殿',
  desc =  [[这里就是灵鹫宫的大殿了，厅堂高大，气势非凡，放眼望去，只见正中一块横匾，写着『灵鹫宫』三个大字。楹柱中堂悬满了字画，你一时也看不了许多，况且好多字你根本不认识。中间上首是两张缅甸红木制成的太师椅，当中一张大理石面的八仙桌，下首两边是八张椅子。几个丫鬟在旁肃立，整个大厅鸦雀无声。]],
  exit = {
    e = { to = '天山走廊#1E', },
    s = { to = '天山走廊#S', },
    w = { to = '天山走廊#1W', },
    n = { to = '天山走廊#N', },
  },
},

['天山观雨亭'] = {
  id = '天山观雨亭',
  area = '天山',
  name = '观雨亭',
  desc =  [[这里是灵鹫宫后园里的观雨亭，只见观雨亭下有一水潭，水谭上依稀可以看到缕缕薄冰。中间有一道断水桥，后面是一片假山。]],
  exit = {
    s = { to = '天山后园', },
    n = { to = '天山断水桥', },
  },
},

['天山防具室'] = {
  id = '天山防具室',
  area = '天山',
  name = '防具室',
  desc =  [[这里是灵鹫宫弟子领取武器和防具之地，汇集了天下各派惯用的各类兵刃。 ]],
  exit = {
    s = { to = '天山走廊#1E', },
  },
},

['天山失足岩'] = {
  id = '天山失足岩',
  area = '天山',
  name = '失足岩',
  desc =  [[这里是失足岩，乃天山山路关口，常年风雪连天，地势陡斜，尽是冰天雪地，踏足滑斜，随时有倾泻之危，常人绝难直进，故取失足之名。]],
  exit = {
    sd = { to = '天山断魂崖', },
    n = { to = '天山百丈涧', },
  },
},

['天山走廊#1E'] = {
  id = '天山走廊#1E',
  area = '天山',
  name = '走廊',
  desc =  [[这是灵鹫宫的一条走廊，只见每根枋梁都绘有精美的彩画，风景、人物、山水、花鸟，应有尽有。]],
  exit = {
    e = { to = '天山走廊#2E', },
    s = { to = '天山兵器室', },
    w = { to = '天山大殿', },
    n = { to = '天山防具室', },
  },
},

['天山钧天部'] = {
  id = '天山钧天部',
  area = '天山',
  name = '钧天部',
  desc =  [[眼前是一个可容纳数百人的大厅，为钧天部的所在地，大厅墙壁上画满了浮雕，天顶上是一只巨蟒，盘踞其上，双眼圆睁，血盆大口中红信吞吐。地面以橙色岩石磨就，分毫无缝，浑然天成。大厅四角点着数盏明灯，弥漫在大厅里的香气好象就是从灯里发出。]],
  exit = {
    ed = { to = '天山青石大道#E', },
    nd = { to = '天山青石大道#N', },
    sd = { to = '天山青石大道#S', },
    wd = { to = '天山青石大道#W', },
    enter = { to = '天山灵鹫宫', },
  },
},

['天山青石大道#SE'] = {
  id = '天山青石大道#SE',
  area = '天山',
  name = '青石大道',
  desc =  [[这是一条青石板铺成的大道，每块青石都是长约八尺，宽约三尺，甚是整齐，要铺成这样的大道，工程浩大之极，不知是何年何代何人所造。大道两旁树立着些石人，皆面目狰狞，手持各色神器让人望之心惊。]],
  exit = {
    se = { to = '天山阳天部', },
    w = { to = '天山青石大道#S', },
    n = { to = '天山青石大道#E', },
  },
},

['天山空场'] = {
  id = '天山空场',
  area = '天山',
  name = '空场',
  desc =  [[转过一个山脚，眼前突然现出一片莫大的空场。黄土夯就，地面平实。空场四周，星星点点可见雪山才能得见的小花。前方一座高山，山势陡峭，半山腰间已是云雾遮罩，使人不能窥其全貌。左一条弯弯曲曲的小道，似乎正是上山的道路。]],
  exit = {
    w = { to = '天山天山山路', },
    e = { to = '星宿海山脚下', },
  },
},

['天山青石大道#SW'] = {
  id = '天山青石大道#SW',
  area = '天山',
  name = '青石大道',
  desc =  [[这是一条青石板铺成的大道，每块青石都是长约八尺，宽约三尺，甚是整齐，要铺成这样的大道，工程浩大之极，不知是何年何代何人所造。大道两旁树立着些石人，皆面目狰狞，手持各色神器让人望之心惊。]],
  exit = {
    e = { to = '天山青石大道#S', },
    sw = { to = '天山朱天部', },
    n = { to = '天山青石大道#W', },
  },
},

['天山走廊#1W'] = {
  id = '天山走廊#1W',
  area = '天山',
  name = '走廊',
  desc =  [[这是灵鹫宫的一条走廊，只见每根枋梁都绘有精美的彩画，风景、人物、山水、花鸟，应有尽有。]],
  exit = {
    e = { to = '天山大殿', },
    s = { to = '天山灵心斋', },
    w = { to = '天山走廊#2W', },
    n = { to = '天山客房', },
  },
},

['天山封器冢'] = {
  id = '天山封器冢',
  area = '天山',
  name = '封器冢',
  desc =  [[这里是灵鹫宫的封器冢，天山童姥曾杀败无数不服的武林群雄，更将他们的兵器封存于封器冢内。]],
  exit = {
    s = { to = '天山走廊#2W', },
  },
},

['天山赤天部'] = {
  id = '天山赤天部',
  area = '天山',
  name = '赤天部',
  desc =  [[眼前是一个可容纳数百人的大厅，是赤天部的所在地，大厅墙壁上画满了浮雕，天顶上是一片云雾，一仙人卧于其中，面目沉静，姿态幽雅，似乎万物与其无关痛痒，万事不动其心。地面以灰色岩石磨就，分毫无缝，浑然天成。大厅四角点着数盏明灯，弥漫在大厅里的香气好象就是从灯里发出。]],
  exit = {
    sd = { to = '天山青石大道#2', },
    nd = { to = '天山青石大道#S', },
  },
},

['天山百草堂'] = {
  id = '天山百草堂',
  area = '天山',
  name = '百草堂',
  desc =  [[这里是灵鹫宫的药房，室中摆放着各种不同的配药的用具和一些已经配好了的药。]],
  exit = {
    s = { to = '天山走廊#2E', },
  },
},

['天山花园'] = {
  id = '天山花园',
  area = '天山',
  name = '花园',
  desc =  [[这里是灵鹫宫花园里，平常灵鹫宫女弟子经常在这里嬉戏。从这里可以看到观雨亭那里，亭里似乎背坐着一个女弟子，隐约中你听见几声叹息。]],
  exit = {
    e = { to = '天山断水桥', },
  },
},

['天山山路#1'] = {
  id = '天山山路#1',
  area = '天山',
  name = '山路',
  desc =  [[这是一条通向山上的小路，由于此地长年苦寒，路的两边只有些耐寒的草本植物生长。四周并无半点虫鸣鸟叫，只有山风呼啸着。阵阵寒意袭来，你不由得裹紧了身上的衣服。]],
  exit = {
    nu = { to = '天山山路#2', },
    sd = { to = '天山天山山路', },
  },
},

['天山山路#2'] = {
  id = '天山山路#2',
  area = '天山',
  name = '山路',
  desc =  [[这是一条通向山上的小路，由于此地长年苦寒，路的两边只有些耐寒的草本植物生长。四周并无半点虫鸣鸟叫，只有山风呼啸着。阵阵寒意袭来，你不由得裹紧了身上的衣服。]],
  exit = {
    nu = { to = '天山山路#3', },
    sd = { to = '天山山路#1', },
  },
},

['天山山路#3'] = {
  id = '天山山路#3',
  area = '天山',
  name = '山路',
  desc =  [[这是一条通向山上的小路，由于此地长年苦寒，路的两边只有些耐寒的草本植物生长。四周并无半点虫鸣鸟叫，只有山风呼啸着。阵阵寒意袭来，你不由得裹紧了身上的衣服。]],
  exit = {
    nu = { to = '天山半山', },
    sd = { to = '天山山路#2', },
  },
},

['天山百丈涧'] = {
  id = '天山百丈涧',
  area = '天山',
  name = '百丈涧',
  desc =  [[眼前是一处山涧，深不可测。连接两侧峭壁的竟是几条铁链，铁链上的木板早已不见。这边桥柱上钉这几枚暗器，四周积雪中插有数柄断刀断剑，更多的是些奇门兵器，有几柄色泛悠蓝，定是涂有剧毒, 山涧下面是云雾弥漫的万丈深崖，看来掉下去定无生路。]],
  exit = {
    s = { to = '天山失足岩', },
    hidden = { to = '天山仙愁门', cmd = 'ge tielian;#wb 3500;tiao duimian;#wb 3500', handler = 'ts_bzjian', cond = 'player.skill["基本轻功"] and player.skill["基本轻功"].level >= 100', },
  },
},

['天山山径#4'] = {
  id = '天山山径#4',
  area = '天山',
  name = '山径',
  desc =  [[这里是一条石弄堂也似的窄道，越走越高，云遮雾罩，隐约可见，两侧是高耸的石壁，青天只得一线，你不由的加快了步伐。]],
  exit = {
    w = { to = '天山山径#3', },
    e = { to = '天山山径#5', },
  },
},

['天山山径#6'] = {
  id = '天山山径#6',
  area = '天山',
  name = '山径',
  desc =  [[这里是一条石弄堂也似的窄道，越走越高，云遮雾罩，隐约可见，两侧是高耸的石壁，青天只得一线，你不由的加快了步伐。]],
  exit = {
    nu = { to = '天山缥缈峰', },
    sd = { to = '天山山径#5', },
  },
},

['天山玄天部'] = {
  id = '天山玄天部',
  area = '天山',
  name = '玄天部',
  desc =  [[眼前是一个可容纳数百人的大厅，为玄天部的所在地，大厅墙壁上画满了浮雕，天顶上是一个女子，骑在一只头上长着个大瘤的怪鸟上，向天上的一个黑洞飞去，她身下的地面隐隐可见流火处处。地面以绿岩石磨就，分毫无缝，浑然天成。大厅四角点着数盏明灯，弥漫在大厅里的香气好象就是从灯里发出。]],
  exit = {
    sd = { to = '天山青石大道#N', },
  },
},

['天山青石大道#NE'] = {
  id = '天山青石大道#NE',
  area = '天山',
  name = '青石大道',
  desc =  [[这是一条青石板铺成的大道，每块青石都是长约八尺，宽约三尺，甚是整齐，要铺成这样的大道，工程浩大之极，不知是何年何代何人所造。大道两旁树立着些石人，皆面目狰狞，手持各色神器让人望之心惊。]],
  exit = {
    ne = { to = '天山鸾天部', },
    w = { to = '天山青石大道#N', },
    s = { to = '天山青石大道#E', },
  },
},

['天山阳天部'] = {
  id = '天山阳天部',
  area = '天山',
  name = '阳天部',
  desc =  [[眼前是一个可容纳数百人的大厅，为阳天部的所在地，大厅墙壁上画满了浮雕，天顶上是一只麒麟，口内喷火，四爪驽地，双目圆睁，似要择人而食。地面以橙色岩石磨就，分毫无缝，浑然天成。大厅四角点着数盏明灯，弥漫在大厅里的香气好象就是从灯里发出。]],
  exit = {
    nw = { to = '天山青石大道#SE', },
  },
},

['天山灵鹫宫'] = {
  id = '天山灵鹫宫',
  area = '天山',
  name = '灵鹫宫',
  desc =  [[石道尽处，一座巨大的石堡巍然耸立，堡门左右各有一头石雕的猛鹫，高达三丈有余，尖喙巨爪，神骏非凡。堡门上方悬有一匾，『灵鹫宫』三个大字铁划银勾。仔细看来仿佛包含着及强的剑意。门旁两副对联，“世间万物尽皆虚无缥缈，入我门来还你自在逍遥”让你不由的一阵迷茫。]],
  exit = {
    out = { to = '天山钧天部', },
    n = { to = '天山前殿', },
  },
},

['天山厨房'] = {
  id = '天山厨房',
  area = '天山',
  name = '厨房',
  desc =  [[一间雅致的小厅，整个房间的装饰基调为翠绿色，看起来让人感觉赏心悦目。这里就是灵鹫宫一起用餐的地方，上首是一张雕饰的十分绚丽的长几，左右手分别是两张小几。]],
  exit = {
    e = { to = '天山前殿', },
  },
},

['天山走廊#2W'] = {
  id = '天山走廊#2W',
  area = '天山',
  name = '走廊',
  desc =  [[这是灵鹫宫的一条走廊，只见每根枋梁都绘有精美的彩画，风景、人物、山水、花鸟，应有尽有。]],
  exit = {
    e = { to = '天山走廊#1W', },
    s = { to = '天山寝室', },
    n = { to = '天山封器冢', },
  },
},

['天山兵器室'] = {
  id = '天山兵器室',
  area = '天山',
  name = '兵器室',
  desc =  [[这里是灵鹫宫弟子摆放兵器的房间，地下杂乱地堆着一些剑，有的已经锈纹斑斑了，有的还是锋利透亮。放置着各种兵器的兵器架（jia)摆放在房间的正中。上面摆满了各种兵器和防具，另人眩目。灵鹫宫弟子练功的时候，就到这里来挑选兵刃。]],
  exit = {
    n = { to = '天山走廊#1E', },
  },
},

['天山后园'] = {
  id = '天山后园',
  area = '天山',
  name = '后园',
  desc =  [[你现在站在灵鹫宫的后园里。园中的一些不知名的小花在寒风冰雪下长得生气勃勃，散发着阵阵的清香，两旁的青石凳上飘着一些黄叶。]],
  exit = {
    s = { to = '天山走廊#N', },
    n = { to = '天山观雨亭', },
  },
},

['天山青石大道#1'] = {
  id = '天山青石大道#1',
  area = '天山',
  name = '青石大道',
  desc =  [[这是一条青石板铺成的大道，每块青石都是长约八尺，宽约三尺，甚是整齐，要铺成这样的大道，工程浩大之极，不知是何年何代何人所造。大道两旁树立着些石人，皆面目狰狞，手持各色神器让人望之心惊。]],
  exit = {
    su = { to = '天山缥缈峰', },
    n = { to = '天山青石大道#2', },
  },
},

['天山天山山路'] = {
  id = '天山天山山路',
  area = '天山',
  name = '天山山路',
  desc =  [[这是一条通向山上的小路，由于此地长年苦寒，路的两边只有些耐寒的草本植物生长。四周并无半点虫鸣鸟叫，只有山风呼啸着。阵阵寒意袭来，你不由得裹紧了身上的衣服。]],
  exit = {
    nu = { to = '天山山路#1', },
    e = { to = '天山空场', },
  },
},

['天山昊天部'] = {
  id = '天山昊天部',
  area = '天山',
  name = '昊天部',
  desc =  [[眼前是一个可容纳数百人的大厅，为昊天部的所在地，大厅墙壁上画满了浮雕，天顶上是地狱百色图，正中一个夜叉左手持叉，右手牵索，上系无数赤身裸体之人，令你观之感同身受，不寒而栗。地面以黑岩石磨就，分毫无缝，浑然天成。大厅四角点着数盏明灯，弥漫在大厅里的香气好象就是从灯里发出。]],
  exit = {
    wd = { to = '天山青石大道#E', },
  },
},

['姑苏慕容渡船#XZ-MTL'] = {
  id = '姑苏慕容渡船#XZ-MTL',
  area = '姑苏慕容',
  name = '渡船',
  desc = { [[你从听雨居的活动机关中掉到了一艘小舟上，船上的船夫对你说：“坐稳了”，咱们这就到曼佗罗山庄去。]], [[一叶小舟，最多也就能载七、八个人。一名老船夫手持长竹篙，正在船尾吃力地撑着船。你放眼望去，湖面上的美丽景色使你浮想连篇。]], [[一叶小舟，最多也就能载七、八个人。一名六十多岁的老艄公手持长竹篙，正在船尾吃力地撑着船。]] },
  exit = {
    out = { to = '曼佗罗山庄岸边#1', unstable = true, cost = 30, handler = 'disembark', },
  },
},

['姑苏慕容小径#2E'] = {
  id = '姑苏慕容小径#2E',
  area = '姑苏慕容',
  name = '小径',
  desc =  [[一条曲曲折折用鹅卵石铺成的小径, 路两旁绿柳成阴, 一处处山石花木点缀在其中。前面就是小厅了，一位美丽的少女站在厅前，你被她的容貌所吸引，如果不是亲眼所见，不可想象世上还有这等如此美貌的少女。]],
  exit = {
    e = { to = '姑苏慕容小厅', },
    sw = { to = '姑苏慕容小径#1E', },
  },
},

['姑苏慕容小舟#SZ-YZW'] = {
  id = '姑苏慕容小舟#SZ-YZW',
  area = '姑苏慕容',
  name = '小舟',
  desc =  [[一叶小舟，最多也就能载七、八个人。一名六十多岁的老艄公手持长竹篙，正在船尾吃力地撑着船。]],
  exit = {
    out = { to = '燕子坞岸边#1', unstable = true, cost = 50, handler = 'disembark', },
  },
},

['姑苏慕容渡船#YZW-SZ'] = {
  id = '姑苏慕容渡船#YZW-SZ',
  area = '姑苏慕容',
  name = '渡船',
  desc =  [[一叶小舟，最多也就能载七、八个人。一名老艄公手持长竹篙，正在船尾吃力地撑着船。]],
  exit = {
    out = { to = '姑苏慕容湖边#3', unstable = true, cost = 50, handler = 'disembark', },
  },
},

['姑苏慕容码头'] = {
  id = '姑苏慕容码头',
  area = '姑苏慕容',
  name = '码头',
  desc =  [[这里是慕容家的家仆和丫鬟出入太湖的水上码头，只见人们来来往往，一个个风尘仆仆，码头边的老船夫见到你走过来，马上笑呵呵的迎了上去。码头边张贴着一张价格表(sign)。]],
  exit = {
    n = { to = '姑苏慕容小石桥#1', },
    hidden1 = { to = '姑苏慕容渡船#SZ-XZ', cmd = 'qu mr', no_wander = true, handler = 'mr_embark', },
    hidden2 = { to = '姑苏慕容小舟#SZ-YZW', cmd = 'qu yanziwu', no_wander = true, handler = 'mr_embark', },
  },
},

['姑苏慕容听雨居'] = {
  id = '姑苏慕容听雨居',
  area = '姑苏慕容',
  name = '听雨居',
  desc =  [[「听雨居」三面环水, 从窗中望出去, 湖上烟波尽收眼底。屋正中摆着一张大圆桌, 上面摆满了蔬果点心, 每一样都十分精致。圆桌四周放了数把椅子。墙边的小柜上放着一把「琴」。]],
  exit = {
    hidden = { to = '姑苏慕容渡船#XZ-MTL', cmd = 'tan qin', no_wander = true, },
    se = { to = '姑苏慕容小径#2W', },
  },
},

['姑苏慕容小石桥#1'] = {
  id = '姑苏慕容小石桥#1',
  area = '姑苏慕容',
  name = '小石桥',
  desc =  [[这是一座小小的白石拱桥。桥下碧绿的湖水正荡着微波。远处的湖面上传来阵阵歌声，不远处两只鸳鸯在一起戏水，岸边的柳树随着湖面上吹来的微风时不时地摇摆着。]],
  exit = {
    d = { to = '姑苏慕容地道#1', door = 'push 桥栏', cond = 'player.party == "姑苏慕容"', },
    nw = { to = '姑苏慕容湖边#3', },
    s = { to = '姑苏慕容码头', },
  },
},

['姑苏慕容地道#1'] = {
  id = '姑苏慕容地道#1',
  area = '姑苏慕容',
  name = '地道',
  desc =  [[这里是慕容世家的秘密通道，里面机关密布，异常潮湿阴暗。]],
  exit = {
    yanziwu = { to = '燕子坞听香水榭', },
    shanzhuang = { to = '曼佗罗山庄小石桥', },
    xiaodao = { to = '姑苏慕容后堂', },
    n = { to = '姑苏慕容地道#2', },
    out = { to = '姑苏慕容小石桥#1', },
  },
},

['姑苏慕容地道#2'] = {
  id = '姑苏慕容地道#2',
  area = '姑苏慕容',
  name = '地道',
  desc =  [[这里是慕容世家的地下通道，仔细看还能发现墙上有一道暗门(door)。]],
  exit = {
    e = { to = '姑苏慕容休息室', },
    w = { to = '姑苏慕容厨房#D', },
    s = { to = '姑苏慕容地道#1', },
    d = { to = '姑苏慕容地道#3', door = 'open door', cond = 'player.flag["got 姑苏慕容黑钥匙"]', },
  },
},

['姑苏慕容休息室'] = {
  id = '姑苏慕容休息室',
  area = '姑苏慕容',
  name = '休息室',
  desc =  [[这是一间休息室, 里面摆设简单, 只有几张床, 一张书桌和一把椅子。]],
  exit = {
    w = { to = '姑苏慕容地道#2', },
  },
},

['姑苏慕容厨房#D'] = {
  id = '姑苏慕容厨房#D',
  area = '姑苏慕容',
  name = '厨房',
  desc =  [[这是一间小厨房, 虽然不大, 但是锅碗瓢盆, 油盐酱醋, 到很奇全。灶台上堆满了新鲜瓜果蔬菜, 活鱼活虾, 不仅不脏不乱, 还十分干净整齐。]],
  exit = {
    e = { to = '姑苏慕容地道#2', },
  },
},

['姑苏慕容地道#3'] = {
  id = '姑苏慕容地道#3',
  area = '姑苏慕容',
  name = '地道',
  desc =  [[这里是慕容世家的地下通道，仔细看还能发现墙上有一道暗门(door)。]],
  exit = {
    n = { to = '姑苏慕容迷宫', no_wander = true, handler = 'reset_data', },
    u = { to = '姑苏慕容地道#2', door = 'open door', cond = 'player.flag["got 姑苏慕容白钥匙"]', },
  },
},

['姑苏慕容迷宫'] = {
  id = '姑苏慕容迷宫',
  area = '姑苏慕容',
  name = '迷宫',
  desc =  [[这里是姑苏慕容的地下迷宫。显然是通向一个重要的地方。四周的墙壁上挂着露水，并无任何特殊标记，你一走进来便迷失了方向。]],
  exit = {
    n = { to = '姑苏慕容迷宫', },
    s = { to = '姑苏慕容迷宫', },
    e = { to = '姑苏慕容迷宫', },
    w = { to = '姑苏慕容迷宫', },
    hidden1 = { to = '姑苏慕容库房', cost = 13, handler = 'cord', },
    hidden2 = { to = '姑苏慕容正堂', cost = 11, handler = 'cord', },
    hidden3 = { to = '姑苏慕容地道#3', cost = 20, handler = 'cord', },
  },
},

['姑苏慕容库房'] = {
  id = '姑苏慕容库房',
  area = '姑苏慕容',
  name = '库房',
  desc =  [[这里阴暗潮湿，你一到这里便闻到一股霉味，满屋的灰尘和成堆成堆的物品快堆满了整间房间。你很是奇怪为什么仆役们离开时不把这些物品也带走。]],
  exit = {
    w = { to = '姑苏慕容迷宫', handler = 'reset_data', },
  },
},

['姑苏慕容正堂'] = {
  id = '姑苏慕容正堂',
  area = '姑苏慕容',
  name = '正堂',
  desc =  [[这里是姑苏慕容的地下迷宫。显然是通向一个重要的地方。四周的墙壁上挂着露水，模糊的刻着几个小字(zi)，你一走进来便迷失了方向。]],
  exit = {
    s = { to = '姑苏慕容地道#3', },
  },
},

['姑苏慕容小厅'] = {
  id = '姑苏慕容小厅',
  area = '姑苏慕容',
  name = '小厅',
  desc =  [[你走进这间小小的厅室, 看到里面放着一张紫檀木茶几和几张湘妃竹椅子，紫檀木的茶几上摆放着茶壶和几只白玉杯，专供客人饮用。你忍不住想坐在竹椅上，让疲惫的身心得到充分的休息。]],
  exit = {
    e = { to = '姑苏慕容厢房', },
    s = { to = '姑苏慕容后堂', },
    w = { to = '姑苏慕容小径#2E', },
    n = { to = '姑苏慕容厨房#1', },
  },
},

['姑苏慕容湖边#2'] = {
  id = '姑苏慕容湖边#2',
  area = '姑苏慕容',
  name = '湖边',
  desc =  [[俗话说 : 上有天堂, 下有苏杭。这里正是大大有名的太湖。 湖面绿波上漂着一叶叶的小舟, 一阵阵悦耳的小曲儿随着湖上的轻风不时漂入你的耳中。]],
  exit = {
    w = { to = '姑苏慕容湖边#1', },
    e = { to = '姑苏慕容湖边#3', },
  },
},

['姑苏慕容后堂'] = {
  id = '姑苏慕容后堂',
  area = '姑苏慕容',
  name = '后堂',
  desc =  [[这里摆着一张小床，床头是一张女人用的梳妆台，上面放着许多胭脂粉盒。靠窗是一张长长的红木书桌，只要抬眼望去，太湖的万顷碧波，尽收眼底。]],
  exit = {
    hidden = { to = '姑苏慕容地道#1', cmd = 'zuan didao', cond = 'player.party == "姑苏慕容"', },
    n = { to = '姑苏慕容小厅', },
  },
},

['姑苏慕容小舍'] = {
  id = '姑苏慕容小舍',
  area = '姑苏慕容',
  name = '小舍',
  desc =  [[这间房舍小巧玲珑, 颇为精雅。小舍匾额上写着「琴韵」两字，笔致颇为潇洒。远处的小屋露出一檐屋角。东西两边各有一条小径不知通向哪里。]],
  exit = {
    e = { to = '姑苏慕容小径#1E', },
    w = { to = '姑苏慕容小径#1W', },
    n = { to = '姑苏慕容小岛边', },
  },
},

['姑苏慕容小径#1E'] = {
  id = '姑苏慕容小径#1E',
  area = '姑苏慕容',
  name = '小径',
  desc =  [[一条曲曲折折用鹅卵石铺成的小径, 路两旁绿柳成阴, 一处处山石花木点缀在其中。远处一座小屋子映入你的眼帘，阵阵炊烟从小屋后面的烟囱中冒出。]],
  exit = {
    ne = { to = '姑苏慕容小径#2E', },
    w = { to = '姑苏慕容小舍', },
  },
},

['姑苏慕容小舟#MTL-YZW'] = {
  id = '姑苏慕容小舟#MTL-YZW',
  area = '姑苏慕容',
  name = '小舟',
  desc =  [[一叶小舟，最多也就能载七、八个人。一名六十多岁的老艄公手持长竹篙，正在船尾吃力地撑着船。]],
  exit = {
    out = { to = '燕子坞岸边#1', unstable = true, cost = 30, handler = 'disembark', },
  },
},

['姑苏慕容小舟#MTL-XZ'] = {
  id = '姑苏慕容小舟#MTL-XZ',
  area = '姑苏慕容',
  name = '小舟',
  desc =  [[一叶小舟，最多也就能载七、八个人。一名六十多岁的老艄公手持长竹篙，正在船尾吃力地撑着船。]],
  exit = {
    out = { to = '姑苏慕容小岛边', unstable = true, cost = 30, handler = 'disembark', },
  },
},

['姑苏慕容湖边#1'] = {
  id = '姑苏慕容湖边#1',
  area = '姑苏慕容',
  name = '湖边',
  desc =  [[俗话说 : 上有天堂, 下有苏杭。这里正是大大有名的太湖。 湖面绿波上漂着一叶叶的小舟, 一阵阵悦耳的小曲儿随着湖上的轻风不时漂入你的耳中。]],
  exit = {
    w = { to = '苏州城青石大道#1', },
    e = { to = '姑苏慕容湖边#2', },
  },
},

['姑苏慕容渡船#SZ-XZ'] = {
  id = '姑苏慕容渡船#SZ-XZ',
  area = '姑苏慕容',
  name = '渡船',
  desc =  [[一叶小舟，最多也就能载七、八个人。一名六十多岁的老艄公手持长竹篙，正在船尾吃力地撑着船。]],
  exit = {
    out2 = { to = '姑苏慕容小岛边', unstable = true, handler = 'disembark', cost = 50, },
    out = { to = '姑苏慕容码头', unstable = true, handler = 'disembark', cost = 50, },
  },
},

['姑苏慕容厢房'] = {
  id = '姑苏慕容厢房',
  area = '姑苏慕容',
  name = '厢房',
  desc =  [[这是一间厢房, 里面摆设简单, 只有一张床, 一张书桌和一把椅子。]],
  exit = {
    w = { to = '姑苏慕容小厅', },
  },
},

['姑苏慕容小径#2W'] = {
  id = '姑苏慕容小径#2W',
  area = '姑苏慕容',
  name = '小径',
  desc =  [[一条曲曲折折用鹅卵石铺成的小径, 路两旁绿柳成阴, 一处处山石花木点缀在其中。你走在石地上，啪嗒啪嗒的发出清脆的响声，往西北面去是听雨居。]],
  exit = {
    nw = { to = '姑苏慕容听雨居', },
    e = { to = '姑苏慕容小径#1W', },
  },
},

['姑苏慕容小径#1W'] = {
  id = '姑苏慕容小径#1W',
  area = '姑苏慕容',
  name = '小径',
  desc =  [[一条曲曲折折用鹅卵石铺成的小径, 路两旁绿柳成阴, 一处处山石花木点缀在其中。你走在石地上，啪嗒啪嗒的发出清脆的响声，往西面去是这条小径的延伸。]],
  exit = {
    w = { to = '姑苏慕容小径#2W', },
    e = { to = '姑苏慕容小舍', },
  },
},

['姑苏慕容渡船#YZW-MTL'] = {
  id = '姑苏慕容渡船#YZW-MTL',
  area = '姑苏慕容',
  name = '渡船',
  desc =  [[一叶小舟，最多也就能载七、八个人。一名老艄公手持长竹篙，正在船尾吃力地撑着船。]],
  exit = {
    out = { to = '曼佗罗山庄岸边#2', unstable = true, cost = 50, handler = 'disembark', },
  },
},

['姑苏慕容小岛边'] = {
  id = '姑苏慕容小岛边',
  area = '姑苏慕容',
  name = '小岛边',
  desc =  [[你一跨上岸去, 见疏疏落落四五座房舍, 建造在一个不知名的小岛或半岛上。岛上树木葱绿，亭宇轩榭错落有秩，处处飘来一阵幽香。这里的一切无一不透出江南水秀山清，建筑小巧别致的特色。一位老艄公左在岸边(bian)。]],
  exit = {
    s = { to = '姑苏慕容小舍', },
    enter = { to = '姑苏慕容渡船#SZ-XZ', unstable = true, no_wander = true, handler = 'embark', },
  },
},

['姑苏慕容湖边#3'] = {
  id = '姑苏慕容湖边#3',
  area = '姑苏慕容',
  name = '湖边',
  desc =  [[俗话说 : 上有天堂, 下有苏杭。这里正是大大有名的太湖。 湖面绿波上漂着一叶叶的小舟, 一阵阵悦耳的小曲儿随着湖上的轻风不时漂入你的耳中。]],
  exit = {
    w = { to = '姑苏慕容湖边#2', },
    se = { to = '姑苏慕容小石桥#1', },
  },
},

['姑苏慕容厨房#1'] = {
  id = '姑苏慕容厨房#1',
  area = '姑苏慕容',
  name = '厨房',
  desc =  [[这是一间小厨房, 虽然不大, 但是锅碗瓢盆, 油盐酱醋, 到很奇全。灶台上堆满了新鲜瓜果蔬菜, 活鱼活虾, 不仅不脏不乱, 还十分干净整齐。]],
  exit = {
    s = { to = '姑苏慕容小厅', },
  },
},

['福州城西巷#2N'] = {
  id = '福州城西巷#2N',
  area = '福州城',
  name = '西巷',
  desc =  [[这里是福州城西大街旁边的一条小巷，巷子里的路很宽，看起来好象比西街窄不了多少，两边开有一些小铺子。东面有一家杂货铺，专卖一些女人家用的东西，很少有男人去那里。]],
  exit = {
    e = { to = '福州城杂货铺', },
    w = { to = '福州城民宅', },
    s = { to = '福州城西巷#1N', },
  },
},

['福州城当铺'] = {
  id = '福州城当铺',
  area = '福州城',
  name = '当铺',
  desc =  [[这是一家素以买卖公平著称的老字号当铺，一个四尺高的柜台摆在你的面前，柜台上摆着一个牌子(paizi)， 柜台后坐着当铺的老板，一双鬼溜溜的眼睛上上下下打量着你。]],
  exit = {
    s = { to = '福州城西街#1', },
  },
},

['福州城西巷#1N'] = {
  id = '福州城西巷#1N',
  area = '福州城',
  name = '西巷',
  desc =  [[这里是福州城西大街旁边的一条小巷，巷子里的路很宽，看起来好象比西街窄不了多少，两边开有一些小铺子。北面巷子里隐隐传来吆喝声。这里的居民看起来要比城东富裕，路上走着的女人们都打扮的花枝招展。]],
  exit = {
    s = { to = '福州城西街#2', },
    w = { to = '福州城药铺', },
    n = { to = '福州城西巷#2N', },
  },
},

['福州城西巷#1S'] = {
  id = '福州城西巷#1S',
  area = '福州城',
  name = '西巷',
  desc =  [[这里是福州城西大街旁边的一条小巷，巷子里的路很宽，看起来好象比西街窄不了多少，两边开有一些小铺子。西面铺子隐隐传来一阵花香。不时有几个年轻的姑娘进了西面铺子的门。南面好象还有几家铺子很热闹。]],
  exit = {
    s = { to = '福州城西巷#2S', },
    w = { to = '福州城花店', },
    n = { to = '福州城西街#2', },
  },
},

['福州城山路#3N'] = {
  id = '福州城山路#3N',
  area = '福州城',
  name = '山路',
  desc =  [[你走在一条山路上。时值春日，路旁的山坡上开满了金黄色的油菜花。向西南则进入福建武夷山区。东北面可直达宁波城。]],
  exit = {
    ne = { to = '福州城山路#4N', },
    sw = { to = '福州城山路#2N', },
    se = { to = '莆田少林山路#1', },
  },
},

['福州城镖局正厅'] = {
  id = '福州城镖局正厅',
  area = '福州城',
  name = '镖局正厅',
  desc =  [[这里是福威镖局的正厅，几只太师椅一字排开，正中央坐着总镖头，手持烟袋杆正在闭目沉思。墙上挂着几幅字画和一把宝剑。]],
  exit = {
    n = { to = '福州城福威镖局', },
  },
},

['福州城西街#2'] = {
  id = '福州城西街#2',
  area = '福州城',
  name = '西街',
  desc =  [[这里是福州的西大街，北面有一所破败的宅子。南面有一家杂货铺，专卖一些女人家用的东西，很少有男人去那里。西南面可以看见一个大院套，一杆大旗高高飘扬，那里是福威镖局的所在。]],
  exit = {
    e = { to = '福州城西街#1', },
    s = { to = '福州城西巷#1S', },
    w = { to = '福州城西门', },
    n = { to = '福州城西巷#1N', },
  },
},

['福州城山路#2W'] = {
  id = '福州城山路#2W',
  area = '福州城',
  name = '山路',
  desc =  [[这是武夷山脉的一条山路。时值春日，路旁的山坡上到处开满了金黄色的油菜花。一阵阵山风吹来，空气里弥漫着油菜花的香味。由此向西南方向可进入两广，往东北可到福州。]],
  exit = {
    ne = { to = '福州城小路', },
    sw = { to = '福州城山路#3W', },
  },
},

['福州城南门吊桥'] = {
  id = '福州城南门吊桥',
  area = '福州城',
  name = '南门吊桥',
  desc = { [[这是福州南面的一座吊桥，从傍着晋江而建的城楼大门上以两个滑轮维系。日出放下吊，日落绞起。过了桥向西南走可达岭南广东。现在行人还多，来来往往异常繁忙。]], [[这里是福州的南门，往西南方向可以通往佛山镇，可惜近日劫匪四起，民不聊生，故现在福州城外的吊桥已经放下，来往的过路人只能等到次日才能进入城池。]] },
  exit = {
    s = { to = '佛山镇林间道#6E', },
    n = { to = '福州城南门', unstable = true, cond = 'time.get_current_hour() >= 0 and time.get_current_hour() < 18', },
  },
},

['福州城南门'] = {
  id = '福州城南门',
  area = '福州城',
  name = '南门',
  desc = { [[这里是福州的南门，往西南方向可以通往佛山镇，可惜近日劫匪四起，民不聊生，故现在夜晚时把吊桥放下，不准任何人等出入。]], [[这里是福州的南门，往西南方向可以通往佛山镇，可惜近日劫匪四起，民不聊生，故夜晚的吊桥放下，不准任何人等出入。现在行人还多，来来往往异常繁忙。]] },
  exit = {
    s = { to = '福州城南门吊桥', unstable = true, cond = 'time.get_current_hour() >= 0 and time.get_current_hour() < 18', },
    n = { to = '福州城南街', },
  },
},

['福州城渔船#4'] = {
  id = '福州城渔船#4',
  area = '福州城',
  name = '渔船',
  desc =  [[渔船都连在一齐，而且都几乎是一模一样的，看得你头晕眼花。忽然一个暗浪涌来，你一个不稳，‘啊。。。’，你几乎掉下了海去。]],
  exit = {
    e = { to = '福州城渔船#5', },
    w = { to = '福州城渔船#3', },
    s = { to = '福州城渔船#4', },
    n = { to = '福州城渔船#4', },
  },
},

['福州城船舱'] = {
  id = '福州城船舱',
  area = '福州城',
  name = '船舱',
  desc =  [[这里是一间船舱，四周的窗都关得严严实实，舱中只点了一盏油灯。你依稀看到地上满是鱼骨，鱼腥味与霉味混在一起，味道极是难闻。船舱正中的桌旁围坐着几个老乞丐，似乎正商量着什么，看他们背上的布袋数量，明显是丐帮中很有地位的人物。这里是丐帮设在福州的大信分舵。]],
  exit = {
    out = { to = '福州城渔船#5', },
  },
},

['福州城向阳老宅'] = {
  id = '福州城向阳老宅',
  area = '福州城',
  name = '向阳老宅',
  desc =  [[这里是一间破败的老宅院，平常没有什么人会来这里。地上横七竖八地堆着几件家具。西边的墙角结着一张蜘蛛网，屋里到处是尘土，显然是已经很久没有人住了。房间的尽头有一扇门(men)，但已被坍塌的砖瓦挡住了。]],
  exit = {
    w = { to = '福州城向阳巷#2', },
  },
},

['福州城福威镖局'] = {
  id = '福州城福威镖局',
  area = '福州城',
  name = '福威镖局',
  desc =  [[你来到一座结构宏伟的建筑前，左右石坛上各插着一根两丈多高的旗杆，杆上青旗飘扬。右首旗子用金线绣着一头张牙舞爪的狮子，狮子上头有一只蝙蝠飞翔。左首旗子上写着“福威镖局”四个黑字，银钩铁划，刚劲非凡。入口处排着两条长凳，几名镖头坐着把守。少镖头正跟他们说笑。]],
  exit = {
    e = { to = '福州城镖局帐房', },
    s = { to = '福州城镖局正厅', },
    n = { to = '福州城西街#1', },
  },
},

['福州城渔船#1'] = {
  id = '福州城渔船#1',
  area = '福州城',
  name = '渔船',
  desc =  [[渔船都连在一齐，而且都几乎是一模一样的，看得你头晕眼花。忽然一个暗浪涌来，你一个不稳，‘啊。。。’，你几乎掉下了海去。]],
  exit = {
    s = { to = '福州城渔船#1', },
    out = { to = '福州城渔港码头', },
    e = { to = '福州城渔船#2', },
    w = { to = '福州城渔船#1', },
    n = { to = '福州城渔船#1', },
  },
},

['福州城北门'] = {
  id = '福州城北门',
  area = '福州城',
  name = '北门',
  desc =  [[这里是福建首府福州的北门。入此门向南可到福州府、往佛山镇，出此门向北可抵江浙一带。城门的墙上张贴着一纸告示(gaoshi)。]],
  exit = {
    s = { to = '福州城北街', },
    n = { to = '福州城武夷山路', },
  },
},

['福州城山路#4W'] = {
  id = '福州城山路#4W',
  area = '福州城',
  name = '山路',
  desc =  [[这是武夷山脉的一条山路。时值春日，路旁的山坡上到处开满了金黄色的油菜花。一阵阵山风吹来，空气里弥漫着油菜花的香味。由此向西南方向可进入两广，往东北可到福州。]],
  exit = {
    e = { to = '福州城山路#3W', },
    sw = { to = '福州城山路#5W', },
  },
},

['福州城向阳巷#1'] = {
  id = '福州城向阳巷#1',
  area = '福州城',
  name = '向阳巷',
  desc =  [[这是一条小巷，没有什么行人，巷口有几个穷汉在晒太阳。附近的居民不多，大多是没有什么钱的穷人在这里住。前一阵子海港上来了一群乞丐，在那里成立了丐帮的福州分舵，所以附近的乞丐好象也比以前多了起来。北面是一座白色小桥，东面是一个荒废的宅院。立在门口的石碑已经破损，仔细看可以看见上面刻有“费园”两个字。人们都把这个宅院叫做废园。]],
  exit = {
    e = { to = '福州城废园', },
    s = { to = '福州城向阳巷#2', },
    n = { to = '福州城石桥', },
  },
},

['福州城小路'] = {
  id = '福州城小路',
  area = '福州城',
  name = '小路',
  desc =  [[这是西门外的一条小路。时值春日，路旁的山坡上到处开满了金黄色的油菜花。一阵阵山风吹来，空气里弥漫着油菜花的香味。由这里向北则进入福建武夷山区。路边有个小酒馆，酒馆门前的空地上有几匹马在吃草。]],
  exit = {
    se = { to = '福州城山路#1W', },
    sw = { to = '福州城山路#2W', },
    w = { to = '福州城小酒馆', },
    n = { to = '福州城山坡', },
  },
},

['福州城渔船#3'] = {
  id = '福州城渔船#3',
  area = '福州城',
  name = '渔船',
  desc =  [[渔船都连在一齐，而且都几乎是一模一样的，看得你头晕眼花。忽然一个暗浪涌来，你一个不稳，‘啊。。。’，你几乎掉下了海去。]],
  exit = {
    e = { to = '福州城渔船#4', },
    w = { to = '福州城渔船#2', },
    s = { to = '福州城渔船#3', },
    n = { to = '福州城渔船#3', },
  },
},

['福州城渔港码头'] = {
  id = '福州城渔港码头',
  area = '福州城',
  name = '渔港码头',
  desc =  [[这是福州的一个渔港，岸边停满了渔船。渔夫们正挑着大担大担的鱼走着，箩里的鱼还在鲜蹦活跳。不远处有十几个乞丐正挨在船边晒太阳，看神情很是自在。其中有几个叫化子身上还别着两三个布口袋。]],
  exit = {
    enter = { to = '福州城渔船#1', },
    s = { to = '福州城渔船#1', },
    w = { to = '福州城海港', },
  },
},

['福州城药铺'] = {
  id = '福州城药铺',
  area = '福州城',
  name = '药铺',
  desc =  [[这是一间药铺，正对着门的是一个高高的柜台，柜台后面靠墙有好几个高大的木头柜子，上面开了很多小抽屉，抽屉上还写着很多小字，有的已经模糊不清。店里弥漫着一股浓烈的中草药味道。一个面色和蔼的老头正坐在旁边的椅子上闭目养神。]],
  exit = {
    e = { to = '福州城西巷#1N', },
  },
},

['福州城山路#1W'] = {
  id = '福州城山路#1W',
  area = '福州城',
  name = '山路',
  desc = { [[这是西门外的一条山路。时值春日，路旁的山坡上到处开满了金黄色的油菜花。一阵阵山风吹来，空气里弥漫着油菜花的香味。由这里向北则进入福建武夷山区。西北方向有条小路。]], [[这是福州城西门外的一条山路。由于是晚上，现在城门已经关了，所以来往的过路人只能等到天亮才能进城了。由此向北则进入福建武夷山区。西北方向还有条小路。]] },
  exit = {
    nw = { to = '福州城小路', },
    e = { to = '福州城西门', unstable = true, cond = 'time.get_current_hour() >= 0 and time.get_current_hour() < 18', },
  },
},

['福州城花店'] = {
  id = '福州城花店',
  area = '福州城',
  name = '花店',
  desc =  [[这是福州城西大大有名的一家花店，店里摆放着各种各样的鲜花，空气里弥散着醉人的花香。人一走进来，就会不由自主的陶醉了。这里的鲜花品种很全，来自全国各地的都有。美丽的卖花姑娘手拿剪子正在修剪花枝。]],
  exit = {
    e = { to = '福州城西巷#1S', },
  },
},

['福州城小酒馆'] = {
  id = '福州城小酒馆',
  area = '福州城',
  name = '小酒馆',
  desc =  [[这是一家路边小酒馆，以卖酒为主，捎带一些零食。因为路上过往的客人不是很多，所以生意也很清淡。偶尔会有些到附近郊游的城里人光顾，这里才热闹起来。一个老头正在檫桌子。]],
  exit = {
    e = { to = '福州城小路', },
  },
},

['福州城西街#1'] = {
  id = '福州城西街#1',
  area = '福州城',
  name = '西街',
  desc =  [[这里是福州的西大街，街面可以算的上很热闹，街道上往来着形形色色的男女老少，其中不乏身背兵器的江湖豪客。北面看起来象是一个当铺，门面不是很大，街南面有两扇高高的大门，门里是一座很大的宅院，抬头可以看见门上的四个大字：“福威镖局”。]],
  exit = {
    e = { to = '福州城城中心', },
    s = { to = '福州城福威镖局', },
    w = { to = '福州城西街#2', },
    n = { to = '福州城当铺', },
  },
},

['福州城西巷#2S'] = {
  id = '福州城西巷#2S',
  area = '福州城',
  name = '西巷',
  desc =  [[这里是福州城西大街旁边的一条小巷，巷子里的路很宽，看起来好象比西街窄不了多少，两边开有一些小铺子。西面是家茶馆，因为福建的茶叶很有名气，所以除了本地人，来这里品茶的外乡客也不少。南面是家客栈，门口高高挂有一幅烫金牌匾，上写着“吉祥客栈”四个大字。]],
  exit = {
    s = { to = '福州城吉祥客栈', },
    w = { to = '福州城茶楼', },
    n = { to = '福州城西巷#1S', },
  },
},

['福州城东街'] = {
  id = '福州城东街',
  area = '福州城',
  name = '东街',
  desc =  [[这里是福州的东街，街面上很多人往来，其中有拿着鱼网的，还有带着扁担的，看来是往东面的渔港去。街北面一排古旧的门窗，门边上挂有一个画着元宝的幌子，看起来象是一座钱庄。南面隐约可以看见一座小桥，几个小孩在桥边玩耍。]],
  exit = {
    e = { to = '福州城海港', },
    s = { to = '福州城石桥', },
    w = { to = '福州城城中心', },
    n = { to = '福州城东巷#1', },
  },
},

['福州城渔船#5'] = {
  id = '福州城渔船#5',
  area = '福州城',
  name = '渔船',
  desc =  [[突然你眼前一亮，你来到了一艘大船上，甲板上躺着几个乞丐，一边在捉虱子， 一边用警惕的双眼不停地打量着你。正中有一个舱门，里面黑乎乎的，你什么也瞧不见。]],
  exit = {
    enter = { to = '福州城船舱', },
    s = { to = '福州城渔船#5', },
    e = { to = '福州城渔船#2', },
    w = { to = '福州城渔船#4', },
    n = { to = '福州城渔船#5', },
  },
},

['福州城向阳巷#2'] = {
  id = '福州城向阳巷#2',
  area = '福州城',
  name = '向阳巷',
  desc =  [[这是一条小巷，因为两边的房子大多已经荒废，所以平常这里没有什么人来。远远的可以看见巷口有几个穷汉躺在那晒太阳。巷子东面是一座废弃的老宅院，院子里长了很高的蒿草。]],
  exit = {
    e = { to = '福州城向阳老宅', },
    n = { to = '福州城向阳巷#1', },
  },
},

['福州城东巷#2'] = {
  id = '福州城东巷#2',
  area = '福州城',
  name = '东巷',
  desc =  [[这里是福州城城东的一条小巷，人们都把它叫做“东巷”。巷子两边都是有钱人家的宅院。往来的人不是骑马就是坐轿，穷人们很少到这里来。巷子东面有一排古旧的门窗，其中一个门边上挂有一个画着元宝的幌子，看起来象是一家钱庄。]],
  exit = {
    e = { to = '福州城通宝斋', },
    s = { to = '福州城东巷#1', },
  },
},

['福州城茶楼'] = {
  id = '福州城茶楼',
  area = '福州城',
  name = '茶楼',
  desc =  [[这是福州西巷的一家茶楼。只见屋内几张长条桌排开，旁边凳子上坐满了茶客，或高声谈笑，或交头接耳，来自各地的口音混杂在一起，听起来熙熙攘攘很是热闹。室内飘散着一股淡淡的茶香，闻着格外舒服。]],
  exit = {
    u = { to = '福州城茶楼二楼', },
    e = { to = '福州城西巷#2S', },
  },
},

['福州城西门'] = {
  id = '福州城西门',
  area = '福州城',
  name = '西门',
  desc = {[[这里是福州府的西门，城墙不是很高，有一座中等规模的城门。出此门向西北可往湘赣，进而入川；西南可达两广，直抵云贵；因此出入往来的客商一向很多。城门旁边的城墙上张贴着一纸告示(gaoshi)。]], [[这里是福州府的西门，城墙不是很高，有一座中等规模的城门。出此门向西北可往湘赣，进而入川；西南可达两广，直抵云贵；因此出入往来的客商一向很多。因为现在是夜晚，城门已经关了，所以暂时无法出城。城门旁边的城墙上张贴着一纸告示(gaoshi)。]]},
  exit = {
    w = { to = '福州城山路#1W', unstable = true, cond = 'time.get_current_hour() >= 0 and time.get_current_hour() < 18', },
    e = { to = '福州城西街#2', },
  },
},

['福州城杂货铺'] = {
  id = '福州城杂货铺',
  area = '福州城',
  name = '杂货铺',
  desc =  [[这是一家专卖女人用品的小铺。铺子虽然很小，但是很受附近的居民的欢迎。靠南边有一个不大的柜台，北边门后的位置站着一位老婆婆。几个裹着头巾的妇女正在柜台前挑选东西。    门前立了个牌子(sign)。]],
  exit = {
    w = { to = '福州城西巷#2N', },
  },
},

['福州城山路#4N'] = {
  id = '福州城山路#4N',
  area = '福州城',
  name = '山路',
  desc =  [[你走在一条山路上。时值春日，路旁的山坡上开满了金黄色的油菜花。向西南则进入福建武夷山区。东北面可直达宁波城。]],
  exit = {
    ne = { to = '宁波城天童禅寺', },
    sw = { to = '福州城山路#3N', },
  },
},

['福州城城中心'] = {
  id = '福州城城中心',
  area = '福州城',
  name = '城中心',
  desc =  [[这里是福州城的城中心，人来人往，很是热闹。因为是东南地区最大的一个海港城市，所以往来的行人中形形色色、熙熙攘攘。其中也有很多挑着担子拿着渔网的渔夫、船家，人们走路的姿势都很悠闲，看起来一付与世无争的样子。东面的方向是一条石板街道，不断有渔人往来，看来那里就是渔港了。东南方向隐约有一条小巷。]],
  exit = {
    e = { to = '福州城东街', },
    s = { to = '福州城南街', },
    w = { to = '福州城西街#1', },
    n = { to = '福州城北街', },
  },
},

['福州城客栈二楼'] = {
  id = '福州城客栈二楼',
  area = '福州城',
  name = '客栈二楼',
  desc =  [[这是一间很大的客房，陈设十分简陋。靠墙放了十几张小木床，不少客人正和衣而卧，满屋子都是呼呼的打酣声。西边有张床是空的，你蹑手蹑脚地走了过去。]],
  exit = {
    d = { to = '福州城吉祥客栈', },
  },
},

['福州城山路#8W'] = {
  id = '福州城山路#8W',
  area = '福州城',
  name = '山路',
  desc =  [[这是武夷山脉的一条山路。时值春日，路旁的山坡上到处开满了金黄色的油菜花。一阵阵山风吹来，空气里弥漫着油菜花的香味。由此向西南方向可进入两广，往东北可到福州。]],
  exit = {
    ne = { to = '福州城山路#7W', },
    w = { to = '福州城山路#9W', },
  },
},

['福州城山路#1N'] = {
  id = '福州城山路#1N',
  area = '福州城',
  name = '山路',
  desc =  [[你走在一条山路上。时值春日，路旁的山坡上开满了金黄色的油菜花。向南则进入福建武夷山区。]],
  exit = {
    s = { to = '福州城武夷山路', },
    n = { to = '福州城山路#2N', },
  },
},

['福州城茶楼二楼'] = {
  id = '福州城茶楼二楼',
  area = '福州城',
  name = '茶楼二楼',
  desc =  [[这是茶楼的二楼，屋内摆着几排长条桌，旁边凳子上坐了几位茶客，或高声谈笑，或交头接耳，来自各地的口音混杂在一起，听起来很是热闹。室内飘散着一股淡淡的茶香。靠窗户的位置有张桌，后面坐了位说书先生。]],
  exit = {
    d = { to = '福州城茶楼', },
  },
},

['福州城南街'] = {
  id = '福州城南街',
  area = '福州城',
  name = '南街',
  desc =  [[这里是福州的南街，街面人不是很多，偶尔有几个好象江湖豪客打扮的人骑马从北向南疾驰而去。由此南行就是福州城的南门。]],
  exit = {
    s = { to = '福州城南门', },
    n = { to = '福州城城中心', },
  },
},

['福州城山坡'] = {
  id = '福州城山坡',
  area = '福州城',
  name = '山坡',
  desc =  [[这是武夷山南麓的一个山坡，坡上密密麻麻得长着高高矮矮的树木，林间的草丛里不时跑过一两只野兔。看来这里的打猎的好地方。坡下的空地上到处开满了金黄色的油菜花。一阵阵山风吹来，空气里弥漫着油菜花的香味。西南方向隐约可以看见一个酒招子。]],
  exit = {
    s = { to = '福州城小路', },
  },
},

['福州城北街'] = {
  id = '福州城北街',
  area = '福州城',
  name = '北街',
  desc =  [[这里是福州的北街，街面人不是很多，偶尔有几个好象江湖豪客打扮的人骑马从南向北疾驰而去。]],
  exit = {
    s = { to = '福州城城中心', },
    n = { to = '福州城北门', },
  },
},

['福州城东巷#1'] = {
  id = '福州城东巷#1',
  area = '福州城',
  name = '东巷',
  desc =  [[这里是福州城城东的一条小巷，人们都把它叫做“东巷”。巷子两边都是有钱人家的宅院。往来的人不是骑马就是坐轿，穷人们很少到这里来。南面的方向是热闹的东大街，北面巷子里好象有几家店铺。]],
  exit = {
    e = { to = '福州城酒馆', },
    s = { to = '福州城东街', },
    n = { to = '福州城东巷#2', },
  },
},

['福州城酒馆'] = {
  id = '福州城酒馆',
  area = '福州城',
  name = '酒馆',
  desc =  [[这是一家小酒馆，只卖一些简单的饭食，捎带卖酒。往来的客人大多都不是很挑剔，所以店里的生意还过的去。这里的老板整天不露面，有人传说他是一个退隐的江洋大盗。平日里只有一位年轻的跑堂忙碌着。]],
  exit = {
    w = { to = '福州城东巷#1', },
  },
},

['福州城通宝斋'] = {
  id = '福州城通宝斋',
  area = '福州城',
  name = '通宝斋',
  desc =  [[这是福州的一家钱庄，是有几百年历史的中原钱庄联盟的西南分店。它们联合发行的银票信誉非常好，通行全国。这里由于地处城东，所以平常往来的人不是很多。]],
  exit = {
    w = { to = '福州城东巷#2', },
  },
},

['福州城废园'] = {
  id = '福州城废园',
  area = '福州城',
  name = '废园',
  desc =  [[这是一座荒废的宅院，以前大概是哪个大富人家的一个花园，可惜现在已经破败了。园子很大很空旷，长了许多高高的荒草。四周的土墙已经有很多处破损和坍塌，一只不知哪里跑来的野猫，在墙根追着一只老鼠。]],
  exit = {
    w = { to = '福州城向阳巷#1', },
  },
},

['福州城山路#3W'] = {
  id = '福州城山路#3W',
  area = '福州城',
  name = '山路',
  desc =  [[这是武夷山脉的一条山路。时值春日，路旁的山坡上到处开满了金黄色的油菜花。一阵阵山风吹来，空气里弥漫着油菜花的香味。由此向西南方向可进入两广，往东北可到福州。]],
  exit = {
    ne = { to = '福州城山路#2W', },
    w = { to = '福州城山路#4W', },
  },
},

['福州城山路#5W'] = {
  id = '福州城山路#5W',
  area = '福州城',
  name = '山路',
  desc =  [[这是武夷山脉的一条山路。时值春日，路旁的山坡上到处开满了金黄色的油菜花。一阵阵山风吹来，空气里弥漫着油菜花的香味。由此向西南方向可进入两广，往东北可到福州。]],
  exit = {
    ne = { to = '福州城山路#4W', },
    sw = { to = '福州城山路#6W', },
  },
},

['福州城海港'] = {
  id = '福州城海港',
  area = '福州城',
  name = '海港',
  desc =  [[这里是从福州出海的必经之地，港口上停着很多各式各样船只，往东边望去，隐约可以看见一个更大的渔港。东边的方向不断传来一阵阵嘈杂声。天空中偶尔还能看见一两只海鸥的身影。向东南方望去，可以看见离这里不远处有一个小岛，距离岸边很近，看起来可以游(swim)过去。]],
  exit = {
    e = { to = '福州城渔港码头', },
    w = { to = '福州城东街', },
    hidden = { to = '福州城小岛', cmd = 'swim', },
  },
},

['福州城小岛'] = {
  id = '福州城小岛',
  area = '福州城',
  name = '小岛',
  desc =  [[这是一个离大陆不远的小岛。隔着中间浅浅的海峡，可以望见对面大陆上的渔港。脚下软软的沙滩上布满了美丽的贝壳，一些小鱼小虾，在岸边的海水里自由自在地游来游去。海水一遍一遍涌过来，打湿了你的鞋子。]],
  exit = {
    s = { to = '福州城沙滩#1', ignore = true, },
    s2 = { to = '福州城小岛', ignore = true, },
    e = { to = '福州城沙滩#1', ignore = true, },
    e2 = { to = '福州城小岛', ignore = true, },
    w = { to = '福州城沙滩#1', ignore = true, },
    w2 = { to = '福州城小岛', ignore = true, },
    n = { to = '福州城沙滩#2', },
    hidden1 = { to = '福州城海港', cmd = 'swim', },
    hidden2 = { to = '福州城沙滩#1', handler = 'look_around', },
  },
},

['福州城沙滩#1'] = {
  id = '福州城沙滩#1',
  area = '福州城',
  name = '沙滩',
  desc =  [[这是小岛上一片美丽的沙滩，西北方向可以望见福州的港口，看起来离得很近，似乎游(swim)也游得回去。岸边沙滩上布满了贝壳，还有不少螃蟹在岩石的洞里吐着泡沫。前面处不远是块大岩石，旁边搭有一个小木棚。]],
  exit = {
    s = { to = '福州城沙滩#1', ignore = true, },
    s2 = { to = '福州城小岛', ignore = true, },
    e = { to = '福州城沙滩#1', ignore = true, },
    e2 = { to = '福州城小岛', ignore = true, },
    n = { to = '福州城沙滩#1', ignore = true, },
    n2 = { to = '福州城小岛', ignore = true, },
    hidden = { to = '福州城渔港码头', cmd = 'swim', },
    w = { to = '福州城小岛', },
  },
},

['福州城沙滩#2'] = {
  id = '福州城沙滩#2',
  area = '福州城',
  name = '沙滩',
  desc =  [[这是一大片沙滩。周围布满了贝壳，不少螃蟹在洞里冒着泡沫。暖暖的阳光撒在身上，晒得你浑身懒洋洋的。蓝蓝的海水一遍遍漫过来，冲刷着你脚下的小石子。远处有几块大礁石，立在那里经受着波涛的冲击。]],
  exit = {
    e = { to = '福州城小岛', },
    w = { to = '福州城沙滩#3', },
    n = { to = '福州城巨岩', },
  },
},

['福州城沙滩#3'] = {
  id = '福州城沙滩#3',
  area = '福州城',
  name = '沙滩',
  desc =  [[这是一大片沙滩。周围布满了贝壳，不少螃蟹在洞里冒着泡沫。暖暖的阳光撒在身上，晒得你浑身懒洋洋的。蓝蓝的海水一遍遍漫过来，冲刷着你脚下的小石子。远处有几块大礁石，立在那里经受着波涛的冲击。]],
  exit = {
    e = { to = '福州城沙滩#2', },
    w = { to = '福州城小岛', },
    s = { to = '福州城沙滩#4', },
  },
},

['福州城沙滩#4'] = {
  id = '福州城沙滩#4',
  area = '福州城',
  name = '沙滩',
  desc =  [[这是一大片沙滩。周围布满了贝壳，不少螃蟹在洞里冒着泡沫。暖暖的阳光撒在身上，晒得你浑身懒洋洋的。蓝蓝的海水一遍遍漫过来，冲刷着你脚下的小石子。远处有几块大礁石，立在那里经受着波涛的冲击。]],
  exit = {
    eu = { to = '福州城礁石', },
    n = { to = '福州城沙滩#3', },
  },
},

['福州城礁石'] = {
  id = '福州城礁石',
  area = '福州城',
  name = '礁石',
  desc =  [[这是岸边向海里突出的一块大礁石。上面大且平整，估计最少可以坐的下二三十人。淡蓝的海水一次次冲过来，发出和谐的拍打声。几只不知名的海鸟或盘旋在上空，或扑打着翅膀落在附近的礁石上。一丝淡淡的云彩轻描淡写的抹在远处的天空中，仿佛一幅水墨画。偶尔有几只嘴里叼着小鱼的水鸟从海水里钻出来，落在你身边的礁石上。]],
  exit = {
    wd = { to = '福州城沙滩#4', },
  },
},

['福州城巨岩'] = {
  id = '福州城巨岩',
  area = '福州城',
  name = '巨岩',
  desc =  [[一块光秃秃的大岩石，四周长满了青苔。只有正中处凹了下去，似乎给什么敲过。你走过去仔细一看，好象里面印着不少掌印似的。站在岩石上，极目四望，远处点点灯火，好一个渔港夜灯。]],
  exit = {
    s = { to = '福州城沙滩#2', },
    enter = { to = '福州城小木棚', },
  },
},

['福州城小木棚'] = {
  id = '福州城小木棚',
  area = '福州城',
  name = '小木棚',
  desc =  [[这是一个当初用岛上的树木临时搭起来的小木棚，年代久远的已经没人知道是什么时候什么人在这里建的了。木棚虽然很破旧，但是由于它是岛上唯一可以避雨的地方，所以偶尔还有人光顾。角落里堆着一些杂物，几个酒坛散放那里。]],
  exit = {
    out = { to = '福州城巨岩', },
  },
},

['福州城山路#2N'] = {
  id = '福州城山路#2N',
  area = '福州城',
  name = '山路',
  desc =  [[你走在一条山路上。时值春日，路旁的山坡上开满了金黄色的油菜花。向南则进入福建武夷山区。]],
  exit = {
    ne = { to = '福州城山路#3N', },
    s = { to = '福州城山路#1N', },
  },
},

['福州城山路#6W'] = {
  id = '福州城山路#6W',
  area = '福州城',
  name = '山路',
  desc =  [[这是武夷山脉的一条山路。时值春日，路旁的山坡上到处开满了金黄色的油菜花。一阵阵山风吹来，空气里弥漫着油菜花的香味。由此向西南方向可进入两广，往东北可到福州。]],
  exit = {
    ne = { to = '福州城山路#5W', },
    sw = { to = '福州城山路#7W', },
  },
},

['福州城山路#7W'] = {
  id = '福州城山路#7W',
  area = '福州城',
  name = '山路',
  desc =  [[这是武夷山脉的一条山路。时值春日，路旁的山坡上到处开满了金黄色的油菜花。一阵阵山风吹来，空气里弥漫着油菜花的香味。由此向西南方向可进入两广，往东北可到福州。]],
  exit = {
    ne = { to = '福州城山路#6W', },
    sw = { to = '福州城山路#8W', },
  },
},

['福州城镖局帐房'] = {
  id = '福州城镖局帐房',
  area = '福州城',
  name = '镖局帐房',
  desc =  [[这是福威镖局的帐房，屋子正中有一张八仙桌。桌子上放着一个看起来很古旧的算盘。墙边摆了几把椅子。]],
  exit = {
    w = { to = '福州城福威镖局', },
  },
},

['福州城石桥'] = {
  id = '福州城石桥',
  area = '福州城',
  name = '石桥',
  desc =  [[这是一座白石堆砌成的小桥，桥下流着一汪弯弯的流水。从这里往桥北方向走，过桥就是东大街了。站在桥头往南边望，可以远远望见一条小巷。巷口立有一块石碑，上写着“向阳巷”三个小字。]],
  exit = {
    s = { to = '福州城向阳巷#1', },
    n = { to = '福州城东街', },
  },
},

['福州城民宅'] = {
  id = '福州城民宅',
  area = '福州城',
  name = '民宅',
  desc =  [[这是一间民宅，正中的墙上有幅画，画的是一个寿星老人。画两旁有幅对联，上写着：“福如东海长流水，寿比南山不老松。”下面是一张八仙桌，两把太师椅，看起来主人刚刚出去不久，桌子上的茶还是温的。]],
  exit = {
    e = { to = '福州城西巷#2N', },
  },
},

['福州城吉祥客栈'] = {
  id = '福州城吉祥客栈',
  area = '福州城',
  name = '吉祥客栈',
  desc =  [[这里是福州城内最大的吉祥客栈，店内的生意看起来很红火。很多南北往来的客人在这里投宿。客栈门口旁边的拴马桩上拴着几匹马，一个年纪不大的店小二正在招呼客人。见你走了过来，店小二急忙迎上来打着招呼。客栈南面的墙上挂有一块牌子(paizi)。]],
  exit = {
    u = { to = '福州城客栈二楼', no_wander = true, },
    n = { to = '福州城西巷#2S', },
  },
},

['福州城山路#9W'] = {
  id = '福州城山路#9W',
  area = '福州城',
  name = '山路',
  desc =  [[这是武夷山脉的一条山路。时值春日，路旁的山坡上到处开满了金黄色的油菜花。一阵阵山风吹来，空气里弥漫着油菜花的香味。由此向西南方向可进入两广，往东北可到福州。]],
  exit = {
    e = { to = '福州城山路#8W', },
    s = { to = '佛山镇小路#3', },
  },
},

['福州城武夷山路'] = {
  id = '福州城武夷山路',
  area = '福州城',
  name = '武夷山路',
  desc =  [[你走在东南第一山脉武夷山上。海风从东面吹来，带着几分寒意。南边就是著名的海港福州了。]],
  exit = {
    s = { to = '福州城北门', },
    n = { to = '福州城山路#1N', },
  },
},

['福州城渔船#2'] = {
  id = '福州城渔船#2',
  area = '福州城',
  name = '渔船',
  desc =  [[渔船都连在一齐，而且都几乎是一模一样的，看得你头晕眼花。忽然一个暗浪涌来，你一个不稳，‘啊。。。’，你几乎掉下了海去。]],
  exit = {
    e = { to = '福州城渔船#3', },
    w = { to = '福州城渔船#1', },
    s = { to = '福州城渔船#2', },
    n = { to = '福州城渔船#2', },
  },
},

['苏州城致爽阁'] = {
  id = '苏州城致爽阁',
  area = '苏州城',
  name = '致爽阁',
  desc =  [[在千人石西面就是致爽阁，又名伏虎阁，在虎丘塔的西南面，是山上的最高点。阁名取“四山爽气，日夕西来”之意。旧称“小五台”，是海涌峰顶。阁外平台宽阔，俯瞰沃野；远眺群峰逶迤，可赏著名上午“狮子回头看虎丘”一景。深秋季节观成群飞翔的苍鹰，蔚为壮观。]],
  exit = {
    se = { to = '苏州城千人石', },
  },
},

['苏州城西大街#1'] = {
  id = '苏州城西大街#1',
  area = '苏州城',
  name = '西大街',
  desc =  [[这是一条宽阔的青石板街道，向东西两头延伸。西大街是衙门所在，行人稀少，静悄悄地很是冷清。东边是沧浪亭和宝带桥，南边是兵营。北边就是衙门了。]],
  exit = {
    ne = { to = '苏州城沧浪亭', },
    s = { to = '苏州城兵营大门', },
    se = { to = '苏州城宝带桥', },
    w = { to = '苏州城西大街#2', },
    n = { to = '苏州城衙门大门', },
  },
},

['苏州城土路#2W'] = {
  id = '苏州城土路#2W',
  area = '苏州城',
  name = '土路',
  desc =  [[你来到了一条土路上。西南边有条江，远远看去不甚宽阔。往东北边走可以找到是去苏州的官道。]],
  exit = {
    ne = { to = '苏州城土路#1W', },
    sw = { to = '苏州城江边', },
  },
},

['苏州城行春桥'] = {
  id = '苏州城行春桥',
  area = '苏州城',
  name = '行春桥',
  desc =  [[顺着石湖岸边走就来到了行春桥，你站在行春桥的石级上，极目远望，湖水接天，群山蜿蜒，塔影倒影，美若画卷。]],
  exit = {
    e = { to = '苏州城石湖', },
  },
},

['苏州城西门'] = {
  id = '苏州城西门',
  area = '苏州城',
  name = '西门',
  desc =  [[这是西城门，几年前曾经遭到土匪的攻打，因此显得有些破败。城门正上方勉勉强强可以认出“西门”两个大字，城墙上贴着几张通缉告示(gaoshi)。这里是罪犯逃往西域的必经之地，官兵们戒备森严，动不动就截住行人盘问。一条笔直的青石板大道向东西两边延伸。西边是郊外，骑马的、座轿的、走路的，行人匆匆。你加快了脚步，生怕官兵找碴。东边是城里。]],
  exit = {
    w = { to = '苏州城西门官道', },
    e = { to = '苏州城西大街#2', },
  },
},

['苏州城千人石'] = {
  id = '苏州城千人石',
  area = '苏州城',
  name = '千人石',
  desc =  [[在虎丘山中心，有一块千人石，巨石呈暗紫红色，由南向北倾斜石面甚平坦，石壁如斧削。传说吴王墓筑成后，其子夫差怕泄露筑墓秘密假借墓成祝酒观舞之名，将千余名工匠全部杀戮，鲜血渗透石中，成暗红色。]],
  exit = {
    e = { to = '苏州城二仙亭', },
    nw = { to = '苏州城致爽阁', },
    n = { to = '苏州城试剑石', },
  },
},

['苏州城客房'] = {
  id = '苏州城客房',
  area = '苏州城',
  name = '客房',
  desc =  [[这是一间很大的客房，陈设十分简陋。靠墙放了十几张小木床，不少客人正和衣而卧，满屋子都是呼呼的打酣声。西边有张床是空的，你蹑手蹑脚地走了过去。]],
  exit = {
    out = { to = '苏州城二楼走廊', },
  },
},

['苏州城紫金庵'] = {
  id = '苏州城紫金庵',
  area = '苏州城',
  name = '紫金庵',
  desc =  [[这是一座苏州城里有名的寺庵，庵中正面是释加摩尼佛眼，似乎在注视前来礼佛之人；右壁一尊诸天用三个手指托起一块轻柔的绣花经盖和后壁观音菩萨头上的一顶刻着牡丹花的紫红色华盖。左壁的每尊罗汉塑像造型生动，各具特征，到达了以神人话、精神超忽、呼之欲活的艺术境界，令人叹为观止。]],
  exit = {
    e = { to = '苏州城北大街#2', },
  },
},

['苏州城西门官道'] = {
  id = '苏州城西门官道',
  area = '苏州城',
  name = '西门官道',
  desc =  [[你走在一条青石大道上，人来人往显得非常繁忙，不时地有人骑着马匆匆而过。大道两旁有一些小货摊，似乎是一处集市。东边通向苏州城。]],
  exit = {
    w = { to = '苏州城西门外官道', },
    e = { to = '苏州城西门', },
  },
},

['苏州城北门兵营'] = {
  id = '苏州城北门兵营',
  area = '苏州城',
  name = '北门兵营',
  desc =  [[这里是兵营，密密麻麻到处都是官兵，有的在武将的指挥下列队操练，有的独自在练功，有的坐着、躺着正在休息。南墙下坐着主帅，不动声色地寻视着四周。]],
  exit = {
    w = { to = '苏州城监狱', },
    e = { to = '苏州城北门', },
  },
},

['苏州城宝和记'] = {
  id = '苏州城宝和记',
  area = '苏州城',
  name = '宝和记',
  desc =  [[这是一家以买卖公平著称的当铺，一个五尺高的柜台挡在你的面前，柜台上摆着一个牌子(sign)，柜台后坐着位老板，一双精明的眼睛上上下下打量着你。]],
  exit = {
    n = { to = '苏州城东大街#1', },
  },
},

['苏州城西门外官道'] = {
  id = '苏州城西门外官道',
  area = '苏州城',
  name = '西门外官道',
  desc =  [[你走在一条青石大道上，人来人往显得非常繁忙，不时地有人骑着马匆匆而过，大道两旁有一些小货摊，似乎是一处集市。东边通向苏州城西门。]],
  exit = {
    w = { to = '苏州城枫桥镇', },
    e = { to = '苏州城西门官道', },
  },
},

['苏州城寒山寺门'] = {
  id = '苏州城寒山寺门',
  area = '苏州城',
  name = '寒山寺门',
  desc =  [[相传在唐元和年间，有寒山子曾来此居住，后来高僧希迁禅师在此重建寺院时，更名为寒山寺。具载，唐开元年间，诗人张继赴京应试落第，返途舟船停靠枫桥，赋诗一首：“月落乌啼霜满天，江枫渔火对愁眠，姑苏城外寒山寺，夜半歌声到客船”。从此，诗韵钟声，脍炙人口，寺因诗而名扬天下。]],
  exit = {
    enter = { to = '苏州城寒山寺正殿', },
    se = { to = '苏州城枫桥镇', },
  },
},

['苏州城青石官道#2'] = {
  id = '苏州城青石官道#2',
  area = '苏州城',
  name = '青石官道',
  desc =  [[你走在一条青石大道上，人来人往非常繁忙，不时地有人骑着马匆匆而过。大道两旁有一些小货摊，似乎是一处集市。]],
  exit = {
    s = { to = '苏州城青石官道#3', },
    sw = { to = '苏州城青石官道#1', },
  },
},

['苏州城宝带桥'] = {
  id = '苏州城宝带桥',
  area = '苏州城',
  name = '宝带桥',
  desc =  [[宝带桥横跨于苏州的运河之上，又因桥形宛若长带，被称为长桥。桥面宽阔，行人在桥上来往，桥边有城里的小贩吆喝、叫卖着，熙熙攘攘，热闹非凡。宝带桥卧于碧波之上，相应生辉，分外多骄。这里是中秋赏月的一处绝佳之地。]],
  exit = {
    ne = { to = '苏州城东大街#1', },
    s = { to = '苏州城南大街#1', },
    nw = { to = '苏州城西大街#1', },
    n = { to = '苏州城沧浪亭', },
  },
},

['苏州城青石大道#3'] = {
  id = '苏州城青石大道#3',
  area = '苏州城',
  name = '青石大道',
  desc =  [[你走在一条青石大道上，人来人往非常繁忙，不时地有人骑着马匆匆而过。大道两旁有一些小货摊，似乎是一处集市。往北遥看，灵岩山展现在你的面前。]],
  exit = {
    s = { to = '苏州城湖边大道', },
    n = { to = '苏州城青石大道#2', },
  },
},

['苏州城东大街#1'] = {
  id = '苏州城东大街#1',
  area = '苏州城',
  name = '东大街',
  desc =  [[你走在东大街上，踩着坚实的青石板地面。东边是东大街的延伸，南面是苏州城里一个老字号的当铺，北面是一条小胡同，西北方向是沧浪亭，西南方向是宝带桥。]],
  exit = {
    s = { to = '苏州城宝和记', },
    e = { to = '苏州城东大街#2', },
    sw = { to = '苏州城宝带桥', },
    nw = { to = '苏州城沧浪亭', },
    n = { to = '苏州城胡同#1', },
  },
},

['苏州城碧水亭'] = {
  id = '苏州城碧水亭',
  area = '苏州城',
  name = '碧水亭',
  desc =  [[这是湖中的一个小亭子，从这望去，可以看到整个湖面的景色,令人心旷神怡。亭子壁上刻画着江南水乡的宜人风景，令人产生无限遐想。亭上有一根梁（liang)。]],
  exit = {
    s = { to = '苏州城湖中岛', },
  },
},

['苏州城古木交诃'] = {
  id = '苏州城古木交诃',
  area = '苏州城',
  name = '古木交诃',
  desc =  [[古木交诃在荷花厅的西面，一排不同图案的漏窗，使你透过漏窗隐隐看到中部的水光山色和高低错落的楼阁，此处赏景，有“移步幻影”之妙。向西窗孔可以遥望绿荫轩、明瑟楼，给人一种“庭院深深深几许”和空间不尽之感。]],
  exit = {
    e = { to = '苏州城荷花厅', },
    sw = { to = '苏州城池塘', },
  },
},

['苏州城揖峰指柏轩'] = {
  id = '苏州城揖峰指柏轩',
  area = '苏州城',
  name = '揖峰指柏轩',
  desc =  [[这里曾是为园主接待宾客和亲友的地方，有时也作为演戏说书或写诗做画之处。轩名取朱熹“前揖庐山，一峰独绣”和高启的“笑指庭前柏”句诗意。轩内摆设古香古色。凭轩眺望，满目石峰嶙峋，古柏虬枝盘绕，旧有桃源“十八景”之称。]],
  exit = {
    sw = { to = '苏州城狮子林', },
  },
},

['苏州城藏经阁'] = {
  id = '苏州城藏经阁',
  area = '苏州城',
  name = '藏经阁',
  desc =  [[中间排列着五排大书架。四周则陈列矮几，以供阅读。几位老僧手执经卷，正在闭目凝思。]],
  exit = {
    s = { to = '苏州城大雄宝殿', },
  },
},

['苏州城苏州北郊'] = {
  id = '苏州城苏州北郊',
  area = '苏州城',
  name = '苏州北郊',
  desc =  [[这是苏州北郊的一条青石大道，路上人来人往非常繁忙，不时地有人骑着马匆匆而过。两旁是一片绿油油的稻田，远处还有几个小货摊，似乎是一处集市。一片江南水乡的景色。继续往南走就是苏州城了。]],
  exit = {
    w = { to = '丐帮田径', },
    sw = { to = '苏州城虎丘山', },
    nw = { to = '扬州城江南官道', },
    s = { to = '苏州城北门', },
  },
},

['苏州城燕誉堂'] = {
  id = '苏州城燕誉堂',
  area = '苏州城',
  name = '燕誉堂',
  desc =  [[燕誉堂是全园主厅，旧时系园主宴客处。曾经作为御膳房。堂名取于《诗经》：“式燕且誉，好而无射”。此处建筑为鸳鸯厅形状，高敞宏丽，堂内陈设富丽精致。]],
  exit = {
    w = { to = '苏州城狮子林', },
    se = { to = '苏州城真趣亭', },
  },
},

['苏州城曹娥碑'] = {
  id = '苏州城曹娥碑',
  area = '苏州城',
  name = '曹娥碑',
  desc =  [[相传曹娥死后葬于此，上虞令命邯郸淳作文镌碑(gravestone)以记其事。时邯郸淳年方十三，文不加点，一挥而就，立于墓侧。]],
  exit = {
    e = { to = '苏州城农舍', },
    n = { to = '苏州城江边', },
  },
},

['苏州城衙门西厅'] = {
  id = '苏州城衙门西厅',
  area = '苏州城',
  name = '衙门西厅',
  desc =  [[这里是衙门的西厅，乃是知府的书房。书案上凌乱地放着几本发黄的古籍。引起你的注意的是墙上挂着一幅很大的地图(ditu)。]],
  exit = {
    e = { to = '苏州城衙门正厅', },
  },
},

['苏州城湖边大道'] = {
  id = '苏州城湖边大道',
  area = '苏州城',
  name = '湖边大道',
  desc =  [[从这里遥看太湖景色，烟波浩森，气象万千。放棹太湖之上，耸嶂叠翠，千顷一壁，倒影楚楚；鼋头眺望，群山来去，岛屿浮水；苍茫水面，鱼帆千张；湖中有湖，水天相接。若赶上傍晚彩霞满天时，湖面金波顷流，令人心旷神怡。]],
  exit = {
    w = { to = '归云庄湖滨小路#E', },
    n = { to = '苏州城青石大道#3', },
  },
},

['苏州城灵岩山'] = {
  id = '苏州城灵岩山',
  area = '苏州城',
  name = '灵岩山',
  desc =  [[这里因山上有状如灵芝的巨石，故名灵岩山。这里山势挺拔秀丽，奇石嶙峋，有甚多的吴宫遗迹，享有“吴中第一峰”的美誉。]],
  exit = {
    eu = { to = '苏州城迎笑亭', },
    nw = { to = '苏州城天平山', },
    s = { to = '苏州城青石大道#1', },
  },
},

['苏州城打铁铺'] = {
  id = '苏州城打铁铺',
  area = '苏州城',
  name = '打铁铺',
  desc =  [[这是一家简陋的打铁铺，中心摆着一个火炉，炉火把四周照得一片通红，你一走进去就感到浑身火热。墙角堆满了已完工和未完工的菜刀、铁锤、铁棍、匕首、盔甲等物。一位铁匠满头大汗挥舞着铁锤，专心致志地在打铁。]],
  exit = {
    n = { to = '苏州城东大街#2', },
  },
},

['苏州城问梅阁'] = {
  id = '苏州城问梅阁',
  area = '苏州城',
  name = '问梅阁',
  desc =  [[阁内的桌凳、花窗、地坪、书画皆取材于梅花，并悬匾额“绮窗春讯”。阁前种植了许多枝梅，以符阁名。曾为旧时文人著书、绘画之处。]],
  exit = {
    w = { to = '苏州城真趣亭', },
    s = { to = '苏州城立雪堂', },
  },
},

['苏州城后堂'] = {
  id = '苏州城后堂',
  area = '苏州城',
  name = '后堂',
  desc =  [[这里是书场的后堂，里面有一张桌子和一张床，墙上的窗户半掩着，墙上挂着一副年画。]],
  exit = {
    hidden = { to = '苏州城运河', cmd = 'jie picture;jump', },
    out = { to = '苏州城书场', door = 'open door', },
  },
},

['苏州城天平山'] = {
  id = '苏州城天平山',
  area = '苏州城',
  name = '天平山',
  desc =  [[过了灵岩山，距离几里地就到了天平山。它为苏州西南诸山之最高峰。因地势平坦如砥而得名。又因山势高峻，白雾缭绕，也称“白云山”。具载：宋仁宗赵祯将天平山赐与范文正公，故也称“范文山”。]],
  exit = {
    ne = { to = '苏州城青石官道#3', },
    eu = { to = '苏州城白云泉', },
    se = { to = '苏州城灵岩山', },
    n = { to = '苏州城石湖', },
  },
},

['苏州城划船坞#W'] = {
  id = '苏州城划船坞#W',
  area = '苏州城',
  name = '划船坞',
  desc =  [[这里名为“画船嵝”，俗称“划船坞”，相传西施在此玩龙舟。向南有一条直通太湖的人工开凿的小溪。]],
  exit = {
    sw = { to = '苏州城采香径', },
    eu = { to = '苏州城石鼋', },
  },
},

['苏州城西大街#2'] = {
  id = '苏州城西大街#2',
  area = '苏州城',
  name = '西大街',
  desc =  [[    你走在西大街上，感到这里的街面要比别处的干净、整洁。大概因为靠近衙门、兵营可受保护的缘故，富人们都喜欢住在这里。东边静悄悄地没有几个行人，西边是西城门通往郊外。南边是玄妙观，北边是一个书堂。]],
  exit = {
    e = { to = '苏州城西大街#1', },
    s = { to = '苏州城玄妙观', },
    w = { to = '苏州城西门', },
    n = { to = '苏州城书场', },
  },
},

['苏州城衙门内宅'] = {
  id = '苏州城衙门内宅',
  area = '苏州城',
  name = '衙门内宅',
  desc =  [[这里是衙门的内宅，住着知府的家眷。外人到此就该止步了。]],
  exit = {
    s = { to = '苏州城衙门正厅', },
  },
},

['苏州城农舍'] = {
  id = '苏州城农舍',
  area = '苏州城',
  name = '农舍',
  desc =  [[这是一间普通的农舍，里面陈设相当简陋，顶上的茅草也不整齐，露出好几个天床。一位农夫正坐在门边抽旱烟。]],
  exit = {
    w = { to = '苏州城曹娥碑', },
  },
},

['苏州城江边'] = {
  id = '苏州城江边',
  area = '苏州城',
  name = '江边',
  desc =  [[这条江叫做曹娥江。相传汉和帝时，这里有一名巫者，名叫曹盱，能婆娑乐神。五月五日，醉舞舟中，堕江而死。其女年十四岁，绕江啼哭七昼夜，跳入波中。后五日，负父之尸浮于江面，里人葬之江边，故名。]],
  exit = {
    ne = { to = '苏州城土路#2W', },
    s = { to = '苏州城曹娥碑', },
  },
},

['苏州城池塘'] = {
  id = '苏州城池塘',
  area = '苏州城',
  name = '池塘',
  desc =  [[一池池水映入你的眼帘，小蓬莱翼然水中，曲折的石桥上架着紫藤花棚。池东你可以看到曲溪楼、西楼、清风池等小筑，掩映于花木山石之间。池西的山腰间，桂树丛生。秋日，置身于“闻木樨香轩”，阵阵桂香，沁人心脾。轩下，水涧两岸叠石重重，你不禁为此景而赞叹不已。]],
  exit = {
    ne = { to = '苏州城古木交诃', },
  },
},

['苏州城运河'] = {
  id = '苏州城运河',
  area = '苏州城',
  name = '运河',
  desc =  [[这里是古老的运河的桥头边，只见这条运河蜿蜒流淌，从苏州城里穿过。运河的两岸都是苏州的寻常百姓家，在苏州的城里出门最好的交通工具就是船了。只见进处有一位老船夫，见你走过来，起身向你迎来，(sign)。]],
  exit = {
    enter = { to = '苏州城渡船#1', no_wander = true, unstable = true, handler = 'embark', },
    se = { to = '苏州城西大街#1', },
  },
},

['苏州城渡船#1'] = {
  id = '苏州城渡船#1',
  area = '苏州城',
  name = '渡船',
  desc =  [[一叶小舟，最多也就能载七、八个人。一名六十多岁的老艄公手持长竹篙，正在船尾吃力地撑着船。]],
  exit = {
    out = { to = '苏州城运河', ignore = true, },
    out2 = { to = '苏州城湖边大道', unstable = true, handler = 'disembark', cost = 50, },
    out3 = { to = '苏州城湖中岛', unstable = true, handler = 'disembark', cost = 50, },
  },
},

['苏州城北门'] = {
  id = '苏州城北门',
  area = '苏州城',
  name = '北门',
  desc =  [[这是北城门，因为曾经失火，到现在城墙还是黑乎乎的，因此白纸黑字的官府告示(gaoshi)就显得特别现眼。北方是一片崇山峻岭，一条黄土小径在山里蜿蜒而上。]],
  exit = {
    s = { to = '苏州城北大街#2', },
    w = { to = '苏州城北门兵营', },
    n = { to = '苏州城苏州北郊', },
  },
},

['苏州城衙门东厅'] = {
  id = '苏州城衙门东厅',
  area = '苏州城',
  name = '衙门东厅',
  desc =  [[这里是衙门东厅，是知府招待客人的所在。厅中摆着一张杉木圆桌和几张椅子，桌上是一套精致的宜兴瓷器。墙上挂着一幅中堂，画的是猛虎下山，乃是知府的手笔。]],
  exit = {
    w = { to = '苏州城衙门正厅', },
  },
},

['苏州城采香径'] = {
  id = '苏州城采香径',
  area = '苏州城',
  name = '采香径',
  desc =  [[这里名为采香径，又称“一箭径”，此溪乃吴王夫差赔西施游山之必经之水道，也是越伐吴时，范蠡携西施，驾小舟出逃之处。]],
  exit = {
    nw = { to = '苏州城划船坞#E', },
    ne = { to = '苏州城划船坞#W', },
  },
},

['苏州城衙门大门'] = {
  id = '苏州城衙门大门',
  area = '苏州城',
  name = '衙门大门',
  desc =  [[这里是衙门大门，两扇朱木大门紧紧关闭着。“肃静”“回避”的牌子分放两头石狮子的旁边。前面有一个大鼓，显然是供小民鸣冤用的。几名衙役在门前巡逻。]],
  exit = {
    s = { to = '苏州城西大街#1', },
    n = { to = '苏州城衙门正厅', },
  },
},

['苏州城沧浪亭'] = {
  id = '苏州城沧浪亭',
  area = '苏州城',
  name = '沧浪亭',
  desc =  [[仓浪亭在苏州的北大街南侧，因为环境相对幽雅，使得男女老少都喜爱在这里闲庭散步。在亭中放眼望去，四周一片碧绿的草坪，亭子翼然于耸翠之中，飞檐凌空琵琶形牌科，布满檐口四周，亭上的额匾和石柱上的楹联(lian)使人更加喜爱这里。]],
  exit = {
    se = { to = '苏州城东大街#1', },
    sw = { to = '苏州城西大街#1', },
    s = { to = '苏州城宝带桥', },
    n = { to = '苏州城北大街#1', },
  },
},

['苏州城憨憨泉'] = {
  id = '苏州城憨憨泉',
  area = '苏州城',
  name = '憨憨泉',
  desc =  [[在山道西侧有一憨憨泉，系南朝梁代高僧憨憨尊者所开凿，距今一千四百多年。据说泉眼通海，姑又名“海涌泉”。水甚清冽为“天下第五泉”。石刻“憨憨泉”三字，系北宋吕升卿所题。]],
  exit = {
    ed = { to = '苏州城万景山庄', },
  },
},

['扬州城江南官道'] = {
  id = '扬州城江南官道',
  area = '扬州城',
  name = '江南官道',
  desc =  [[你走在一条青石大道上，人来人往非常繁忙，不时有人骑着马匆匆而过。北面是长江下游近入海口的地方，东南面通往姑苏城。]],
  exit = {
    se = { to = '苏州城苏州北郊', },
    n = { to = '扬州城长江南岸#C', },
  },
},

['苏州城坟墓'] = {
  id = '苏州城坟墓',
  area = '苏州城',
  name = '坟墓',
  desc =  [[在山之西南麓，有南宋抗金名将韩世忠与梁红玉等死位妻妾的合葬墓。墓左竖巨碑，碑上篆刻着宋孝宗皇帝御书“中兴佐命定国元勋之碑”，碑文长达一万三千多字，自古称“天下第一碑”。]],
  exit = {
    ne = { to = '苏州城石鼋', },
  },
},

['苏州城青石大道#1'] = {
  id = '苏州城青石大道#1',
  area = '苏州城',
  name = '青石大道',
  desc =  [[你走在一条青石大道上，人来人往非常繁忙，不时地有人骑着马匆匆而过。大道两旁有一些小货摊，似乎是一处集市。北边通向灵岩山。东面的湖边大道通向举世著名的姑苏慕容世家。]],
  exit = {
    e = { to = '姑苏慕容湖边#1', },
    s = { to = '苏州城青石大道#2', },
    n = { to = '苏州城灵岩山', },
  },
},

['苏州城枫桥镇'] = {
  id = '苏州城枫桥镇',
  area = '苏州城',
  name = '枫桥镇',
  desc =  [[出苏州城西门向西行约三十里，就到了这枫桥镇。具史书所载，唐朝开元年间，诗人张继赴京应试落第，返途舟船停靠枫桥，赋诗一首：“月落乌啼霜满天，江枫渔火对愁眠，姑苏城外寒山寺，夜半歌声到客船”。从此，诗韵钟声，脍炙人口，寺因诗而名扬天下，枫桥镇也成了游览胜地。]],
  exit = {
    e = { to = '苏州城西门外官道', },
    nw = { to = '苏州城寒山寺门', },
    s = { to = '苏州城土路#1W', },
  },
},

['苏州城枕石'] = {
  id = '苏州城枕石',
  area = '苏州城',
  name = '枕石',
  desc =  [[在山半腰有一块巨石，因石形如枕而得名枕石。相传东晋高僧，常在此倚石阅经，倦则枕石休息。此石其形又象蜒蚰，故亦称“蜒蚰石”。另因有“唐寅三笑姻缘”的传说，故又名“鸳鸯石”。这块大石，实系海涌山遗物。]],
  exit = {
    s = { to = '苏州城试剑石', },
  },
},

['苏州城二楼走廊'] = {
  id = '苏州城二楼走廊',
  area = '苏州城',
  name = '二楼走廊',
  desc =  [[你正走在客店二楼的走廊上，可以听到从客房里不时地呼呼的打酣声，一阵高过一阵。不时有睡意朦胧的旅客进进出出，到楼下的掌柜处付了钱再上来睡觉。]],
  exit = {
    enter = { to = '苏州城客房', },
    d = { to = '苏州城客店', },
  },
},

['扬州城长江南岸#W'] = {
  id = '扬州城长江南岸#W',
  area = '扬州城',
  name = '长江南岸',
  desc =  [[面前是一条波涛翻滚的大江(river)。 浊流滚滚，万舟竞发。两岸渡船来来往往，江边一长溜摆满了鱼摊，渔家就将船泊在岸边，支一块木板，板上摆满了活蹦乱跳的鲤鱼。不远处是一个摆渡，不少过江客都在这里等待渡船。]],
  exit = {
    e = { to = '扬州城长江南岸#C', },
    enter = { to = '扬州城长江渡船#W', cmd = 'dujiang', unstable = true, handler = 'cross_cj', no_wander = true, },
  },
},

['苏州城衙门正厅'] = {
  id = '苏州城衙门正厅',
  area = '苏州城',
  name = '衙门正厅',
  desc =  [[堂上东西有两根楹住，挂着一幅对联，但是你无心细看。正墙上悬挂一个横匾，上书“正大光明”四个金光闪闪的大字。知府正坐在文案后批阅文书，师爷随侍在后。]],
  exit = {
    e = { to = '苏州城衙门东厅', },
    s = { to = '苏州城衙门大门', },
    w = { to = '苏州城衙门西厅', },
    n = { to = '苏州城衙门内宅', },
  },
},

['扬州城长江南岸#E'] = {
  id = '扬州城长江南岸#E',
  area = '扬州城',
  name = '长江南岸',
  desc =  [[面前是一条波涛翻滚的大江(river)。 浊流滚滚，万舟竞发。两岸渡船来来往往，江边一长溜摆满了鱼摊，渔家就将船泊在岸边，支一块木板，板上摆满了活蹦乱跳的鲤鱼。不远处是一个摆渡，不少过江客都在这里等待渡船。]],
  exit = {
    w = { to = '扬州城长江南岸#C', },
    enter = { to = '扬州城长江渡船#E', cmd = 'dujiang', unstable = true, handler = 'cross_cj', no_wander = true, },
  },
},

['苏州城大雄宝殿'] = {
  id = '苏州城大雄宝殿',
  area = '苏州城',
  name = '大雄宝殿',
  desc =  [[这里是灵岩寺的大雄宝殿。正中供奉着如来三宝，左右各是文殊、普贤菩萨。一群青衣小和尚们正在佛像前的地上诵经。缕缕香烟与梵唱交错在一起，仰视佛祖拈花浅笑的面容，令人顿时生起几分脱俗之感。身边经常有一队队僧人鱼贯而入，看他们手持戒刀，似乎是巡寺的僧人。]],
  exit = {
    out = { to = '苏州城灵岩寺', },
    n = { to = '苏州城藏经阁', },
  },
},

['扬州城长江南岸#C'] = {
  id = '扬州城长江南岸#C',
  area = '扬州城',
  name = '长江南岸',
  desc =  [[面前是一条波涛翻滚的大江(river)。 浊流滚滚，万舟竞发。两岸渡船来来往往，江边一长溜摆满了鱼摊，渔家就将船泊在岸边，支一块木板，板上摆满了活蹦乱跳的鲤鱼。不远处是一个摆渡，不少过江客都在这里等待渡船。]],
  exit = {
    e = { to = '扬州城长江南岸#E', },
    s = { to = '扬州城江南官道', },
    w = { to = '扬州城长江南岸#W', },
    enter = { to = '扬州城长江渡船#C', cmd = 'dujiang', unstable = true, handler = 'cross_cj', no_wander = true, },
  },
},

['苏州城翰林府院'] = {
  id = '苏州城翰林府院',
  area = '苏州城',
  name = '翰林府院',
  desc =  [[你走进大院，迎面是一个假山水池，池上摆着一块奇形怪状的石头，据说是当年花石纲的遗石。水池的两旁种满了花草。东边是一棵槐树，郁郁葱葱，遮盖了大半个院子，显得阴森恐怖。一条长廊走道通往后院，有几个家丁把守。]],
  exit = {
    s = { to = '苏州城翰林府门', },
    n = { to = '苏州城后院', },
  },
},

['苏州城留园'] = {
  id = '苏州城留园',
  area = '苏州城',
  name = '留园',
  desc =  [[留园是苏州的一大名景之一，它以结构布局紧密、厅堂华丽宏敝、装饰精美典雅而享有“吴中第一名园”之誉。]],
  exit = {
    w = { to = '苏州城荷花厅', },
    e = { to = '苏州城南大街#2', },
  },
},

['苏州城立雪堂'] = {
  id = '苏州城立雪堂',
  area = '苏州城',
  name = '立雪堂',
  desc =  [[立雪堂名自”程门力雪“和”断臂力雪“之典。堂前小院中的湖石、形似牛、蟹、狮、蛙，谓“狮子静观牛吃蟹”，颇生动有趣。]],
  exit = {
    n = { to = '苏州城问梅阁', },
  },
},

['苏州城翰林府门'] = {
  id = '苏州城翰林府门',
  area = '苏州城',
  name = '翰林府门',
  desc =  [[一座富丽堂皇的大宅院出现在你的眼前，两头高大的石狮子镇住了大门两侧，大门上的朱漆足足有三寸厚。门上一张匾，上书“翰林府”三个大字。]],
  exit = {
    s = { to = '苏州城万景山庄', },
    n = { to = '苏州城翰林府院', },
  },
},

['苏州城兵营'] = {
  id = '苏州城兵营',
  area = '苏州城',
  name = '兵营',
  desc =  [[这里是兵营，密密麻麻到处都是官兵，有的在武将的指挥下列队操练，有的独自在练功，有的坐着、躺着正在休息。南墙下坐着主帅，不动声色地寻视着四周。看到你进来，他们全都向你包围了过来，形势看来不太妙。]],
  exit = {
    n = { to = '苏州城兵营大门', },
  },
},

['苏州城二仙亭'] = {
  id = '苏州城二仙亭',
  area = '苏州城',
  name = '二仙亭',
  desc =  [[二仙亭在千人石东侧，建于北宋。亭壁嵌两方石碑，分别刻着五代宋初陈抟与唐代吕洞宾二仙像。亭柱上有两幅石刻楹联：“梦中说梦原非梦，元里求元便是元”；“昔日岳阳曾显迹，今朝虎阜再留踪”。]],
  exit = {
    w = { to = '苏州城千人石', },
    n = { to = '苏州城白莲池', },
  },
},

['苏州城钟楼小院'] = {
  id = '苏州城钟楼小院',
  area = '苏州城',
  name = '钟楼小院',
  desc =  [[这是一座砖木结构的宝塔，塔高七层，塔身作八角形，飞檐翘翎，檐角上挂满了一串串小铜铃，随风叮叮作响。塔身墙上镂空雕绘着无数佛陀们的坐像。一个个形态维肖，看来出自名匠之手。塔底入口处开了一扇拱形的小木门，门扇两侧用彩漆涂绘，画的是释祖在灵山对诸天众佛讲经时的情形。]],
  exit = {
    e = { to = '苏州城灵岩寺', },
  },
},

['苏州城迎笑亭'] = {
  id = '苏州城迎笑亭',
  area = '苏州城',
  name = '迎笑亭',
  desc =  [[这里是灵岩山半山上的一座小亭子，从山下上山的游客到了这里都歇歇脚。俯望山下景色，远处一片碧波，在水天之间，点点银光，煞是宜人。]],
  exit = {
    wd = { to = '苏州城灵岩山', },
    su = { to = '苏州城石鼋', },
  },
},

['苏州城石湖'] = {
  id = '苏州城石湖',
  area = '苏州城',
  name = '石湖',
  desc =  [[石湖是太湖的一个内陆支流，位于苏州城南春秋时，越兵伐吴，横断山麓，凿石开湖，通故苏，故名石湖。湖畔有座上方山，山顶矗立上方塔。湖的北面横跨高大的越城桥，湖东有当年越兵登陆的越来溪，湖西隔着始建于南宋末年的行春桥。]],
  exit = {
    w = { to = '苏州城行春桥', },
    s = { to = '苏州城天平山', },
  },
},

['苏州城灵岩寺'] = {
  id = '苏州城灵岩寺',
  area = '苏州城',
  name = '灵岩寺',
  desc =  [[爬上山顶，就是灵岩寺。灵岩寺原系吴王馆娃宫遗址，为“东南著名丛林”，佛教净土宗道场。始建于南朝，原名绣峰寺。唐代改称灵岩寺，信奉律宗。]],
  exit = {
    e = { to = '苏州城灵岩塔', },
    nd = { to = '苏州城石鼋', },
    w = { to = '苏州城钟楼小院', },
    enter = { to = '苏州城大雄宝殿', },
  },
},

['苏州城虎丘山'] = {
  id = '苏州城虎丘山',
  area = '苏州城',
  name = '虎丘山',
  desc =  [[虎丘山因其山形似蹲虎而得名。又相传吴王葬后，有白虎出现其墓上，故名虎丘。山前绝岩幽谷，花木繁茂，景色绮丽，后山空蒙宽广，石壁树立，气势雄浑。有“山藏寺里”的特色，被誉为“吴中第一名胜”。]],
  exit = {
    ne = { to = '苏州城苏州北郊', },
    s = { to = '苏州城头门山', },
  },
},

['苏州城青石大道#2'] = {
  id = '苏州城青石大道#2',
  area = '苏州城',
  name = '青石大道',
  desc =  [[你走在一条青石大道上，人来人往非常繁忙，不时地有人骑着马匆匆而过。大道两旁有一些小货摊，似乎是一处集市。]],
  exit = {
    s = { to = '苏州城青石大道#3', },
    n = { to = '苏州城青石大道#1', },
  },
},

['苏州城后院'] = {
  id = '苏州城后院',
  area = '苏州城',
  name = '后院',
  desc =  [[这里是翰林府的后院。院子里种了不少的各种奇花异草，尤以各色菊花为多。北面有一扇门(men)。]],
  exit = {
    s = { to = '苏州城翰林府院', },
    n = { to = '苏州城闺房', no_wander = true, unstable = true, door = 'kai men', cond = 'player.flag["got 铜钥匙"]', },
  },
},

['苏州城闺房'] = {
  id = '苏州城闺房',
  area = '苏州城',
  name = '闺房',
  desc =  [[这是凌小姐的闺房，一股幽香扑面而来。一张绣榻放在墙角，垂着细纱。凌小姐正对着一盆菊花在沉思。西面是座花园。]],
  exit = {
    s = { to = '苏州城后院', },
    w = { to = '苏州城花园', cond = 'player.flag["asked 凌霜华 about 丁典"]', },
  },
},

['苏州城花园'] = {
  id = '苏州城花园',
  area = '苏州城',
  name = '花园',
  desc =  [[这里是翰林府的花园。院子里种了各色名贵的菊花。黄菊有都胜、金芍药、报君知。白菊有月下白、一团雪、貂蝉拜月。紫菊有双飞燕、紫玉莲、玛瑙盘。红菊有美人红、醉贵妃、绣芙蓉。。。院中有几盆颜色特别娇艳的黄花，花瓣黄得像金子一样，花朵的样子很像荷花。那就是从天竺传来的金波旬花。]],
  exit = {
    e = { to = '苏州城闺房', },
  },
},

['苏州城胡同#2'] = {
  id = '苏州城胡同#2',
  area = '苏州城',
  name = '胡同',
  desc =  [[这是一条黑暗、肮脏的小巷，空气中仿佛飘扬着一股罪恶的气息，东边通向小巷深处。]],
  exit = {
    e = { to = '苏州城胡同#3', },
    sw = { to = '苏州城胡同#1', },
  },
},

['苏州城土路#1W'] = {
  id = '苏州城土路#1W',
  area = '苏州城',
  name = '土路',
  desc =  [[你来到了一条土路上，西南边不远好象有条江。北边是去苏州的官道。]],
  exit = {
    sw = { to = '苏州城土路#2W', },
    n = { to = '苏州城枫桥镇', },
  },
},

['苏州城真趣亭'] = {
  id = '苏州城真趣亭',
  area = '苏州城',
  name = '真趣亭',
  desc =  [[亭内高高悬挂御笔题写的”真趣“匾一块。亭内装饰精致金碧辉煌。梁架、围屏、裙板上雕刻的人物、花鸟图案惟妙惟肖。在此可以环览全园景色。]],
  exit = {
    nw = { to = '苏州城燕誉堂', },
    e = { to = '苏州城问梅阁', },
  },
},

['苏州城石鼋'] = {
  id = '苏州城石鼋',
  area = '苏州城',
  name = '石鼋',
  desc =  [[这是一块突出平地的巨石，称为“石鼋”。石鼋背面刻着“望佛来”三个字，背上凹痕处，传说是夫差与西施立石昂首眺望太湖石留下的脚印。从石鼋旁俯视，左右有两个水洼。]],
  exit = {
    ed = { to = '苏州城划船坞#E', },
    nd = { to = '苏州城迎笑亭', },
    sw = { to = '苏州城坟墓', },
    wd = { to = '苏州城划船坞#W', },
    su = { to = '苏州城灵岩寺', },
  },
},

['苏州城立春堂'] = {
  id = '苏州城立春堂',
  area = '苏州城',
  name = '立春堂',
  desc =  [[这是一家药铺，一股浓浓的药味让你几欲窒息，那是从药柜上的几百个小抽屉里散发出来的。药房先生坐在茶几旁，独自喝着茶，看也不看你一眼。一名小伙计站在柜台后招呼着顾客。]],
  exit = {
    s = { to = '苏州城东大街#2', },
  },
},

['苏州城白莲池'] = {
  id = '苏州城白莲池',
  area = '苏州城',
  name = '白莲池',
  desc =  [[白莲池位于二仙亭的北面，池中种有千叶莲花，池上架彩莲曲桥，相传吴王夫差与西施曾在此采莲赏荷。]],
  exit = {
    s = { to = '苏州城二仙亭', },
  },
},

['苏州城玄妙观'] = {
  id = '苏州城玄妙观',
  area = '苏州城',
  name = '玄妙观',
  desc =  [[你一走进玄妙观，看到观中香火缭绕，香客众多。殿是重檐歇山式，屋脊高十几米，内有高大殿柱四十根。屋面坡度平缓，出檐较深，斗拱疏朗宏大，殿内正中有砖砌须弥座，座上供奉着的三尊高十几米的泥塑三清金身像，法像庄严，神采奕奕，不失为道教雕塑中的精品。]],
  exit = {
    n = { to = '苏州城西大街#2', },
  },
},

['苏州城划船坞#E'] = {
  id = '苏州城划船坞#E',
  area = '苏州城',
  name = '划船坞',
  desc =  [[这里名为“画船嵝”，俗称“划船坞”，相传西施在此玩龙舟。向南有一条直通太湖的人工开凿的小溪。从这坐船能够到达运河之上。]],
  exit = {
    se = { to = '苏州城采香径', },
    wu = { to = '苏州城石鼋', },
    enter = { to = '苏州城渡船#2', no_wander = true, unstable = true, handler = 'embark', },
  },
},

['苏州城渡船#2'] = {
  id = '苏州城渡船#2',
  area = '苏州城',
  name = '渡船',
  desc =  [[一叶小舟，最多也就能载七、八个人。一名六十多岁的老艄公手持长竹篙，正在船尾吃力地撑着船。]],
  exit = {
    out = { to = '苏州城划船坞#E', ignore = true, },
    out2 = { to = '苏州城运河', unstable = true, handler = 'disembark', cost = 50, },
  },
},

['苏州城真娘墓'] = {
  id = '苏州城真娘墓',
  area = '苏州城',
  name = '真娘墓',
  desc =  [[在试剑石北面就是古真娘墓，真娘也称贞娘，因安史之乱流落江南，受骗流落堕入青楼。贞娘为守贞操，自尽抗之。后人筑亭其上，墓前石刻“香魂”两字，墓上遍栽花卉。唐代白居易等诗人墨客纷纷为之题诗，褒赞真娘之贞烈。]],
  exit = {
    sw = { to = '苏州城试剑石', },
    n = { to = '苏州城孙武亭', },
  },
},

['苏州城狮子林'] = {
  id = '苏州城狮子林',
  area = '苏州城',
  name = '狮子林',
  desc =  [[你一走进狮子林，便不禁为江南苏州园林的奇妙美景所折服。狮子林东南多山，西北多水，素有”假山王国“之称。假山峰峦叠嶂，曲折盘旋，石洞连绵不断，幽深莫测。咫尺之间，可望而不可及，变幻无穷如入迷宫，不由得不为之赞叹不已。]],
  exit = {
    ne = { to = '苏州城揖峰指柏轩', },
    w = { to = '苏州城南大街#1', },
    e = { to = '苏州城燕誉堂', },
  },
},

['苏州城监狱'] = {
  id = '苏州城监狱',
  area = '苏州城',
  name = '监狱',
  desc =  [[这里是监狱，约莫两丈见方的一间大石室，墙壁和顶板都是大石所砌。墙角里放着一只粪桶，鼻中闻到的尽是臭气和霉气。从西面墙上的小窗望去，可以见到翰林府的一角。]],
  exit = {
    e = { to = '苏州城北门兵营', },
  },
},

['苏州城书场'] = {
  id = '苏州城书场',
  area = '苏州城',
  name = '书场',
  desc =  [[这里是个热闹的书场，场子里坐满了来听书的闲人。场子前面的桌子后面有一位说书先生，他看上去四五十岁，手中拿着一块响板，正在聚精会神地说着评书--《杨家将》。场中的人们不时的发出惊叹和喝彩声，时不时将铜板抛了上去。]],
  exit = {
    s = { to = '苏州城西大街#2', },
    enter = { to = '苏州城后堂', door = 'open door', },
  },
},

['苏州城铁玲关'] = {
  id = '苏州城铁玲关',
  area = '苏州城',
  name = '铁玲关',
  desc =  [[关呈长方形，砖石结构，正中的三层敌楼为新建。铁玲关地处水陆要冲登敌楼，既可了望，又能放炮射箭。这关垣、运河、石桥所组成的联合工事，当时是为了防御合抵抗侵扰的倭寇。]],
  exit = {
    s = { to = '苏州城枫桥', },
  },
},

['苏州城聚宝斋'] = {
  id = '苏州城聚宝斋',
  area = '苏州城',
  name = '聚宝斋',
  desc =  [[这是一家老字号的钱庄，已有几百年的历史，在全国各地都有分店。它发行的银票信誉非常好，通行全国。这里是苏州分店。]],
  exit = {
    e = { to = '苏州城南大街#1', },
  },
},

['苏州城南大街#1'] = {
  id = '苏州城南大街#1',
  area = '苏州城',
  name = '南大街',
  desc =  [[南大街乃是城里的繁华地段，一到晚上，一派灯红酒绿，尤为热闹。笑声、歌声、琴声、箫声，汇成一片送入了你的耳朵，你不禁心猿意马，很想就此停步享受一番。苏州的城里秀丽景色此时已使你心旷神怡，此时此刻只想与这大自然秀丽的景色融为一体。从这里看去，苏州南城的街景是一片喧闹。在街的东北面是一个茶馆，正东望去是一座苏州园林。]],
  exit = {
    ne = { to = '苏州城茶馆', },
    s = { to = '苏州城南大街#2', },
    e = { to = '苏州城狮子林', },
    sw = { to = '苏州城书院', },
    w = { to = '苏州城聚宝斋', },
    n = { to = '苏州城宝带桥', },
  },
},

['苏州城灵岩塔'] = {
  id = '苏州城灵岩塔',
  area = '苏州城',
  name = '灵岩塔',
  desc =  [[灵岩塔，又名永多宝佛塔，始建于梁代。高约三十多米，为七级八面塔。塔身上刻写着“灵岩塔”三个大字。]],
  exit = {
    w = { to = '苏州城灵岩寺', },
  },
},

['苏州城胡同#1'] = {
  id = '苏州城胡同#1',
  area = '苏州城',
  name = '胡同',
  desc =  [[这是一条黑暗、肮脏的小巷，空气中仿佛飘扬着一股罪恶的气息，东北边通向小巷深处，正人君子是不会往那边走去的。往东走就会回到城中大路了。西面是一条小巷，名为“生死巷”。]],
  exit = {
    ne = { to = '苏州城胡同#2', },
    s = { to = '苏州城东大街#1', },
  },
},

['苏州城马厩'] = {
  id = '苏州城马厩',
  area = '苏州城',
  name = '马厩',
  desc =  [[这是北大街边上的马厩，常年供应新鲜草料。据说此地民风淳朴，客人要住店，马夫们就会把马牵到马厩好生照看，将它们喂饱饮足，再洗刷得干乾净净。一直伺候到客人离店上路。马厩中堆放著几堆草料，正中有一口泔槽。]],
  exit = {
    e = { to = '苏州城北大街#1', },
    s = { to = '苏州城戏园子', },
  },
},

['苏州城青石官道#1'] = {
  id = '苏州城青石官道#1',
  area = '苏州城',
  name = '青石官道',
  desc =  [[你走在一条青石大道上，人来人往非常繁忙，不时地有人骑着马匆匆而过。大道两旁有一些小货摊，似乎是一处集市。北边通向苏州城。西南面有一条大路通往杭州。]],
  exit = {
    ne = { to = '苏州城青石官道#2', },
    sw = { to = '杭州城山路#2N', },
    se = { to = '嘉兴城青石官道#1', },
    n = { to = '苏州城南门', },
  },
},

['苏州城荷花厅'] = {
  id = '苏州城荷花厅',
  area = '苏州城',
  name = '荷花厅',
  desc =  [[荷花厅的主建筑面阔三间，宽敝高爽，厅名取朱熹：“一水方涵碧，千林以变红”之诗意。厅前宽广的平台依临荷池，为夏日赏荷纳凉胜处，故称“荷花厅”。厅后有花台庭院，叠石种树，自成一景。]],
  exit = {
    w = { to = '苏州城古木交诃', },
    e = { to = '苏州城留园', },
  },
},

['苏州城湖中岛'] = {
  id = '苏州城湖中岛',
  area = '苏州城',
  name = '湖中岛',
  desc =  [[这里是太湖中心的一个小岛，小岛的中心有一座亭子。]],
  exit = {
    enter = { to = '苏州城渡船#1', no_wander = true, unstable = true, handler = 'embark', },
    n = { to = '苏州城碧水亭', },
    hidden = { to = '苏州城湖边大道', cmd = 'dushui', cond = 'player.skill["少林身法"] and player.skill["少林身法"].level >= 50 and player.enable.dodge.skill == "少林身法"', },
  },
},

['苏州城听雨轩'] = {
  id = '苏州城听雨轩',
  area = '苏州城',
  name = '听雨轩',
  desc =  [[听雨轩是苏州城内的一处唯一的一家书店了。这里有着各种各样的书籍，什么小说啦、风光旅游啦、手艺制作啦、基本武功啦，等等等等。只须花几两银子就可买到你想要的书。]],
  exit = {
    w = { to = '苏州城南大街#2', },
  },
},

['苏州城南大街#2'] = {
  id = '苏州城南大街#2',
  area = '苏州城',
  name = '南大街',
  desc =  [[你走在一条繁华的街道上，向南北两头延伸。南边是南城门，北边通往城南大街的中心地段，东面是听雨轩，西面是留园，望南面，是苏州城的南城门。]],
  exit = {
    e = { to = '苏州城听雨轩', },
    s = { to = '苏州城南门', },
    w = { to = '苏州城留园', },
    n = { to = '苏州城南大街#1', },
  },
},

['苏州城南门'] = {
  id = '苏州城南门',
  area = '苏州城',
  name = '南门',
  desc =  [[这是南城门，城墙被当成了广告牌，贴满了花花绿绿各行各业的广告，官府的告示(gaoshi)因此不太显目。官兵们被近处的欢声笑语所吸引，似乎不是很认真在执勤。一条笔直的青石板大道向南北两边延伸。]],
  exit = {
    s = { to = '苏州城青石官道#1', },
    n = { to = '苏州城南大街#2', },
  },
},

['苏州城戏园子'] = {
  id = '苏州城戏园子',
  area = '苏州城',
  name = '戏园子',
  desc =  [[这是一座苏州城里鼎鼎有名的戏园，戏园中生，旦，净，墨，丑一应具全，场中一个大戏台，台上正在唱着《遇长春》，台下不时地传来票友们的叫跃，喝彩声。你也忍不住想坐下来看看戏，放松一下筋骨。]],
  exit = {
    ne = { to = '苏州城北大街#1', },
    n = { to = '苏州城马厩', },
  },
},

['苏州城兵营大门'] = {
  id = '苏州城兵营大门',
  area = '苏州城',
  name = '兵营大门',
  desc =  [[你正站在兵营的门口，面对着一排简陋的营房，可以看到穿着制服的官兵正在操练，不时地传来呐喊声。老百姓是不允许在此观看的，你最好赶快走开。]],
  exit = {
    s = { to = '苏州城兵营', },
    n = { to = '苏州城西大街#1', },
  },
},

['苏州城枫桥'] = {
  id = '苏州城枫桥',
  area = '苏州城',
  name = '枫桥',
  desc =  [[寺的北面有一座桥孔呈半圆的单空石桥---枫桥，她跨于运河的枫桥湾。桥的东面石铁玲关，它与白虎关，浒墅关，合称苏州三关。]],
  exit = {
    s = { to = '苏州城寒拾殿', },
    n = { to = '苏州城铁玲关', },
  },
},

['苏州城北大街#2'] = {
  id = '苏州城北大街#2',
  area = '苏州城',
  name = '北大街',
  desc =  [[这是一条宽阔的青石街道，向南北两头延伸。北边是北城门通向城外。南边显得很繁忙。东边是一座两层的楼阁，名为春在楼。西面是一座庙庵，南面是一条笔直的大街，十分繁华。]],
  exit = {
    e = { to = '苏州城春在楼', },
    s = { to = '苏州城北大街#1', },
    w = { to = '苏州城紫金庵', },
    n = { to = '苏州城北门', },
  },
},

['苏州城头门山'] = {
  id = '苏州城头门山',
  area = '苏州城',
  name = '头门山',
  desc =  [[头山门在虎丘山的南面，形似虎头。隔河照墙上书着“海涌流辉”四个大字，以示虎丘与大海的渊源关系。]],
  exit = {
    w = { to = '苏州城万景山庄', },
    n = { to = '苏州城虎丘山', },
  },
},

['苏州城白云泉'] = {
  id = '苏州城白云泉',
  area = '苏州城',
  name = '白云泉',
  desc =  [[一股清泉顺着山麓而下，在这里汇集成一潭泉水，当地人起了一个名字“白云泉”，这里的泉水如线涓涓流入一石盂中，故又名“一线泉”或“钵盂泉”。此泉大旱不竭，被唐代茶圣陆羽评为“吴中第一泉”。诗人白居易曾赋诗吟咏“天平山上白云泉，云本无心水自闲，何必奔冲山下去，更添波浪向人间”。泉旁设有茶室，品茗名泉者络绎不绝。]],
  exit = {
    wd = { to = '苏州城天平山', },
  },
},

['苏州城客店'] = {
  id = '苏州城客店',
  area = '苏州城',
  name = '客店',
  desc =  [[这是一家价钱低廉的客栈，生意非常兴隆。外地游客多选择这里落脚，你可以在这里打听到各地的风土人情。店小二里里外外忙得团团转，接待着南腔北调的客人。客店的主人从不露面，他究竟是谁，有各种各样的猜测。墙上挂着一个牌子(paizi)。]],
  exit = {
    u = { to = '苏州城二楼走廊', },
    w = { to = '苏州城北大街#1', },
  },
},

['苏州城书院'] = {
  id = '苏州城书院',
  area = '苏州城',
  name = '书院',
  desc =  [[这里是书院的讲堂，窗明几净，一尘不染。一位庄重严肃的老者坐在太师椅上讲学，那就是当今大儒朱先生了。在他的两侧坐满了求学的学生。一张古意盎然的书案放在朱先生的前面，案上摆着几本翻开了的线装书籍。朱先生的身后是一个书架(shujia)讲堂内多历代楹联石刻，足见书院历史的悠久。值得一提的是嵌在讲堂前左壁的学规(xuegui)。]],
  exit = {
    ne = { to = '苏州城南大街#1', },
  },
},

['苏州城寒拾殿'] = {
  id = '苏州城寒拾殿',
  area = '苏州城',
  name = '寒拾殿',
  desc =  [[这里供奉着相传为“和合二仙”化身的寒山、拾得的金身塑像，形态生动，逗人喜爱。寒山寺每年除夕半夜，撞钟一百零八响，其含义是除旧迎新和纪念佛门一百零八位高僧。]],
  exit = {
    w = { to = '苏州城寒山寺正殿', },
    out = { to = '苏州城枫桥', },
  },
},

['苏州城胡同#3'] = {
  id = '苏州城胡同#3',
  area = '苏州城',
  name = '胡同',
  desc =  [[这是一条黑暗、肮脏的小巷，空气中仿佛飘扬着一股罪恶的气息，东边通向小巷深处。]],
  exit = {
    w = { to = '苏州城胡同#2', },
    se = { to = '苏州城东大街#2', },
  },
},

['苏州城万景山庄'] = {
  id = '苏州城万景山庄',
  area = '苏州城',
  name = '万景山庄',
  desc =  [[在虎丘山东面就是万景山庄，是一个较大的盆景园，有盆名为“秦汉遗韵”的圆柏，树龄已逾五百年，被誉为“盆景之王”。还有盆景为“云蒸霞蔚”的树石盆景和另一盆四百多年的雀梅古桩盆景，都是盆景艺术的中的珍品。圆内景色优美，颇富园林雅趣。]],
  exit = {
    e = { to = '苏州城头门山', },
    eu = { to = '苏州城试剑石', },
    wu = { to = '苏州城憨憨泉', },
    n = { to = '苏州城翰林府门', },
  },
},

['苏州城东门'] = {
  id = '苏州城东门',
  area = '苏州城',
  name = '东门',
  desc =  [[这是东城门，城门正上方刻着“东门”两个楷书大字，城墙上贴着几张官府告示(gaoshi)。官兵们警惕地注视着过往行人，你最好小心为妙。一条笔直的青石板大道向东西两边延伸，西边是城里。]],
  exit = {
    w = { to = '苏州城东大街#2', },
  },
},

['苏州城北大街#1'] = {
  id = '苏州城北大街#1',
  area = '苏州城',
  name = '北大街',
  desc =  [[你走在一条繁忙的街道上，看着操着南腔北调的人们行色匆匆，许多人都往南边走去，那里有一个热闹的亭子。西南面是一家戏园子，不时传来叫好声，来自各地的人们进进出出。在东面是一个客店。西面是一个马厩。]],
  exit = {
    s = { to = '苏州城沧浪亭', },
    e = { to = '苏州城客店', },
    sw = { to = '苏州城戏园子', },
    w = { to = '苏州城马厩', },
    n = { to = '苏州城北大街#2', },
  },
},

['苏州城茶馆'] = {
  id = '苏州城茶馆',
  area = '苏州城',
  name = '茶馆',
  desc =  [[你一走进来，就闻到一股茶香沁入心脾，精神为之一爽。几张八仙桌一字排开，坐满了客人，或高声谈笑，或交头接耳。几个店伙计在一旁伺候着客人们，在台后坐着一位老板娘，正在弹着算盘。]],
  exit = {
    sw = { to = '苏州城南大街#1', },
  },
},

['苏州城青石官道#3'] = {
  id = '苏州城青石官道#3',
  area = '苏州城',
  name = '青石官道',
  desc =  [[你走在一条青石大道上，人来人往非常繁忙，不时地有人骑着马匆匆而过。大道两旁有一些小货摊，似乎是一处集市。]],
  exit = {
    sw = { to = '苏州城天平山', },
    n = { to = '苏州城青石官道#2', },
  },
},

['苏州城春在楼'] = {
  id = '苏州城春在楼',
  area = '苏州城',
  name = '春在楼',
  desc =  [[这是一座苏州城里有名的酒楼，整个楼面以雕刻为特色，砖雕，木雕，石雕。走进楼内，一眼便看到一副八仙上寿图，八仙人被描画的惟妙惟肖。楼内许多南北来往的门客正在聊天品茶，只见店小二忙的不亦乐乎。]],
  exit = {
    w = { to = '苏州城北大街#2', },
  },
},

['苏州城孙武亭'] = {
  id = '苏州城孙武亭',
  area = '苏州城',
  name = '孙武亭',
  desc =  [[在真娘幕后的土丘上，有一座小亭子，名为孙武亭。相传春秋时，兵家孙武曾在此训练两个宫女，由吴王的两个宠姬分别担任队长，由于宠姬与宫女们不听军令，虽三令五申，仍置若罔闻，孙武遂下令，先斩两姬于军前以整军纪。后人筑亭纪念孙武。]],
  exit = {
    s = { to = '苏州城真娘墓', },
  },
},

['苏州城寒山寺正殿'] = {
  id = '苏州城寒山寺正殿',
  area = '苏州城',
  name = '寒山寺正殿',
  desc =  [[这里是寒山寺的正殿，一走进来，首先看到的就是扬州八怪之一的大画家罗聘所绘的寒山、拾得写意画像石刻。石刻旁边是另一个画家郑文焯指画的丰干和尚石刻像。左右碑廊中藏有岳飞等历代名人题写得诗文，碑廊旁楹联碑刻树方，世传精品。正殿左右的偏殿保存着宋代樟木雕塑的金身五百罗汉。]],
  exit = {
    e = { to = '苏州城寒拾殿', },
    out = { to = '苏州城寒山寺门', },
  },
},

['苏州城东大街#2'] = {
  id = '苏州城东大街#2',
  area = '苏州城',
  name = '东大街',
  desc =  [[你走在东大街上，踩着坚实的青石板地面。东边是东城门，可以听到守城官兵的吆喝声，北边是一家老字号的药铺，南边是打铁铺，叮叮当当的声音老远就能听到。]],
  exit = {
    s = { to = '苏州城打铁铺', },
    e = { to = '苏州城东门', },
    w = { to = '苏州城东大街#1', },
    nw = { to = '苏州城胡同#3', },
    n = { to = '苏州城立春堂', },
  },
},

['苏州城试剑石'] = {
  id = '苏州城试剑石',
  area = '苏州城',
  name = '试剑石',
  desc =  [[在山道东侧是试剑石，呈椭圆形，正中有条深而齐裂的裂缝，相传吴王得“干将”，“莫邪”剑后，为试其锋利，将石劈开。石旁刻着元代顾瑛的诗句“剑试一痕秋，崖倾水断流，如何百年后，不斩赵高头？”的诗句。]],
  exit = {
    ne = { to = '苏州城真娘墓', },
    s = { to = '苏州城千人石', },
    wd = { to = '苏州城万景山庄', },
    n = { to = '苏州城枕石', },
  },
},

['丐帮田径'] = {
  id = '丐帮田径',
  area = '丐帮',
  name = '田径',
  desc =  [[你前行里许，折而向西，曲曲折折的走上了乡下的田径。这一带都是极肥的良田，田径边到处河港交叉，一派江南水乡的秀丽风光。田径北面是一大片杏子林，杏树上开满着鲜花。]],
  exit = {
    e = { to = '苏州城苏州北郊', },
    n = { to = '丐帮杏子林#1', handler = 'simple_path_set_pos', },
  },
},

['丐帮杏子林#1'] = {
  id = '丐帮杏子林#1',
  area = '丐帮',
  name = '杏子林',
  desc =  [[这是一片杏子林，一走进来，你仿佛迷失了方向。你在杏花丛乱闯, 试图发现出林的路。杏树上的鲜花开得缤纷绚丽，简直分不出方向，放眼望去，到处都是盛开的鲜花。南面是一个田埂。]],
  exit = {
    e = { to = '丐帮杏子林#1', },
    w = { to = '丐帮杏子林#1', },
    s = { to = '丐帮田径', },
    n = { to = '丐帮杏子林#1', },
    hidden = { to = '丐帮杏子林#2', handler = 'simple_path', cost = 7, },
  },
},

['丐帮杏子林#2'] = {
  id = '丐帮杏子林#2',
  area = '丐帮',
  name = '杏子林',
  desc =  [[这儿是杏子林中间的一片空地，四周的杏树上开满了花。一群蜜蜂飞来飞去繁忙地采蜜。树下有几个乞丐围坐在一起，旁边站着两个年轻乞丐。他们脸色凝重，好像在商议着什么。]],
  exit = {
    s = { to = '丐帮杏子林#1', },
    n = { to = '丐帮杏子林#3', },
  },
},

['丐帮杏子林#3'] = {
  id = '丐帮杏子林#3',
  area = '丐帮',
  name = '杏子林',
  desc =  [[这儿是杏子林中间的一片空地，四周的杏树上开满了花。一群蜜蜂飞来飞去繁忙地采蜜。树下有几个乞丐围坐在一起，旁边站着两个年轻乞丐。他们脸色凝重，好像在商议着什么。]],
  exit = {
    s = { to = '丐帮杏子林#2', },
    w = { to = '丐帮空地', },
    n = { to = '丐帮土地庙', },
  },
},

['丐帮空地'] = {
  id = '丐帮空地',
  area = '丐帮',
  name = '空地',
  desc =  [[这儿是杏子林中间的一片空地。四周的树上挂着一个个竹篓，里面有很多毒蛇在蠕动，一个老乞丐坐在地上手里拿着条蛇。丐帮弟子可以在这里问陈长老有关抓蛇的事。]],
  exit = {
    e = { to = '丐帮杏子林#3', },
  },
},

['丐帮后院'] = {
  id = '丐帮后院',
  area = '丐帮',
  name = '后院',
  desc =  [[这是土地庙的后院，四周是高高低低的黄土墙，院中间有一口大锅，锅里好象正煮着什么东西。不远处有几个中年乞丐，围坐在一个身材高大的老乞丐周围。在高谈阔论着什么。声音很洪亮。]],
  exit = {
    s = { to = '丐帮土地庙', door = 'open door', },
  },
},

['丐帮土地庙'] = {
  id = '丐帮土地庙',
  area = '丐帮',
  name = '土地庙',
  desc =  [[这是一间破破烂烂的土地庙，庙里破败不堪，土地神像推在一旁，梁上地下也布满了灰尘。一看就知道已经很久没有人来清理过了。正中放着个大香案，上面零乱地扔着几根吃剩下来的鸡骨头。也许正是因为隐蔽的原因吧，据说丐帮江南据点就被设在此处。北面墙上开着一个小门。]],
  exit = {
    s = { to = '丐帮杏子林#3', },
    n = { to = '丐帮后院', door = 'open door', },
  },
},

['大理皇宫正厅'] = {
  id = '大理皇宫正厅',
  area = '大理皇宫',
  name = '正厅',
  desc =  [[这里是大理皇宫的正厅。只见正中有一块横匾，写着「邦国柱石」四个大字，下首署着「丁卯御笔」四个小字，楹柱中堂悬满了字画。厅中站着一人，气宇轩昂，看上去有帝王之像。厅的东边是书房，西边是御膳房。北边有一扇门，似乎是通往后宫的走廊。]],
  exit = {
    e = { to = '大理皇宫书房', },
    s = { to = '大理皇宫走廊#1N', },
    w = { to = '大理皇宫御膳房', },
    n = { to = '大理皇宫走廊#2N', cond = 'player.exp >= 100000', handler = 'dl_hougong', },
  },
},

['大理皇宫走廊#2N'] = {
  id = '大理皇宫走廊#2N',
  area = '大理皇宫',
  name = '走廊',
  desc = [[这是一条走廊，两侧雕栏画砌，盘龙描凤。处处显示出这里不是寻常的地方。北边有一条小河，河上有座小桥，似乎通向后宫。]],
  exit = {
    e = { to = '大理皇宫厢房', },
    s = { to = '大理皇宫正厅', },
    w = { to = '大理皇宫大殿', },
    n = { to = '大理皇宫小桥', },
  },
},

['大理皇宫大殿'] = {
  id = '大理皇宫大殿',
  area = '大理皇宫',
  name = '大殿',
  desc = [[这是一座三重檐的圆形大殿，兰色琉璃瓦顶，全砖木结构，没有大梁长檩，全靠二十八根木柱和三十六根枋桷支撑。大殿中央四根“龙井柱”代表一年四季，中层十二根柱子象征十二个月，外圈十二根柱象征十二个时辰，内外檐柱十二根代表二十四个节气。设计精巧，寓意奇特。]],
  exit = {
    e = { to = '大理皇宫走廊#2N', },
  },
},

['大理皇宫厢房'] = {
  id = '大理皇宫厢房',
  area = '大理皇宫',
  name = '厢房',
  desc = [[只见这间房一隔一隔，或有贮书处，或设鼎处，或安置笔砚处，供花设瓶安放盆景处，其格各式各样，或天圆地方，或葵花蕉叶，或连环半壁，真是花团锦簇，剔透玲珑。倏尔五色纱糊就，竟系小窗；倏尔彩绫轻覆，竟系幽户。且满墙皆系古玩之形抠成的槽子，诸如琴、剑、悬瓶桌屏之类，虽悬于壁，却都是与壁相平的。]],
  exit = {
    w = { to = '大理皇宫走廊#2N', },
  },
},

['大理皇宫小桥'] = {
  id = '大理皇宫小桥',
  area = '大理皇宫',
  name = '小桥',
  desc = [[这是一座很别致小石桥，桥上是缓缓的流水，水看上去很清，使人有跳下去游泳的冲动。这里是通往后宫的必经之路。]],
  exit = {
    s = { to = '大理皇宫走廊#2N', },
    nw = { to = '大理皇宫池塘', },
    n = { to = '大理皇宫后院', },
  },
},

['大理皇宫池塘'] = {
  id = '大理皇宫池塘',
  area = '大理皇宫',
  name = '池塘',
  desc = [[这里是一个池塘，池塘里长满了荷花，远远望去一片绿色的世界，不由使你想起“碧叶菡萏天接水”的诗句。仔细看还有不少鱼儿在水中嬉戏。]],
  exit = {
    nw = { to = '大理皇宫大山石', },
    se = { to = '大理皇宫小桥', },
  },
},

['大理皇宫大山石'] = {
  id = '大理皇宫大山石',
  area = '大理皇宫',
  name = '大山石',
  desc = [[忽迎面突出插天的大玲珑山石来，四面群绕各式石块，竟把里面所有房屋悉皆遮住。且一株花木也无，只见许多异草：或有牵藤的，或有引蔓的，或垂山巅，或穿石隙，甚至垂绕柱，萦砌盘阶，或如翠带飘飘，或如金绳蟠屈，或实如丹砂，或花如金桂。味芬气馥，非花香之可比。]],
  exit = {
    se = { to = '大理皇宫池塘', },
  },
},

['大理皇宫后院'] = {
  id = '大理皇宫后院',
  area = '大理皇宫',
  name = '后院',
  desc = [[这里是大理皇宫的后院，再进去就是保定帝的寝宫了，由于保定帝生性喜静，所以这里很少有人走动，处处给人一种静谧的感觉。]],
  exit = {
    s = { to = '大理皇宫小桥', },
    n = { to = '大理皇宫寝宫', },
  },
},

['大理皇宫寝宫'] = {
  id = '大理皇宫寝宫',
  area = '大理皇宫',
  name = '寝宫',
  desc = [[这里就是保定帝的寝宫了，寝宫整个布置都很简洁，若不是床上被褥的花纹绣着只有帝王之家特有的龙的图案，你根本就不能想到这里就是大理皇帝段正明的寝宫。]],
  exit = {
    s = { to = '大理皇宫后院', },
  },
},

['大理皇宫走廊#1N'] = {
  id = '大理皇宫走廊#1N',
  area = '大理皇宫',
  name = '走廊',
  desc =  [[这是一条走廊。彩梁画栋，连顶棚也用彩漆绘满了各种飞天的图形，每幅精美的雕画似乎都在诉说一个娓娓动人的故事。]],
  exit = {
    s = { to = '大理皇宫皇宫正门', },
    n = { to = '大理皇宫正厅', },
  },
},

['大理皇宫御膳房'] = {
  id = '大理皇宫御膳房',
  area = '大理皇宫',
  name = '御膳房',
  desc =  [[这里是大理皇宫的御膳房，只见桌上放着十来碟点心糕饼。点心和糕饼看上去都很精致，显然不是寻常人家的食品。]],
  exit = {
    e = { to = '大理皇宫正厅', },
  },
},

['大理皇宫皇宫正门'] = {
  id = '大理皇宫皇宫正门',
  area = '大理皇宫',
  name = '皇宫正门',
  desc =  [[这便是大理皇宫正门。巍峨雄伟的城墙上，「圣慈宫」三个大字十分显眼，气势辉煌。夕阳照在琉璃瓦上，金碧辉煌，令人目为之眩。一张镶着金边的告示(gaoshi)贴在墙上，许多侍卫立在两旁。路旁还立了一座牌坊(paifang)。]],
  exit = {
    s = { to = '大理城青石街#1', },
    n = { to = '大理皇宫走廊#1N', },
  },
},

['大理皇宫书房'] = {
  id = '大理皇宫书房',
  area = '大理皇宫',
  name = '书房',
  desc =  [[这里是大理皇宫的书房，只见四面皆是雕空玲珑木板，或山水人物，或翎毛花卉，或集锦，或博古，或万万福寿，各种花样，皆名手雕镂，五彩销金嵌宝的。保定帝经常在这里批阅奏折。后墙边有一个书架（jia)，书架上摆着不少的书。]],
  exit = {
    w = { to = '大理皇宫正厅', },
  },
},

['桃源县山岭'] = {
  id = '桃源县山岭',
  area = '桃源县',
  name = '山岭',
  desc =  [[山岭道路更显狭窄，有些地方只够单人侧着身子过去。由于路旁高山几乎将阳光全然遮去，此处在盛夏时倒是颇为清凉。从这里可以听见南边传来隐隐水声。]],
  exit = {
    ne = { to = '桃源县山间小路', },
    s = { to = '桃源县山谷瀑布', },
  },
},

['桃源县茅屋'] = {
  id = '桃源县茅屋',
  area = '桃源县',
  name = '茅屋',
  desc =  [[这里是一间由竹子搭成的茅屋，屋内摆设简朴，看来是渔人休息的小茅屋，在墙角放着一艘小铁舟和一对铁桨。]],
  exit = {
    e = { to = '桃源县山谷瀑布', },
  },
},

['桃源县小饭铺'] = {
  id = '桃源县小饭铺',
  area = '桃源县',
  name = '小饭铺',
  desc =  [[奔出百余里之遥。百里之内仅此一家小饭铺，往来的行人都在此打尖住店。四处一问，知道当地已属桃源县管辖，]],
  exit = {
    e = { to = '大理城南土林', },
    sw = { to = '桃源县山间小路', },
  },
},

['桃源县山谷瀑布'] = {
  id = '桃源县山谷瀑布',
  area = '桃源县',
  name = '山谷瀑布',
  desc =  [[空山寂寂，水声在山谷间激荡回响，轰轰汹汹，愈走水声愈大，待得走上岭顶，只见一道白龙似的大瀑布(pubu)从对面双峰之间奔腾而下，声势甚是惊人。从岭上望下去，瀑布旁边有一间草屋。只见瀑布旁柳树下坐着一人，头戴斗笠，坐在一块石上，正自垂钓。]],
  exit = {
    w = { to = '桃源县茅屋', },
    n = { to = '桃源县山岭', },
  },
},

['桃源县山间小路'] = {
  id = '桃源县山间小路',
  area = '桃源县',
  name = '山间小路',
  desc =  [[道路两旁山峰壁立，道路愈来愈窄，中间一条羊肠小径，仅容一人勉强过去，顺山路望去，此处仿佛是入山道口，此处以渐渐没有了行人。]],
  exit = {
    ne = { to = '桃源县小饭铺', },
    sw = { to = '桃源县山岭', },
  },
},

['华山侧廊#SW'] = {
  id = '华山侧廊#SW',
  area = '华山',
  name = '侧廊',
  desc =  [[这里是华山派总堂的侧廊, 庄严古朴, 两旁蜂舞蝶影，山花烂漫，好一派山地风光。西面是华山弟子的饭厅，未及走近，你已经闻到阵阵饭香。南面是华山弟子的休息室，供习武疲倦之时睡眠之用。]],
  exit = {
    e = { to = '华山后堂', },
    w = { to = '华山饭厅', },
    s = { to = '华山女休息室', cond = 'player.gender == "female"', },
  },
},

['华山玉女峰'] = {
  id = '华山玉女峰',
  area = '华山',
  name = '玉女峰',
  desc =  [[这里是华山的中峰，玉女峰。玉女峰地势略为平缓，不似其它四峰那般险峻，江湖上赫赫有名的华山剑派就在此处。西边有所小小的庙宇，那就是玉女祠了。南面稀稀落落有十几间房子，那里是华山派的地方，闲杂游客最好别往那去。]],
  exit = {
    nd = { to = '华山镇岳宫', },
    s = { to = '华山山路#1', },
    e = { to = '华山玉女祠', },
    w = { to = '华山瀑布', },
    nw = { to = '华山小山路#1', },
  },
},

['华山百尺峡'] = {
  id = '华山百尺峡',
  area = '华山',
  name = '百尺峡',
  desc =  [[走过千尺幢，前面又见另一要命的百尺峡，百尺峡不似千尺幢般险峻，但亦十分陡峭，岩壁两侧设有铁索以作扶拦。]],
  exit = {
    eu = { to = '华山老君沟', },
    nd = { to = '华山千尺幢', },
  },
},

['华山正气堂'] = {
  id = '华山正气堂',
  area = '华山',
  name = '正气堂',
  desc =  [[这是华山掌门岳不群的居所「有所不为轩」，此处是前厅，厅上挂着「正气堂」三字匾额。厅中很宽敞，却没什么摆设，靠墙放着两把交椅，这里是岳不群议事、授徒的地方。]],
  exit = {
    s = { to = '华山后堂', },
    n = { to = '华山前厅', },
  },
},

['华山剑房'] = {
  id = '华山剑房',
  area = '华山',
  name = '剑房',
  desc =  [[“剑”本身并不重要，最关键的是使剑的人本身的剑术修为，所以，高手无剑。华山派弟子用剑的时候，都是到这个剑房来取。这里面也零散放着一些其他的兵器，供华山弟子习武时取用。]],
  exit = {
    s = { to = '华山书院', },
    n = { to = '华山练武场#E', },
  },
},

['华山侧廊#W'] = {
  id = '华山侧廊#W',
  area = '华山',
  name = '侧廊',
  desc =  [[这里是华山派总堂的侧廊, 庄严古朴, 两旁蜂舞蝶影，山花烂漫，好一派山地风光。西面就是华山弟子的练武场了。]],
  exit = {
    w = { to = '华山练武场#W', },
    e = { to = '华山前厅', },
  },
},

['华山台阶'] = {
  id = '华山台阶',
  area = '华山',
  name = '台阶',
  desc =  [[这是依山石开凿的石阶，因为过往的人不多，上面步满了青苔，南面就是华山派的中心所在。]],
  exit = {
    su = { to = '华山前厅', },
    nd = { to = '华山山路#2', },
  },
},

['华山小山路#2'] = {
  id = '华山小山路#2',
  area = '华山',
  name = '小山路',
  desc =  [[这里是华山的一条小山路，地势较为平缓，不似其它地方那么险峻。你走在这里，四周静悄悄的，你就象走进了一个世外桃源。]],
  exit = {
    se = { to = '华山小山路#1', },
    wu = { to = '华山思过崖', },
  },
},

['华山饭厅'] = {
  id = '华山饭厅',
  area = '华山',
  name = '饭厅',
  desc =  [[这里便是华山派弟子用饭的地方。饭厅不是很大，但窗明几净。桌上摆着一些食物，让人垂涎欲滴。不时有一些华山弟子走来走去，想是在忙些什么。]],
  exit = {
    e = { to = '华山侧廊#SW', },
    n = { to = '华山药房', },
  },
},

['华山猢狲愁'] = {
  id = '华山猢狲愁',
  area = '华山',
  name = '猢狲愁',
  desc =  [[前面又是一处十分陡峭的山岭，上面有四只铁猿，盘踞台畔，据说以前从华山水帘洞出来的猿猴，每到这里就要返回去，连它们也感到难于超越，此岭因而得名。]],
  exit = {
    su = { to = '华山苍龙岭', },
    nd = { to = '华山老君沟', },
  },
},

['华山玉女祠'] = {
  id = '华山玉女祠',
  area = '华山',
  name = '玉女祠',
  desc =  [[玉女祠里供奉的到底是哪位玉女，有许多不同的说法，现在所能看到的只一尊呆板的石像。祠中大石上有一处深陷，凹处积水清碧，传说这是天上玉女的洗脸盆，碧水终年不干。往里面走是一个祭坛，是华山百姓用来祭祀上天保佑一方水土的地方。]],
  exit = {
    w = { to = '华山玉女峰', },
    enter = { to = '华山祭坛', },
  },
},

['华山寝室'] = {
  id = '华山寝室',
  area = '华山',
  name = '寝室',
  desc =  [[这里是岳不群的寝室，岳不群在江湖上人称「君子剑」，他虽为一大派掌门，可他的卧室却布置的很简单。除了一张床，几只箱子，墙角有张化妆台，只有靠墙一张红木书桌(desk)还显得略有气派。]],
  exit = {
    n = { to = '华山后堂', },
  },
},

['华山思过崖'] = {
  id = '华山思过崖',
  area = '华山',
  name = '思过崖',
  desc =  { [[这是华山的思过崖。危崖上有个山洞，是华山派历代弟子犯规后囚禁受罚之所。崖上光秃秃的寸草不生，更无一株树木。这危崖自来自来相传是玉女发钗上的一颗珍珠，当年华山派的祖师以此危崖为惩罚弟子之所，主要是便此一处无草无木，无虫无鸟，受罚的弟子在面壁思过之时，不致为外物所扰，心有旁鹜。]], [[这是华山的思过崖。危崖上有个山洞，是华山派历代弟子犯规后囚禁受罚之所。崖上光秃秃的寸草不生，更无一株树木。天色灰暗，你已看不清四周的景物。]], },
  exit = {
    ed = { to = '华山小山路#2', },
    enter = { to = '华山思过崖洞口', unstable = true, cond = 'time.get_current_hour() >= 6 and time.get_current_hour() < 21', },
  },
},

['华山思过崖洞口'] = {
  id = '华山思过崖洞口',
  area = '华山',
  name = '思过崖洞口',
  desc = [[这里便是犯错误华山派弟子受罚思过的地方。位于玉女峰顶，正好有一小块平地，一面是深不可测的山谷、一面是陡峭的悬壁(bi)，零零落落的有几块山石。其中一块特别光滑，想是弟子在面壁是久坐而成。]],
  exit = {
    out = { to = '华山思过崖', },
    enter = { to = '华山山洞', no_wander = true, unstable = true, handler = 'hs_siguoya', cond = 'player.neili >= 600', },
  },
},

['华山山洞'] = {
  id = '华山山洞',
  area = '华山',
  name = '山洞',
  desc = [[这里是山洞的入口。山洞里面漆黑一团，你根本分不清东南西北，只好胡乱瞎闯了。]],
  exit = {
    out = { to = '华山思过崖洞口', unstable = true, handler = 'hs_siguoya', cond = 'player.neili >= 600', },
    left = { to = '华山密洞', unstable = true, door = 'use fire', },
    right = { to = '华山密道', unstable = true, door = 'use fire', cond = 'player.flag["独孤九剑"]', },
  },
},

['华山密洞'] = {
  id = '华山密洞',
  area = '华山',
  name = '密洞',
  desc = [[你走进来，发现石壁后面，别有洞天，是个可容得千人之众的大洞，洞中有七具骸骨，或坐，或卧，身旁均有兵刃。山洞四壁离地数丈突出一块大石，似是一个平台，大石之下刻着十六个大字(dazi)。你举起火把更往石壁上照看时，只见一行字刻道：范松赵鹤破恒山剑法于此。这一行之旁是无数人形，粗略一计，少说也有五六百个。]],
  exit = {
    right = { to = '华山山洞', },
  },
},

['华山密道'] = {
  id = '华山密道',
  area = '华山',
  name = '密道',
  desc = [[这里是山洞入口处的一条密道。山洞里面漆黑一团，你根本分不清东南西北，只好胡乱瞎闯了。]],
  exit = {
    left = { to = '华山山洞', },
    s = { to = '华山秘洞', },
  },
},

['华山秘洞'] = {
  id = '华山秘洞',
  area = '华山',
  name = '秘洞',
  desc = [[洞里漆黑一团，透过从洞口远远透过来的一丝亮光你发现四周的洞壁上似乎刻着一些小人，但怎么也看不清楚。]],
  exit = {
    ne = { to = '华山秘洞', },
    w = { to = '华山秘洞', },
    s = { to = '华山秘洞', },
    se = { to = '华山秘洞', },
    e = { to = '华山秘洞', },
    sw = { to = '华山秘洞', },
    nw = { to = '华山秘洞', },
    n = { to = '华山秘洞', },
    hidden1 = { to = '华山后山#1', handler = 'hs_midong', cost = 30, },
    hidden2 = { to = '华山思过崖', handler = 'hs_midong', cost = 20, },
  },
},

['华山后山#1'] = {
  id = '华山后山#1',
  area = '华山',
  name = '后山',
  desc =  [[这里是玉女峰后山的一个小山谷，长年人迹罕至。谷中古树参天，绿荫森森。偶尔从远处传来几声悠扬的鸟语，伴随着阵阵花香，简直让人疑心自己到了世外桃源。　　你远远的看见谷中有两间小屋，不过看来已经好久没住过人了。你心里不禁发起愁来，该怎么办呢？]],
  exit = {
    nd = { to = '华山秘洞', },
  },
},

['华山后山#2'] = {
  id = '华山后山#2',
  area = '华山',
  name = '后山',
  desc =  [[这是华山后山里的一个山谷，两边是陡峭光滑的山壁。谷底阴暗潮湿，似乎很适合蛇类动物生长，高耸的峭壁上偶尔传来几声鹰鸣。]],
  exit = {
    hidden = { to = '华山岩石', handler = 'wait', },
  },
},

['华山岩石'] = {
  id = '华山岩石',
  area = '华山',
  name = '岩石',
  desc =  [[这是华山山涧中一块巨大岩石的顶部，距离地面很高，站在此处可以看到很远的地方。周围常有蛇蟒出没，耳边时常传来一声鹰鸣。]],
  exit = {
    d = { to = '华山山涧#SW', },
  },
},

['华山玉泉院'] = {
  id = '华山玉泉院',
  area = '华山',
  name = '玉泉院',
  desc =  [[这里因屋后的玉泉而得名，是宋代陈希夷隐居的地方。周围生着十二株大龙藤，夭矫多姿，枝干中空，就如飞龙相似，相传是希夷先生陈抟老祖所植。]],
  exit = {
    s = { to = '华山山脚下', },
  },
},

['华山山涧#C'] = {
  id = '华山山涧#C',
  area = '华山',
  name = '山涧',
  desc =  [[这里周围都是灌木(guanmu)，东南的方向和东北面的方向似乎能走过去。]],
  exit = {
    ne = { to = '华山山涧#NE', },
    sw = { to = '华山山涧#SW', },
    se = { to = '华山山涧#SE', },
    hidden = { to = '华山茅屋', cmd = 'bo guanmu', },
  },
},

['华山茅屋'] = {
  id = '华山茅屋',
  area = '华山',
  name = '茅屋',
  desc = [[这是一间很普通的茅屋，茅屋的四周有一圈篱笆墙，墙边有一个大缸水缸(gang)，水缸上面有一个大盖子(gaizi)。水缸的旁边是一道木门,上面上了一把锁(lock)，很显然主人出门去了。篱笆院内有一个石桌(desk)，上面密密麻麻的不知是刻了些什么东西。]],
  exit = {
    se = { to = '华山山涧#C', },
  },
},

['华山舍身崖'] = {
  id = '华山舍身崖',
  area = '华山',
  name = '舍身崖',
  desc =  [[这是一段极窄极险的山崖，四周云雾飞绕，下面渊深无底。如不小心，一失足掉下去，只怕连骨头都找不到。]],
  exit = {
    ed = { to = '华山苍龙岭', },
  },
},

['华山练武场#W'] = {
  id = '华山练武场#W',
  area = '华山',
  name = '练武场',
  desc =  [[这是华山派的练武场，厚厚的石墙上打有一排排手掌痕迹，地砖已被踩出一个个脚印。]],
  exit = {
    e = { to = '华山侧廊#W', },
    s = { to = '华山药房', },
  },
},

['华山山路#1'] = {
  id = '华山山路#1',
  area = '华山',
  name = '山路',
  desc =  [[这是通往华山派总堂的山路，但见山势险峻，树木清幽，鸟鸣嘤嘤，流水淙淙，四五座粉墙大屋依着山坡或高或低的构筑，东南方有条小道通往山上。]],
  exit = {
    se = { to = '华山山路#2', },
    n = { to = '华山玉女峰', },
  },
},

['华山祭坛'] = {
  id = '华山祭坛',
  area = '华山',
  name = '祭坛',
  desc =  [[这里是华山绝顶上人们祭祀上天的祭坛，华山弟子都要下山行侠仗义，以换取上苍对华山百姓的保佑。]],
  exit = {
    out = { to = '华山玉女祠', },
  },
},

['华山山涧#NE'] = {
  id = '华山山涧#NE',
  area = '华山',
  name = '山涧',
  desc =  [[这里周围都是灌木，东南的方向和东面的方向似乎能走过去。]],
  exit = {
    sw = { to = '华山山涧#C', },
    eu = { to = '华山山涧#EU', },
  },
},

['华山小山路#1'] = {
  id = '华山小山路#1',
  area = '华山',
  name = '小山路',
  desc =  [[这里是华山的一条小山路，地势较为平缓，不似其它地方那么险峻。你走在这里，四周静悄悄的，你就象走进了一个世外桃源。]],
  exit = {
    nw = { to = '华山小山路#2', },
    se = { to = '华山玉女峰', },
  },
},

['华山千尺幢'] = {
  id = '华山千尺幢',
  area = '华山',
  name = '千尺幢',
  desc =  [[前面有一斜如天垂石梯的山阶，这就是赫赫有名的千尺幢，千尺幢是依一陡峭岩脊的裂缝开凿而成，斜度约七十度，高约二十米，仅容一人上落。如果不是精气十足，还是不要冒险攀登的好。]],
  exit = {
    wd = { to = '华山青柯坪', },
    su = { to = '华山百尺峡', },
  },
},

['华山山涧#EU'] = {
  id = '华山山涧#EU',
  area = '华山',
  name = '山涧',
  desc =  [[这里周围都是灌木，前面无法继续行走，西边是刚才来时的路。你隐隐约约看到上面是玉女峰(mount)。]],
  exit = {
    wd = { to = '华山山涧#NE', },
    se = { to = '华山松树林#M', },
    hidden = { to = '华山峭壁', cmd = 'climb up', },
  },
},

['华山峭壁'] = {
  id = '华山峭壁',
  area = '华山',
  name = '峭壁',
  desc = [[由于这里实在是太陡峭，你无法立足。玉女峰高高的在上面，思过崖时隐时现。]],
  exit = {
    hidden = { to = '华山山涧#EU', handler = 'wait', },
  },
},

['华山侧廊#SE'] = {
  id = '华山侧廊#SE',
  area = '华山',
  name = '侧廊',
  desc =  [[这里是华山派总堂的侧廊, 庄严古朴, 两旁蜂舞蝶影，山花烂漫，好一派山地风光。东面是一座古色古香的建筑，仔细一看，是华山派的书院所在，南面是华山弟子的休息室，供习武疲倦之时睡眠之用。]],
  exit = {
    e = { to = '华山书院', },
    w = { to = '华山后堂', },
    s = { to = '华山男休息室', cond = 'player.gender == "male"', },
  },
},

['华山男休息室'] = {
  id = '华山男休息室',
  area = '华山',
  name = '男休息室',
  desc =  [[这是间整洁的厢房，因门窗常闭着，光线很昏暗。房里别无他物，只有中间放着一张收拾得舒舒服服的大床，看着就让人想睡觉。]],
  exit = {
    n = { to = '华山侧廊#SE', },
  },
},

['华山山路#2'] = {
  id = '华山山路#2',
  area = '华山',
  name = '山路',
  desc =  [[这是通往华山派总堂的山路，但见山势险峻，树木清幽，鸟鸣嘤嘤，流水淙淙，这里已经看不见游客，偶尔会见到几只野兽出没。]],
  exit = {
    sw = { to = '华山小溪', },
    nw = { to = '华山山路#1', },
    su = { to = '华山台阶', },
  },
},

['华山书院'] = {
  id = '华山书院',
  area = '华山',
  name = '书院',
  desc =  [[这里是华山派的书院，平时华山派弟子在习武之余，都遵从师命到此学习武功秘籍，来提高自己的修为，特别是华山心法。]],
  exit = {
    w = { to = '华山侧廊#SE', },
    n = { to = '华山剑房', },
  },
},

['华山山脚下'] = {
  id = '华山山脚下',
  area = '华山',
  name = '山脚下',
  desc =  [[这里是华山脚下，南面就是素有「奇峰天下第一山」的西岳华山，华山由于远望宛如一朵白莲花，因而得名（古时，「华」与「花」通）。西面有个小村庄，北边有几间房屋。]],
  exit = {
    se = { to = '华山莎萝坪', },
    s = { to = '华山树林', },
    w = { to = '华山村东村口', },
    n = { to = '华山玉泉院', },
  },
},

['华山空地'] = {
  id = '华山空地',
  area = '华山',
  name = '空地',
  desc =  [[哑巴带着你攀登了一天，登上了一座高峰的绝顶，只见峰顶是一块很大的平地，四周古松耸立，穿过松林，眼前出现五六间石屋。]],
  exit = {
    sd = { to = '华山山涧#C', },
    n = { to = '华山松树林#1', },
  },
},

['华山前厅'] = {
  id = '华山前厅',
  area = '华山',
  name = '前厅',
  desc =  [[上得山来，忽然面前一片开阔，很多华山派弟子各自忙碌着。南边的房屋门上挂着一块匾，上书五个大字「有所不为轩」。]],
  exit = {
    e = { to = '华山侧廊#E', },
    nd = { to = '华山台阶', },
    w = { to = '华山侧廊#W', },
    s = { to = '华山正气堂', },
  },
},

['华山女休息室'] = {
  id = '华山女休息室',
  area = '华山',
  name = '女休息室',
  desc =  [[这是间整洁的厢房，因门窗常闭着，光线很昏暗。房里别无他物，只有中间放着一张收拾得舒舒服服的大床，看着就让人想睡觉。]],
  exit = {
    n = { to = '华山侧廊#SW', },
  },
},

['华山山涧#SE'] = {
  id = '华山山涧#SE',
  area = '华山',
  name = '山涧',
  desc =  [[山涧到这里就没有路了，你仰头望去，一片绝壁在你的头顶上，根本没有上去的可能，离你约莫四丈高的地方有一棵万年松(Songshu)正在随风摇摆。前面就是华山的万丈深渊。]],
  exit = {
    nw = { to = '华山山涧#C', },
    hidden = { to = '华山万年松', cmd = 'bang shengzi;climb up', cond = 'player.skill["基本轻功"] and player.skill["基本轻功"].level >= 20', },
  },
},

['华山万年松'] = {
  id = '华山万年松',
  area = '华山',
  name = '万年松',
  desc = [[这是一只大树枝，从一棵万年松上伸出。这棵松树生得高大苍劲，年代古远，树根由石缝中长出，紧紧攀着崖壁。]],
  exit = {
    enter = { to = '华山石洞', },
    d = { to = '华山山涧#SE', },
  },
},

['华山石洞'] = {
  id = '华山石洞',
  area = '华山',
  name = '石洞',
  desc = [[这是一个华山绝顶石壁上的一个不起眼的石洞，华山派高老者和矮老者就隐居在此。华山派弟子一般很少能够见到他们，如果能够见到，武功必然得到他们的大力指点。]],
  exit = {
    out = { to = '华山万年松', },
  },
},

['华山青柯坪'] = {
  id = '华山青柯坪',
  area = '华山',
  name = '青柯坪',
  desc =  [[走过崎岖的十八盘，穿过云门，就到了青柯坪。青柯坪是一山间盆地，地势略为平坦。从这里开始，上山的路都是由原地凿出的石阶。北壁下一块大石当路，此石叫做回心石，再上去山道奇险，游客至此，就该回头了。　　远远望见一个小小石亭，便是赌棋亭了。相传宋太祖与华夷先生曾弈棋于此，将华山作为赌注，宋太祖输了，从此华山上的土地就不须缴纳钱粮。]],
  exit = {
    eu = { to = '华山千尺幢', },
    nd = { to = '华山莎萝坪', },
  },
},

['华山苍龙岭'] = {
  id = '华山苍龙岭',
  area = '华山',
  name = '苍龙岭',
  desc =  [[华山五峰中最惊险的是北峰，北峰之上最陡峭的则是苍龙岭。此岭高约百米，宽仅一米，而登山之路则在其山脊之上，两侧脊坡光滑挺拔，其下悬崖深邃，云涛隐伏。岭侧有一石碑(shibei)。从这里往北是下山的路，往南是上其它华山四峰的路，西面是华山极险处之一，叫做“舍身崖”。]],
  exit = {
    nd = { to = '华山猢狲愁', },
    sd = { to = '华山镇岳宫', },
    wu = { to = '华山舍身崖', },
  },
},

['华山朝阳峰'] = {
  id = '华山朝阳峰',
  area = '华山',
  name = '朝阳峰',
  desc =  [[这里就是华山的东峰—朝阳峰，於此俯瞰，黄河隐显东迤如带，南望小孤峰背倚山河。东壁悬崖上，更有一个巨型掌印，相传为「河神巨灵」劈山时所留下的。西面有一片树林，灌木丛生，让人不敢深入。]],
  exit = {
    wd = { to = '华山镇岳宫', },
  },
},

['华山瀑布'] = {
  id = '华山瀑布',
  area = '华山',
  name = '瀑布',
  desc =  [[这里是一处峡谷，每年雨季山洪爆发时就形成了一处蔚为壮观的瀑布。传说当年神雕侠杨过就是在这里练成绝世的玄铁剑法的。现在人去谷空，只剩下空寥的山谷和飞流而下的瀑布(Pubu)，泉水从山上倾泻下来，形成一道水帘。在地下冲出一个深潭(Tan)。东边是华山玉女峰。]],
  exit = {
    e = { to = '华山玉女峰', },
    hidden = { to = '华山山涧#SW', cmd = 'tiao down', cond = '( player.dex >= 30 or ( player.enable.dodge and player.enable.dodge.level >= 100 ) ) and player.skill["基本轻功"] and player.skill["基本轻功"].level >= 140', },
    hidden = { to = '华山瀑布底', cmd = 'tiao tan;#wb 4500', },
  },
},

['华山瀑布底'] = {
  id = '华山瀑布底',
  area = '华山',
  name = '瀑布底',
  desc = [[你只觉得水下面黑咕隆咚的......，什么也看不清。]],
  exit = {
    hidden = { to = '华山瀑布', cmd = 'swim up', },
  },
},

['华山练武场#E'] = {
  id = '华山练武场#E',
  area = '华山',
  name = '练武场',
  desc =  [[这是华山派的练武场，厚厚的石墙上打有一排排手掌痕迹，地砖已被踩出一个个脚印。]],
  exit = {
    w = { to = '华山侧廊#E', },
    s = { to = '华山剑房', },
  },
},

['华山山涧#SW'] = {
  id = '华山山涧#SW',
  area = '华山',
  name = '山涧',
  desc =  [[这是华山里的一个山涧，旁边是由于上面的山泉常年累月冲击形成的一个很深的水潭。这里周围长满了灌木，东北的方向似乎能走过去。]],
  exit = {
    ne = { to = '华山山涧#C', },
  },
},

['华山后堂'] = {
  id = '华山后堂',
  area = '华山',
  name = '后堂',
  desc =  [[   这是华山派的后堂，来往的人不是很多，只看见几个仆人来回忙碌着。东西面分别是男女弟子休息的地方，南面是华山派掌门岳不群的寝室。]],
  exit = {
    e = { to = '华山侧廊#SE', },
    s = { to = '华山寝室', },
    w = { to = '华山侧廊#SW', },
    n = { to = '华山正气堂', },
  },
},

['华山小溪'] = {
  id = '华山小溪',
  area = '华山',
  name = '小溪',
  desc =  [[这里是峰下的一条小溪，每年雨季的时候，这里的水流就很急。其余的时候，只能看见被水冲刷的一条深沟.]],
  exit = {
    ne = { to = '华山山路#2', },
  },
},

['华山山洪瀑布'] = {
  id = '华山山洪瀑布',
  area = '华山',
  name = '山洪瀑布',
  desc =  [[转过一个山峡，水声震耳欲聋，只见山峰间一条白龙似的瀑布奔泻而下，冲入一条溪流，奔胜雷鸣，湍急异常，水中挟著树枝石块，转眼便流得不知去向。溪流(river)的中心有一块巨石(stone)。水花飞溅，四顾水气蒙蒙，蔚为奇观。那山洪势道猛烈，令人颇有惧意，还是别乱来的好。]],
  exit = {
    sw = { to = '华山莎萝坪', },
  },
},

['华山老君沟'] = {
  id = '华山老君沟',
  area = '华山',
  name = '老君沟',
  desc =  [[爬过两个要命的悬崖，你已经十分疲倦，可在这里稍作歇息。老君沟是一条半里多长的山沟，相传为太上老君所开，故名老君沟。]],
  exit = {
    wd = { to = '华山百尺峡', },
    su = { to = '华山猢狲愁', },
  },
},

['华山镇岳宫'] = {
  id = '华山镇岳宫',
  area = '华山',
  name = '镇岳宫',
  desc =  [[这里地势略为平坦，上、下山的游客多在此稍作休息再继续前行。附近有几间简陋的旅社，欲登东峰观日出者，大都于头晚歇息于此。]],
  exit = {
    nu = { to = '华山苍龙岭', },
    eu = { to = '华山朝阳峰', },
    su = { to = '华山玉女峰', },
  },
},

['华山侧廊#E'] = {
  id = '华山侧廊#E',
  area = '华山',
  name = '侧廊',
  desc =  [[这里是华山派总堂的侧廊, 庄严古朴, 两旁蜂舞蝶影，山花烂漫，好一派山地风光。再往东走，就是华山弟子的练武场了。]],
  exit = {
    w = { to = '华山前厅', },
    e = { to = '华山练武场#E', },
  },
},

['华山树林'] = {
  id = '华山树林',
  area = '华山',
  name = '树林',
  desc =  [[这里是华山村里的一片杨树林，如果你没有好身手，可千万不要在此地久留，据说这里强盗出没，抢劫、杀人的事情经常发生。]],
  exit = {
    e = { to = '华山松树林#1', },
    w = { to = '华山松树林#M', },
    n = { to = '华山松树林#M', },
  },
},

['华山松树林#1'] = {
  id = '华山松树林#1',
  area = '华山',
  name = '松树林',
  desc =  [[这是一片松树林。几十丈高的大松树簇在一块，密实的枝叶象一蓬蓬巨伞般伸向天空，把阳光遮得丝毫也无。尺把厚的松针积在地上，一脚踩下去，半天拔不出来。]],
  exit = {
    e = { to = '华山松树林#1', },
    s = { to = '华山空地', },
    w = { to = '华山松树林#1', },
    n = { to = '华山松树林#M', },
  },
},

['华山松树林#M'] = {
  id = '华山松树林#M',
  area = '华山',
  name = '松树林',
  desc =  [[你眼前骤然一黑，朦胧中，只见左右前后，到处都是铺天盖地的松树林。几十丈高的大松树簇在一块，密实的枝叶象一蓬蓬巨伞般伸向天空，把阳光遮得丝毫也无。尺把厚的松针积在地上，一脚踩下去，半天拔不出来。你似乎迷失了方向，象没头苍蝇般到处乱闯。]],
  exit = {
    s = { to = '华山松树林#M', },
    e = { to = '华山松树林#M', },
    n = { to = '华山松树林#M', },
    w = { to = '华山松树林#M', },
    hidden = { to = '华山松树林#E', cost = 5, handler = 'look_around', },
  },
},

['华山松树林#E'] = {
  id = '华山松树林#E',
  area = '华山',
  name = '松树林',
  desc =  [[你眼前骤然一黑，朦胧中，只见左右前后，到处都是铺天盖地的松树林。几十丈高的大松树簇在一块，密实的枝叶象一蓬蓬巨伞般伸向天空，把阳光遮得丝毫也无。尺把厚的松针积在地上，一脚踩下去，半天拔不出来。你似乎迷失了方向，象没头苍蝇般到处乱闯。]],
  exit = {
    e = { to = '华山石屋', },
    s = { to = '华山山脚下', },
    w = { to = '华山松树林#E', },
    n = { to = '华山空地', },
  },
},

['华山石屋'] = {
  id = '华山石屋',
  area = '华山',
  name = '石屋',
  desc =  [[你走进石屋，屋内尘封蛛结，显然是许久没有人住了。]],
  exit = {
    w = { to = '华山松树林#E', },
  },
},

['华山莎萝坪'] = {
  id = '华山莎萝坪',
  area = '华山',
  name = '莎萝坪',
  desc =  [[沿着玉泉，踏过累累石涧，由山径迤逦而上，就来到了莎萝坪。从这里山路开始陡峭，南面一条迂回盘旋的山道，称作「十八盘」，通往山上。]],
  exit = {
    ne = { to = '华山山洪瀑布', },
    nw = { to = '华山山脚下', },
    su = { to = '华山青柯坪', },
  },
},

['华山药房'] = {
  id = '华山药房',
  area = '华山',
  name = '药房',
  desc =  [[这里是华山派弟子提炼丹药的地方。几名弟子低头忙碌着，所有华山珍贵的丸药皆出于此处。]],
  exit = {
    s = { to = '华山饭厅', },
    n = { to = '华山练武场#W', },
  },
},

['嵩山碎石路#NW'] = {
  id = '嵩山碎石路#NW',
  area = '嵩山',
  name = '碎石路',
  desc =  [[出了峻极殿，便是这条由小碎石子铺成的石路，直通往东边的御书楼。清整的地面被打扫的干干净净，微风吹过，道路两边郁郁葱葱的松柏亦沙沙作响，地面却不见丁点灰尘。]],
  exit = {
    w = { to = '嵩山御书楼', },
    e = { to = '嵩山峻极殿', },
  },
},

['嵩山配天作镇坊'] = {
  id = '嵩山配天作镇坊',
  area = '嵩山',
  name = '配天作镇坊',
  desc =  [[往上行便是位于嵩山之巅的封禅台。向北望去，遥见成皋玉门，黄河有如一线，西向隐隐见到洛阳伊阙，东南两方皆是重重叠叠的山峰。]],
  exit = {
    nu = { to = '嵩山封禅台', },
    sd = { to = '嵩山石道#3', },
  },
},

['嵩山观胜峰'] = {
  id = '嵩山观胜峰',
  area = '嵩山',
  name = '观胜峰',
  desc =  [[站在这里，凌于瀑布之上，景色又是一番不同，处在一片山从之中，西北是绝顶，西面是嵩山的各个山峰，南面遥遥相望的便是地处少室山的嵩山少林寺(shaolin)，身处山中而不见归路。路边到处可见一堆堆的乱石。]],
  exit = {
    ed = { to = '嵩山观胜峰下', },
    nd = { to = '嵩山山路#3', },
  },
},

['嵩山旷地'] = {
  id = '嵩山旷地',
  area = '嵩山',
  name = '旷地',
  desc =  [[这是在绝顶的一片旷地，十分广大，以前的帝王来嵩天祭天时，侍卫部队在这里集合听命，现在却成了五岳剑派汇合的场所。]],
  exit = {
    s = { to = '嵩山太室阙', },
    n = { to = '嵩山峻极宫大门', },
  },
},

['嵩山封禅台'] = {
  id = '嵩山封禅台',
  area = '嵩山',
  name = '封禅台',
  desc =  [[封禅台为大麻石所建，每块大石都凿得极是平整，当年历代皇帝为了祭天祀福，不知驱使多少民工、石匠始建成此巨构。封禅台下是可以容纳数千人的广场，登临于此，可以望见大熊峰、小熊峰、双主峰、三尖峰和少林寺所在的少室山，不禁让人想起杜甫“齐鲁青未了”的绝句。]],
  exit = {
    sd = { to = '嵩山配天作镇坊', },
    hidden = { to = '嵩山观日峰', cmd = 'guan ri', cond = 'player.party == "嵩山派"', },
  },
},

['嵩山观日峰'] = {
  id = '嵩山观日峰',
  area = '嵩山',
  name = '观日峰',
  desc =  [[这里就是嵩山观日峰，往这里一站,你不禁有一种:          渺万里层云,千山暮雪,只影向谁去?的感觉,这里有几块石头,大概是练气士平时修炼打坐的地方!]],
  exit = {
    w = { to = '嵩山封禅台', },
  },
},

['嵩山岩壁'] = {
  id = '嵩山岩壁',
  area = '嵩山',
  name = '岩壁',
  desc =  [[你的身子紧紧的贴在岩壁上，丝毫不敢离开半分，谷中的寒风不断侵袭而来，你不禁打了个哆嗦。]],
  exit = {
    hidden = { to = '嵩山谷底', cmd = 'climb down', },
  },
},

['嵩山谷底'] = {
  id = '嵩山谷底',
  area = '嵩山',
  name = '谷底',
  desc =  [[谷内怪石嶙峋，竟没有一点出路可寻。此处的严寒非寻常地方可比，各个方向似乎都不断的有寒风吹来，寒冷异常。]],
  exit = {
  },
},

['嵩山掌门卧室'] = {
  id = '嵩山掌门卧室',
  area = '嵩山',
  name = '掌门卧室',
  desc =  [[一进卧室，一股清新的味道扑鼻而来，看到墙上挂着各种宝剑和字画，以及书架上摆满的书。从左冷禅的屋内装饰看，的确不失一代宗师的气派。]],
  exit = {
    w = { to = '嵩山寝殿', },
  },
},

['嵩山峻极宫大门'] = {
  id = '嵩山峻极宫大门',
  area = '嵩山',
  name = '峻极宫大门',
  desc =  [[峻极宫本是前朝佛教大寺，近百年来却已成为嵩山派的住所。大门两旁有两个巨大的石狮雕象，一旁旗帜飘扬，人影涌动，而门匾也早已换成了“嵩山剑派”四个大字。]],
  exit = {
    s = { to = '嵩山旷地', },
    n = { to = '嵩山峻极禅院', },
  },
},

['嵩山小铁梁峡'] = {
  id = '嵩山小铁梁峡',
  area = '嵩山',
  name = '小铁梁峡',
  desc =  [[这里的情形和大铁梁峡类似，不过道路更加狭窄，一阵山风袭来，人似乎就要被吹下千丈深渊，让人不寒而栗。]],
  exit = {
    nw = { to = '嵩山山路#4', },
    sd = { to = '嵩山大铁梁峡', },
    hidden = { to = '嵩山岩壁', no_wander = true, cmd = 'tie sheng;climb down', cond = 'player.flag["寒冰真气"]', },
  },
},

['嵩山太室阙'] = {
  id = '嵩山太室阙',
  area = '嵩山',
  name = '太室阙',
  desc =  [[在你眼前赫然耸立着一座太室阙，这是嵩山派的象征性大门，由整齐的青石块垒砌而成。看上去年代已经久远，上面长满了青苔。]],
  exit = {
    sd = { to = '嵩山山路#5', },
    n = { to = '嵩山旷地', },
  },
},

['嵩山遥参亭'] = {
  id = '嵩山遥参亭',
  area = '嵩山',
  name = '遥参亭',
  desc =  [[这是一座古色古香的亭台，由青砖整体铺构而成，亭上横卧一匾，上写着“遥参亭”三个隶书大字。向北边望去，远远能看见那里有一座琉光璃瓦的大殿，好不壮观。]],
  exit = {
    s = { to = '嵩山石道#1', },
    n = { to = '嵩山天中阁', },
  },
},

['嵩山青岗峰'] = {
  id = '嵩山青岗峰',
  area = '嵩山',
  name = '青岗峰',
  desc =  [[瀑布声已渐渐消失，而却景色蓦地开郎了许多，道路两旁，都是松林，松树高大而笔挺，路也平坦了很多。]],
  exit = {
    nu = { to = '嵩山青岗坪', },
    sd = { to = '嵩山山路#3', },
  },
},

['嵩山藏书阁'] = {
  id = '嵩山藏书阁',
  area = '嵩山',
  name = '藏书阁',
  desc =  [[嵩山派的藏书阁，书架上放满了嵩山各种武功书籍、心法，由于嵩山弟子众多，书有时也会供不应求。]],
  exit = {
    s = { to = '嵩山御书楼', },
  },
},

['嵩山石道#2'] = {
  id = '嵩山石道#2',
  area = '嵩山',
  name = '石道',
  desc =  [[石道通往封禅台地上的石砖铺得十分整齐，显然是嵩山派重修过的。道旁更是整齐地种着松柏。]],
  exit = {
    nu = { to = '嵩山崇高峻极坊', },
    s = { to = '嵩山天中阁', },
  },
},

['嵩山碎石路#NE'] = {
  id = '嵩山碎石路#NE',
  area = '嵩山',
  name = '碎石路',
  desc =  [[出了峻极殿，便是这条由小碎石子铺成的石路，直通往东边的寝殿。清整的地面被打扫的干干净净，微风吹过，道路两边郁郁葱葱的松柏亦沙沙作响，地面却不见丁点灰尘。]],
  exit = {
    w = { to = '嵩山峻极殿', },
    e = { to = '嵩山寝殿', },
  },
},

['嵩山药房'] = {
  id = '嵩山药房',
  area = '嵩山',
  name = '药房',
  desc =  [[从东边的碎石路一出来，便可以闻到一股浓浓的药香，让人精神为之一振，立马神清气爽。这里就是嵩山派的药房，里面各种灵丹妙药应有尽有，旁边还有几名嵩山弟子正在敷药疗伤。]],
  exit = {
    e = { to = '嵩山碎石路#SW', },
  },
},

['嵩山休息室#N'] = {
  id = '嵩山休息室#N',
  area = '嵩山',
  name = '休息室',
  desc =  [[这里是供嵩山派女弟子休息的房间，里面摆着几张大床。]],
  exit = {
    s = { to = '嵩山寝殿', },
  },
},

['嵩山寝殿'] = {
  id = '嵩山寝殿',
  area = '嵩山',
  name = '寝殿',
  desc =  [[这里是嵩山派弟子的休息之所，每天清晨，弟子们都会去峻极宫外旷地修习武艺。南北两边分别是男，女弟子的休息室，再往东就是嵩山掌门左冷禅的卧室。]],
  exit = {
    e = { to = '嵩山掌门卧室', },
    s = { to = '嵩山休息室#S', cond = 'player.gender ~= "female"', },
    w = { to = '嵩山碎石路#NE', },
    n = { to = '嵩山休息室#N', cond = 'player.gender == "female"', },
  },
},

['嵩山观胜峰下'] = {
  id = '嵩山观胜峰下',
  area = '嵩山',
  name = '观胜峰下',
  desc =  [[行了一程，忽听得水声如雷，峭壁上两条玉龙直挂下来，双瀑并泻，屈曲回旋，飞跃奔逸。向瀑布之侧向上望去，便是著名的观胜峰。瀑布气势之雄伟让人感到一种敬畏之情。]],
  exit = {
    se = { to = '嵩山山路#2', },
    wu = { to = '嵩山观胜峰', },
  },
},

['嵩山休息室#S'] = {
  id = '嵩山休息室#S',
  area = '嵩山',
  name = '休息室',
  desc =  [[这里是供嵩山派男弟子休息的房间，里面摆着几张大床。]],
  exit = {
    n = { to = '嵩山寝殿', },
  },
},

['嵩山膳房'] = {
  id = '嵩山膳房',
  area = '嵩山',
  name = '膳房',
  desc =  [[从碎石路出来，便是膳房，不断有阵阵菜香飘出。里面饭厅极大，足可容纳上千人同时用膳，从东到西摆放了一排排的餐桌和长凳。几名厨师正在紧张的忙碌着，也有不少的嵩山弟子在这里来打杂干活。]],
  exit = {
    w = { to = '嵩山碎石路#SE', },
  },
},

['嵩山掌门书房'] = {
  id = '嵩山掌门书房',
  area = '嵩山',
  name = '掌门书房',
  desc =  [[这里是左冷禅平时读书的地方，窗明几净，一尘不染。一张古意盎然的书案摆放在房间的正中，案上摆着几本翻开了的线装书籍。]],
  exit = {
    e = { to = '嵩山御书楼', },
  },
},

['嵩山石道#3'] = {
  id = '嵩山石道#3',
  area = '嵩山',
  name = '石道',
  desc =  [[石道通往封禅台地上的石砖铺得十分整齐，显然是嵩山派重修过的。道旁更是整齐地种着松柏。]],
  exit = {
    nu = { to = '嵩山配天作镇坊', },
    sd = { to = '嵩山峻极殿', },
  },
},

['嵩山御书楼'] = {
  id = '嵩山御书楼',
  area = '嵩山',
  name = '御书楼',
  desc =  [[穿过碎石路，你来到了这座御书楼面前，它是嵩山派的武学秘籍等珍贵书籍的藏居之所。北边是专供弟子们研习武功的藏书阁，南边是放置兵器的轩辕剑阁，再往东行就是左冷禅的书房。]],
  exit = {
    e = { to = '嵩山碎石路#NW', },
    s = { to = '嵩山轩辕剑阁', },
    w = { to = '嵩山掌门书房', },
    n = { to = '嵩山藏书阁', },
  },
},

['嵩山山路#2'] = {
  id = '嵩山山路#2',
  area = '嵩山',
  name = '山路',
  desc =  [[行路似乎越来越难了，沿着道路西行山路出现了岔道，你向路边望去发现一个路标(sign)指引你的方向。一阵清风袭来，松涛阵阵。而向东的路则趋向平坦了。]],
  exit = {
    nw = { to = '嵩山观胜峰下', },
    e = { to = '嵩山山路#1', },
  },
},

['嵩山大铁梁峡'] = {
  id = '嵩山大铁梁峡',
  area = '嵩山',
  name = '大铁梁峡',
  desc =  [[这里的道路十分限险，向道路之右望去，铁梁峡之右尽是怪石，道路左侧却是万仞深壑，渺不见底。不禁让人胆颤心惊。]],
  exit = {
    nu = { to = '嵩山小铁梁峡', },
    sd = { to = '嵩山青岗坪', },
  },
},

['嵩山山路#4'] = {
  id = '嵩山山路#4',
  area = '嵩山',
  name = '山路',
  desc =  [[道路到此一转，前面云雾迷朦，但又开始显得宽阔而比较平坦了，这里已经接近嵩山的绝顶了。]],
  exit = {
    nw = { to = '嵩山朝天门', },
    se = { to = '嵩山小铁梁峡', },
  },
},

['嵩山朝天门'] = {
  id = '嵩山朝天门',
  area = '嵩山',
  name = '朝天门',
  desc =  [[走到这里，双峰中断，天然现出一个门户，疾风从断绝处吹出，云雾随风扑面而至。]],
  exit = {
    ne = { to = '嵩山山路#5', },
    se = { to = '嵩山山路#4', },
  },
},

['嵩山山路#1'] = {
  id = '嵩山山路#1',
  area = '嵩山',
  name = '山路',
  desc =  [[行路至此，道路开始崎岖不平，向西望去，不禁让人精神一振，只见高山峻林于前，路边有块石壁(wall)，高山、阳光、绿林和鸟啼声，让人豪气顿生，心旷神怡。]],
  exit = {
    w = { to = '嵩山山路#2', },
    d = { to = '嵩山少林石阶#6', },
  },
},

['嵩山峻极禅院'] = {
  id = '嵩山峻极禅院',
  area = '嵩山',
  name = '峻极禅院',
  desc =  [[这里是嵩山峻极宫之峻极禅院，也是是嵩山派的据点。以前曾是寺院，现在院子却是中古柏森森，殿上并无佛像，大殿虽也极大，可比之少林寺的大雄宝殿却还有不如，可以容纳近千人。几名嵩山派弟子正提剑巡逻。]],
  exit = {
    s = { to = '嵩山峻极宫大门', },
    n = { to = '嵩山石道#1', },
  },
},

['嵩山天中阁'] = {
  id = '嵩山天中阁',
  area = '嵩山',
  name = '天中阁',
  desc =  [[此处位于嵩山派峻极禅院的中部，又名天中。由此再往前行，便是嵩山最大的殿堂：峻极殿。东西两面各有一条碎石路直通这里。]],
  exit = {
    e = { to = '嵩山碎石路#SE', },
    s = { to = '嵩山遥参亭', },
    w = { to = '嵩山碎石路#SW', },
    n = { to = '嵩山石道#2', },
  },
},

['嵩山碎石路#SE'] = {
  id = '嵩山碎石路#SE',
  area = '嵩山',
  name = '碎石路',
  desc =  [[从天中阁往东，便是这条由小碎石子铺成的石路，直通往东边的膳房。清整的地面被打扫的干干净净，微风吹过，道路两边的松柏亦沙沙作响，地面却不见丁点灰尘。]],
  exit = {
    w = { to = '嵩山天中阁', },
    e = { to = '嵩山膳房', },
  },
},

['嵩山碎石路#SW'] = {
  id = '嵩山碎石路#SW',
  area = '嵩山',
  name = '碎石路',
  desc =  [[从天中阁往西，便是这条由小碎石子铺成的石路，直通往西边的药房。清整的地面被打扫的干干净净，微风吹过，道路两边的松柏亦沙沙作响，地面却不见丁点灰尘。]],
  exit = {
    w = { to = '嵩山药房', },
    e = { to = '嵩山天中阁', },
  },
},

['嵩山山路#3'] = {
  id = '嵩山山路#3',
  area = '嵩山',
  name = '山路',
  desc =  [[这里处于群山峻岭之中，观胜峰已在身后，而瀑布声仍不绝于耳，如果没有熟人领路，也许十分容易迷路。]],
  exit = {
    nu = { to = '嵩山青岗峰', },
    su = { to = '嵩山观胜峰', },
  },
},

['嵩山山路#5'] = {
  id = '嵩山山路#5',
  area = '嵩山',
  name = '山路',
  desc =  [[这段是通往绝顶的山路，已经可以望见绝顶的旷地，十分巨大，而路的两旁也有不少树木，偶而会有一些雕像，有一种庄严的气派。]],
  exit = {
    nu = { to = '嵩山太室阙', },
    sw = { to = '嵩山朝天门', },
  },
},

['嵩山崇高峻极坊'] = {
  id = '嵩山崇高峻极坊',
  area = '嵩山',
  name = '崇高峻极坊',
  desc =  [[一座宏伟的大殿赫然屹立眼前，整个为上好红木构成，殿顶镶满了琉璃瓦，一派皇家气息。相传这里为秦朝末年所筑，以后亦是历代帝王所好之处。]],
  exit = {
    sd = { to = '嵩山石道#2', },
    n = { to = '嵩山峻极殿', },
  },
},

['嵩山轩辕剑阁'] = {
  id = '嵩山轩辕剑阁',
  area = '嵩山',
  name = '轩辕剑阁',
  desc =  [[剑阁里放着各种长短剑及其它兵器防具，起名“轩辕”却足见左冷禅有一统武林的野心。]],
  exit = {
    n = { to = '嵩山御书楼', },
  },
},

['嵩山石道#1'] = {
  id = '嵩山石道#1',
  area = '嵩山',
  name = '石道',
  desc =  [[石道通过禅院前往封禅台，地上的石砖铺得十分整齐，显然是嵩山派重修过的。道旁更是整齐地种着松柏。]],
  exit = {
    s = { to = '嵩山峻极禅院', },
    n = { to = '嵩山遥参亭', },
  },
},

['嵩山峻极殿'] = {
  id = '嵩山峻极殿',
  area = '嵩山',
  name = '峻极殿',
  desc =  [[整个大殿红墙黄瓦，金碧辉煌，是嵩山派的正殿，亦称中岳大殿。外派上山偈拜大都在此等候左冷禅的召见，由此可见左冷禅意欲一统武林的野心。]],
  exit = {
    nu = { to = '嵩山石道#3', },
    w = { to = '嵩山碎石路#NW', },
    s = { to = '嵩山崇高峻极坊', },
    e = { to = '嵩山碎石路#NE', },
  },
},

['嵩山青岗坪'] = {
  id = '嵩山青岗坪',
  area = '嵩山',
  name = '青岗坪',
  desc =  [[这里是一块很大的空地，从道路向北望去，是一大片山谷，而南向则是大片松林，东西面的山峰仍高高地挡住了视线。]],
  exit = {
    nu = { to = '嵩山大铁梁峡', },
    sd = { to = '嵩山青岗峰', },
  },
},

['柳宗镇前厅'] = {
  id = '柳宗镇前厅',
  area = '柳宗镇',
  name = '前厅',
  desc =  [[这是薛府的前厅，由于修建年代久远，看起来已颇为陈旧，但因光线充足完全没有陈年旧宅的阴晦之气。右首有一个书架，琳琅满目，全是各种医书，一看就知道这里的主人对医学很有研究。]],
  exit = {
    s = { to = '柳宗镇薛府大门', },
    n = { to = '柳宗镇天井#2', },
  },
},

['柳宗镇正厅#2'] = {
  id = '柳宗镇正厅#2',
  area = '柳宗镇',
  name = '正厅',
  desc =  [[这里是薛府的正厅,周围的墙上挂着几幅字画,似乎出自名家手笔,正中挂有一幅中堂(zhongtang)。屋子打扫的很干净,一张八仙桌,几把椅子放在墙角。屋子里隐隐有一股药草的香气。]],
  exit = {
    s = { to = '柳宗镇天井#2', },
  },
},

['柳宗镇四季小吃店'] = {
  id = '柳宗镇四季小吃店',
  area = '柳宗镇',
  name = '四季小吃店',
  desc =  [[这是一家小酒馆，店里空荡荡的。没有多少人来这里吃饭，所以生意不是很兴隆。屋子里零零散散摆着几张桌椅。几个无聊的闲人围在一个过路的外乡客人周围，听他在讲山外面的新鲜事。]],
  exit = {
    e = { to = '柳宗镇柳宗镇', },
  },
},

['柳宗镇薛府大门'] = {
  id = '柳宗镇薛府大门',
  area = '柳宗镇',
  name = '薛府大门',
  desc =  [[江湖上最有名气的薛慕华，薛神医就住在这里。年代久远的红门有的地方已经班驳，但是没有丝毫破败的样子。一扇大门常年开着，门前挤满了前来求医的人们，其中有不少都走南闯北的武林人士。]],
  exit = {
    s = { to = '柳宗镇小河', },
    n = { to = '柳宗镇前厅', },
  },
},

['柳宗镇侧廊#2'] = {
  id = '柳宗镇侧廊#2',
  area = '柳宗镇',
  name = '侧廊',
  desc =  [[只见红栏碧瓦，一派富贵气象，不时有几只蝴蝶、蜜蜂等可爱的飞禽灵巧的从廊间飞过，北边通向后院，东边是一条长廊。]],
  exit = {
    e = { to = '柳宗镇侧廊#1', },
    n = { to = '柳宗镇后院', },
  },
},

['柳宗镇花园'] = {
  id = '柳宗镇花园',
  area = '柳宗镇',
  name = '花园',
  desc =  [[这个花园虽然不大，但整理的井井有条，种植着各式各样的花花草草，看的出这里的主人下了一番功夫，常有人来这里散步。沿着弯弯曲曲的花径，可以通向后院。]],
  exit = {
    s = { to = '柳宗镇后院', },
  },
},

['柳宗镇小路'] = {
  id = '柳宗镇小路',
  area = '柳宗镇',
  name = '小路',
  desc =  [[这是通往柳宗镇的一条小路，行人不是很多。路上偶尔能看到车轮碾压过的痕迹。路两旁长满了低矮的灌木，树林里不时传出一两声鸟叫。再往北边走就是柳宗镇了。]],
  exit = {
    s = { to = '襄阳城小路#1', },
    n = { to = '柳宗镇柳宗镇', },
  },
},

['柳宗镇药房'] = {
  id = '柳宗镇药房',
  area = '柳宗镇',
  name = '药房',
  desc =  [[这是薛府的药房。各种灵丹妙药，医学典籍，应有尽有。其中不少都是世面上很难见到的。东首有个书架，上面摆着从各地收集来的医书医典。这里灵丹飘香，一进来就能令你精神一展。北面是一条走廊。]],
  exit = {
    n = { to = '柳宗镇侧廊#1', },
  },
},

['柳宗镇小河'] = {
  id = '柳宗镇小河',
  area = '柳宗镇',
  name = '小河',
  desc =  [[一条弯弯曲曲的小河，河上架着个独木桥，你走在桥上，脚下发出吱吱的声音。远处有几个顽皮的小孩子在河边嬉戏。桥对面是一家很大的宅院。可以看见一扇朱红的大门。南边是柳宗镇。]],
  exit = {
    s = { to = '柳宗镇柳宗镇', },
    n = { to = '柳宗镇薛府大门', },
  },
},

['柳宗镇后院'] = {
  id = '柳宗镇后院',
  area = '柳宗镇',
  name = '后院',
  desc =  [[这里是薛府的後院，打扫的非常干净，错落有序的放着几把藤椅。北边是一个花园，种植着各种花草，南边是侧廊。]],
  exit = {
    s = { to = '柳宗镇侧廊#2', },
    n = { to = '柳宗镇花园', },
  },
},

['柳宗镇侧廊#1'] = {
  id = '柳宗镇侧廊#1',
  area = '柳宗镇',
  name = '侧廊',
  desc =  [[只见红栏碧瓦，一派富贵气象，不时有几只蝴蝶、蜜蜂等可爱的飞禽灵巧的从廊见飞过，西边是长廊，东边通向天井。]],
  exit = {
    e = { to = '柳宗镇天井#2', },
    s = { to = '柳宗镇药房', },
    w = { to = '柳宗镇侧廊#2', },
  },
},

['柳宗镇天井#2'] = {
  id = '柳宗镇天井#2',
  area = '柳宗镇',
  name = '天井',
  desc =  [[你一走进天井，便会看见彩色方砖铺成的路面，路周围种着四季花草，两边有几个不错的院落，虽是个小小的天井，布置的也是精巧细致，别具匠心。]],
  exit = {
    s = { to = '柳宗镇前厅', },
    w = { to = '柳宗镇侧廊#1', },
    n = { to = '柳宗镇正厅#2', },
  },
},

['柳宗镇柳宗镇'] = {
  id = '柳宗镇柳宗镇',
  area = '柳宗镇',
  name = '柳宗镇',
  desc =  [[欢迎来到柳宗镇。这个镇子不大，但是在武林中却很有名气，因为这个镇子上住着一位大大有名的神医，人们谈论起他来，脸上都情不自禁露出自豪的神色。西边有一家小酒馆，再往北边走是一条小河。]],
  exit = {
    s = { to = '柳宗镇小路', },
    w = { to = '柳宗镇四季小吃店', },
    n = { to = '柳宗镇小河', },
  },
},

['扬州城长江渡船#W'] = {
  id = '扬州城长江渡船#W',
  area = '扬州城',
  name = '长江渡船',
  desc =  [[一叶小舟，最多也就能载七、八个人。一名六十多岁的老艄公手持一根长竹篙，正在船尾吃力地撑着船。]],
  exit = {
    out2 = { to = '扬州城长江南岸#W', unstable = true, handler = 'disembark', cost = 50, },
    out = { to = '扬州城长江北岸#W', unstable = true, handler = 'disembark', cost = 50, },
  },
},

['扬州城码头'] = {
  id = '扬州城码头',
  area = '扬州城',
  name = '码头',
  desc =  [[这里是扬州东门外古老的运河水运码头，只见大运河水蜿蜒流淌，从扬州城中穿过。运河的两岸种着一排排青青的垂杨柳，一阵微风吹来，树枝随风摇荡。在扬州城里出门最好的交通工具就是船了。远处的河上可以望见一艘小船的影子，船首依稀有一位老船夫。河边的地上立着一个石碑(shibei)。]],
  exit = {
    n = { to = '扬州城东门', },
  },
},

['扬州城天阁斋'] = {
  id = '扬州城天阁斋',
  area = '扬州城',
  name = '天阁斋',
  desc =  [[这是一家老字号的钱庄，已有几百年的历史，在全国各地都有分店。它发行的银票信誉非常好，通行全国。]],
  exit = {
    e = { to = '扬州城北大街#2', },
  },
},

['扬州城东大街#1'] = {
  id = '扬州城东大街#1',
  area = '扬州城',
  name = '东大街',
  desc =  [[这是一条宽阔的青石板街道，向东西两头延伸。东边不时地传来朗朗的书声，西北边是一个热闹的广场，南边则是一家古香古色的店铺，里边不时传出用乐器吹奏的曲调。]],
  exit = {
    e = { to = '扬州城东大街#2', },
    s = { to = '扬州城乐器店', },
    w = { to = '扬州城广场南', },
    n = { to = '扬州城广场东', },
  },
},

['扬州城拱猪南房'] = {
  id = '扬州城拱猪南房',
  area = '扬州城',
  name = '拱猪南房',
  desc =  [[这是一间专门为拱猪而特别设计的拱猪房。房间里面灯火通明，仿佛永远准备着为拱猪狂们服务似的。房间的中心放着一张用百年老松树木材特制的拱猪桌(table)，周围放着四把楠木靠背椅。桌子上摆着一本记分簿(scoreboard)，北边的墙上贴着一张纸(paper)。]],
  exit = {
    n = { to = '扬州城赌场#U', },
  },
},

['扬州城湖畔'] = {
  id = '扬州城湖畔',
  area = '扬州城',
  name = '湖畔',
  desc =  [[瘦西湖湖山青水秀，碧波涟漪，湖光山色，相映成趣，泛舟湖上犹如镜中行，漫步湖堤则如画中游。西湖之美令人陶醉。自古以来，人们常以艳、娇、媚、秀、柔、嫩来形容她。]],
  exit = {
    s = { to = '扬州城西大街#2', },
    n = { to = '扬州城瘦西湖', },
  },
},

['扬州城西大街#1'] = {
  id = '扬州城西大街#1',
  area = '扬州城',
  name = '西大街',
  desc =  [[这是一条宽阔的青石板街道，向东西两头延伸。北边是一片青色的楼房，隐约传来阵阵的浪笑，那就是天下闻名的鸣玉坊。这里往东南面走是一个热闹的广场。西面就是瘦西湖了。]],
  exit = {
    e = { to = '扬州城广场北', },
    s = { to = '扬州城广场西', },
    w = { to = '扬州城西大街#2', },
    n = { to = '扬州城鸣玉坊', cond = 'player.age >= 18', },
  },
},

['扬州城西郊'] = {
  id = '扬州城西郊',
  area = '扬州城',
  name = '西郊',
  desc =  [[你走在一条青石大道上，人来人往非常繁忙，不时有人骑着马匆匆而过。大道往西进入安徽境内。东边通向扬州城。]],
  exit = {
    e = { to = '扬州城西门', },
    w = { to = '襄阳城青石大道#1E', },
    nw = { to = '扬州城得胜山', },
  },
},

['扬州城长江渡船#C'] = {
  id = '扬州城长江渡船#C',
  area = '扬州城',
  name = '长江渡船',
  desc =  [[一叶小舟，最多也就能载七、八个人。一名六十多岁的老艄公手持一根长竹篙，正在船尾吃力地撑着船。]],
  exit = {
    out2 = { to = '扬州城长江南岸#C', unstable = true, handler = 'disembark', cost = 51, },
    out = { to = '扬州城长江北岸#C', unstable = true, handler = 'disembark', cost = 51, },
  },
},

['扬州城南大街#1'] = {
  id = '扬州城南大街#1',
  area = '扬州城',
  name = '南大街',
  desc =  [[南大街乃是扬州城里的繁华地段，一到晚上，一派灯红酒绿，尤为热闹。笑声、歌声、琴声、箫声，汇成一片送入了你的耳朵，你不禁心猿意马，很想就此停步享受一番。东北边是一个热闹的广场。西边是一片喧嚣，夹杂着“一五一十”的数钱声，原来那里是方圆千里之内最大的一家赌场。]],
  exit = {
    e = { to = '扬州城广场南', },
    s = { to = '扬州城南大街#2', },
    w = { to = '扬州城赌场#C', },
    n = { to = '扬州城广场西', },
  },
},

['扬州城丽春院'] = {
  id = '扬州城丽春院',
  area = '扬州城',
  name = '丽春院',
  desc =  [[这便是扬州城鸣玉坊四大院子之一丽春院。华灯初上，院子中一片丝竹和欢笑之声，中间又夹杂着猜枚行令，唱曲闹酒，当真是笙歌处处，一片升平景象。老板娘便是当朝大红人鹿鼎公的老娘韦春芳, 她正“咯咯”笑个不停。]],
  exit = {
    e = { to = '扬州城东厢房', },
    w = { to = '扬州城西厢房', },
    s = { to = '扬州城鸣玉坊', },
  },
},

['扬州城药铺'] = {
  id = '扬州城药铺',
  area = '扬州城',
  name = '药铺',
  desc =  [[这是一家药铺，一股浓浓的药味让你几欲窒息，那是从药柜上的几百个小抽屉里散发出来的。药铺老板坐在茶几旁，独自喝着茶。一名小伙计站在柜台后招呼着顾客。柜台上贴着一张发黄的广告(guanggao)。]],
  exit = {
    s = { to = '扬州城东大街#3', },
  },
},

['扬州城东大街#4'] = {
  id = '扬州城东大街#4',
  area = '扬州城',
  name = '东大街',
  desc =  [[你走在东大街上，踩着坚实的青石板地面。东边是东城门，可以听到守城官兵的盘查声。北边是一家打铁铺，敲敲打打的声音不断从其中传出来。南边是家兵器铺，人来人往生意很是兴旺。]],
  exit = {
    e = { to = '扬州城东门', },
    s = { to = '中原神州兵器铺', },
    w = { to = '扬州城东大街#3', },
    n = { to = '中原神州打铁铺', },
  },
},

['扬州城赌场大厅'] = {
  id = '扬州城赌场大厅',
  area = '扬州城',
  name = '赌场大厅',
  desc =  [[你一走进这房间，只听到玎玲玲，玎玲玲骰子落碗之声，说不出的悦耳动听。房里已聚着五六个人，都是一般的打扮，正在聚精会神的掷骰子，抬头一望有匾（ｓｉｇｎ）一块。]],
  exit = {
    e = { to = '扬州城赌场#C', },
    d = { to = '扬州城地下黑拳市', no_wander = true },
    n = { to = '扬州城赛龟房', },
  },
},

['扬州城长江渡船#E'] = {
  id = '扬州城长江渡船#E',
  area = '扬州城',
  name = '长江渡船',
  desc =  [[一叶小舟，最多也就能载七、八个人。一名六十多岁的老艄公手持一根长竹篙，正在船尾吃力地撑着船。]],
  exit = {
    out2 = { to = '扬州城长江南岸#E', unstable = true, handler = 'disembark', cost = 50, },
    out = { to = '扬州城长江北岸#E', unstable = true, handler = 'disembark', cost = 50, },
  },
},

['扬州城广场西'] = {
  id = '扬州城广场西',
  area = '扬州城',
  name = '广场西',
  desc =  [[这是广场的西侧。西边是扬州戌守兵营的所在，由于门前戒备森严，所以行人稀少，静悄悄地很是冷清。南边是城里最繁华的南大街。]],
  exit = {
    e = { to = '扬州城中央广场', },
    s = { to = '扬州城南大街#1', },
    w = { to = '扬州城兵营大门', },
    n = { to = '扬州城西大街#1', },
  },
},

['扬州城北大街#3'] = {
  id = '扬州城北大街#3',
  area = '扬州城',
  name = '北大街',
  desc =  [[这是一条宽阔的青石街道，向南北两头延伸。北边是北城门通向城外。南边显得很繁忙。东边是一家小吃店，店面窄小，恐怕只供应外卖。西边就是城隍庙。]],
  exit = {
    e = { to = '扬州城小吃店', },
    s = { to = '扬州城北大街#2', },
    w = { to = '扬州城城隍庙', },
    n = { to = '扬州城北门', },
  },
},

['扬州城书院'] = {
  id = '扬州城书院',
  area = '扬州城',
  name = '书院',
  desc =  [[这里就是顾炎武晚年隐居, 教书谈文的扬州书院。你一抬头，就见到壁上挂着一幅高约五尺，宽约丈许的大画，绘的是一大片山水，笔势纵横，气象雄伟，你不禁喝了声采。画上只题了四个大字：“如此江山”。你走到画前仔细观看，只见大江浩浩东流，两岸峰峦无数，点缀着奇树怪石，只是画中云气弥漫，山川虽美，却令人一见之下，胸臆间顿生郁积之气。顾先生的身后还有一幅字贴(zitie)。]],
  exit = {
    u = { to = '扬州城巫师雕像陈列室', },
    s = { to = '扬州城东大街#2', },
  },
},

['扬州城赌场#S'] = {
  id = '扬州城赌场#S',
  area = '扬州城',
  name = '赌场',
  desc =  [[这里是一个骨骰房，房间不大，挤满了急于翻本的人，屋子中间的桌子边上站着一位四十多岁的人，正在那里吆五喝六，一看就是一个赌场高手，被老板请来做庄家。墙上挂着一块牌子(paizi)。]],
  exit = {
    n = { to = '扬州城赌场#C', },
  },
},

['扬州城品棋亭'] = {
  id = '扬州城品棋亭',
  area = '扬州城',
  name = '品棋亭',
  desc =  [[亭中有一张石桌，上面划着一张围棋盘。桌角摆放着棋子。另外还有两张石凳，颜色一深一浅。]],
  exit = {
    n = { to = '扬州城乐器店', },
  },
},

['扬州城鸣玉坊'] = {
  id = '扬州城鸣玉坊',
  area = '扬州城',
  name = '鸣玉坊',
  desc =  [[这便是扬州城里妓院最集中的鸣玉坊了，因为座落在瘦西湖边，所以往来的游人、嫖客络绎不绝。南面是扬州的西大街，北面是一座大院子。]],
  exit = {
    s = { to = '扬州城西大街#1', },
    n = { to = '扬州城丽春院', },
  },
},

['扬州城长江北岸#C'] = {
  id = '扬州城长江北岸#C',
  area = '扬州城',
  name = '长江北岸',
  desc =  [[面前是一条波涛翻滚的大江(river)。 浊流滚滚，万舟竞发。两岸渡船来来往往，江边一长溜摆满了鱼摊，渔家就将船泊在岸边，支一块木板，板上摆满了活蹦乱跳的鲤鱼。不远处是一个摆渡，不少过江客都在这里等待渡船。]],
  exit = {
    e = { to = '扬州城长江北岸#E', },
    enter = { to = '扬州城长江渡船#C', cmd = 'dujiang', unstable = true, handler = 'cross_cj', no_wander = true, },
    w = { to = '扬州城长江北岸#W', },
    n = { to = '扬州城南门', },
  },
},

['扬州城巫师雕像陈列室'] = {
  id = '扬州城巫师雕像陈列室',
  area = '扬州城',
  name = '巫师雕像陈列室',
  desc =  [[]],
  exit = {
    d = { to = '扬州城书院', },
  },
},

['扬州城当铺'] = {
  id = '扬州城当铺',
  area = '扬州城',
  name = '当铺',
  desc =  [[这是一家素以买卖公平著称的老字号当铺，一个四尺高的柜台摆在你的面前，柜台上摆着一个牌子(paizi)， 柜台后坐着当铺的老板，一双鬼溜溜的眼睛上上下下打量着你，听说这里正在大量收讫『书剑通宝』。]],
  exit = {
    n = { to = '扬州城广场南', },
  },
},

['扬州城珠宝店'] = {
  id = '扬州城珠宝店',
  area = '扬州城',
  name = '珠宝店',
  desc =  [[这是一家装饰豪华的珠宝店。厅内摆满了各种金银玉器，将四周映得金碧辉煌。几个富商模样的人正在低头仔细地挑拣着，老板在不厌其烦地推销着。]],
  exit = {
    n = { to = '扬州城西大街#3', },
  },
},

['扬州城北门'] = {
  id = '扬州城北门',
  area = '扬州城',
  name = '北门',
  desc =  [[这是就是扬州城的北城门了，城门口一队队官兵正在盘查过往的百姓，一个手持长剑身穿铁甲武将正在门口巡视，近些时候因为江南一带的贩私盐愈演愈烈，所以朝廷以办事不利的罪名撤消了程要发的官职，上京问斩了，派了一位新的巡抚大人，弄的现在人心惶惶，谁都不敢在城门久留。城门的墙上张贴着一纸告示(gaoshi)。]],
  exit = {
    s = { to = '扬州城北大街#3', },
    n = { to = '扬州城北门外', },
  },
},

['扬州城拱猪东房'] = {
  id = '扬州城拱猪东房',
  area = '扬州城',
  name = '拱猪东房',
  desc =  [[这是一间专门为拱猪而特别设计的拱猪房。房间里面灯火通明，仿佛永远准备着为拱猪狂们服务似的。房间的中心放着一张用百年老松树木材特制的拱猪桌(table)，周围放着四把楠木靠背椅。桌子上摆着一本记分簿(scoreboard)，北边的墙上贴着一张纸(paper)。]],
  exit = {
    w = { to = '扬州城赌场#U', },
  },
},

['极乐世界会客室'] = {
  id = '极乐世界会客室',
  area = '极乐世界',
  name = '会客室',
  desc = [[这里是管理员的会客室，是用来接待玩家的地方。室内窗明几净，陈设简单。楼上是一间休息室，管理员平常都是在那里休息。一般玩家到这里后就上不去了。东面的出口通往扬州城隍庙。    边上有台饮水机可以(drink),不过好象没有提供点心。]],
  exit = {
    u = { to = '极乐世界巫师休息室', ignore = true, },
    se = { to = '扬州城城隍庙', },
  },
},

['扬州城东厅'] = {
  id = '扬州城东厅',
  area = '扬州城',
  name = '东厅',
  desc =  [[这里是衙门东厅，是知府待客的所在。厅中摆着一张杉木圆桌图刚椅子，桌上是一套精致的宜兴瓷器。墙上挂着一幅中堂，画的是百鸟朝奉图，内行人一看就知是唐寅的手笔。]],
  exit = {
    w = { to = '扬州城衙门正厅', },
  },
},

['扬州城瘦西湖雅楼'] = {
  id = '扬州城瘦西湖雅楼',
  area = '扬州城',
  name = '瘦西湖雅楼',
  desc =  [[这里是雅座，文人学士经常在这里吟诗作画，富商土豪也在这里边吃喝边作交易。这里也是城里举办喜宴的最佳场所。楼上有一阁, 从阁中往外眺望，只觉得心旷神怡。东面就是闻名的瘦西湖, 碧波荡漾。北面是崇山峻岭，而南面可以看到白鹿书院的后庭。这里坐了几桌客人，有文有武，还有一些围在一张卷帛(juanbo)旁评论着什么。]],
  exit = {
    d = { to = '扬州城瘦西湖酒馆', },
  },
},

['扬州城客店二楼#1'] = {
  id = '扬州城客店二楼#1',
  area = '扬州城',
  name = '客店二楼',
  desc =  [[你正走在客店二楼的走廊上，可以听到从客房里不时地呼呼的打酣声，一阵高过一阵。不时有睡意朦胧的旅客进进出出，到楼下的掌柜处付了钱再上来睡觉。]],
  exit = {
    enter = { to = '扬州城客店二楼#2', },
    d = { to = '扬州城宝昌客栈', },
  },
},

['扬州城广场东'] = {
  id = '扬州城广场东',
  area = '扬州城',
  name = '广场东',
  desc =  [[这是广场的东侧。东边是一家车马行，显然是为驿站提供服务的。偶尔从里边传来一阵马的嘶鸣声。北面就是有钱庄、客店的北大街了，从那里的大路出去可直达京城。]],
  exit = {
    e = { to = '扬州城车马行', },
    s = { to = '扬州城东大街#1', },
    w = { to = '扬州城中央广场', },
    n = { to = '扬州城北大街#1', },
  },
},

['扬州城赛龟房'] = {
  id = '扬州城赛龟房',
  area = '扬州城',
  name = '赛龟房',
  desc =  [[一排紫色的镂空檀香靠背椅沿着屋子四周放了一圈，坐着聚精会神的客人。中间是一雕花石座，上面放着一个长长的紫檀龟台。一位扎着青鬏的龟童正围着龟台转来转去。龟房的墙上挂着牌子(paizi)。]],
  exit = {
    s = { to = '扬州城赌场大厅', },
  },
},

['扬州城英烈夫人庙'] = {
  id = '扬州城英烈夫人庙',
  area = '扬州城',
  name = '英烈夫人庙',
  desc =  [[这儿就是英烈夫人庙，供奉的是韩世忠夫人，当初韩世忠夫人曾经当过妓女，因此妓女每年必到英烈夫人庙烧香许愿，祈祷这位宋朝的安国夫人有灵，照顾后代的同行姐妹。]],
  exit = {
    e = { to = '扬州城得胜山', },
  },
},

['扬州城杂货铺'] = {
  id = '扬州城杂货铺',
  area = '扬州城',
  name = '杂货铺',
  desc =  [[这是一家小小的杂货铺，大箱小箱堆满了一地，都是一些日常用品。掌柜懒洋洋地躺在一只躺椅上，招呼着过往行人。据说私底下他也卖一些贵重的东西。摊上立着一块招牌(zhaopai)。    门前立了个牌子(sign)。]],
  exit = {
    n = { to = '扬州城东大街#2', },
  },
},

['扬州城山冈'] = {
  id = '扬州城山冈',
  area = '扬州城',
  name = '山冈',
  desc =  [[这是扬州郊外的一个坟场，说是坟场，其实是一个乱葬冈。当年扬州十日屠时，城里的死尸都扔在这里，后来人们才纷纷在这建了些坟，让死去的亲友们得以安息。可能由于杀气太重，这里常年都是乌云满天的，凄厉的寒风扑面吹来，更显得阴森可怖。平时都没人敢到这来，只有树上的乌鸦‘呀，呀’凄惨地叫着。]],
  exit = {
    se = { to = '扬州城北门外', },
    n = { to = '扬州城坟墓', },
  },
},

['扬州城拱猪西房'] = {
  id = '扬州城拱猪西房',
  area = '扬州城',
  name = '拱猪西房',
  desc =  [[这是一间专门为拱猪而特别设计的拱猪房。房间里面灯火通明，仿佛永远准备着为拱猪狂们服务似的。房间的中心放着一张用百年老松树木材特制的拱猪桌(table)，周围放着四把楠木靠背椅。桌子上摆着一本记分簿(scoreboard)，北边的墙上贴着一张纸(paper)。]],
  exit = {
    e = { to = '扬州城赌场#U', },
  },
},

['扬州城长江北岸#E'] = {
  id = '扬州城长江北岸#E',
  area = '扬州城',
  name = '长江北岸',
  desc =  [[面前是一条波涛翻滚的大江(river)。 浊流滚滚，万舟竞发。两岸渡船来来往往，江边一长溜摆满了鱼摊，渔家就将船泊在岸边，支一块木板，板上摆满了活蹦乱跳的鲤鱼。不远处是一个摆渡，不少过江客都在这里等待渡船。]],
  exit = {
    w = { to = '扬州城长江北岸#C', },
    enter = { to = '扬州城长江渡船#E', cmd = 'dujiang', unstable = true, handler = 'cross_cj', no_wander = true, },
  },
},

['扬州城东厢房'] = {
  id = '扬州城东厢房',
  area = '扬州城',
  name = '东厢房',
  desc =  [[这是丽春院的东厢房。这儿比起外面院子里安静了一些, 床上躺着一位汉子, 看样子伤得很厉害。]],
  exit = {
    w = { to = '扬州城丽春院', },
  },
},

['扬州城墓室通道'] = {
  id = '扬州城墓室通道',
  area = '扬州城',
  name = '墓室通道',
  desc =  [[这里是墓室里的一条通道，墙壁上很潮湿。四下里很黑，前面隐隐传来人声。通道不是很长，有一丝光亮从远处照过来，把人的影子拖得长长的，印在地上。]],
  exit = {
    w = { to = '扬州城小墓室', },
    s = { to = '扬州城墓室', },
  },
},

['扬州城乐器店'] = {
  id = '扬州城乐器店',
  area = '扬州城',
  name = '乐器店',
  desc =  [[这是一家古香古色的乐器店。四面的墙上挂满了各种奇怪的乐器，除了常见的琴瑟笛箫外，还有许多是叫不出名字的。店老板站在柜台后面，正拿着一支箫在比划着。东面是扬州城的月老亭，南面是品棋亭。]],
  exit = {
    e = { to = '扬州城月老亭', },
    s = { to = '扬州城品棋亭', },
    n = { to = '扬州城东大街#1', },
  },
},

['扬州城车马行'] = {
  id = '扬州城车马行',
  area = '扬州城',
  name = '车马行',
  desc =  [[这是一个车马行，供应车、马以及马的饲料等，不过现在只是扬州驿站专用的，所以没人来搭理你。]],
  exit = {
    w = { to = '扬州城广场东', },
  },
},

['扬州城瘦西湖酒馆'] = {
  id = '扬州城瘦西湖酒馆',
  area = '扬州城',
  name = '瘦西湖酒馆',
  desc =  [[方圆数百里内提起瘦西湖酒馆可以说是无人不知，无人不晓。当年文学泰斗顾炎武云游到此，对这儿的扬州炒饭赞不绝口，欣然为其题匾，流下一段传遍海内的佳话，从此瘦西湖酒馆名声大震。大厅内一溜摆着几排桃木做的红漆桌子(table)，桌上整齐地摆放着碗筷，四周放着些椅子(chair)。扬州贩私盐的经常也来这里喝酒闹事，你别去招惹他们为妙。一个酒保正在忙个不停。柜台上立着一个价目表(sign)。]],
  exit = {
    u = { to = '扬州城瘦西湖雅楼', },
    s = { to = '扬州城西大街#3', },
  },
},

['扬州城大虹桥'] = {
  id = '扬州城大虹桥',
  area = '扬州城',
  name = '大虹桥',
  desc =  [[大虹桥横跨于瘦西湖之上，是西园曲水通向长堤春柳的大桥。因桥上的红色栏杆而称红桥。诗人王渔洋有“红桥飞跨水当中，一字栏杆九曲红，日午画船桥下过，衣香人影太匆匆”句，像一道彩虹从湖的东岸飞跨西岸。]],
  exit = {
    e = { to = '扬州城小金山', },
    s = { to = '扬州城瘦西湖', },
    n = { to = '扬州城瘦西湖边', },
  },
},

['扬州城城隍庙'] = {
  id = '扬州城城隍庙',
  area = '扬州城',
  name = '城隍庙',
  desc =  [[这是扬州城北的城隍庙。庙里平日香客稀少，赶上中秋节、端午节或者庙会的时候，才会有些香火。堂中放着一个城隍的塑像，上面落满了灰尘，墙角里有个破蜘蛛网，两只蜘蛛无聊地蹲在上面。]],
  exit = {
    nw = { to = '极乐世界会客室', },
    e = { to = '扬州城北大街#3', },
  },
},

['扬州城赌场#C'] = {
  id = '扬州城赌场#C',
  area = '扬州城',
  name = '赌场',
  desc =  [[这里是赌场的大堂，四周的房间里传出来吆五喝六的赌博声，北边是赌「大小」的房间，西面是赌「牌九」的房间，楼上的拱猪房灯火通明。]],
  exit = {
    u = { to = '扬州城赌场#U', },
    w = { to = '扬州城赌场大厅', },
    s = { to = '扬州城赌场#S', },
    e = { to = '扬州城南大街#1', },
  },
},

['扬州城门廊'] = {
  id = '扬州城门廊',
  area = '扬州城',
  name = '门廊',
  desc =  [[这里是衙门的门廊，这里平常没什么人，两旁摆放着许多肃静回避牌，以及知府日常出行用的仪仗。东边有间屋子，里面偶尔传来几句说话声，好象有什么人在聊天。]],
  exit = {
    e = { to = '扬州城班房', },
    s = { to = '扬州城衙门大门', },
    n = { to = '扬州城衙门正厅', },
  },
},

['扬州城大明寺'] = {
  id = '扬州城大明寺',
  area = '扬州城',
  name = '大明寺',
  desc =  [[这里曾是唐代高僧鉴真讲学和居住的地方，寺前是三间三楼的牌楼，正面是大雄宝殿，殿内正前为三大佛，两旁是十八罗汉像。大殿的东侧是东苑，后有晴空阁。]],
  exit = {
    n = { to = '扬州城西大街#2', },
  },
},

['扬州城广场南'] = {
  id = '扬州城广场南',
  area = '扬州城',
  name = '广场南',
  desc =  [[这是广场的南侧。南边是一家大店铺，门前的绣金旗子上写着一个斗大的“当”字，仔细倾听，可以听到压低的讨价还价的声音。东边则是店铺云集的东大街了。]],
  exit = {
    e = { to = '扬州城东大街#1', },
    s = { to = '扬州城当铺', },
    w = { to = '扬州城南大街#1', },
    n = { to = '扬州城中央广场', },
  },
},

['扬州城驿站'] = {
  id = '扬州城驿站',
  area = '扬州城',
  name = '驿站',
  desc =  [[这是扬州驿站，负责传送和京城里的往来公文。每天快马三匹，早午晚各传递书信三次。不管你的书信要寄到哪里，只要放到这里，一天之内绝对可以送到，北边是一家新开的花店，据说里面的老板非常漂亮。]],
  exit = {
    w = { to = '扬州城北大街#1', },
    n = { to = '扬州城鲜花店', },
  },
},

['扬州城中央广场'] = {
  id = '扬州城中央广场',
  area = '扬州城',
  name = '中央广场',
  desc =  [[这里是城市的正中心，一个很宽阔的广场，铺着青石地面。一些游手好闲的人在这里溜溜达达，经常有艺人在这里表演。你可以看到东边和南边是几家大的店铺，来自全国各地的行人来来往往，西面是扬州戌守兵营，而北边则是扬州巡抚衙门的所在。广场中央有一棵老桃树(tree)，显得十分的粗壮，树上的树叶(leaf)非常茂密，有几只不知名的小鸟在其中窜来窜去。大树旁边有一块新立的牌子(sign)。]],
  exit = {
    e = { to = '扬州城广场东', },
    s = { to = '扬州城广场南', },
    w = { to = '扬州城广场西', },
    n = { to = '扬州城广场北', },
  },
},

['扬州城衙门正厅'] = {
  id = '扬州城衙门正厅',
  area = '扬州城',
  name = '衙门正厅',
  desc =  [[这里是衙门的正堂，堂上东西有两根楹住，挂着一幅对联，但是你无心细看。正面墙上悬挂一个横匾，上书“正大光明”四个金光闪闪的大字。两旁衙役们手持板子侧立两旁，朝廷刚派来的知府赵城之正坐在文案后批阅文书，师爷随侍在后。]],
  exit = {
    e = { to = '扬州城东厅', },
    w = { to = '扬州城西厅', },
    nw = { to = '扬州城府衙后院', },
    s = { to = '扬州城门廊', },
  },
},

['扬州城得胜山'] = {
  id = '扬州城得胜山',
  area = '扬州城',
  name = '得胜山',
  desc =  [[得胜山在扬州城西北三十里的大仪乡，山只有七八丈高，不过是个小丘，南宋绍兴年间，韩世忠曾在此处大破金兵，因此山名“得胜”。]],
  exit = {
    w = { to = '扬州城英烈夫人庙', },
    se = { to = '扬州城西郊', },
  },
},

['扬州城南大街#2'] = {
  id = '扬州城南大街#2',
  area = '扬州城',
  name = '南大街',
  desc =  [[你走在一条繁华的街道上，向南北两头延伸。南边是几座园林，北边通往市中心，西边是一家顾客众多的茶馆，三教九流人士都在那里谈天说地。东边则是官府特设的扬州盐局。]],
  exit = {
    e = { to = '扬州城扬州盐局', },
    s = { to = '扬州城南大街#3', },
    w = { to = '扬州城茶馆', },
    n = { to = '扬州城南大街#1', },
  },
},

['扬州城宝昌客栈'] = {
  id = '扬州城宝昌客栈',
  area = '扬州城',
  name = '宝昌客栈',
  desc =  [[这里是生意兴隆的宝昌客栈，附近的外地游客多选择在此落脚。一个年轻的店小二里里外外忙得团团转，接待着南腔北调的客人。客栈北面的墙上挂着一块醒目的招牌(zhaopai)，南面的墙上挂有一张告示(gaoshi)。]],
  exit = {
    u = { to = '扬州城客店二楼#1', handler = 'hotel', no_wander = true, },
    w = { to = '扬州城北大街#2', },
    e = { to = '扬州城偏厅', },
  },
},

['扬州城茶馆'] = {
  id = '扬州城茶馆',
  area = '扬州城',
  name = '茶馆',
  desc =  [[这是扬州城南的一家茶馆。一走进来，就闻到一股茶香沁入心脾，你的精神为之一爽。几张八仙桌一字排开，坐满了客人，或高声谈笑，或交头接耳。壁上挂了一幅字贴(zitie) 。茶馆中有一说书之人，讲述三国志、水浒传、大明英烈传等等英雄故事。茶博士正在吆喝着招呼客人, 递茶送水, 忙的不亦乐乎。]],
  exit = {
    e = { to = '扬州城南大街#2', },
  },
},

['扬州城偏厅'] = {
  id = '扬州城偏厅',
  area = '扬州城',
  name = '偏厅',
  desc =  [[这是客店的偏厅，只有一个蒙古女子和一些蒙古士兵在此。]],
  exit = {
    w = { to = '扬州城宝昌客栈', },
  },
},

['扬州城拱猪北房'] = {
  id = '扬州城拱猪北房',
  area = '扬州城',
  name = '拱猪北房',
  desc =  [[这是一间专门为拱猪而特别设计的拱猪房。房间里面灯火通明，仿佛永远准备着为拱猪狂们服务似的。房间的中心放着一张用百年老松树木材特制的拱猪桌(table)，周围放着四把楠木靠背椅。桌子上摆着一本记分簿(scoreboard)，北边的墙上贴着一张纸(paper)。]],
  exit = {
    s = { to = '扬州城赌场#U', },
  },
},

['扬州城小金山'] = {
  id = '扬州城小金山',
  area = '扬州城',
  name = '小金山',
  desc =  [[小金山原名为长春岭，四面环水，山和园林都在湖心的小岛上，山顶筑，风亭山上植松柏。山东麓墙内有小桂花厅，与之相连的还有一座朝东的花厅，内有对联一幅：“月来满地水，云起一天山。”]],
  exit = {
    w = { to = '扬州城大虹桥', },
  },
},

['扬州城盐局东厅'] = {
  id = '扬州城盐局东厅',
  area = '扬州城',
  name = '盐局东厅',
  desc =  [[这里是扬州盐局的东厅，四周装饰的非常简单，盐商们都在这里商讨一些事情，是盐商们聚会的场所。中间正座着一个盐商，他就是这里的盐商头子。]],
  exit = {
    w = { to = '扬州城扬州盐局', },
  },
},

['扬州城北大街#2'] = {
  id = '扬州城北大街#2',
  area = '扬州城',
  name = '北大街',
  desc =  [[你走在一条繁忙的街道上，看着操着南腔北调的人们行色匆匆，许多人都往南边走去，那里通向一个热闹的广场。东边是一家生意兴隆的宝昌客栈，来自各地的人们进进出出。西边是扬州一家老字号的钱庄，名为天阁斋。可以听到叮叮当当的金银声音。]],
  exit = {
    e = { to = '扬州城宝昌客栈', },
    s = { to = '扬州城北大街#1', },
    w = { to = '扬州城天阁斋', },
    n = { to = '扬州城北大街#3', },
  },
},

['扬州城坟墓'] = {
  id = '扬州城坟墓',
  area = '扬州城',
  name = '坟墓',
  desc =  [[这是一个建在岗上最高处的一个大坟，地上插了几柱香，还在燃着。看来有人经常来这。坟上立了一个大石碑(shibei)，旁边还有一个铁环(huan)。这里风很大，除了隐隐从远处传来阵阵狗吠声，你什么也听不到。]],
  exit = {
    s = { to = '扬州城山冈', },
    d = { to = '扬州城墓室', door = 'pull huan', },
  },
},

['扬州城地牢'] = {
  id = '扬州城地牢',
  area = '扬州城',
  name = '地牢',
  desc =  [[这里是衙门后院的地牢，四处有几个看守在巡逻，气氛森严。不时有来提审的衙役隔着铁门向里面大声吆喝着囚犯的名字。偶尔有几个犯人在看守的押送下，送来这里关押。西边的铁门上开有一个小窗口(window)。为了方便探监的百姓，可以从这个窗口递(pass)些吃的东西进去。]],
  exit = {
    su = { to = '扬州城府衙后院', },
  },
},

['扬州城兵营'] = {
  id = '扬州城兵营',
  area = '扬州城',
  name = '兵营',
  desc =  [[这里是兵营，密密麻麻到处都是官兵，有的在武将的指挥下列队操练，有的独自在练功，有的坐着、躺着正在休息。南墙下坐着主帅，不动声色地寻视着四周。看到你进来，他们全都向你包围了过来，形势看来不太妙。西边有一个小窗口(window)。为了方便探监的百姓，可以从这个窗口传递(pass)些吃的东西。]],
  exit = {
    e = { to = '扬州城兵营大门', },
    s = { to = '扬州城兵器库', },
  },
},

['扬州城扬州盐局'] = {
  id = '扬州城扬州盐局',
  area = '扬州城',
  name = '扬州盐局',
  desc =  [[你来到一座结构宏伟的建筑前，左右石坛上各插着一根两丈多高的旗杆，杆上锦旗飘扬。左首旗子上写着“扬州盐局”四个黑字，银钩铁划，端的是刚劲非凡。扬州一带是江北淮盐的集散之地，官府为了便于管理, 征得盐税, 特设了扬州盐局, 直接听命于朝廷。入口处有一堆盐商在说笑，墙角堆着一堆石灰粉，旁边放着个布袋。]],
  exit = {
    w = { to = '扬州城南大街#2', },
    e = { to = '扬州城盐局东厅', },
  },
},

['扬州城兵营大门'] = {
  id = '扬州城兵营大门',
  area = '扬州城',
  name = '兵营大门',
  desc =  [[你正站在兵营的门口，面对着一排简陋的营房，可以看到穿着制服的官兵正在操练，不时地传来呐喊声。老百姓是不允许在此观看的，你最好还是赶快走开为妙。]],
  exit = {
    w = { to = '扬州城兵营', },
    e = { to = '扬州城广场西', },
  },
},

['扬州城小盘古'] = {
  id = '扬州城小盘古',
  area = '扬州城',
  name = '小盘古',
  desc =  [[小盘古是扬州一座著名的小庭院。园内以湖石假山为主，山下有曲洞，绕洞而行，进入一条回廊，尽头紧接着山谷。山峰下，水池上，凌空架一石梁，通向水阁凉亭。]],
  exit = {
    w = { to = '扬州城南大街#3', },
  },
},

['扬州城月老亭外'] = {
  id = '扬州城月老亭外',
  area = '扬州城',
  name = '月老亭外',
  desc =  [[这里是月老亭外，北面紧挨着东大街，南面的小亭子就是天下闻名的月老亭了。每天都有许多人来此登记婚姻，所以一些专门从事婚嫁生意的轿夫之流整天在此招徕生意。]],
  exit = {
    nw = { to = '扬州城东大街#3', },
    s = { to = '扬州城月老亭', },
  },
},

['扬州城衙门大门'] = {
  id = '扬州城衙门大门',
  area = '扬州城',
  name = '衙门大门',
  desc =  [[这里是衙门大门，两扇朱木大门紧紧关闭着。“肃静”“回避”的牌子分放两头石狮子的旁边。前面有一个大鼓，显然是供小民鸣冤用的。几名衙役在门前巡逻。俗话说：新官上任三把火，这位刚上任的知府大人就在衙门口前摆放了一块“百姓鸣冤板”，供百姓陈述冤情。]],
  exit = {
    s = { to = '扬州城广场北', },
    n = { to = '扬州城门廊', },
  },
},

['扬州城关帝庙'] = {
  id = '扬州城关帝庙',
  area = '扬州城',
  name = '关帝庙',
  desc =  [[这是扬州城东面的一所关帝庙，据说夜里经常有人在此聚众饮酒，普通百姓是不会来这是非之地的。但见庙正中供奉的关帝塑像栩栩如生，手持青龙偃月刀，左右各是关公的结义兄弟刘备和张飞，一个个义气夺人，仿佛要杀尽天下不义之人。]],
  exit = {
    sw = { to = '扬州城东门', },
  },
},

['扬州城个园'] = {
  id = '扬州城个园',
  area = '扬州城',
  name = '个园',
  desc =  [[据传这里是盐商黄应泰修建。园内种竹千杆，因竹叶形如“个”字，故以是名。入园门左转至复道廊，迎面花坛种竹，竹间立石笋。北面园门上有“个园”题字石额。园门向北为桂花厅，前植桂树，后凿水池，六角攒尖式小亭隔水相望。延北墙是湖石假山，山上古松，山下趋桥流水。夏日晴雨，水中倒影多变，有下山之称。]],
  exit = {
    w = { to = '扬州城假山', },
    e = { to = '扬州城南大街#3', },
  },
},

['扬州城大驿道#2'] = {
  id = '扬州城大驿道#2',
  area = '扬州城',
  name = '大驿道',
  desc =  [[你走在一条尘土飞扬的大驿道上。四周人来人往。挑担子的行商，赶着大车的马夫，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。马上的人个个身着劲装，衣甲鲜明，有的还随身佩带着刀剑。看来都是些习武的江湖人。道路两旁是整整齐齐的杨树林。]],
  exit = {
    w = { to = '中原神州大驿道#1', },
    se = { to = '长乐帮大驿道#1', },
  },
},

['扬州城南大街#3'] = {
  id = '扬州城南大街#3',
  area = '扬州城',
  name = '南大街',
  desc =  [[你走在一条繁华的街道上，向南北两头延伸。南边是南城门，北边通往市中心，东西两边各是一座小园子。]],
  exit = {
    e = { to = '扬州城小盘古', },
    s = { to = '扬州城南门', },
    w = { to = '扬州城个园', },
    n = { to = '扬州城南大街#2', },
  },
},

['扬州城广场北'] = {
  id = '扬州城广场北',
  area = '扬州城',
  name = '广场北',
  desc =  [[这是广场的北侧。北边是衙门所在，以前去衙门的人很少，静悄悄地很是冷清。现在百姓自从程要发卸任以后，常常到北面的百姓鸣冤板去留言，向新任知府大人申述自己的冤情，盼望大人能够为自己做主。西边是西大街，著名的瘦西湖就再那边。]],
  exit = {
    ne = { to = '扬州城广场', },
    s = { to = '扬州城中央广场', },
    e = { to = '扬州城北大街#1', },
    w = { to = '扬州城西大街#1', },
    n = { to = '扬州城衙门大门', },
  },
},

['扬州城小吃店'] = {
  id = '扬州城小吃店',
  area = '扬州城',
  name = '小吃店',
  desc =  [[这是一家小店，生意倒是挺兴隆的，座位坐得满满的，还有些人在站着等座。看来多等也是无益，不如买点包子、鸡腿、烤鸭、米酒赶路吧。]],
  exit = {
    w = { to = '扬州城北大街#3', },
  },
},

['扬州城东门'] = {
  id = '扬州城东门',
  area = '扬州城',
  name = '东门',
  desc =  [[这里是扬州东城门，城门正上方刻着“东门”两个楷书大字，城墙上贴着几张官府的告示(gaoshi)。官兵们警惕地注视着过往行人，通缉犯最好小心为妙。一条笔直的青石板大道向东西两边延伸。东边是郊外，隐约可见一片一望无际的树林，神秘莫测。]],
  exit = {
    ne = { to = '扬州城关帝庙', },
    s = { to = '扬州城码头', },
    e = { to = '中原神州大驿道#1', },
    w = { to = '扬州城东大街#4', },
    n = { to = '中原神州龙门镖局', },
  },
},

['扬州城西门'] = {
  id = '扬州城西门',
  area = '扬州城',
  name = '西门',
  desc =  [[这是西城门，城墙上贴着几张通缉告示(gaoshi)。西门是往西域的必经之地，官兵们戒备森严。一条笔直的青石板大道向东西两边延伸。西边是郊外，骑马的、坐轿的、走路的，行人匆匆。东边是城里的西大街。]],
  exit = {
    w = { to = '扬州城西郊', },
    e = { to = '扬州城西大街#3', },
  },
},

['扬州城班房'] = {
  id = '扬州城班房',
  area = '扬州城',
  name = '班房',
  desc =  [[这里是衙门的班房，是扬州府巡捕办案和休息的地方。东厢墙上挂着一些脏兮兮的套具，锁具，刑具。北首靠墙放有一个八仙桌，几张椅子，几个面孔阴森的捕头坐在那里。有几个衙役站在旁边，不知道在说着什么。]],
  exit = {
    w = { to = '扬州城门廊', },
  },
},

['扬州城莲性寺白塔'] = {
  id = '扬州城莲性寺白塔',
  area = '扬州城',
  name = '莲性寺白塔',
  desc =  [[塔下筑有长方形高台，四周围以栏板，前有小台，小台北面和两侧均筑阶梯，可以登人。塔位于高台中央，底为砖雕须弥座，上为塔肚，塔肚上是塔脖子，再上是十三层瘦长的圆圈，称“十三天”，顶上盖圆盘，最上是铜制的葫芦塔顶。此塔用砖砌成，是瘦西湖名景之一。]],
  exit = {
    e = { to = '扬州城瘦西湖边', },
  },
},

['扬州城东大街#3'] = {
  id = '扬州城东大街#3',
  area = '扬州城',
  name = '东大街',
  desc =  [[你走在东大街上，踩着坚实的青石板地面。东边是打铁铺和武器店，不时传来敲敲打打的金属撞击声，与西边朗朗的读书声混杂在一起。北边是一家老字号的药铺，南边是家寄卖店。]],
  exit = {
    s = { to = '中原神州寄卖店', },
    se = { to = '扬州城月老亭外', },
    e = { to = '扬州城东大街#4', },
    w = { to = '扬州城东大街#2', },
    n = { to = '扬州城药铺', },
  },
},

['扬州城小墓室'] = {
  id = '扬州城小墓室',
  area = '扬州城',
  name = '小墓室',
  desc =  [[这是一个小墓室，墙上挂满了火炬，照得光亮亮的。墙边有一口不太深的井，隐约可以看见井里面清澈的泉水。角落里有一个摊开的布口袋，上面放着几个从附近百姓家讨来的剩馒头。花子们靠在角落里的破床边打着瞌睡。]],
  exit = {
    e = { to = '扬州城墓室通道', },
  },
},

['扬州城鲜花店'] = {
  id = '扬州城鲜花店',
  area = '扬州城',
  name = '鲜花店',
  desc =  [[这里是新近开张的一家鲜花店，店内百花齐放，清香满室。花儿虽非名种，却也朵朵娇艳欲滴。她们是期待、是问候、是默默的祝福、是深深的思念……小姑娘紫竹手持花洒，在花间轻轻走动，精心照料着每朵鲜花。门边柜台上还立着一张告示(gaoshi)。]],
  exit = {
    s = { to = '扬州城驿站', },
  },
},

['扬州城月老亭'] = {
  id = '扬州城月老亭',
  area = '扬州城',
  name = '月老亭',
  desc =  [[这里是月老亭，是举办婚礼的场所。亭子四周的柱子上贴满了字条，也有些人物肖像画，看来有不少人留了名字在这里，希望能找个如意佳偶。有几张字条被人用红笔勾了出来，十分显眼。很多有情人都是在这里由月下老人主持他们的婚礼。亭边的柱子上挂着一个，木牌(mu pai)。]],
  exit = {
    w = { to = '扬州城乐器店', },
    n = { to = '扬州城月老亭外', },
  },
},

['扬州城客店二楼#2'] = {
  id = '扬州城客店二楼#2',
  area = '扬州城',
  name = '客店二楼',
  desc =  [[这是一间很大的客房，陈设十分简陋。靠墙放了十几张小木床，不少客人正和衣而卧，满屋子都是呼呼的打酣声。西边有张床是空的，你蹑手蹑脚地走了过去。]],
  exit = {
    out = { to = '扬州城客店二楼#1', },
  },
},

['扬州城墓室'] = {
  id = '扬州城墓室',
  area = '扬州城',
  name = '墓室',
  desc =  [[这是一个很大的墓室，里面坐着不少人。墙上挂满了火炬，照得光亮亮的。原来这就是丐帮的大勇分舵，一群乞丐围着地图，似乎正在激烈地讨论着什么。墙角处还有一口枯井(well)。]],
  exit = {
    hidden = { to = '扬州城山冈', cmd = ' jump well', },
    n = { to = '扬州城墓室通道', },
  },
},

['扬州城西大街#3'] = {
  id = '扬州城西大街#3',
  area = '扬州城',
  name = '西大街',
  desc = { [[你走在西大街上，感到这里的街面要比别处的干净、整洁。街上的行人比以前也多了许多，东面是扬州的著名风景“瘦西湖”，西边是西城门。南边是一家珠宝店，而北边则是一座大酒楼，挂着“太白遗风”的招帘，门额上悬挂一方横匾，“瘦西湖酒馆”五字擦得闪闪发亮, 乃是顾炎武的手笔。阵阵酒香肉香让你垂涎欲滴。]], [[你走在西大街上，感到这里的街面要比别处的干净、整洁。街上的行人比以前也多了许多，东面是扬州的著名风景“瘦西湖”，西边是西城门。南边是一家已经关门了的珠宝店，而北边则是一座已经打烊了的大酒楼，挂着一幅招帘，门额上悬挂一方横匾，黑暗之中看不太清匾上的字迹。]] },
	use_cond = '( time.get_current_hour() >= 6 and time.get_current_hour() < 9 ) or ( time.get_current_hour() >= 11 and time.get_current_hour() < 14 ) or ( time.get_current_hour() >= 17 and time.get_current_hour() < 21 )',
  exit = {
    e = { to = '扬州城西大街#2', },
    s = { to = '扬州城珠宝店', unstable = true, cond = 'time.get_current_hour() >= 6 and time.get_current_hour() < 21', },
    w = { to = '扬州城西门', },
    n = { to = '扬州城瘦西湖酒馆', unstable = true, cond = 'time.get_current_hour() >= 6 and time.get_current_hour() < 21', },
  },
},

['扬州城东大街#2'] = {
  id = '扬州城东大街#2',
  area = '扬州城',
  name = '东大街',
  desc =  [[这是一条宽阔的青石板街道，向东西两头延伸。东边不时地传来金属撞击声，西边人声嘈杂。北边是一座简朴的院子，半月形的大门上方写着“白鹿书院”四个烫金大字，苍劲有力。里面不时地传来学生们抑扬顿挫的读书声。南边是一家杂货铺。]],
  exit = {
    e = { to = '扬州城东大街#3', },
    s = { to = '扬州城杂货铺', },
    w = { to = '扬州城东大街#1', },
    n = { to = '扬州城书院', },
  },
},

['扬州城广场'] = {
  id = '扬州城广场',
  area = '扬州城',
  name = '广场',
  desc =  [[这是知府旁边的一片小空场，在东边的墙上贴了几张官府悬赏捉拿朝廷要犯的告示 (wanted list)，下面围观了许多看热闹的人，当中不乏一些武林高手，但是要捉拿的要犯都很扎手，很少有人随便揭榜(jie)。 但也有不少武林后起之秀在一旁跃跃欲试。]],
  exit = {
    sw = { to = '扬州城广场北', },
  },
},

['扬州城假山'] = {
  id = '扬州城假山',
  area = '扬州城',
  name = '假山',
  desc =  [[由复廊和小道就到了这里，黄色的山拔地而起，山峰俊俏，山间古柏，山顶小亭，山中还有小院、石桥、石室等，气势磅礴。为江南山石中所少见。]],
  exit = {
    e = { to = '扬州城个园', },
  },
},

['扬州城赌场#U'] = {
  id = '扬州城赌场#U',
  area = '扬州城',
  name = '赌场',
  desc =  [[	≌≌≌≌≌≌≌≌≌≌≌≌≌≌≌≌≌≌≌≌	    ≌≌				≌≌	    ≌≌ 　拱    猪　　帮　　总   舵    ≌≌	    ≌≌				≌≌	    ≌≌≌≌≌≌≌≌≌≌≌≌≌≌≌≌≌≌≌≌    这里有四条走廊通向不同的拱猪房间。房间里面灯火通明，永远准备着为拱猪狂们服务。墙上贴着一张发黄的纸(paper)，上面写着拱猪门的级别。你可以查看各拱猪房(pigroom)的人数状况。]],
  exit = {
    s = { to = '扬州城拱猪南房', },
    e = { to = '扬州城拱猪东房', },
    d = { to = '扬州城赌场#C', },
    w = { to = '扬州城拱猪西房', },
    n = { to = '扬州城拱猪北房', },
  },
},

['扬州城北门外'] = {
  id = '扬州城北门外',
  area = '扬州城',
  name = '北门外',
  desc =  [[这是扬州北门郊外的一条青石大道，路上人来人往非常热闹，不时地有人骑着马匆匆而过。这条大道南边直通往扬州城。西北面是一条黄土小径，蜿蜒通向一个小山冈。北面是一片密林。]],
  exit = {
    s = { to = '扬州城北门', },
    nw = { to = '扬州城山冈', },
    n = { to = '黄河流域草地#2', },
  },
},

['扬州城地下黑拳市'] = {
  id = '扬州城地下黑拳市',
  area = '扬州城',
  name = '地下黑拳市',
  desc =  [[这是扬州城内的一家地下赌坊，城里人都知道这里，但外人并不清楚。这里平时有比武，但是都是生死自负。赢的人往往能获得大量的金钱，输的人则丢掉生命。左面有个牌子（paizi）,说明了赌博的规则。]],
  exit = {
    u = { to = '扬州城赌场大厅', },
  },
},

['扬州城长江北岸#W'] = {
  id = '扬州城长江北岸#W',
  area = '扬州城',
  name = '长江北岸',
  desc =  [[面前是一条波涛翻滚的大江(river)。 浊流滚滚，万舟竞发。两岸渡船来来往往，江边一长溜摆满了鱼摊，渔家就将船泊在岸边，支一块木板，板上摆满了活蹦乱跳的鲤鱼。不远处是一个摆渡，不少过江客都在这里等待渡船。]],
  exit = {
    e = { to = '扬州城长江北岸#C', },
    enter = { to = '扬州城长江渡船#W', cmd = 'dujiang', unstable = true, handler = 'cross_cj', no_wander = true, },
  },
},

['扬州城瘦西湖边'] = {
  id = '扬州城瘦西湖边',
  area = '扬州城',
  name = '瘦西湖边',
  desc =  [[瘦西湖湖山青水秀，碧波涟漪，湖光山色，相映成趣，泛舟湖上犹如镜中行，漫步湖堤则如画中游。西湖之美令人陶醉。自古以来，人们常以艳、娇、媚、秀、柔、嫩来形容她。]],
  exit = {
    w = { to = '扬州城莲性寺白塔', },
    s = { to = '扬州城大虹桥', },
  },
},

['扬州城府衙后院'] = {
  id = '扬州城府衙后院',
  area = '扬州城',
  name = '府衙后院',
  desc =  [[这里是府衙后院，有几个衙役无所事事地靠在墙角，边晒太阳边聊天。看见你进来，他们立刻不说话了，纷纷用眼角的余光上下打量着你。一旁的几只大狼狗不怀好意地靠进你的身边闻了闻。]],
  exit = {
    se = { to = '扬州城衙门正厅', },
    nd = { to = '扬州城地牢', },
  },
},

['扬州城兵器库'] = {
  id = '扬州城兵器库',
  area = '扬州城',
  name = '兵器库',
  desc =  [[这里是兵器库，到处银光闪闪，让人眼花缭乱。宝刀、宝剑、金箍棒，大刀、长剑、哨棒，短刀、短剑、短棍，各色各样的兵器应有尽有，你一时不知道挑什么好。]],
  exit = {
    n = { to = '扬州城兵营', },
  },
},

['扬州城西厢房'] = {
  id = '扬州城西厢房',
  area = '扬州城',
  name = '西厢房',
  desc =  [[这是丽春院的西厢房。这儿比起外面院子里安静了一些, 床上收拾得干干净净。]],
  exit = {
    e = { to = '扬州城丽春院', },
  },
},

['扬州城西大街#2'] = {
  id = '扬州城西大街#2',
  area = '扬州城',
  name = '西大街',
  desc =  [[这是一条宽阔的青石板街道，向东西两头延伸。这里来来往往的游人你推我挤，热闹非常。从东面不时地传来笑语莺歌，声声撩人，而从西边则传来一阵阵的香气。南边是有名的扬州大明寺，北边就是瘦西湖边了。]],
  exit = {
    e = { to = '扬州城西大街#1', },
    s = { to = '扬州城大明寺', },
    w = { to = '扬州城西大街#3', },
    n = { to = '扬州城湖畔', },
  },
},

['扬州城北大街#1'] = {
  id = '扬州城北大街#1',
  area = '扬州城',
  name = '北大街',
  desc =  [[你走在一条繁忙的街道上，看着操着南腔北调的人们行色匆匆，许多人都往西南边走去，那里是扬州的中心广场。东边是扬州驿站，来自京城的快马有时会急驶而入，片刻后又会有另一匹快马从里面冲出来绝尘而去。]],
  exit = {
    e = { to = '扬州城驿站', },
    s = { to = '扬州城广场东', },
    w = { to = '扬州城广场北', },
    n = { to = '扬州城北大街#2', },
  },
},

['扬州城南门'] = {
  id = '扬州城南门',
  area = '扬州城',
  name = '南门',
  desc =  [[这是扬州的南城门，城墙上贴着一张官府的告示(gaoshi)。扬州是淮盐的集散地，往来的盐贩子很多，几个官兵正在认真地检查过往的行人，查看他们是否携带有私盐。南边的青石大道可以一直通到远处长江北岸的码头。]],
  exit = {
    s = { to = '扬州城长江北岸#C', },
    n = { to = '扬州城南大街#3', },
  },
},

['扬州城西厅'] = {
  id = '扬州城西厅',
  area = '扬州城',
  name = '西厅',
  desc =  [[这里是衙门的西厅，乃是知府的书房。书案上凌乱地放着几本发黄的古籍和一些卷宗。墙上挂着扬州地区的地图，上面密密麻麻的圈圈点点，你仔细看去那里好象是盐局的位置。]],
  exit = {
    e = { to = '扬州城衙门正厅', },
  },
},

['扬州城瘦西湖'] = {
  id = '扬州城瘦西湖',
  area = '扬州城',
  name = '瘦西湖',
  desc =  [[钱塘诗人汪沆有诗云：“垂扬不断接惨芜，雁赤虹桥俨画图，也是销金一锅子，故应换作瘦西湖。”瘦西湖湖长十于里，犹如一幅山水画，既有天然景色，又是扬州一大名园。]],
  exit = {
    s = { to = '扬州城湖畔', },
    n = { to = '扬州城大虹桥', },
  },
},

['莆田少林藏经阁'] = {
  id = '莆田少林藏经阁',
  area = '莆田少林',
  name = '藏经阁',
  desc =  [[这里是少林莆田别院的藏经阁，虽然不如嵩山本院的藏书数量多，也没有本院藏经楼的名气响亮，但是也不愧为南方佛法的宝藏，莆田少林寺此处藏经多以佛经典籍为主，间或藏有一些少林不传之绝技图谱。虽无本院广博，但占其精练概要。这里到处都是密密麻麻，高及顶棚的大书架。]],
  exit = {
    nd = { to = '莆田少林妙法殿', },
  },
},

['莆田少林小路#2E'] = {
  id = '莆田少林小路#2E',
  area = '莆田少林',
  name = '小路',
  desc =  [[这是一条小路，路的一边是高高的墙壁，看起来一般人很难爬上去。看不到墙里面的情况。偶尔可以听见远处传来的僧人们练武的声音。路旁开着一种野花，颜色鲜红，很是好看。]],
  exit = {
    w = { to = '莆田少林小路#1E', },
    ed = { to = '莆田少林小路#3E', },
  },
},

['莆田少林山路#1'] = {
  id = '莆田少林山路#1',
  area = '莆田少林',
  name = '山路',
  desc =  [[来到福建境内，只见满山红花，蝴蝶飞舞。路两旁是一片片翠绿茂密的树林，其间点缀着许多不知名的野花。南边远远的好象可以望见座城池。]],
  exit = {
    nw = { to = '福州城山路#3N', },
    s = { to = '莆田少林山路#2', },
  },
},

['莆田少林山路#6'] = {
  id = '莆田少林山路#6',
  area = '莆田少林',
  name = '山路',
  desc =  [[这里的山路平整了些，旁边出现了一块不大不小的空地，空地正中间修有一座凉亭。偶尔可见个把僧人挑着担水，从旁边的小路走过来，行上山去。僧人的脚步看上去很是扎实沉稳。]],
  exit = {
    enter = { to = '莆田少林凉亭', },
    nd = { to = '莆田少林石阶#1', },
    su = { to = '莆田少林石阶#2', },
  },
},

['莆田少林须弥殿'] = {
  id = '莆田少林须弥殿',
  area = '莆田少林',
  name = '须弥殿',
  desc =  [[这里是须弥殿，这一殿也是烛火明亮，殿堂却较前面三殿小得多。殿中放了两个蒲团，蒲团旁边有几张桌子，还有几把椅子，墙上有几张画像，都是佛经典故。]],
  exit = {
    s = { to = '莆田少林戒持院', },
    n = { to = '莆田少林后殿', },
  },
},

['莆田少林罗汉堂'] = {
  id = '莆田少林罗汉堂',
  area = '莆田少林',
  name = '罗汉堂',
  desc =  [[这里是罗汉堂，面前是一座很大的院落，周围用高墙围住，院门匾额上写着『罗汉堂』三个大字。这里是少林弟子练习本门基本武功的所在。有很多年轻的僧人进进出出，院内传来阵阵呼喝练功的声音。]],
  exit = {
    e = { to = '莆田少林大乘殿', },
  },
},

['莆田少林长廊#E'] = {
  id = '莆田少林长廊#E',
  area = '莆田少林',
  name = '长廊',
  desc =  [[这是一条幽静的长廊，长廊顶上的画梁上画有许多佛经中的故事，最上面是红色的琉璃瓦，地上铺着一层细碎的石子。东西两面都有个月亮门，偶尔有小沙弥低着头匆匆走过。]],
  exit = {
    w = { to = '莆田少林戒持院', },
    e = { to = '莆田少林暖阁', },
  },
},

['莆田少林山路#3'] = {
  id = '莆田少林山路#3',
  area = '莆田少林',
  name = '山路',
  desc =  [[这里是一条山中小路，路上没有行人，但是可以依稀看见有车马走过的痕迹，看来还不算荒僻。满山都开着一种红花，向远处望去，能看到各种颜色的蝴蝶在半空中飞舞着，很是绚丽夺目。]],
  exit = {
    nw = { to = '莆田少林山路#2', },
    e = { to = '莆田少林山路#4', },
  },
},

['莆田少林侧廊#SW'] = {
  id = '莆田少林侧廊#SW',
  area = '莆田少林',
  name = '侧廊',
  desc =  [[这是一条幽静的长廊，长廊顶上的画梁上画有许多佛经中的故事，最上面是红色的琉璃瓦，地上铺着一层细碎的石子。南北两面都有个月亮门，分别通向前后院。偶尔有小沙弥低着头匆匆走过。]],
  exit = {
    e = { to = '莆田少林小院#SW', },
    s = { to = '莆田少林小径#W', },
    n = { to = '莆田少林饭厅', },
  },
},

['莆田少林方丈室'] = {
  id = '莆田少林方丈室',
  area = '莆田少林',
  name = '方丈室',
  desc =  [[这里是方丈室，室内摆有一方桌，桌子旁边有几把藤椅，靠窗的位置有一张茶几，茶几前摆一个蒲团，南面放有一张竹床，看起来很简单。西首墙上写有一段金刚经的经文，]],
  exit = {
    e = { to = '莆田少林长廊#W', },
  },
},

['莆田少林中殿'] = {
  id = '莆田少林中殿',
  area = '莆田少林',
  name = '中殿',
  desc =  [[这是寺中的中殿，殿中面积不是很大，但是感觉好象很宽阔，地上铺了一层青色的方砖，两旁立着些佛像。平常这里不会有外人进来，游客只能走到前殿的门口，后面一般是进不来的。]],
  exit = {
    s = { to = '莆田少林后殿', },
    n = { to = '莆田少林前殿', },
  },
},

['莆田少林小径#W'] = {
  id = '莆田少林小径#W',
  area = '莆田少林',
  name = '小径',
  desc =  [[这是一条幽静的小径，两旁和四周的树丛修剪的很整齐，地上铺着一层细碎的石子。]],
  exit = {
    s = { to = '莆田少林妙法殿', },
    n = { to = '莆田少林侧廊#SW', },
  },
},

['莆田少林小路#2W'] = {
  id = '莆田少林小路#2W',
  area = '莆田少林',
  name = '小路',
  desc =  [[这是一条小路，路的一边是高高的墙壁，看起来一般人很难爬上去。看不到墙里面的情况，但是可以听见远处传来的僧人们练武的声音。路旁开着一种野花，颜色鲜红，很是好看。]],
  exit = {
    w = { to = '莆田少林小路#3W', },
    e = { to = '莆田少林小路#1W', },
  },
},

['莆田少林小路#3W'] = {
  id = '莆田少林小路#3W',
  area = '莆田少林',
  name = '小路',
  desc =  [[这是一条小路，路的一边是高高的墙壁，看起来一般人很难爬上去。看不到墙里面的情况，但是可以听见远处传来的僧人们练武的声音。路旁开着一种野花，颜色鲜红，很是好看。]],
  exit = {
    e = { to = '莆田少林小路#2W', },
    sw = { to = '莆田少林小路#4W', },
  },
},

['莆田少林大雄宝殿'] = {
  id = '莆田少林大雄宝殿',
  area = '莆田少林',
  name = '大雄宝殿',
  desc =  [[这里是大雄宝殿。正中间供奉着如来三宝的金身塑像，左右各是文殊、普贤诸位菩萨。大殿四周的墙壁上画有许多佛经典故的壁画，构图宏伟，色彩绚丽。殿中一年四季香火不断，一群僧人正自焚香诵经。]],
  exit = {
    sd = { to = '莆田少林前殿', },
    nd = { to = '莆田少林广场', },
  },
},

['莆田少林六祖殿'] = {
  id = '莆田少林六祖殿',
  area = '莆田少林',
  name = '六祖殿',
  desc =  [[这里是六祖殿，里面供奉着少林历史上六位有名的祖师：初祖达摩，二祖惠可，三祖僧璨，四祖道信，五祖弘忍，六祖慧能的塑像。个个栩栩如生，活灵活现。一位僧人正坐在蒲团上闭目养神。]],
  exit = {
    n = { to = '莆田少林小院#SE', },
  },
},

['莆田少林长廊#W'] = {
  id = '莆田少林长廊#W',
  area = '莆田少林',
  name = '长廊',
  desc =  [[这是一条幽静的长廊，长廊顶上的画梁上画有许多佛经中的故事，最上面是红色的琉璃瓦，地上铺着一层细碎的石子。东西两面都有个月亮门，偶尔有小沙弥低着头匆匆走过。]],
  exit = {
    w = { to = '莆田少林方丈室', },
    e = { to = '莆田少林戒持院', },
  },
},

['莆田少林法堂#W'] = {
  id = '莆田少林法堂#W',
  area = '莆田少林',
  name = '法堂',
  desc =  [[这是寺中讲经的法堂，可以同时容纳几百人而绝无问题。这里是寺中演说佛经，佛法和阪戒集会的场所。殿内整齐的放着一排排的蒲团，以供听经者打坐之用。]],
  exit = {
    e = { to = '莆田少林后殿', },
  },
},

['莆田少林武功阁'] = {
  id = '莆田少林武功阁',
  area = '莆田少林',
  name = '武功阁',
  desc =  [[这里是武功阁，里面地方很大，地面上铺着大块的清石方砖，四角各有一个大柱子，两边放着兵器架，架上摆满了各种兵器。几个身材魁梧的壮年武僧正在练武。]],
  exit = {
    nd = { to = '莆田少林大乘殿', },
  },
},

['莆田少林后殿'] = {
  id = '莆田少林后殿',
  area = '莆田少林',
  name = '后殿',
  desc =  [[这里是寺中的后殿，进得殿来，顿时眼前一片光亮，只见殿中两侧点满了香烛，何止百数十枝。靠墙摆有一些香炉和供桌，因为没有开窗子，殿中有些显得烟雾缭绕。]],
  exit = {
    e = { to = '莆田少林法堂#E', },
    s = { to = '莆田少林须弥殿', },
    w = { to = '莆田少林法堂#W', },
    n = { to = '莆田少林中殿', },
  },
},

['莆田少林小院#SW'] = {
  id = '莆田少林小院#SW',
  area = '莆田少林',
  name = '小院',
  desc =  [[这是一个寂静幽雅的小院，地上整齐的铺着一块块方砖。北面有个不大的月亮门，连接着一个走廊，仿佛可以一直通往前院。东面的方向是广场，不时传来阵阵嘈杂的人声。西面飘来阵阵菜香。]],
  exit = {
    e = { to = '莆田少林广场', },
    s = { to = '莆田少林紧那罗王殿', },
    w = { to = '莆田少林侧廊#SW', },
    n = { to = '莆田少林侧廊#W', },
  },
},

['莆田少林山路#5'] = {
  id = '莆田少林山路#5',
  area = '莆田少林',
  name = '山路',
  desc =  [[山路逐渐开始变窄，并且开始蜿蜒上山了。远处的山丘全部被树木覆盖，绿得望不到边。偶尔传来鸟儿在枝头间轻快的叫声。]],
  exit = {
    sw = { to = '莆田少林山路#4', },
    eu = { to = '莆田少林石阶#1', },
  },
},

['莆田少林侧廊#E'] = {
  id = '莆田少林侧廊#E',
  area = '莆田少林',
  name = '侧廊',
  desc =  [[这是一条幽静的长廊，长廊顶上的画梁上画有许多佛经中的故事，最上面是红色的琉璃瓦，地上铺着一层细碎的石子。南北两面都有个月亮门，分别通向前后院。偶尔有小沙弥低着头匆匆走过。]],
  exit = {
    s = { to = '莆田少林小院#SE', },
    n = { to = '莆田少林小院#E', },
  },
},

['莆田少林饭厅'] = {
  id = '莆田少林饭厅',
  area = '莆田少林',
  name = '饭厅',
  desc =  [[这里是僧人们用斋的地方，饭厅不是很大，但是也能容纳个三五十人同时用餐。屋子里摆了十几张桌子和三十几条长凳，几个小沙弥在一旁在负责伺候大家用饭。桌上摆几个大盆，在桌子的一端有面小铜锣(luo) 没吃饱的可以敲一下锣。]],
  exit = {
    s = { to = '莆田少林侧廊#SW', },
  },
},

['莆田少林紧那罗王殿'] = {
  id = '莆田少林紧那罗王殿',
  area = '莆田少林',
  name = '紧那罗王殿',
  desc =  [[这是紧那罗王殿，殿中供奉着佛家禅宗的紧那罗王金身塑像。四周的墙壁上绘满了西方胜境，四十八愿，二十四尊天的壁画，壁画的线条流畅，画工精细，俨然出于名家之手。一个小沙弥在扫地。]],
  exit = {
    n = { to = '莆田少林小院#SW', },
  },
},

['莆田少林山门'] = {
  id = '莆田少林山门',
  area = '莆田少林',
  name = '山门',
  desc =  [[上得石阶，眼前出现两扇高大的红门和高高的院墙。墙边松柏翠绿，门前有几个身着青布僧衣的僧人在低着头扫地。仔细看，个个身材魁梧，体格健壮。原来这里就是有名的少林别院，被世人称为南少林的福建莆田少林寺。山门上方高悬着一块烫金木匾(bian)。]],
  exit = {
    e = { to = '莆田少林小路#1E', },
    nd = { to = '莆田少林石阶#2', },
    w = { to = '莆田少林小路#1W', },
    s = { to = '莆田少林前院', door = 'knock gate', },
  },
},

['莆田少林油菜地'] = {
  id = '莆田少林油菜地',
  area = '莆田少林',
  name = '油菜地',
  desc =  [[这是一大片油菜地，大片大片的油菜花开的到处都是。空气中弥漫着菜花的香气。蜜蜂飞来飞去，忙碌个不停。地头上放着一副扁担，旁边还有一个大木桶，里面有半下水。]],
  exit = {
    s = { to = '莆田少林小路#3E', },
  },
},

['莆田少林小院#SE'] = {
  id = '莆田少林小院#SE',
  area = '莆田少林',
  name = '小院',
  desc =  [[这是一个幽静的无人小院，地上整齐的铺着一块块条石。北面有个不大的月亮门，连接着一个走廊，仿佛可以一直通往前院。西面的方向是广场，不时传来阵阵嘈杂的人声。]],
  exit = {
    e = { to = '莆田少林侧廊#SE', },
    s = { to = '莆田少林六祖殿', },
    w = { to = '莆田少林广场', },
    n = { to = '莆田少林侧廊#E', },
  },
},

['莆田少林山路#2'] = {
  id = '莆田少林山路#2',
  area = '莆田少林',
  name = '山路',
  desc =  [[这里是一条山中小路，路上没有行人，但是可以依稀看见有车马走过的痕迹，看来还不算荒僻。满山都开着一种红花，向远处望去，能看到各种颜色的蝴蝶在半空中飞舞着，很是绚丽夺目。]],
  exit = {
    se = { to = '莆田少林山路#3', },
    n = { to = '莆田少林山路#1', },
  },
},

['莆田少林小路#1E'] = {
  id = '莆田少林小路#1E',
  area = '莆田少林',
  name = '小路',
  desc =  [[这是一条小路，路的一边是高高的墙壁，看起来一般人很难爬上去。看不到墙里面的情况。偶尔可以听见远处传来的僧人们练武的声音。路旁开着一种野花，颜色鲜红，很是好看。]],
  exit = {
    w = { to = '莆田少林山门', },
    e = { to = '莆田少林小路#2E', },
  },
},

['莆田少林石阶#1'] = {
  id = '莆田少林石阶#1',
  area = '莆田少林',
  name = '石阶',
  desc =  [[向上的山路继续变窄，一行古旧的石阶出现在你脚下。石块平整均匀，有些已经长了青苔。脚踏在上面很柔软，但是很滑。不远处可以看见一个小凉亭。]],
  exit = {
    wd = { to = '莆田少林山路#5', },
    su = { to = '莆田少林山路#6', },
  },
},

['莆田少林小路#1W'] = {
  id = '莆田少林小路#1W',
  area = '莆田少林',
  name = '小路',
  desc =  [[这是一条小路，路的一边是高高的墙壁，看起来一般人很难爬上去。看不到墙里面的情况，但是可以听见远处传来的僧人们练武的声音。路旁开着一种野花，颜色鲜红，很是好看。]],
  exit = {
    w = { to = '莆田少林小路#2W', },
    e = { to = '莆田少林山门', },
  },
},

['莆田少林前院'] = {
  id = '莆田少林前院',
  area = '莆田少林',
  name = '前院',
  desc =  [[这是山门内的一个大院子，很空荡，地上整齐的铺着一块块条石。靠近院子的东南角，放有一个兵器架，上面整齐的摆着各式兵器。几个身穿灰布的僧人正在一边练武。另外有几个身着青布僧衣的僧人，手里拿着大扫帚在低着头扫地。闻名武林的莆田少林寺，看来似乎也很普通。]],
  exit = {
    e = { to = '莆田少林小院#E', },
    s = { to = '莆田少林慈悲殿', },
    w = { to = '莆田少林小院#W', },
    n = { to = '莆田少林山门', door = 'open gate', },
  },
},

['莆田少林广场'] = {
  id = '莆田少林广场',
  area = '莆田少林',
  name = '广场',
  desc =  [[这是寺中的广场，广场面积很大很宽阔，地上铺了一层青色的方砖，个别地方的方砖有些不平，仔细看能看见有象脚印形状的凹陷。北面是高大的慈悲殿，南面是威严的大雄宝殿，琉璃的尖顶在阳光下闪着光。]],
  exit = {
    e = { to = '莆田少林小院#SE', },
    su = { to = '莆田少林大雄宝殿', },
    w = { to = '莆田少林小院#SW', },
    n = { to = '莆田少林慈悲殿', },
  },
},

['莆田少林前殿'] = {
  id = '莆田少林前殿',
  area = '莆田少林',
  name = '前殿',
  desc =  [[这是寺中的前殿，殿中面积很大很宽阔，地上铺了一层青色的方砖，个别地方的方砖有些不平，仔细看能看见有象脚印形状的凹陷。北面是高大的大雄宝殿，琉璃的尖顶在阳光下闪着光。南面是中殿，一条石板路通向后院。]],
  exit = {
    nu = { to = '莆田少林大雄宝殿', },
    s = { to = '莆田少林中殿', },
  },
},

['莆田少林暖阁'] = {
  id = '莆田少林暖阁',
  area = '莆田少林',
  name = '暖阁',
  desc =  [[这里是一间暖阁，对墙的地方摆放着很多红木箱子和大木柜，上面都贴有封条。看来里面保存的都是些很重要的东西。暖阁里点了几根蜡烛，烛光昏黄显得这里更加神秘莫测。]],
  exit = {
    w = { to = '莆田少林长廊#E', },
  },
},

['莆田少林麻田地#1'] = {
  id = '莆田少林麻田地#1',
  area = '莆田少林',
  name = '麻田地',
  desc =  [[这是一大片麻田地，地里扔着几个锄头，旁边有一堆地里锄下来的乱草，地旁边有棵小树上搭着一件衣服。看来人好象还没走远。]],
  exit = {
    sd = { to = '莆田少林麻田地#2', },
    n = { to = '莆田少林小路#4W', },
  },
},

['莆田少林小院#W'] = {
  id = '莆田少林小院#W',
  area = '莆田少林',
  name = '小院',
  desc =  [[这是一个寂静幽雅的小院，地上整齐的铺着一块块方砖。南面有个不大的月亮门，连接着一个走廊，仿佛可以一直通往后院。东面的方向是前院，不时传来阵阵嘈杂的人声。]],
  exit = {
    e = { to = '莆田少林前院', },
    s = { to = '莆田少林侧廊#W', },
  },
},

['莆田少林小院#E'] = {
  id = '莆田少林小院#E',
  area = '莆田少林',
  name = '小院',
  desc =  [[这是一个幽静的无人小院，地上整齐的铺着一块块条石。南面有个不大的月亮门，连接着一个走廊，仿佛可以一直通往后院。西面的方向是前院，不时传来阵阵嘈杂的人声。]],
  exit = {
    w = { to = '莆田少林前院', },
    s = { to = '莆田少林侧廊#E', },
  },
},

['莆田少林慈悲殿'] = {
  id = '莆田少林慈悲殿',
  area = '莆田少林',
  name = '慈悲殿',
  desc =  [[这里是慈悲殿，是莆田少林寺的几座重要建筑其中之一。殿中宽阔，很安静，两旁立着一些金身佛像，气氛庄严肃穆。几个身穿青布僧衣的小沙弥在忙碌地擦拭着案上的灰尘。]],
  exit = {
    s = { to = '莆田少林广场', },
    n = { to = '莆田少林前院', },
  },
},

['莆田少林僧舍'] = {
  id = '莆田少林僧舍',
  area = '莆田少林',
  name = '僧舍',
  desc =  [[这里是僧众们饮食起居的地方。靠墙一溜摆着几张木床，床上铺的是篾席。床头叠着床薄被，冬天想必很冷，僧侣们全靠扎实的内功根基御寒。地上整齐的放着几个蒲团和木鱼。]],
  exit = {
    s = { to = '莆田少林侧廊#SE', },
  },
},

['莆田少林法堂#E'] = {
  id = '莆田少林法堂#E',
  area = '莆田少林',
  name = '法堂',
  desc =  [[这是寺中讲经的法堂，可以同时容纳几百人而绝无问题。这里是寺中演说佛经，佛法和阪戒集会的场所。殿内整齐的放着一排排的蒲团，以供听经者打坐之用。]],
  exit = {
    w = { to = '莆田少林后殿', },
  },
},

['莆田少林戒持院'] = {
  id = '莆田少林戒持院',
  area = '莆田少林',
  name = '戒持院',
  desc =  [[这里是戒持院，相当于嵩山少林本院的戒律院。整个大殿门户紧闭，密不透风。即便是在白昼，也犹如黑夜一般，墙上点着几枝蜡烛。殿上供奉着降魔韦陀，下方摆着一排水牛皮鞭、穿孔竹板及狼牙棒等执法刑杖。四周站满了怀抱戒刀的执法僧兵。他们正用威严的眼神打量着你，令你不禁心生惧意。]],
  exit = {
    e = { to = '莆田少林长廊#E', },
    s = { to = '莆田少林静室', },
    w = { to = '莆田少林长廊#W', },
    n = { to = '莆田少林须弥殿', },
  },
},

['莆田少林山路#4'] = {
  id = '莆田少林山路#4',
  area = '莆田少林',
  name = '山路',
  desc =  [[这里是一条山中小路，路上没有行人，但是可以依稀看见有车马走过的痕迹，看来还不算荒僻。满山都开着一种红花，向远处望去，能看到各种颜色的蝴蝶在半空中飞舞着，很是绚丽夺目。南面就是德化城啦。东北方是一条更窄的山路。]],
  exit = {
    ne = { to = '莆田少林山路#5', },
    w = { to = '莆田少林山路#3', },
  },
},

['莆田少林静室'] = {
  id = '莆田少林静室',
  area = '莆田少林',
  name = '静室',
  desc =  [[小小一间静室，少林寺方丈天虹禅师端坐在禅床上，身前有张小几，几上小香炉中檀香青烟袅袅上升，对面壁上挂着一幅白描的寒山拾得图，寥寥不多几笔，却画得两位高僧神采栩栩。]],
  exit = {
    n = { to = '莆田少林戒持院', },
  },
},

['莆田少林麻田地#2'] = {
  id = '莆田少林麻田地#2',
  area = '莆田少林',
  name = '麻田地',
  desc =  [[日头火辣辣的晒着你的后背。眼前是一大片麻田地，田间好象隐约可以看见有几个破草帽。地旁边有一片黑压压的树林，灌木高高矮矮，不是很整齐。地头的空地上，有一个僧人正在站着擦汗。]],
  exit = {
    nu = { to = '莆田少林麻田地#1', },
  },
},

['莆田少林小路#3E'] = {
  id = '莆田少林小路#3E',
  area = '莆田少林',
  name = '小路',
  desc =  [[这是一条小路，路的一边是高高的墙壁，看起来一般人很难爬上去。看不到墙里面的情况。偶尔可以听见远处传来的僧人们练武的声音。路旁开着一种野花，颜色鲜红，很是好看。]],
  exit = {
    wu = { to = '莆田少林小路#2E', },
    n = { to = '莆田少林油菜地', },
  },
},

['莆田少林侧廊#W'] = {
  id = '莆田少林侧廊#W',
  area = '莆田少林',
  name = '侧廊',
  desc =  [[这是一条幽静的长廊，长廊顶上的画梁上画有许多佛经中的故事，最上面是红色的琉璃瓦，地上铺着一层细碎的石子。南北两面都有个月亮门，分别通向前后院。偶尔有小沙弥低着头匆匆走过。]],
  exit = {
    s = { to = '莆田少林小院#SW', },
    n = { to = '莆田少林小院#W', },
  },
},

['莆田少林大乘殿'] = {
  id = '莆田少林大乘殿',
  area = '莆田少林',
  name = '大乘殿',
  desc =  [[这里是大乘殿，殿中香火很多，门口有一个镂刻得十分精美的大香炉，香炉前面是一张深色的供桌，桌后面立着一个很大的屏风。屏风后面靠墙壁高高的摆放着几尊佛像。大殿南面也有一个门。]],
  exit = {
    su = { to = '莆田少林武功阁', },
    w = { to = '莆田少林罗汉堂', },
    n = { to = '莆田少林小径#E', },
  },
},

['莆田少林达摩院'] = {
  id = '莆田少林达摩院',
  area = '莆田少林',
  name = '达摩院',
  desc =  [[这里是达摩院，大殿两旁摆满了供桌、香炉、蒲团。因为是寺中重地，所以平常这里很少有外人可以进入，达摩院的武僧平常也念经焚香，同时他们负有巡逻、警戒寺中各处要地的责任。]],
  exit = {
    w = { to = '莆田少林妙法殿', },
  },
},

['莆田少林石阶#2'] = {
  id = '莆田少林石阶#2',
  area = '莆田少林',
  name = '石阶',
  desc =  [[窄窄的石阶继续在向山上延伸，山风吹来，带来一阵阵凉意。山势虽然不是很陡峭，但是也有些吃力。眼看着三两个僧人健步如飞，从你身旁经过，看来好象身怀高深武功。]],
  exit = {
    su = { to = '莆田少林山门', },
    nd = { to = '莆田少林山路#6', },
  },
},

['莆田少林凉亭'] = {
  id = '莆田少林凉亭',
  area = '莆田少林',
  name = '凉亭',
  desc =  [[这是半山腰的一个小凉亭，中央放有一张白色的石头桌(table)，周围零散摆有四五个石头凳(chair)。有几个劲装打扮的外地人，正坐在那里休息乘凉。一个小和尚手里捧着茶壶站在一旁。]],
  exit = {
    out = { to = '莆田少林山路#6', },
  },
},

['莆田少林侧廊#SE'] = {
  id = '莆田少林侧廊#SE',
  area = '莆田少林',
  name = '侧廊',
  desc =  [[这是一条幽静的长廊，长廊顶上的画梁上画有许多佛经中的故事，最上面是红色的琉璃瓦，地上铺着一层细碎的石子。西面有个月亮门，通往寺中广场。偶尔有小沙弥低着头匆匆走过。]],
  exit = {
    s = { to = '莆田少林小径#E', },
    w = { to = '莆田少林小院#SE', },
    n = { to = '莆田少林僧舍', },
  },
},

['莆田少林妙法殿'] = {
  id = '莆田少林妙法殿',
  area = '莆田少林',
  name = '妙法殿',
  desc =  [[这里是妙法殿，殿中香火很多，门口有一个镂刻得十分精美的大香炉，香炉前面是一张深色的供桌，桌后面立着一个很大的屏风。从这里出去南面就是藏经阁了。]],
  exit = {
    e = { to = '莆田少林达摩院', },
    su = { to = '莆田少林藏经阁', },
    n = { to = '莆田少林小径#W', },
  },
},

['莆田少林小路#4W'] = {
  id = '莆田少林小路#4W',
  area = '莆田少林',
  name = '小路',
  desc =  [[这是一条小路，路的一边是高高的墙壁。有一处的墙头掉了几块砖，看起来显得更加古朴。偶尔可以听见远处传来的僧人们练武的声音。路旁开着一种野花，颜色鲜红，很是好看。]],
  exit = {
    ne = { to = '莆田少林小路#3W', },
    s = { to = '莆田少林麻田地#1', },
  },
},

['莆田少林小径#E'] = {
  id = '莆田少林小径#E',
  area = '莆田少林',
  name = '小径',
  desc =  [[这是一条幽静的小径，两旁和四周的树丛修剪的很整齐，地上铺着一层细碎的石子。]],
  exit = {
    s = { to = '莆田少林大乘殿', },
    n = { to = '莆田少林侧廊#SE', },
  },
},

['星宿海天然石洞'] = {
  id = '星宿海天然石洞',
  area = '星宿海',
  name = '天然石洞',
  desc =  [[这里就是星宿派老巢的储藏处。从外面看只是一个开在石山上的普通天然石洞，因为地点隐密，而且洞中空气十分干燥，星宿派弟子便将这里改造成了一个绝佳的储藏库。]],
  exit = {
    out = { to = '星宿海星宿海#2', },
  },
},

['星宿海虫谷入口'] = {
  id = '星宿海虫谷入口',
  area = '星宿海',
  name = '虫谷入口',
  desc =  [[又走了一程，越走越荒凉，转入了一处阴森森的山谷之中，眼见四下里阴沉沉的，似乎有毒雾弥漫，不是久留之所。面前有一个木制的大门，上面有一把金制大锁，还有一名星宿派的弟子在这里做守卫，不许外人随便进去。在路旁边，竖着一块木制的牌子，牌子由上到下写着「毒虫谷」三个字，你不由得惊讶地啊了一声，怎么闯到了这个地方。]],
  exit = {
    sw = { to = '星宿海山前荒地', },
    n = { to = '星宿海毒虫谷#E', door = 'order remove', cond = 'player.party == "星宿派"', },
  },
},

['星宿海毒虫谷#E'] = {
  id = '星宿海毒虫谷#E',
  area = '星宿海',
  name = '毒虫谷',
  desc =  [[一片平坦谷地，四周是大山环绕。四周阴沉沉的，气氛十分恐怖。谷内瘴气四起，各种毒物，不计其数，地下都是陈年腐草败叶烂成的软泥。寒风从山谷通道中刮进来，吹得你肌肤隐隐生疼。]],
  exit = {
    s = { to = '星宿海虫谷入口', door = 'yell open;#wa 1500', },
    nw = { to = '星宿海毒虫谷#M', cond = 'player.exp >= 3000', },
  },
},

['星宿海毒虫谷#M'] = {
  id = '星宿海毒虫谷#M',
  area = '星宿海',
  name = '毒虫谷',
  desc =  [[一片平坦谷地，四周是大山环绕。四周阴沉沉的，气氛十分恐怖。谷内瘴气四起，各种毒物，不计其数，地下都是陈年腐草败叶烂成的软泥。寒风从山谷通道中刮进来，吹得你肌肤隐隐生疼。]],
  exit = {
    s = { to = '星宿海毒虫谷#M', },
    n = { to = '星宿海毒虫谷#M', },
    e = { to = '星宿海毒虫谷#M', },
    w = { to = '星宿海毒虫谷#M', },
    se = { to = '星宿海毒虫谷#E', ignore = true, unstable = true, },
    hidden = { to = '星宿海毒虫谷#E', cost = 5, handler = 'xx_duchonggu', },
  },
},

['星宿海星宿海#M'] = {
  id = '星宿海星宿海#M',
  area = '星宿海',
  name = '星宿海',
  desc = { [[这里是星宿海。方圆几百里都是一望无际的湖泊和沼泽，被当地牧羊人称之为“海”。也因阴暗潮湿，毒虫繁殖甚富。星宿弟子常来此捕捉毒虫，以备练毒之用。这里通向星宿海的深处。]], [[这里是星宿海。因方圆几百里都是一望无际的湖泊和沼泽，当地牧羊人称之为“海”。也因阴暗潮湿，毒虫繁殖甚富。星宿弟子常来此捕捉毒虫，以备练毒之用。这里通向星宿海的深处。]] },
  exit = {
    e = { to = '星宿海小路', cost = 3, handler = 'go_straight', },
    e2 = { to = '星宿海星宿海#M', },
    s = { to = '星宿海星宿海#1', cost = 6, handler = 'go_straight', },
    s2 = { to = '星宿海星宿海#M', },
    w = { to = '星宿海海边荒路', cost = 3, handler = 'go_straight', },
    w2 = { to = '星宿海星宿海#M', },
    n = { to = '星宿海山前荒地', cost = 6, handler = 'go_straight', },
    n2 = { to = '星宿海星宿海#M', },
  },
},

['星宿海丝绸之路#3'] = {
  id = '星宿海丝绸之路#3',
  area = '星宿海',
  name = '丝绸之路',
  desc =  [[这是闻名中外的丝绸商道。迎面而来的是一个个沙包，星罗棋布於荒原之上。一阵风沙吹过，象刀割一样撕裂着你的脸。东边是颂摩崖，继续往西走便是]],
  exit = {
    eu = { to = '星宿海颂摩崖', },
    nw = { to = '星宿海胭脂山', },
    w = { to = '星宿海石门', },
  },
},

['星宿海星宿海#1'] = {
  id = '星宿海星宿海#1',
  area = '星宿海',
  name = '星宿海',
  desc =  [[这里是天山脚下的星宿海海边。因为方圆几百里都是一望无际的湖泊和沼泽，所以被当地牧人称为“海”。一旦有几只离群的羊迷失在“海”里，便再也找不着了。臭名昭著的星宿派总坛便设在北面的海中央。]],
  exit = {
    se = { to = '伊犁城惠远', },
    s = { to = '星宿海天山脚下', },
    n = { to = '星宿海星宿海#M', },
  },
},

['星宿海天阁斋分店'] = {
  id = '星宿海天阁斋分店',
  area = '星宿海',
  name = '天阁斋分店',
  desc =  [[这是老字号钱庄天阁斋位于嘉峪关的分店，开了大约有几十年了，天阁斋在全国各地都有分店。它发行的银票信誉非常好，通行全国。墙上挂有一个牌子(sign)。]],
  exit = {
    n = { to = '星宿海雁门关', },
  },
},

['星宿海胭脂山'] = {
  id = '星宿海胭脂山',
  area = '星宿海',
  name = '胭脂山',
  desc =  [[胭脂山因山石赭红似胭脂而得名。这里水草丰美，宜于畜牧。冰雪融化，清流缓缓而下，汇集成渠。山下绿草如茵的马营草场滩，是久负盛名的牧场。]],
  exit = {
    sd = { to = '星宿海石门', },
    nw = { to = '星宿海人头疙瘩', },
    se = { to = '星宿海丝绸之路#3', },
  },
},

['星宿海丝绸之路#4'] = {
  id = '星宿海丝绸之路#4',
  area = '星宿海',
  name = '丝绸之路',
  desc =  [[这是闻名中外的丝绸商道。风沙弥漫，一片荒凉景象。南面连绵的祁连山脉在阳光的照射下好像是一条玉带。只是有几人合抱之粗的古老胡杨，仍然挺立在荒原上，笑迎风沙，频频招呼行人。西南是一片黄沙，传过沙漠就可以到达昆仑山脉。]],
  exit = {
    sw = { to = '星宿海大沙漠#MJ', },
    nw = { to = '星宿海沙洲', },
    se = { to = '星宿海石门', },
  },
},

['星宿海大沙漠#HJ'] = {
  id = '星宿海大沙漠#HJ',
  area = '星宿海',
  name = '大沙漠',
  desc =  [[这是一片一望无际的大沙漠。你一进来就迷失了方向。看来要走出这块沙漠并非易事。]],
  exit = {
    e = { to = '星宿海丝绸之路#6', cost = 5, handler = 'go_straight', },
    e2 = { to = '星宿海大沙漠#HJ', },
    s = { to = '星宿海大沙漠#HJ', },
    w = { to = '回疆草原边缘', cost = 5, handler = 'go_straight', },
    w2 = { to = '星宿海大沙漠#HJ', },
    n = { to = '星宿海大沙漠#HJ', },
  },
},

['星宿海丝绸之路#6'] = {
  id = '星宿海丝绸之路#6',
  area = '星宿海',
  name = '丝绸之路',
  desc =  [[这是闻名中外的丝绸商道。风沙弥漫，一片荒凉景象。这儿常有盗匪出没。西北通向一片连绵的山脉，东面就是通向中原的路。路边有一块石碑(shibei)。]],
  exit = {
    nw = { to = '星宿海天山脚下', },
    w = { to = '星宿海大沙漠#HJ', },
    se = { to = '星宿海吐谷浑伏俟城', },
  },
},

['星宿海月牙泉'] = {
  id = '星宿海月牙泉',
  area = '星宿海',
  name = '月牙泉',
  desc =  [[出乎你的意料之外，在沙漠中竟然有一汪月牙形的泉水，涟漪萦回，水草丛生，清澈见底。这里出产铁背鱼、七星草，但不常见。此泉虽在流沙山群中，风起沙飞，均绕泉而过，从不落入泉内。北面是一片峭壁(cliff) ，东边传来嗡嗡的声响。]],
  exit = {
    w = { to = '星宿海人头疙瘩', },
    se = { to = '星宿海万象洞', },
    hidden = { to = '星宿海莫高窟', cmd = 'enter hole', cond = 'player.encumbrance < 20', },
  },
},

['星宿海莫高窟'] = {
  id = '星宿海莫高窟',
  area = '星宿海',
  name = '莫高窟',
  desc = [[这里是敦煌莫高窟，窟内墙壁上绘制着与佛教相关的画面，有仙女飞天，还有反弹琵琶。洞中还有很多佛像和经书。你被这些瑰丽的文化之宝惊呆了。]],
  exit = {
    out = { to = '星宿海月牙泉', },
  },
},

['星宿海石门'] = {
  id = '星宿海石门',
  area = '星宿海',
  name = '石门',
  desc =  [[这里两峰对峙，形如门，故名。又因常有虎豹出没，俗称卧虎台。山壁高立千仞，苍翠欲滴。四周峭壁无径，中间一条小路。真是一座天险。]],
  exit = {
    nu = { to = '星宿海胭脂山', },
    nw = { to = '星宿海丝绸之路#4', },
    s = { to = '星宿海兴隆山', },
    e = { to = '星宿海丝绸之路#3', },
  },
},

['星宿海日月洞口'] = {
  id = '星宿海日月洞口',
  area = '星宿海',
  name = '日月洞口',
  desc =  [[这里是星宿海的尽头。因方圆几百里都是一望无际的湖泊和沼泽，当地牧羊人称之为“海”。北边是一座小石山，星宿派总舵日月洞便设在这里，洞口立着一个铜制牌子(paizi)。]],
  exit = {
    e = { to = '星宿海星宿海#M', },
    sd = { to = '星宿海山前荒地', },
    w = { to = '星宿海星宿海#M', },
    n = { to = '星宿海日月洞', },
  },
},

['星宿海万里长城#W'] = {
  id = '星宿海万里长城#W',
  area = '星宿海',
  name = '万里长城',
  desc =  [[这里是万里长城的极西端，城墙高大厚实，上面不时有身穿铠甲的士兵来回在走动巡逻。往西走便是著名的边关“嘉峪关”，往东通往中原，途中土城是军需粮仓大方盘城。]],
  exit = {
    e = { to = '星宿海大方盘城', },
    wd = { to = '星宿海嘉峪关东城门', },
  },
},

['星宿海山壁'] = {
  id = '星宿海山壁',
  area = '星宿海',
  name = '山壁',
  desc =  [[一条草草在山壁上人工开凿出来崎岖的小路，几个星宿弟子正在埋头苦干。这里，寒风凛冽，西面是望浩浩百里方圆的星宿海。东边山壁上，尽是星宿弟子用力砸出的坑凹(ao)。]],
  exit = {
    sd = { to = '星宿海小路', },
  },
},

['星宿海仙人崖'] = {
  id = '星宿海仙人崖',
  area = '星宿海',
  name = '仙人崖',
  desc =  [[这里以传说有神仙出没而得名，每到盛夏夜，火光从崖面飞出，名曰仙人送灯。面山带水，群峰环峙，野草蒙茸，奇花异树，清幽险峻，令人绝俗。]],
  exit = {
    nw = { to = '星宿海水帘洞', },
    ne = { to = '星宿海丝绸之路#1', },
  },
},

['星宿海药庐'] = {
  id = '星宿海药庐',
  area = '星宿海',
  name = '药庐',
  desc =  [[这里是星宿派的药庐。星宿弟子性格凶残者极多，经常打家劫舍，所以也经常受伤，这里准备了一些毒虫粉，冰魄粉，红磷粉，银磷粉，放在柜子上。屋子角落处摆着一口大铁锅（guo），是星宿弟子自己熬毒药用的。]],
  exit = {
    s = { to = '星宿海日月洞', },
  },
},

['星宿海山石'] = {
  id = '星宿海山石',
  area = '星宿海',
  name = '山石',
  desc =  [[这里是星宿海海边一处山石。东面是方圆几百里都是一望无际的湖泊和沼泽。因为阴冷潮湿，此处毒虫繁殖甚富。星宿派弟子常来此捕捉毒虫，以备练毒之用。南边有个黑黢黢的山洞(cave)。]],
  exit = {
    ed = { to = '星宿海海边荒路', },
    hidden = { to = '星宿海山洞#1', },
  },
},

['星宿海山洞#1'] = {
  id = '星宿海山洞#1',
  area = '星宿海',
  name = '山洞',
  desc = [[黑黝黝的山洞里，有一股腥臭味。等眼睛适应了这里的弱光后，才发现地上有一条色彩斑斓的巨蟒。巨蟒旁有许多白惨惨的骨骇，令人胆寒。想必都是探险之人，误入山洞，为巨蟒所害。]],
  exit = {
    out = { to = '星宿海山石', },
    hidden = { to = '星宿海山洞#2', handler = 'xx_cave', },
  },
},

['星宿海山洞#2'] = {
  id = '星宿海山洞#2',
  area = '星宿海',
  name = '山洞',
  desc = [[本来是黑黝黝的山洞里，伸手不见五指。只有一丝微光从洞顶的裂缝透进来，可以勉强看见正中央有一个石棺，散发着浓厚的腐尸气味，微光下更显得洞内阴森可怕。一个鬼一般的人影坐在石壁边，两只闪着蓝光的眼睛正盯着你看，山壁上有人工修缮之处。]],
  exit = {
    hidden = { to = '星宿海山洞#1', handler = 'xx_cave', },
  },
},

['星宿海仇池山'] = {
  id = '星宿海仇池山',
  area = '星宿海',
  name = '仇池山',
  desc =  [[这里绝壁峭峙，孤险云高，山峰拔地而起，直刺蓝天。山顶平田千亩，风景秀美，物产丰饶，气候温和，泉水多，胜迹遍山。仇池石色赭红，吸水性能强，适宜养育小树花卉。远远可以看见东南边有一座雄伟的关隘。]],
  exit = {
    sw = { to = '星宿海水帘洞', },
    se = { to = '星宿海丝绸之路#1', },
    n = { to = '星宿海丝绸之路#2', },
  },
},

['星宿海大沙漠#MJ'] = {
  id = '星宿海大沙漠#MJ',
  area = '星宿海',
  name = '大沙漠',
  desc =  [[这是一片一望无际的大沙漠的入口。你一进来就迷失了方向。在冬天时能看见一片片的积雪，西边是一个个小沙丘。]],
  exit = {
    w = { to = '明教小沙丘#1', },
    ne = { to = '星宿海丝绸之路#4', },
  },
},

['星宿海丝绸之路#1'] = {
  id = '星宿海丝绸之路#1',
  area = '星宿海',
  name = '丝绸之路',
  desc =  [[这是闻名中外的丝绸商道。迎面而来的是一个个沙包，星罗棋布於荒原之上。一阵风沙吹过，象刀割一样撕裂着你的脸。东边有一座雄伟的关隘，西面则通往西域。]],
  exit = {
    e = { to = '星宿海嘉峪关西城门', },
    sw = { to = '星宿海仙人崖', },
    nw = { to = '星宿海仇池山', },
  },
},

['星宿海嘉峪关东城门'] = {
  id = '星宿海嘉峪关东城门',
  area = '星宿海',
  name = '嘉峪关东城门',
  desc =  [[这是长城最西的关隘嘉峪关东城门。再往西就进关了，这儿有军队驻扎，不时盘问来往行人。你小心翼翼，急步离开这是非之地。出关向东，联结的便是著名的“万里长城”。城门的墙上张贴着一纸告示(gaoshi)。]],
  exit = {
    w = { to = '星宿海雁门关', },
    eu = { to = '星宿海万里长城#W', },
  },
},

['星宿海颂摩崖'] = {
  id = '星宿海颂摩崖',
  area = '星宿海',
  name = '颂摩崖',
  desc =  [[颂摩崖又名黄龙碑。周围山势陡峭，两山对峙，一泓中流，两峡旁有潭，渊深莫测。俗传有黄龙自潭飞出，因名黄龙潭。潭左侧摩崖成碑。汉隶真迹，笔触遒劲，刀刻有力，记叙了开天井道的过程。往东南是仇池山，往西则是石门。]],
  exit = {
    ed = { to = '星宿海丝绸之路#2', },
    wd = { to = '星宿海丝绸之路#3', },
    n = { to = '星宿海鸣沙山', },
  },
},

['星宿海峭壁'] = {
  id = '星宿海峭壁',
  area = '星宿海',
  name = '峭壁',
  desc =  [[这里是颂摩崖之峭壁，从这里望去，北面正是星宿一带，南面是雁门关。站在高处，你不由感到风光无限好。]],
  exit = {
    hidden = { to = '星宿海颂摩崖', cmd = 'jump down', cond = 'player.enable.dodge and player.enable.dodge.level >= 200', },
  },
},

['星宿海丝绸之路#2'] = {
  id = '星宿海丝绸之路#2',
  area = '星宿海',
  name = '丝绸之路',
  desc =  [[这是闻名中外的丝绸商道。迎面而来的是一个个沙包，星罗棋布於荒原之上。一阵风沙吹过，象刀割一样撕裂着你的脸。东南过仇池山通往嘉峪关，西面则是颂摩崖。]],
  exit = {
    s = { to = '星宿海仇池山', },
    wu = { to = '星宿海颂摩崖', },
  },
},

['星宿海万里长城#E'] = {
  id = '星宿海万里长城#E',
  area = '星宿海',
  name = '万里长城',
  desc =  [[这里是万里长城的极西端，城墙高大厚实，上面不时有身穿铠甲的士兵来回在走动巡逻。往西走便是著名的边关“嘉峪关”，往东通往中原，但必须先渡过黄河。]],
  exit = {
    w = { to = '星宿海大方盘城', },
    se = { to = '兰州城武威', },
  },
},

['星宿海大方盘城'] = {
  id = '星宿海大方盘城',
  area = '星宿海',
  name = '大方盘城',
  desc =  [[此城是本朝西部防线储备粮草的军需仓库。坐落在高出河床两米许的自然土台上。呈长方形，坐北向南，粘土版筑，四壁已多有残颓。城门口有几个无精打采的士兵。一队队骆驼商队从你身边走过。]],
  exit = {
    w = { to = '星宿海万里长城#W', },
    e = { to = '星宿海万里长城#E', },
  },
},

['星宿海嘉峪关西城门'] = {
  id = '星宿海嘉峪关西城门',
  area = '星宿海',
  name = '嘉峪关西城门',
  desc =  [[这是长城最西的关隘嘉峪关西城门。再往西就称西域了，因此这儿有军队驻扎，不时盘问来往行人。你小心翼翼，急步离开这是非之地。出关向西，便是著名的“丝绸之路”。你一踏上西域荒道，忍不住回过头来再望一下嘉峪关。发觉岁月沧桑，仍掩不住它的风采。群山环抱之下，更显它的雄浑。城门的墙上张贴着一纸告示(gaoshi)。]],
  exit = {
    w = { to = '星宿海丝绸之路#1', },
    e = { to = '星宿海雁门关', },
  },
},

['星宿海水帘洞'] = {
  id = '星宿海水帘洞',
  area = '星宿海',
  name = '水帘洞',
  desc =  [[这里群峰高耸，沿曲径入幽林，峰回路转，石壁中露出有拱形洞窟，洞内水锈青苔，红绿班驳，乱石穿孔。雨季山顶飞流直下如水帘，因有此名。]],
  exit = {
    ne = { to = '星宿海仇池山', },
    se = { to = '星宿海仙人崖', },
  },
},

['星宿海鸣沙山'] = {
  id = '星宿海鸣沙山',
  area = '星宿海',
  name = '鸣沙山',
  desc =  [[此山高数十米，山峰陡峭，势如刀刃。北麓有月牙泉。登山俯瞰，沙丘林立，清泉荡漾。从山顶下滑沙砾随人体下坠，鸣声不绝于耳，兴味盎然。故称“沙岭晴鸣”。]],
  exit = {
    w = { to = '星宿海万象洞', },
    s = { to = '星宿海颂摩崖', },
  },
},

['星宿海兴隆山'] = {
  id = '星宿海兴隆山',
  area = '星宿海',
  name = '兴隆山',
  desc =  [[此山东西两面山坡上，天然林密布，有云杉、松、桦、柳、杨等乔木及灌木丛。峰峦叠翠，四季长青。上有太白、玉液泉，汇成小溪山涧，清流潺潺。中有大峡河，清澈见底，南北穿越峡谷。地阴潮湿，气温较低，为游览避暑胜地。]],
  exit = {
    n = { to = '星宿海石门', },
  },
},

['星宿海吐谷浑伏俟城'] = {
  id = '星宿海吐谷浑伏俟城',
  area = '星宿海',
  name = '吐谷浑伏俟城',
  desc =  [[这里是吐谷浑都城。吐谷浑原为鲜卑的一支，游牧于北方。后来首领吐谷浑率所部西迁于此。以吐谷浑为国名。其可汗现正居于伏俟城内。城内混居了周围的多个民族，走在大街上看到和听到的无不透着新奇。]],
  exit = {
    s = { to = '星宿海南疆沙漠#1', },
    e = { to = '星宿海沙洲', },
    w = { to = '星宿海万宝斋', },
    nw = { to = '星宿海丝绸之路#6', },
    n = { to = '星宿海丝绸之路#5', },
  },
},

['星宿海南疆沙漠#1'] = {
  id = '星宿海南疆沙漠#1',
  area = '星宿海',
  name = '南疆沙漠',
  desc = [[这就是浩瀚的塔克拉马干大沙漠，一走进来，你仿佛迷失了方向。你感到口内十分焦渴，还是快些离开吧。]],
  exit = {
    ne = { to = '星宿海南疆沙漠#1', },
    sw = { to = '星宿海南疆沙漠#1', },
    nw = { to = '星宿海南疆沙漠#M', no_wander = true, handler = 'simple_path_set_pos', },
    se = { to = '星宿海南疆沙漠#1', },
    w = { to = '星宿海南疆沙漠#1', },
    s = { to = '星宿海南疆沙漠#1', },
    n = { to = '星宿海吐谷浑伏俟城', },
    e = { to = '星宿海南疆沙漠#1', },
  },
},

['星宿海南疆沙漠#M'] = {
  id = '星宿海南疆沙漠#M',
  area = '星宿海',
  name = '南疆沙漠',
  desc = [[这就是浩瀚的塔克拉马干大沙漠，一走进来，你仿佛迷失了方向。你感到口内十分焦渴，还是快些离开吧。]],
  exit = {
    ne = { to = '星宿海南疆沙漠#1', },
    sw = { to = '星宿海南疆沙漠#M', },
    nw = { to = '星宿海南疆沙漠#M', },
    se = { to = '星宿海南疆沙漠#M', },
    w = { to = '星宿海南疆沙漠#M', },
    s = { to = '星宿海南疆沙漠#M', },
    n = { to = '星宿海南疆沙漠#M', },
    e = { to = '星宿海南疆沙漠#M', },
    hidden1 = { to = '星宿海南疆沙漠#2', handler = 'simple_path', cost = 2, },
  },
},

['星宿海南疆沙漠#2'] = {
  id = '星宿海南疆沙漠#2',
  area = '星宿海',
  name = '南疆沙漠',
  desc = [[这就是浩瀚的塔克拉马干大沙漠，一走进来，你仿佛迷失了方向。你感到口内十分焦渴，还是快些离开吧。]],
  exit = {
    ne = { to = '星宿海清水温泉', },
    sw = { to = '星宿海南疆沙漠#2', },
    nw = { to = '星宿海南疆沙漠#2', },
    se = { to = '星宿海南疆沙漠#2', },
    w = { to = '星宿海南疆沙漠#2', },
    s = { to = '星宿海南疆沙漠#2', },
    n = { to = '星宿海南疆沙漠#2', },
    e = { to = '星宿海南疆沙漠#2', },
  },
},

['星宿海清水温泉'] = {
  id = '星宿海清水温泉',
  area = '星宿海',
  name = '清水温泉',
  desc =  [[这温泉水在个沟谷内。谷旁杨柳层林，有眼温泉涌出，溪水潺潺，寒冬不冻，白雾蒸腾，有如沸羹，缓流入谷二、三里到达清水温泉。在清水温泉洗浴(swim)，可以去风尘，疗病疾。]],
  exit = {
    ne = { to = '星宿海吐谷浑伏俟城', },
  },
},

['星宿海万宝斋'] = {
  id = '星宿海万宝斋',
  area = '星宿海',
  name = '万宝斋',
  desc =  [[这是大漠边上的一家小钱庄，设施很简陋，但是生意在附近还是不错的，因为这个小镇是最临近大漠边的一个安全岛，所以当初钱庄的主人选择将店面开在了这里。附近的人将自己的血汗钱小心的存在这里，它发行的银票可以通行全国。]],
  exit = {
    e = { to = '星宿海吐谷浑伏俟城', },
  },
},

['星宿海丝绸之路#5'] = {
  id = '星宿海丝绸之路#5',
  area = '星宿海',
  name = '丝绸之路',
  desc =  [[这是闻名中外的丝绸商道。迎面而来的是一个个沙包，星罗棋布於荒原之上。一阵风沙吹过，象刀割一样撕裂着你的脸。北边是伊犁，继续往南走便是吐谷浑伏俟城。]],
  exit = {
    s = { to = '星宿海吐谷浑伏俟城', },
    n = { to = '伊犁城惠远', },
  },
},

['星宿海山前荒地'] = {
  id = '星宿海山前荒地',
  area = '星宿海',
  name = '山前荒地',
  desc =  [[这里是一座石山前的荒地，平常人迹罕至，放眼望去尽是枯树败草，十分荒凉，一阵朔风萧杀，令人心惊胆颤。路边有几个星宿弟子在练功，同时在盯着行人的一举一动。你没事还是快走吧。]],
  exit = {
    nu = { to = '星宿海日月洞口', },
    nw = { to = '星宿海星宿海#2', },
    s = { to = '星宿海星宿海#M', },
    ne = { to = '星宿海虫谷入口', },
  },
},

['星宿海星宿海#2'] = {
  id = '星宿海星宿海#2',
  area = '星宿海',
  name = '星宿海',
  desc =  [[这里是星宿海。因方圆几百里都是一望无际的湖泊和沼泽，当地牧羊人称之为“海”。也因阴暗潮湿，毒虫繁殖甚富。星宿弟子常来此捕捉毒虫，以备练毒之用。这里通向星宿海的深处。西面有一条小径，两旁点缀了些花卉。虽是稀少，但在星宿海是一奇观了。不由得让人心花怒放，哼起了小曲。]],
  exit = {
    enter = { to = '星宿海天然石洞', },
    w = { to = '星宿海石道', },
    se = { to = '星宿海山前荒地', },
  },
},

['星宿海石道'] = {
  id = '星宿海石道',
  area = '星宿海',
  name = '石道',
  desc =  [[这是一条两旁点缀花卉的小径。花儿发出的香味多多少少冲淡了周围弥漫着沼泽的瘴气。来来往往都是星宿弟子，而且都是男的，哼着小曲。西边有一山洞，洞里不时传来嬉笑声，其中也夹杂了哭叫求饶声。]],
  exit = {
    e = { to = '星宿海星宿海#2', },
    w = { to = '星宿海厨房', },
    enter = { to = '星宿海逍遥洞', },
  },
},

['星宿海厨房'] = {
  id = '星宿海厨房',
  area = '星宿海',
  name = '厨房',
  desc =  [[这是星宿的厨房, 虽然不大, 但是锅碗瓢盆, 油盐酱醋, 都很奇全。灶台上堆满了新鲜瓜果蔬菜, 活鱼活虾, 满屋的果香和肉香，使你一走进这里，闻得阵阵的香气，就立即想饱餐一顿。有一个厨子正在忙碌着。]],
  exit = {
    e = { to = '星宿海石道', },
  },
},

['星宿海逍遥洞'] = {
  id = '星宿海逍遥洞',
  area = '星宿海',
  name = '逍遥洞',
  desc =  [[这里就是星宿弟子淫乐之处。原来不过是一粗糙的石洞，后因众星宿弟子不断修缮，成了方园几百里臭名昭著的淫窟。不知有多少可怜的牧羊女在此度过了暗无天日的余生。洞壁(wall)上有些字迹。]],
  exit = {
    out = { to = '星宿海石道', },
  },
},

['星宿海日月洞'] = {
  id = '星宿海日月洞',
  area = '星宿海',
  name = '日月洞',
  desc =  [[这里是星宿派总舵所在地日月洞。洞内灯火通明，正中一把虎皮椅上端坐着星宿派掌门人丁春秋。两边各站列着数十位星宿派弟子，不断有各派人士走进来献(xian)上各种宝物。一片歌功颂德之声，洋洋盈耳，丝竹箫管也跟着吹奏。丁春秋每听到得意之时，禁不住挥动手中的羽扇，捋着白须，眯起了双眼，薰薰然，飘飘然，有如饱醉醇酒。洞壁上装饰着虎皮、鹿头、雕羽，及一些字画 (zihua)。]],
  exit = {
    s = { to = '星宿海日月洞口', },
    n = { to = '星宿海药庐', },
  },
},

['星宿海海边荒路'] = {
  id = '星宿海海边荒路',
  area = '星宿海',
  name = '海边荒路',
  desc =  [[一条崎岖的小路，东面是方圆几百里，一望无际的星宿海，靠西是一片山石。这里荒无人烟，寒风凛冽。枯树败草间，不时有毒虫出没。你感到有点乏力，歇了一口气再往前走。]],
  exit = {
    e = { to = '星宿海星宿海#M', },
    wu = { to = '星宿海山石', },
    s = { to = '星宿海星宿海#M', },
    n = { to = '星宿海星宿海#M', },
  },
},

['星宿海小路'] = {
  id = '星宿海小路',
  area = '星宿海',
  name = '小路',
  desc =  [[你走在一条在星宿海海边乱石堆里崎岖的小路上，路边有一群星宿弟子正在长啸练功。这里，阴风凛冽，西面是望浩浩百里方圆的星宿海。东面是座陡峭之极的山壁，壁上有一凸出的巨石(jushi) 。]],
  exit = {
    nu = { to = '星宿海山壁', },
    w = { to = '星宿海星宿海#M', },
    s = { to = '星宿海星宿海#M', },
    hidden = { to = '星宿海巨石', cmd = 'pa jushi', cond = 'player.enable.dodge and player.enable.dodge.level >= 100', },
  },
},

['星宿海巨石'] = {
  id = '星宿海巨石',
  area = '星宿海',
  name = '巨石',
  desc = [[你落脚在一块黑褐色的巨石上。你身在半空，向下一望，不由得头晕目眩。因此只好远望对面山色。一阵山风吹来，令人心旷神怡，你才顿时发觉此乃练功(liangong)一佳地。]],
  exit = {
    d = { to = '星宿海小路', },
  },
},

['星宿海万象洞'] = {
  id = '星宿海万象洞',
  area = '星宿海',
  name = '万象洞',
  desc =  [[这是一个深邃的洞穴，洞内钟乳石绚丽多姿，美妙神奇。有犀牛望月、五岳朝天、卧龙坪、炼丹井、仙人灶、上天梯、独木桥等，景象万千，耐人寻味。]],
  exit = {
    nw = { to = '星宿海月牙泉', },
    e = { to = '星宿海鸣沙山', },
  },
},

['星宿海山脚下'] = {
  id = '星宿海山脚下',
  area = '星宿海',
  name = '山脚下',
  desc =  [[这里是天山东麓，山风从山上吹下来，冷得你瑟瑟发抖。这儿背靠天山，阳光充裕。常年有雪水灌溉，土地肥沃，滋长了一片草原。草原上肥羊成群结队，一对对牧羊男女弹起了冬不拉，互诉衷肠。]],
  exit = {
    w = { to = '天山空场', },
    se = { to = '回疆针叶林#M', handler = 'reset_data', },
  },
},

['星宿海星宿小屋'] = {
  id = '星宿海星宿小屋',
  area = '星宿海',
  name = '星宿小屋',
  desc =  [[一间破旧的小屋，屋里十分杂乱，墙角乱七八糟的堆放着一些杂物。阳光从南面墙上的小窗照射进来。物中央站立着一个高大的汉子，]],
  exit = {
    s = { to = '星宿海雁门关', },
  },
},

['星宿海人头疙瘩'] = {
  id = '星宿海人头疙瘩',
  area = '星宿海',
  name = '人头疙瘩',
  desc =  [[这里是黄黏土地带。是风蚀台地得自然景象。周围皆人迹罕至的戈壁滩。因地处风带线上，常年多刮大风，泥土剥蚀，留下坚硬和有红柳草根的部分，形成土墩，星罗棋布，酷似人头，故有此称。]],
  exit = {
    e = { to = '星宿海月牙泉', },
    sd = { to = '星宿海沙洲', },
    se = { to = '星宿海胭脂山', },
  },
},

['星宿海天山脚下'] = {
  id = '星宿海天山脚下',
  area = '星宿海',
  name = '天山脚下',
  desc =  [[这里是天山脚下，西北方是高耸入云的天山，抬头仰望可以看到山顶上的万年积雪。一道天山将西域分为两半，北疆是西域各族的聚居区，南疆是广阔无边的大草原。从这里往西便是伊犁城，因为这是交通要津，时常有星宿派弟子把关抢劫。]],
  exit = {
    e = { to = '伊犁城惠远', },
    sw = { to = '回疆针叶林#M', handler = 'reset_data', },
    se = { to = '星宿海丝绸之路#6', },
    n = { to = '星宿海星宿海#1', },
  },
},

['星宿海沙洲'] = {
  id = '星宿海沙洲',
  area = '星宿海',
  name = '沙洲',
  desc =  [[这里是敦煌城所在地，是丝绸之路上的咽喉重镇。四面城墙高耸，另有高出城墙一倍的城墩。城内混居了周围的多个民族，走在大街上看到和听到的无不透着新奇。]],
  exit = {
    nu = { to = '星宿海人头疙瘩', },
    w = { to = '星宿海吐谷浑伏俟城', },
    se = { to = '星宿海丝绸之路#4', },
  },
},

['星宿海雁门关'] = {
  id = '星宿海雁门关',
  area = '星宿海',
  name = '雁门关',
  desc =  [[这里是长城最西的关隘雁门关，又称嘉峪关。岁月沧桑，掩不住它的风采。群山环抱之下，更显它的雄浑。。再往西走便是著名的“丝绸之路”，值通西域，往东顺着万里长城便可通往中原。这儿驻扎有边防军队，不时盘问来往行人。你小心翼翼，急步离开这是非之地。]],
  exit = {
    e = { to = '星宿海嘉峪关东城门', cmd = '#wa 2000;e', },
    s = { to = '星宿海天阁斋分店', },
    w = { to = '星宿海嘉峪关西城门', cmd = '#wa 2000;w', },
    n = { to = '星宿海星宿小屋', },
  },
},

['昆仑山山路#2'] = {
  id = '昆仑山山路#2',
  area = '昆仑山',
  name = '山路',
  desc =  [[这是一条昆仑山上到处可见的山路。只是这里已随处可见梅树，梅花盛开时到处一片火红，花香飘溢。西边是红梅山庄。]],
  exit = {
    w = { to = '昆仑山红梅山庄', },
    e = { to = '昆仑山山路#1', },
  },
},

['昆仑山石路#C'] = {
  id = '昆仑山石路#C',
  area = '昆仑山',
  name = '石路',
  desc =  [[这是一条铺的十分平整的石板路，路面打扫的干干净净，南面过去是个花圆，传来阵阵花香，西面是静修室，东面传来些读书声，那里是书房了。]],
  exit = {
    e = { to = '昆仑山书房', },
    s = { to = '昆仑山花园', },
    w = { to = '昆仑山静修室', },
    n = { to = '昆仑山前厅', },
  },
},

['昆仑山三圣坳'] = {
  id = '昆仑山三圣坳',
  area = '昆仑山',
  name = '三圣坳',
  desc =  [[但见遍地绿草如锦，到处果树香花。原来那三圣坳四周都是插天高山，挡住了寒气。昆仑派历代掌门人曾花了极大力气整顿这个山坳，派遣弟子东至江南，西至天竺，搬移奇花异树前来种植。忽听得山坳后隐隐传出一阵琴声，你好奇心起，便循声寻去。]],
  exit = {
    d = { to = '昆仑山扶峰山', },
    n = { to = '昆仑山惊神峰', },
  },
},

['昆仑山扶峰山'] = {
  id = '昆仑山扶峰山',
  area = '昆仑山',
  name = '扶峰山',
  desc =  [[扶峰山极高且十分陡峭，山腰以上尽没入茫茫云海，峰顶终年积雪，山腰以下却是郁郁苍苍，林木茂密，花团锦簇，春意烂漫]],
  exit = {
    ne = { to = '昆仑山白牛山', },
    hidden = { to = '昆仑山三圣坳', cmd = 'climb', cond = 'player.skill["基本轻功"] and player.skill["基本轻功"].level >= 60', },
    enter = { to = '昆仑山后院#YSL', door = 'open door', },
  },
},

['昆仑山客厅#E'] = {
  id = '昆仑山客厅#E',
  area = '昆仑山',
  name = '客厅',
  desc =  [[这里是客厅，里面简单，只有一些椅子和桌子，桌子上摆着写茶和点心供客人食用。不少江湖人士不远千里到这，往往先到这里歇息片刻，恢复一下。]],
  exit = {
    w = { to = '昆仑山东走廊', },
  },
},

['昆仑山前厅'] = {
  id = '昆仑山前厅',
  area = '昆仑山',
  name = '前厅',
  desc =  [[这里是座大厅，高檐大瓦，十分的简朴壮阔，厅内摆几张高背方椅，一张八仙桌，看来是接待客人的地方，西面和东面也是客厅，供客人歇息，南面一条长廊通向后面。]],
  exit = {
    e = { to = '昆仑山东走廊', },
    s = { to = '昆仑山石路#C', },
    w = { to = '昆仑山西走廊', },
    n = { to = '昆仑山石屏风', },
  },
},

['昆仑山书房'] = {
  id = '昆仑山书房',
  area = '昆仑山',
  name = '书房',
  desc =  [[这里是书房，靠墙一排大书架，摆放着很多的书籍，昆仑三圣何足道以琴棋而号称以“圣”，故昆仑派一直引以为荣，鼓励弟子学琴棋艺。一眼望过去，似乎有关于不少琴棋方面的书。]],
  exit = {
    w = { to = '昆仑山石路#C', },
    s = { to = '昆仑山走廊#E', },
  },
},

['昆仑山后院门'] = {
  id = '昆仑山后院门',
  area = '昆仑山',
  name = '后院门',
  desc =  [[往东走就是昆仑派弟子的休息处所和吃东西的地方了，这里是连接后院的大门，不断看见各种打扮的江湖人士走过，看过廊外，是一片青色的树林，幽静雅致，只听见不断传来的鸟鸣声。]],
  exit = {
    w = { to = '昆仑山走廊#E', },
    e = { to = '昆仑山石路#E', cond = 'player.party == "昆仑派"', },
  },
},

['昆仑山西域山路#1'] = {
  id = '昆仑山西域山路#1',
  area = '昆仑山',
  name = '西域山路',
  desc =  [[渐行渐西，天气一天冷似一天，西域昆仑派势力雄强，沿途倒并无什么强盗，只是黄沙扑面，寒风透骨，却也着实难熬。]],
  exit = {
    w = { to = '昆仑山西域山路#2', },
    e = { to = '昆仑山镇远桥', },
  },
},

['昆仑山云杉林#5'] = {
  id = '昆仑山云杉林#5',
  area = '昆仑山',
  name = '云杉林',
  desc =  [[这是一片蜿蜒无尽的翠绿的树林，密密的云杉像撑天的巨伞，重重叠叠的枝丫，只漏下斑斑点点细碎的日影。林子十分幽静，连鸟雀也少飞来，只偶尔能听到远处的几声鸟鸣。]],
  exit = {
    e = { to = '昆仑山云杉林#5', },
    s = { to = '昆仑山葱岭谷', },
    w = { to = '昆仑山云杉林#6', },
    n = { to = '昆仑山云杉林#5', },
  },
},

['昆仑山白牛山'] = {
  id = '昆仑山白牛山',
  area = '昆仑山',
  name = '白牛山',
  desc =  [[这座山因终年覆盖白雪，且形状远望如一头正在吃草的牛而得名。这里寒风呼啸，凛冽刺骨，你不禁打了个寒颤。山顶有一处平地，放有一块青色的巨石(stone)。]],
  exit = {
    sw = { to = '昆仑山扶峰山', },
  },
},

['昆仑山惊神峰'] = {
  id = '昆仑山惊神峰',
  area = '昆仑山',
  name = '惊神峰',
  desc =  [[折而向北，过了一岭，只见古柏三把百余章，皆挺直端秀，凌霄托根树旁，作花柏顶，灿若云荼。走出十余丈，只听得琴声之中杂有无数鸟语，细细听来，琴声竟似和鸟语互相应答，间间关关，宛转啼鸣。只见三株大松树下一个白衣男子背向而坐，膝上放这一张焦尾琴，整自弹奏。他身周树木上停满了鸟雀，黄莺，杜鹃，喜鹊，八哥，还有许多不知其名的，和琴声或一问一答，或齐声和唱。]],
  exit = {
    s = { to = '昆仑山三圣坳', },
  },
},

['昆仑山广场东'] = {
  id = '昆仑山广场东',
  area = '昆仑山',
  name = '广场东',
  desc =  [[这里是一个平平开阔的大广场，广场上有昆仑派的弟子在习武，西面仍然是广场，东面过去就是悬崖了，北面是下山的路。]],
  exit = {
    nw = { to = '昆仑山山路#6', },
    w = { to = '昆仑山广场', },
  },
},

['昆仑山雪地#2'] = {
  id = '昆仑山雪地#2',
  area = '昆仑山',
  name = '雪地',
  desc =  [[昆仑山由于僻处北疆，山上经常终年积雪。这里是一个悬崖的下方，地上白雪皑皑，反光直刺你的双目。附近有个雪堆(xuedui)。]],
  exit = {
    ne = { to = '昆仑山雪地#1', },
  },
},

['昆仑山九曲廊#1'] = {
  id = '昆仑山九曲廊#1',
  area = '昆仑山',
  name = '九曲廊',
  desc =  [[九曲廊前后共有九进，曲曲折折地盘旋在水面。一路穿花度柳，抚石依泉，落花浮荡，水色溶溶。两边垂柳杂着桃杏，藤蔓绕柱。白石为栏，飞楼插空，转折处皆由小亭相接。]],
  exit = {
    e = { to = '昆仑山小石桥', },
    sw = { to = '昆仑山铁琴居', },
  },
},

['昆仑山可可西里山'] = {
  id = '昆仑山可可西里山',
  area = '昆仑山',
  name = '可可西里山',
  desc =  [[可可西里山又称可可稀立山，蒙古语为“青山”的意思。西起木孜塔格峰，东接巴颜喀拉山，山势平缓，冻土广布，高处少永久性积雪与冰川。除北侧有淡水湖钦马湖外，其余南北星罗棋布的湖泊均为咸水湖。草木稀疏，人烟极少。]],
  exit = {
    nw = { to = '昆仑山昆仑山垭口', },
    e = { to = '昆仑山巴颜喀拉山', },
  },
},

['昆仑山后院#YSL'] = {
  id = '昆仑山后院#YSL',
  area = '昆仑山',
  name = '后院',
  desc =  [[由于这里一向少有人来，渐渐被人忘记，也就很久没有被打扫过了。落叶满地，踩上去软绵绵的。墙壁已有些残破，檐下结满了蜘蛛网，角落里的一扇小门因为日晒雨淋，开始朽烂。]],
  exit = {
    s = { to = '昆仑山云杉林#2', },
    out = { to = '昆仑山扶峰山', door = 'open door', },
  },
},

['昆仑山暖阁'] = {
  id = '昆仑山暖阁',
  area = '昆仑山',
  name = '暖阁',
  desc =  [[昆仑山中一向甚为寒冷，但在此暖阁之中却温暖如春，可又不见何处生着炭火，此间取暖方法当真巧妙无比。阁中陈设辉煌灿烂，榻上椅上都铺着锦缎软垫，极是富丽豪华。南边是大厅。]],
  exit = {
    s = { to = '昆仑山大厅', },
  },
},

['昆仑山巴颜喀拉山'] = {
  id = '昆仑山巴颜喀拉山',
  area = '昆仑山',
  name = '巴颜喀拉山',
  desc =  [[巴颜喀拉山山势低平，西接昆仑山垭口，又与通天河支流德曲相隔，沼泽遍布。在山脚放眼望去，随处可见一处处沼泽草甸，乃是放牧各类牲畜的好地方。远处散布着一顶顶牧民的蒙古包。]],
  exit = {
    w = { to = '昆仑山可可西里山', },
    nd = { to = '昆仑山西域山路#3', },
  },
},

['昆仑山云杉林#6'] = {
  id = '昆仑山云杉林#6',
  area = '昆仑山',
  name = '云杉林',
  desc =  [[这是一片蜿蜒无尽的翠绿的树林，密密的云杉像撑天的巨伞，重重叠叠的枝丫，只漏下斑斑点点细碎的日影。林子十分幽静，连鸟雀也少飞来，只偶尔能听到远处的几声鸟鸣。]],
  exit = {
    e = { to = '昆仑山苦寒楼一层', },
    s = { to = '昆仑山云杉林#6', },
    w = { to = '昆仑山云杉林#6', },
    n = { to = '昆仑山云杉林#6', },
  },
},

['昆仑山昆仑山垭口'] = {
  id = '昆仑山昆仑山垭口',
  area = '昆仑山',
  name = '昆仑山垭口',
  desc =  [[这是位于两山之间的一个小山口。只见昆仑山脉绵延千里，群山复叠，山上树木并不多，不时露出光秃秃的山面和石头，山腰以上均为冰雪覆盖，冰峰雄峙，高插云霄。]],
  exit = {
    w = { to = '昆仑山昆仑山麓', },
    se = { to = '昆仑山可可西里山', },
  },
},

['昆仑山雪山丛林#1'] = {
  id = '昆仑山雪山丛林#1',
  area = '昆仑山',
  name = '雪山丛林',
  desc =  [[这是一个很大的丛林，树木的枝叶上挂满了冰雪，雪白的一大片，奇美无比。丛林向山上延伸，直至山顶。在丛林中微露出一条小道，依稀可认，你走在小道上，雪地中留下一行长长的足印。]],
  exit = {
    nu = { to = '昆仑山雪山丛林#2', },
    ed = { to = '昆仑山山溪边', },
  },
},

['昆仑山花园'] = {
  id = '昆仑山花园',
  area = '昆仑山',
  name = '花园',
  desc =  [[这里是一个小花园，何太冲素来爱花，这里遍地种着珍奇花卉，你只觉得花香阵阵袭来。    北面是一条石板路，南面过去就是内室走廊，过几步就可见到三圣堂，西面有座小石桥，风景倒也不错。]],
  exit = {
    e = { to = '昆仑山走廊#E', },
    s = { to = '昆仑山走廊#S', },
    w = { to = '昆仑山小石桥', },
    n = { to = '昆仑山石路#C', },
  },
},

['昆仑山广场西'] = {
  id = '昆仑山广场西',
  area = '昆仑山',
  name = '广场西',
  desc =  [[这里是一个平平开阔的大广场，广场上有昆仑派的弟子在习武，东面仍然是广场，西面过去就是悬崖了，北面是下山的路。]],
  exit = {
    ne = { to = '昆仑山山路#6', },
    e = { to = '昆仑山广场', },
  },
},

['昆仑山铁琴居'] = {
  id = '昆仑山铁琴居',
  area = '昆仑山',
  name = '铁琴居',
  desc =  [[这儿便是“铁琴先生”何太冲的居处。房间陈设颇为精巧，物品与中土所见别是不同。几个昆仑派弟子守在这里，个个深有忧色。东边通往三圣堂，西边通往卧室。]],
  exit = {
    ne = { to = '昆仑山九曲廊#1', },
    w = { to = '昆仑山卧室', door = 'open door', },
  },
},

['昆仑山红梅山庄'] = {
  id = '昆仑山红梅山庄',
  area = '昆仑山',
  name = '红梅山庄',
  desc =  [[这是一座颇大的庄子。一眼看去就知道此间主人是当地的富豪，在昆仑山中有这么大的一座山庄确实非常少见。据说，此间主人也是武林中人，所以路过之人也不敢随意的进入，当以江湖之礼求见。]],
  exit = {
    e = { to = '昆仑山山路#2', },
    wd = { to = '昆仑山山溪边', },
    n = { to = '昆仑山大厅', },
  },
},

['昆仑山云杉林#4'] = {
  id = '昆仑山云杉林#4',
  area = '昆仑山',
  name = '云杉林',
  desc =  [[这是一片蜿蜒无尽的翠绿的树林，密密的云杉像撑天的巨伞，重重叠叠的枝丫，只漏下斑斑点点细碎的日影。林子十分幽静，连鸟雀也少飞来，只偶尔能听到远处的几声鸟鸣。]],
  exit = {
    e = { to = '昆仑山云杉林#4', },
    s = { to = '昆仑山云杉林#5', },
    w = { to = '昆仑山云杉林#4', },
    n = { to = '昆仑山云杉林#4', },
  },
},

['昆仑山昆仑派山门'] = {
  id = '昆仑山昆仑派山门',
  area = '昆仑山',
  name = '昆仑派山门',
  desc =  [[你一路走来，饱受大风黄沙之苦，渐渐树木多了起来，不时可听见枝叶中传来的鸟鸣，路边草丛偶尔也能发现一些开着的野花。到得这里，已是绿树红花，十分茂盛，你万万没想到深山中却有如此所在，精神大为一振。前面是一座山门，写着“昆仑派”三个大字。]],
  exit = {
    sd = { to = '昆仑山昆仑山麓', },
    eu = { to = '昆仑山山路#3', },
  },
},

['昆仑山云杉林#2'] = {
  id = '昆仑山云杉林#2',
  area = '昆仑山',
  name = '云杉林',
  desc =  [[这是一片蜿蜒无尽的翠绿的树林，密密的云杉像撑天的巨伞，重重叠叠的枝丫，只漏下斑斑点点细碎的日影。林子十分幽静，连鸟雀也少飞来，只偶尔能听到远处的几声鸟鸣。]],
  exit = {
    e = { to = '昆仑山云杉林#1', },
    s = { to = '昆仑山云杉林#2', },
    w = { to = '昆仑山云杉林#2', },
    n = { to = '昆仑山后院#YSL', },
  },
},

['昆仑山雪地#1'] = {
  id = '昆仑山雪地#1',
  area = '昆仑山',
  name = '雪地',
  desc =  [[昆仑山由于僻处北疆，山上经常终年积雪。这里的地上白雪皑皑，反光直刺你的双目。雪地里一行脚印通向北边，看来那边应该有条山路的。]],
  exit = {
    nu = { to = '昆仑山山路#1', },
    sw = { to = '昆仑山雪地#2', },
  },
},

['昆仑山苦寒楼二层'] = {
  id = '昆仑山苦寒楼二层',
  area = '昆仑山',
  name = '苦寒楼二层',
  desc =  [[每个楼层上都铺设了结实的木楼板，八角形的墙身上则开了四扇大窗。四周墙壁贴着昆仑派历代掌门和高手的画像，并有专门的文字记载着他们的事迹。从这里往外眺望，只能看到围绕塔周的密密匝匝的云杉林，正是通过这种忍饥耐寒，清心寡欲的办法以求得对武学孜孜不倦的追求。]],
  exit = {
    u = { to = '昆仑山苦寒楼三层', },
    d = { to = '昆仑山苦寒楼一层', },
  },
},

['昆仑山山路#3'] = {
  id = '昆仑山山路#3',
  area = '昆仑山',
  name = '山路',
  desc =  [[这里已经是昆仑派的地方了，路边花草满地，虽然是寒冬，这里却仍然生机勃勃，到处传来鸟兽的叫声，前面山上就是昆仑派的居所了，北面是来的时候的山门。]],
  exit = {
    wd = { to = '昆仑山昆仑派山门', },
    su = { to = '昆仑山山路#4', },
  },
},

['昆仑山石屏风'] = {
  id = '昆仑山石屏风',
  area = '昆仑山',
  name = '石屏风',
  desc =  [[这是一个巨大的屏风，用昆仑山特产的汗白玉雕成，屏风上的图案是昆仑派的师祖昆仑三圣何足道挑战少林的风姿，英姿挺拔，颇有一派宗师之象。屏风后面就是昆仑派的前厅了。]],
  exit = {
    s = { to = '昆仑山前厅', },
    n = { to = '昆仑山广场', },
  },
},

['昆仑山云杉林#1'] = {
  id = '昆仑山云杉林#1',
  area = '昆仑山',
  name = '云杉林',
  desc =  [[这是一片蜿蜒无尽的翠绿的树林，密密的云杉像撑天的巨伞，重重叠叠的枝丫，只漏下斑斑点点细碎的日影。林子十分幽静，连鸟雀也少飞来，只偶尔能听到远处的几声鸟鸣。]],
  exit = {
    ne = { to = '昆仑山九曲廊#2', },
    w = { to = '昆仑山云杉林#2', },
    se = { to = '昆仑山云杉林#3', },
  },
},

['昆仑山山溪边'] = {
  id = '昆仑山山溪边',
  area = '昆仑山',
  name = '山溪边',
  desc =  [[这里是一条小溪。昆仑山终年积雪，在烈日照射下，部分冰雪融化成水，而汇成小溪，溪水向下而流，不知其流向何方。往西而上是一个大丛林。]],
  exit = {
    eu = { to = '昆仑山红梅山庄', },
    wu = { to = '昆仑山雪山丛林#1', },
    d = { to = '星宿海大厅', unstable = true, ignore = true, },
  },
},

['昆仑山苦寒楼一层'] = {
  id = '昆仑山苦寒楼一层',
  area = '昆仑山',
  name = '苦寒楼一层',
  desc =  [[这里是苦寒楼的底层。苦寒楼结构简单，四周为浓密的云杉包围。取名自“梅花香自苦寒来”之意，乃是昆仑派前辈为了激励后进昆仑派弟子而建的，往上看，长长的木楼梯盘绕而上，似乎永无尽头。青砖地相当洁净，看来经常有人打扫。]],
  exit = {
    u = { to = '昆仑山苦寒楼二层', },
    out = { to = '昆仑山云杉林#1', },
  },
},

['昆仑山山路#6'] = {
  id = '昆仑山山路#6',
  area = '昆仑山',
  name = '山路',
  desc =  [[前面传来刀剑相碰的声音，快到了，你不由得加快了脚步，远远望去，似乎是个大广场，围着不少人在练武。]],
  exit = {
    sw = { to = '昆仑山广场西', },
    nd = { to = '昆仑山山路#5', },
    s = { to = '昆仑山广场', },
    se = { to = '昆仑山广场东', },
  },
},

['昆仑山灵獒宫'] = {
  id = '昆仑山灵獒宫',
  area = '昆仑山',
  name = '灵獒宫',
  desc =  [[只见厅上扁额上写着“灵獒宫”三个血红大字。一进厅，你便吃了一惊，但见三十余头雄健猛恶的大犬，分成三排蹲在地上，一个身穿白孤裘的女郎坐在一张虎皮椅上，她手执皮鞭，正在指挥恶犬咬人。南边是一个大院子。]],
  exit = {
    s = { to = '昆仑山后院#HM', },
  },
},

['昆仑山静修室'] = {
  id = '昆仑山静修室',
  area = '昆仑山',
  name = '静修室',
  desc =  [[这里是静修室，地下顺序地放着几个蒲团，正中烧着几柱香，轻烟袅袅升起。几位昆仑派弟子正盘膝坐在上面打坐静修。]],
  exit = {
    e = { to = '昆仑山石路#C', },
    s = { to = '昆仑山小石桥', },
  },
},

['昆仑山广场'] = {
  id = '昆仑山广场',
  area = '昆仑山',
  name = '广场',
  desc =  [[这里是一个平平开阔的大广场，广场上有昆仑派的弟子在习武，前面不远处是个巨大的石屏风，后面就是昆仑派的前厅了，西面和东面仍然是广场。]],
  exit = {
    e = { to = '昆仑山广场东', },
    s = { to = '昆仑山石屏风', },
    w = { to = '昆仑山广场西', },
    n = { to = '昆仑山山路#6', },
  },
},

['昆仑山九曲廊#2'] = {
  id = '昆仑山九曲廊#2',
  area = '昆仑山',
  name = '九曲廊',
  desc =  [[九曲廊前后共有九进，曲曲折折地盘旋在水面。一路穿花度柳，抚石依泉，落花浮荡，水色溶溶。两边垂柳杂着桃杏，藤蔓绕柱。白石为栏，飞楼插空，转折处皆由小亭相接。]],
  exit = {
    ne = { to = '昆仑山三圣堂', },
    sw = { to = '昆仑山云杉林#1', },
  },
},

['昆仑山卧室'] = {
  id = '昆仑山卧室',
  area = '昆仑山',
  name = '卧室',
  desc =  [[这里是何太冲最宠爱的第五小妾五姑的卧房。刚一进房，扑鼻便是一股药气，里面还能闻到一股十分古怪的气息，过了片刻，更觉得这气息忽浓忽淡，甚是奇特。床上躺着一个人，这人面向帐里，喘气甚急，象是扯着风箱。窗子(window)都是紧紧关着。]],
  exit = {
    e = { to = '昆仑山铁琴居', door = 'open door', },
  },
},

['昆仑山三圣堂'] = {
  id = '昆仑山三圣堂',
  area = '昆仑山',
  name = '三圣堂',
  desc =  [[昆仑三圣堂乃“昆仑三圣”何足道所建，原为了修身养性，读书练功。随着昆仑派日益壮大，名声远播，这里便成了昆仑派聚众议事，接待各路江湖英雄的地方。“昆仑三圣”也只好另觅安静所在了。]],
  exit = {
    sw = { to = '昆仑山九曲廊#2', },
    n = { to = '昆仑山走廊#S', },
  },
},

['昆仑山云杉林#3'] = {
  id = '昆仑山云杉林#3',
  area = '昆仑山',
  name = '云杉林',
  desc =  [[这是一片蜿蜒无尽的翠绿的树林，密密的云杉像撑天的巨伞，重重叠叠的枝丫，只漏下斑斑点点细碎的日影。林子十分幽静，连鸟雀也少飞来，只偶尔能听到远处的几声鸟鸣。]],
  exit = {
    e = { to = '昆仑山云杉林#4', },
    s = { to = '昆仑山云杉林#3', },
    w = { to = '昆仑山云杉林#3', },
    n = { to = '昆仑山云杉林#3', },
  },
},

['昆仑山葱岭谷'] = {
  id = '昆仑山葱岭谷',
  area = '昆仑山',
  name = '葱岭谷',
  desc =  [[你的眼前突然为之一亮，只见一条象被一刀劈开的峡谷岩石间，高山的雪水泻落到千丈以下的山涧里去，溅起的密密的飞沫激起一种惊心动魄的震憾。就在这深山野谷的溪流边，却长满了各种各样的花草树木，春天繁花开遍峡谷秋天果实压满山腰，人迹罕至，正是鸟兽们的乐园。]],
  exit = {
    out = { to = '昆仑山云杉林#3', },
  },
},

['昆仑山镇远桥'] = {
  id = '昆仑山镇远桥',
  area = '昆仑山',
  name = '镇远桥',
  desc =  [[这座桥号称“天下黄河第一桥”，气势极为雄伟，扼守西域，东往中原。黄河水从桥底倾泻而过，轰隆作响。]],
  exit = {
    w = { to = '昆仑山西域山路#1', },
    ed = { to = '明教山脚下', },
  },
},

['昆仑山西域山路#2'] = {
  id = '昆仑山西域山路#2',
  area = '昆仑山',
  name = '西域山路',
  desc =  [[渐行渐西，天气一天冷似一天，西域昆仑派势力雄强，沿途倒并无什么强盗，只是黄沙扑面，寒风透骨，却也着实难熬。]],
  exit = {
    e = { to = '昆仑山西域山路#1', },
    wu = { to = '昆仑山西域山路#3', },
  },
},

['昆仑山西域山路#3'] = {
  id = '昆仑山西域山路#3',
  area = '昆仑山',
  name = '西域山路',
  desc =  [[渐行渐西，天气一天冷似一天，西域昆仑派势力雄强，沿途倒并无什么强盗，只是黄沙扑面，寒风透骨，却也着实难熬。]],
  exit = {
    ed = { to = '昆仑山西域山路#2', },
    su = { to = '昆仑山巴颜喀拉山', },
  },
},

['昆仑山山路#1'] = {
  id = '昆仑山山路#1',
  area = '昆仑山',
  name = '山路',
  desc =  [[这是一条昆仑山上到处可见的山路。只是这里已随处可见梅树，梅花盛开时到处一片火红，花香飘溢。]],
  exit = {
    e = { to = '昆仑山昆仑山麓', },
    w = { to = '昆仑山山路#2', },
    sd = { to = '昆仑山雪地#1', },
  },
},

['昆仑山大厅'] = {
  id = '昆仑山大厅',
  area = '昆仑山',
  name = '大厅',
  desc =  [[这里是山庄会客之所，大厅之中坐着此间庄主。每逢年节，就有许多仆役在此等侯，希望主人能赏一些银子。厅子两旁放置着许多椅子和茶机，是供客人坐的。这里虽然远离中原，但来此之客却是当真不少。厅中壁上挂着一大副猛虎之图。这里有几个童仆来回地侍侯着。]],
  exit = {
    e = { to = '昆仑山后院#HM', },
    s = { to = '昆仑山红梅山庄', },
    n = { to = '昆仑山暖阁', },
  },
},

['昆仑山后院#HM'] = {
  id = '昆仑山后院#HM',
  area = '昆仑山',
  name = '后院',
  desc =  [[这里是山庄的后院。此庄号称“红梅”，当有其根源。院子里就长着许多梅树。每逢春天梅花盛开之时，到处一片火红，分外美丽，梅花飘香更是令人心旷神怡。北边是“灵獒宫”。]],
  exit = {
    w = { to = '昆仑山大厅', },
    n = { to = '昆仑山灵獒宫', },
  },
},

['昆仑山雪山丛林#2'] = {
  id = '昆仑山雪山丛林#2',
  area = '昆仑山',
  name = '雪山丛林',
  desc =  [[这是一个很大的丛林，树木的枝叶上挂满了冰雪，雪白的一大片，奇美无比。丛林向山上延伸，直至山顶。在丛林中微露出一条小道，依稀可认，你走在小道上，雪地中留下一行长长的足印。]],
  exit = {
    sd = { to = '昆仑山雪山丛林#1', },
    wu = { to = '昆仑山悬崖', },
  },
},

['昆仑山悬崖'] = {
  id = '昆仑山悬崖',
  area = '昆仑山',
  name = '悬崖',
  desc =  [[你来到悬崖之上，突然在对面传来几声狼嗥，甚是凄厉可怖。只见对面几只大灰狼仰起头，向着你张牙舞爪的嗥叫，想是要食以果腹，只是之间有一条深不见底的万丈峡谷，无法过来。]],
  exit = {
    ed = { to = '昆仑山雪山丛林#2', },
    hidden = { to = '昆仑山松树', cmd = 'jump down', cond = 'player.flag["九阳神功"] and player.skill["基本轻功"] and player.skill["基本轻功"].level >= 100', },
  },
},

['昆仑山山路#4'] = {
  id = '昆仑山山路#4',
  area = '昆仑山',
  name = '山路',
  desc =  [[这是一条盘山的路，路边花草满地，路面似乎很久没有修整了，显得有些破旧，但是从遗留的痕迹依稀可以看出当年的辉煌。北面是山下，南面山上是昆仑派的所在。]],
  exit = {
    su = { to = '昆仑山山路#5', },
    nd = { to = '昆仑山山路#3', },
  },
},

['昆仑山山路#5'] = {
  id = '昆仑山山路#5',
  area = '昆仑山',
  name = '山路',
  desc =  [[这是一条盘山的路，山间穿来鸟鸣兽叫，路面似乎很久没有修整了，显得有些破旧，但是从遗留的痕迹依稀可以看出当年的辉煌。北面是山下，南面山上是昆仑派的所在。]],
  exit = {
    su = { to = '昆仑山山路#6', },
    nd = { to = '昆仑山山路#4', },
  },
},

['昆仑山西走廊'] = {
  id = '昆仑山西走廊',
  area = '昆仑山',
  name = '西走廊',
  desc =  [[这是一条长廊，连接前厅和客房，不断看见各种打扮的江湖人士走过，看过廊外，是一片青色的树林，幽静雅致，只听见不断传来的鸟鸣声。]],
  exit = {
    w = { to = '昆仑山客厅#W', },
    e = { to = '昆仑山前厅', },
  },
},

['昆仑山客厅#W'] = {
  id = '昆仑山客厅#W',
  area = '昆仑山',
  name = '客厅',
  desc =  [[这里是客厅，里面简单，只有几张床，供疲惫的客人歇息，屋子里烤着火，暖烘烘的。]],
  exit = {
    e = { to = '昆仑山西走廊', },
  },
},

['昆仑山东走廊'] = {
  id = '昆仑山东走廊',
  area = '昆仑山',
  name = '东走廊',
  desc =  [[这是一条长廊，连接前厅和客房，不断看见各种打扮的江湖人士走过，看过廊外，是一片青色的树林，幽静雅致，只听见不断传来的鸟鸣声。]],
  exit = {
    w = { to = '昆仑山前厅', },
    e = { to = '昆仑山客厅#E', },
  },
},

['昆仑山走廊#E'] = {
  id = '昆仑山走廊#E',
  area = '昆仑山',
  name = '走廊',
  desc =  [[这是一条长廊，连接前厅和客房，不断看见各种打扮的江湖人士走过，看过廊外，是一片青色的树林，幽静雅致，只听见不断传来的鸟鸣声。]],
  exit = {
    e = { to = '昆仑山后院门', },
    s = { to = '昆仑山走廊#SE', },
    w = { to = '昆仑山花园', },
    n = { to = '昆仑山书房', },
  },
},

['昆仑山休息室'] = {
  id = '昆仑山休息室',
  area = '昆仑山',
  name = '休息室',
  desc =  [[这是间整洁的厢房，因门窗常闭着，光线很昏暗。房里放着几张收拾得舒舒服服的木床，看着就让人想睡觉。]],
  exit = {
    s = { to = '昆仑山石路#E', },
  },
},

['昆仑山厨房'] = {
  id = '昆仑山厨房',
  area = '昆仑山',
  name = '厨房',
  desc =  [[这里是昆仑派弟子用餐的地方。由于天长日久，墙壁都被烟熏黑了。屋里摆着几张桌椅，几位昆仑弟子正在大吃大喝，行酒猜拳。]],
  exit = {
    w = { to = '昆仑山石路#E', },
  },
},

['昆仑山练功房'] = {
  id = '昆仑山练功房',
  area = '昆仑山',
  name = '练功房',
  desc =  [[这里是练功房，地下凌乱地放着几个蒲团，正中烧着几柱香，轻烟袅袅升起。几位昆仑派弟子正盘膝坐在上面打坐。]],
  exit = {
    w = { to = '昆仑山走廊#SE', },
  },
},

['昆仑山走廊#S'] = {
  id = '昆仑山走廊#S',
  area = '昆仑山',
  name = '走廊',
  desc =  [[这是一条长廊，连接前厅和客房，不断看见各种打扮的江湖人士走过，看过廊外，是一片青色的树林，幽静雅致，只听见不断传来的鸟鸣声。]],
  exit = {
    e = { to = '昆仑山走廊#SE', },
    s = { to = '昆仑山三圣堂', },
    n = { to = '昆仑山花园', },
  },
},

['昆仑山小石桥'] = {
  id = '昆仑山小石桥',
  area = '昆仑山',
  name = '小石桥',
  desc =  [[这是一座小小的白石拱桥。桥下碧绿的湖水正荡着微波。远处的湖面上传来阵阵歌声，不远处两只鸳鸯在一起戏水，岸边的柳树随着湖面上吹来的微风时不时地摇摆着。]],
  exit = {
    e = { to = '昆仑山花园', },
    w = { to = '昆仑山九曲廊#1', },
    n = { to = '昆仑山静修室', },
  },
},

['昆仑山石路#E'] = {
  id = '昆仑山石路#E',
  area = '昆仑山',
  name = '石路',
  desc =  [[这是一条铺的十分平整的石板路，路面打扫的干干净净，西面过去是连接后院的大门，东面是厨房，北面就是昆仑派弟子歇息的地方了。]],
  exit = {
    e = { to = '昆仑山厨房', },
    w = { to = '昆仑山后院门', },
    n = { to = '昆仑山休息室', },
  },
},

['昆仑山走廊#SE'] = {
  id = '昆仑山走廊#SE',
  area = '昆仑山',
  name = '走廊',
  desc =  [[这是一条长廊，连接前厅和客房，不断看见各种打扮的江湖人士走过，看过廊外，是一片青色的树林，幽静雅致，只听见不断传来的鸟鸣声。]],
  exit = {
    e = { to = '昆仑山练功房', },
    w = { to = '昆仑山走廊#S', },
    n = { to = '昆仑山走廊#E', },
  },
},

['昆仑山苦寒楼三层'] = {
  id = '昆仑山苦寒楼三层',
  area = '昆仑山',
  name = '苦寒楼三层',
  desc =  [[很快就到了苦寒楼顶层。这里可以看到山门以及北边的诸多昆仑山峰，四周的杉林随风摇摆，发出“哗哗哗”的声音。山风夹着隐隐寒气，远处的景色单调而苍凉，你心里顿时生出一种莫名寂寞的感觉。房间里的布置十分简单。往外看，有个很大的红木窗台(out)。]],
  exit = {
    d = { to = '昆仑山苦寒楼二层', },
    out = { to = '昆仑山后院#YSL', unstable = true, },
  },
},

['昆仑山昆仑山麓'] = {
  id = '昆仑山昆仑山麓',
  area = '昆仑山',
  name = '昆仑山麓',
  desc =  [[整个昆仑山脉雪山连绵，冰河垂悬。远望昆仑，有如横卧云彩间的银色玉龙。每年春天以后，冰雪融化，汇成一股股清澈溪流，流入长江，黄河。]],
  exit = {
    nu = { to = '昆仑山昆仑派山门', },
    w = { to = '昆仑山山路#1', },
    e = { to = '昆仑山昆仑山垭口', },
  },
},

['昆仑山松树'] = {
  id = '昆仑山松树',
  area = '昆仑山',
  name = '松树',
  desc = [[这是一株长于峭壁上的松树。向上而望，不能看见悬崖上之物，刚才从上面跳下之时义无返顾，但回想起来你自不禁心悸，额头冷汗涔涔而下。再看四下形势，向上攀援是绝不可能，而脚下也深不见底。如果跌到底下，十之八九是没有命了的，唯有沿着山壁斜坡，慢慢的爬行出去。东边是雪山上的斜坡，西面是半山悬崖。]],
  exit = {
    hidden1 = { to = '昆仑山雪山斜坡#1', cmd = 'climb east;#wb 1500', },
    hidden2 = { to = '昆仑山半山悬崖', cmd = 'climb west;#wb 1500', },
  },
},

['昆仑山半山悬崖'] = {
  id = '昆仑山半山悬崖',
  area = '昆仑山',
  name = '半山悬崖',
  desc = [[你向西爬行，这边的山势十分凶险，直爬了半个时辰也无任何去路了。]],
  exit = {
    hidden2 = { to = '昆仑山松树', cmd = 'climb east;#wb 1500', },
  },
},

['昆仑山雪山斜坡#1'] = {
  id = '昆仑山雪山斜坡#1',
  area = '昆仑山',
  name = '雪山斜坡',
  desc = [[你手脚着地，沿着雪山斜坡，一步一步向着有阳光之处爬去，但此峭壁本就极陡，加上冻结冰雪，更是滑溜无比，一不小心就会滑跌。]],
  exit = {
    hidden1 = { to = '昆仑山雪山斜坡#2', cmd = 'climb east;#wb 1500', },
    hidden2 = { to = '昆仑山松树', cmd = 'climb west;#wb 1500', },
  },
},

['昆仑山雪山斜坡#2'] = {
  id = '昆仑山雪山斜坡#2',
  area = '昆仑山',
  name = '雪山斜坡',
  desc = [[你手脚着地，沿着雪山斜坡，一步一步向着有阳光之处爬去，但此峭壁本就极陡，加上冻结冰雪，更是滑溜无比，一不小心就会滑跌。]],
  exit = {
    hidden1 = { to = '昆仑山大石壁', cmd = 'climb east;#wb 1500', },
    hidden2 = { to = '昆仑山雪山斜坡#1', cmd = 'climb west;#wb 1500', },
  },
},

['昆仑山大石壁'] = {
  id = '昆仑山大石壁',
  area = '昆仑山',
  name = '大石壁',
  desc = [[你爬了很久，手肘膝盖都已被坚冰割得鲜血淋漓，总算山坡已不如何陡峭了，再一步步向前行，走到了此处大山壁，此大山壁如一堵大屏风，阻住你的去路，东面是一个大平台。]],
  exit = {
    e = { to = '昆仑山大平台', },
  },
},

['昆仑山大平台'] = {
  id = '昆仑山大平台',
  area = '昆仑山',
  name = '大平台',
  desc = [[这是一个三面皆空的极高的平台，平台有十余丈方园，可是半天临空，上既不行，下亦不能，眼前只有茫茫云海，更无去路，平台之上有的是白皑皑的冰雪，既无树木，更无野兽。平台的左侧山壁处有一个黑黝黝的山洞。]],
  exit = {
    w = { to = '昆仑山大石壁', },
    hidden1 = { to = '昆仑山山洞', cmd = 'zuan dong', },
    hidden2 = { to = '昆仑山雪地#2', cmd = 'jump down', },
  },
},

['昆仑山山洞'] = {
  id = '昆仑山山洞',
  area = '昆仑山',
  name = '山洞',
  desc = [[这是一个越来越窄的山洞，洞壁皆是颇为坚硬的岩石，刀剑不能开。洞口刚好能进一人，如果不小心头部则会撞到山石。往里十多丈后，更加狭窄，身体已不能随意的转动了，如果身体稍大点则不能入内。再进数丈后，忽见前面透进亮光，似乎另有一翻天地。 ]],
  exit = {
    hidden1 = { to = '昆仑山洞天福地', cmd = 'climb;#wb 1500', cond = 'player.str < 25 or ( player.skill["基本内功"] and player.skill["基本内功"].level >= 150 )', },
    hidden2 = { to = '昆仑山大平台', cmd = 'back;#wb 1500', },
  },
},

['昆仑山洞天福地'] = {
  id = '昆仑山洞天福地',
  area = '昆仑山',
  name = '洞天福地',
  desc = [[出得洞来，突然间阳光耀眼，你闭着眼定一定神，再睁开眼来，面前竟是个花团锦簇的翠谷，红花绿树，交相掩映。山洞离地竟然不过丈许。你轻轻一跃，便已着地，脚步下踏着的是柔软细草，鼻中闻到的是清幽花香，耳中听到的是鸣禽间关，眼前呈现的是鲜果悬枝，你怎么也不会想到经过黑黝黝的洞穴之后，竟会有这样一个洞天福地。]],
  exit = {
    s = { to = '昆仑山翠谷#S', },
    eu = { to = '昆仑山山壁', },
    w = { to = '昆仑山翠谷#1W', },
    n = { to = '昆仑山翠谷#1N', },
    hidden = { to = '昆仑山大平台', cmd = 'zuan dong', },
  },
},

['昆仑山翠谷#S'] = {
  id = '昆仑山翠谷#S',
  area = '昆仑山',
  name = '翠谷',
  desc = [[你面前是个花团锦簇的翠谷，红花绿树，交相掩映。脚下踏着的是柔软细草，鼻中闻到的是清幽花香，鸣禽间关，鲜果悬枝，不由的心旷神怡。左壁山壁上刻着一行小字(zi)，距离太远，你看不真切。]],
  exit = {
    n = { to = '昆仑山洞天福地', },
  },
},

['昆仑山翠谷#1N'] = {
  id = '昆仑山翠谷#1N',
  area = '昆仑山',
  name = '翠谷',
  desc = [[你面前是个花团锦簇的翠谷，红花绿树，交相掩映。脚下踏着的是柔软细草，鼻中闻到的是清幽花香，鸣禽间关，鲜果悬枝，不由的心旷神怡。]],
  exit = {
    s = { to = '昆仑山洞天福地', },
    n = { to = '昆仑山翠谷#2N', },
  },
},

['昆仑山翠谷#2N'] = {
  id = '昆仑山翠谷#2N',
  area = '昆仑山',
  name = '翠谷',
  desc = [[你面前是个花团锦簇的翠谷，红花绿树，交相掩映。脚下踏着的是柔软细草，鼻中闻到的是清幽花香，鸣禽间关，鲜果悬枝，不由的心旷神怡。]],
  exit = {
    s = { to = '昆仑山翠谷#1N', },
    n = { to = '昆仑山翠谷#3N', },
  },
},

['昆仑山翠谷#3N'] = {
  id = '昆仑山翠谷#3N',
  area = '昆仑山',
  name = '翠谷',
  desc = [[但见翠谷四周高山环绕，似乎亘古以来从未有人至，四面雪峰插云，险峻陡峭，决计无法攀登而入，北边一座高峰阻住去路，无法再往前行，草地上有七八头野山羊低头吃草，见人毫不惊避，树(tree)上十余只猴儿相嬉，看来虎豹之类巨兽因身子笨重，不能逾险峰而至。]],
  exit = {
    s = { to = '昆仑山翠谷#2N', },
  },
},

['昆仑山翠谷#1W'] = {
  id = '昆仑山翠谷#1W',
  area = '昆仑山',
  name = '翠谷',
  desc = [[你面前是个花团锦簇的翠谷，红花绿树，交相掩映。脚下踏着的是柔软细草，鼻中闻到的是清幽花香，鸣禽间关，鲜果悬枝，不由的心旷神怡。]],
  exit = {
    w = { to = '昆仑山翠谷#2W', },
    e = { to = '昆仑山洞天福地', },
  },
},

['昆仑山翠谷#2W'] = {
  id = '昆仑山翠谷#2W',
  area = '昆仑山',
  name = '翠谷',
  desc = [[你面前是个花团锦簇的翠谷，红花绿树，交相掩映。脚下踏着的是柔软细草，鼻中闻到的是清幽花香，鸣禽间关，鲜果悬枝，不由的心旷神怡。]],
  exit = {
    w = { to = '昆仑山瀑布', },
    e = { to = '昆仑山翠谷#1W', },
  },
},

['昆仑山瀑布'] = {
  id = '昆仑山瀑布',
  area = '昆仑山',
  name = '瀑布',
  desc = [[你向西走出两里多路，只见峭壁上有一道大瀑布冲击而下，料想是雪融而成，阳光照射下犹如一条玉龙，极是壮观美丽。瀑布泻在一个清澈碧绿的深潭之中，潭水却也不见满，当是另有泄水的去路。潭水中不时的跳起一尾大白鱼，似乎随手可得。]],
  exit = {
    e = { to = '昆仑山翠谷#2W', },
    sd = { to = '昆仑山翠谷#3W', },
  },
},

['昆仑山翠谷#3W'] = {
  id = '昆仑山翠谷#3W',
  area = '昆仑山',
  name = '翠谷',
  desc = [[你面前是个花团锦簇的翠谷，红花绿树，交相掩映。脚下踏着的是柔软细草，鼻中闻到的是清幽花香，鸣禽间关，鲜果悬枝，不由的心旷神怡。这般在野地里独自过活的日子，在你看来毫不希奇，当下便捏土为盆，铺草作床。]],
  exit = {
    nu = { to = '昆仑山瀑布', },
  },
},

['昆仑山山壁'] = {
  id = '昆仑山山壁',
  area = '昆仑山',
  name = '山壁',
  desc = [[陡峭的山壁，全为极为坚硬的岩石，滑不溜脚，稍微不小心就会滑倒。往西而下是一片翠谷，往东而下是一山沟。]],
  exit = {
    wd = { to = '昆仑山洞天福地', },
    ed = { to = '昆仑山山沟', },
  },
},

['昆仑山山沟'] = {
  id = '昆仑山山沟',
  area = '昆仑山',
  name = '山沟',
  desc = [[山壁之下的一条小山沟，这里绿草丛生，有许多雪鸡出没于其中。这里因为背阴，生着许多无名的小草，看来可以入药。]],
  exit = {
    wu = { to = '昆仑山山壁', },
  },
},

['白驼山储藏室'] = {
  id = '白驼山储藏室',
  area = '白驼山',
  name = '储藏室',
  desc =  [[你一进门便闻到一股霉味，在门外射进来的阳光的照耀下，你看见这里满屋的灰尘，成堆成堆的物品快堆满了整间房间。你很是奇怪为什么仆役们离开时不把这些物品也带走。]],
  exit = {
    e = { to = '白驼山空地', },
  },
},

['白驼山蛇潭'] = {
  id = '白驼山蛇潭',
  area = '白驼山',
  name = '蛇潭',
  desc =  [[一个阴深深的水潭，水面离地有丈高。你感觉到水里有东西在向你游来。。。是蟒蛇！快跑(jumpup)吧！]],
  exit = {
    hidden = { to = '白驼山院子#1', cmd = 'jumpup', cond = 'player.dex >= 26', },
  },
},

['白驼山睡房'] = {
  id = '白驼山睡房',
  area = '白驼山',
  name = '睡房',
  desc =  [[这间睡房宽敞明亮，想来便是庄主的卧室了。有一张书桌，桌子上放有几本书，却是《易经》之类。墙边有一大箱子。整个房间看上去极为单调。]],
  exit = {
    w = { to = '白驼山堂屋', },
  },
},

['白驼山白驼山'] = {
  id = '白驼山白驼山',
  area = '白驼山',
  name = '白驼山',
  desc =  [[这是传说中神秘的白驼山。远远望去，两座白沙堆积形成的山峰好像一只骆驼的脊背。一座山门立在你的眼前。山门后一条小路通向一座山腰上的山庄。那里是「西毒」欧阳锋的秘宅。]],
  exit = {
    e = { to = '回疆大戈壁', handler = 'reset_data', },
    wu = { to = '白驼山白驼山庄山门', },
  },
},

['白驼山退堂'] = {
  id = '白驼山退堂',
  area = '白驼山',
  name = '退堂',
  desc =  [[这间退堂不大，只放有两个茶几，挂了两副字画。左右两边是睡房，再往后是个小院子。]],
  exit = {
    e = { to = '白驼山睡房', },
    s = { to = '白驼山堂屋', },
    n = { to = '白驼山花园', },
  },
},

['白驼山白驼山庄山门'] = {
  id = '白驼山白驼山庄山门',
  area = '白驼山',
  name = '白驼山庄山门',
  desc =  [[这里就是西毒欧阳锋的居所“白驼山庄”。但自从欧阳锋失踪以后，家丁、仆人都走光了。现在这里看上去已经极为破烂了，山庄的牌匾上扑满的灰尘。]],
  exit = {
    nu = { to = '白驼山空地', },
    ed = { to = '白驼山白驼山', },
  },
},

['白驼山花园'] = {
  id = '白驼山花园',
  area = '白驼山',
  name = '花园',
  desc =  [[这是个不大的花园，中间一堆假山，一条小溪。旁边种满了各类花草，芳香宜人。北面有一道锁着的铁门(tiemen)，可以通往另一个院子。]],
  exit = {
    s = { to = '白驼山退堂', },
    hidden1 = { to = '白驼山蛇潭', cmd = 'climb tiemen', cond = 'player.dex >= 25 and player.skill["毒技"] and player.skill["毒技"].level >= 50', no_wander = true, },
    hidden2 = { to = '白驼山院子#1', cmd = 'push tiemen', cond = 'player.str >= 38 and player.dex >= 18 and player.skill["毒技"] and player.skill["毒技"].level >= 50', no_wander = true, },
  },
},

['白驼山堂屋'] = {
  id = '白驼山堂屋',
  area = '白驼山',
  name = '堂屋',
  desc =  [[一间宽敞的堂屋，左右两排太师椅都是檀香木制成。正中那把尺寸大一倍的雕花太师椅更是不凡。堂上正中挂有一匾额(bian)。左右偏堂的房门半掩，看不清里面。]],
  exit = {
    sd = { to = '白驼山空地', },
    w = { to = '白驼山药房', },
    n = { to = '白驼山退堂', },
  },
},

['白驼山药房'] = {
  id = '白驼山药房',
  area = '白驼山',
  name = '药房',
  desc =  [[欧阳锋既为“西毒”，他在对药理的精通当真是上无古人下无来者。这药房内上千种医药、毒药全用白瓷瓶子装着，贴上标签，分门别类地放在四周的药架上，令人一目了然，越也增加了一丝恐惧之心。]],
  exit = {
    e = { to = '白驼山堂屋', },
  },
},

['白驼山院子#1'] = {
  id = '白驼山院子#1',
  area = '白驼山',
  name = '院子',
  desc =  [[这个院子里虽只有几颗小树，却堆放着上百堆的石头。这些石头有大有小，大如一间房屋，小如一个鸭蛋。你发现旁边矮墙下有一条深沟，下面水花盈盈看不清有什么东西。身后有道铁门(tiemen)，不过已经关上了。一股股的腥臭味飘来，使你快要做呕了。]],
  exit = {
    jumpdown = { to = '白驼山蛇潭', },
    nw = { to = '白驼山院子#S', },
    hidden = { to = '白驼山花园', cmd = 'climb tiemen', cond = 'player.dex >= 18', },
  },
},

['白驼山空地'] = {
  id = '白驼山空地',
  area = '白驼山',
  name = '空地',
  desc =  [[这是一片堂屋前的空地，旁边放了些兵器架、沙袋以及几个木桩。地上铺满了飘落的树叶和干草。旁边有一口水井、一把水瓢，井水清澈，散发着阵阵凉气。西面是几大间储藏室。]],
  exit = {
    nu = { to = '白驼山堂屋', },
    w = { to = '白驼山储藏室', },
    sd = { to = '白驼山白驼山庄山门', },
  },
},

['大理城西宁浪泸沽湖'] = {
  id = '大理城西宁浪泸沽湖',
  area = '大理城西',
  name = '宁浪泸沽湖',
  desc =  [[整个湖泊，状若马蹄，南北长而东西窄。晨曦初露，湖水如染，一片金红，朝阳徐徐上升，则为翠绿；待夕阳西下，又成一片墨绿。风静时，平滑若镜，积万顷碧玉；微风起处，波光林林。湖泊周围山峦起伏，东北，峭拔壁立的肖家火山，高三千七百八十七米；西北，状若雄狮狮蹲踞的格姆山高三千七百五十五米。湖东，有条山梁蜿蜒而下直插湖心，]],
  exit = {
    ne = { to = '大理城西虎跳峡', },
    su = { to = '大理城西玉龙雪山', },
  },
},

['大理城西虎跳峡'] = {
  id = '大理城西虎跳峡',
  area = '大理城西',
  name = '虎跳峡',
  desc =  [[金沙江流经丽江的石鼓之后，切穿了玉龙雪山和哈巴雪山，形成极为壮观的大峡谷，这就是有名的虎跳峡。虎跞峡全长十五公里，自谷底到江岸山顶，高差达三千多米，是世界上最深的峡谷之一。两岸如刀削斧砍，谷底狭窄，江面宽仅几十米。传说有巨虎一跃而过，因而得名。]],
  exit = {
    e = { to = '大理城西怒江', },
    sw = { to = '大理城西宁浪泸沽湖', },
    nw = { to = '大理城西梅里雪山', },
  },
},

['大理城西怒江'] = {
  id = '大理城西怒江',
  area = '大理城西',
  name = '怒江',
  desc =  [[怒江发源于青藏高原的唐古拉山南麓，上游藏语叫做“那曲”，即“黑水河”，流入他念他翁山和伯舒拉岭之间的峡谷中，始称“怒江”。怒江奔流于怒山和高黎贡山之间，两岸山第拔多在三千米以上，山谷幽深，河流落差大，水急滩高，有“一滩接一滩，一滩高十丈”的说法，十分气派。两岸多危崖，有“水无不怒石，山有欲飞峰”之称。]],
  exit = {
    ne = { to = '天龙寺点苍山', },
    w = { to = '大理城西虎跳峡', },
    su = { to = '大理城西轿子雪山', },
  },
},

['大理城西玉龙雪山'] = {
  id = '大理城西玉龙雪山',
  area = '大理城西',
  name = '玉龙雪山',
  desc =  [[全山十三峰，峰峰终年披云戴雪，似一排玉柱立地擎天，并肩耸立在金沙江东岸；如一条矫健的玉龙。从碧空蜿蜒而来，腾跃于锦绣大地之上。它气势磅礴，洋溢着一种雄奇、壮丽的美。]],
  exit = {
    nd = { to = '大理城西宁浪泸沽湖', },
  },
},

['大理城西梅里雪山'] = {
  id = '大理城西梅里雪山',
  area = '大理城西',
  name = '梅里雪山',
  desc =  [[这里高峰耸立，终年积雪，常年悬挂现代高山冰川，俨然是一个冰雪世界。春夏之交，部分积雪融化，冰水泻而下，白练悬空，蔚为奇观。地势险峻，坡度很陡。整个坡面的直线距离为十二公里。如此深切、陡峭的高山纵谷地形，是罕见的景观。]],
  exit = {
    se = { to = '大理城西虎跳峡', },
    sw = { to = '大理城西天池', },
  },
},

['大理城西天池半山'] = {
  id = '大理城西天池半山',
  area = '大理城西',
  name = '天池半山',
  desc =  [[天池半山，森林苍翠茂密，时闻鸟鸣，偶见兽迹，清晨可登上五宝山箸看日出，远山若海，红日冉冉升腾，分外壮观。远可望碧罗雪山，雪冠如银天池地势高，景色幽奇，气候凉爽，野花缤纷，每逢暑月，人们多来赏。]],
  exit = {
    d = { to = '大理城西天池', },
  },
},

['大理城西天池'] = {
  id = '大理城西天池',
  area = '大理城西',
  name = '天池',
  desc =  [[天池，亦名署场海，海拔二千五百五十一米。湖水由四围山顶雨水汇聚而成。水尤清碧，波光潋滟；茭蒲茂密，野鸭成群；山色倒映，蔚为奇观。近南岸有一小岛。湖内养有肥鱼；湖面有独木舟，游人可泛舟湖上；湖畔有养鹿场。真是山光水色荟一地，山海味萃一方，实为难得。向东，能望见点苍山。向西，近可见澜沧江灰白如练，迤逦南。]],
  exit = {
    ne = { to = '大理城西梅里雪山', },
    u = { to = '大理城西天池半山', },
  },
},

['大理城西轿子雪山'] = {
  id = '大理城西轿子雪山',
  area = '大理城西',
  name = '轿子雪山',
  desc =  [[这里位于禄劝县境内，有峨嵋山的雄伟、黄山的秀丽华山的险峻，自然景观十分独特。山上有明镜般的高山湖泊、高山草甸、七彩瀑布和变幻莫测的云层、雪花、阳光。春季，几十种杜鹃漫山开遍，五彩缤纷；冬季，银装素裹，雾松、冰湖、冰瀑、雪原等景观壮丽雄奇。]],
  exit = {
    nd = { to = '大理城西怒江', },
  },
},

['大理王府长廊#2E'] = {
  id = '大理王府长廊#2E',
  area = '大理王府',
  name = '长廊',
  desc =  [[这是镇南王府内的一条长廊，长廊一直通向王府内，廊边雕满了花边，透过缕空的花纹，你可以看见廊外的树木花草。西面是帐房，东边是厨房。]],
  exit = {
    e = { to = '大理王府王府厨房', },
    s = { to = '大理王府长廊#3E', },
    w = { to = '大理王府帐房', },
    n = { to = '大理王府长廊#1E', },
  },
},

['大理王府书房'] = {
  id = '大理王府书房',
  area = '大理王府',
  name = '书房',
  desc =  [[这是书房，整个房间弥漫着浓浓的墨香。整个房间全部都是书，其中不少是武林密芨。段王爷每天都要在此处理朝廷要事，闲暇时吟诗诵词，家人卫士等，不经许可，决不敢贸然闯进。]],
  exit = {
    w = { to = '大理王府长廊#3W', },
  },
},

['大理王府议政厅'] = {
  id = '大理王府议政厅',
  area = '大理王府',
  name = '议政厅',
  desc =  [[这里是镇南王办理公事的地方，一张红木大桌摆在厅中央，桌上摆满了各种文件，四周也都是一个个的大柜子。]],
  exit = {
    e = { to = '大理王府长廊#2W', },
  },
},

['大理王府长廊#1E'] = {
  id = '大理王府长廊#1E',
  area = '大理王府',
  name = '长廊',
  desc =  [[这是镇南王府内的一条长廊，长廊一直通向王府内，廊边雕满了花边，透过缕空的花纹，你可以看见廊外的树木花草。]],
  exit = {
    w = { to = '大理王府王府大厅', },
    s = { to = '大理王府长廊#2E', },
  },
},

['大理王府长廊#3W'] = {
  id = '大理王府长廊#3W',
  area = '大理王府',
  name = '长廊',
  desc =  [[这是镇南王府内的一条长廊，长廊一直通向王府内，廊边雕满了花边，透过缕空的花纹，你可以看见廊外的树木花草。西面是镇南王的卧室，东面是书房。南面过去是一个小花园。]],
  exit = {
    e = { to = '大理王府书房', },
    se = { to = '大理王府长廊#4W', },
    w = { to = '大理王府卧室#1W', },
    n = { to = '大理王府长廊#2W', },
  },
},

['大理王府王府大厅'] = {
  id = '大理王府王府大厅',
  area = '大理王府',
  name = '王府大厅',
  desc =  [[放眼望这大厅，只见正中一块横匾，写着“帮国柱石”四个大字，下首署着“丁卯御笔”四个小字，楹柱中堂上悬满了字画，一时也看不了这么许多。这就是镇南王接待江湖朋友的地方!]],
  exit = {
    e = { to = '大理王府长廊#1E', },
    w = { to = '大理王府长廊#1W', },
    n = { to = '大理王府镇南王府大门', },
  },
},

['大理王府长廊#4E'] = {
  id = '大理王府长廊#4E',
  area = '大理王府',
  name = '长廊',
  desc =  [[这是镇南王府内的一条长廊，长廊一直通向王府内，廊边雕满了花边，透过缕空的花纹，你可以看见廊外的树木花草。西面是过去是一个小花园。]],
  exit = {
    ne = { to = '大理王府长廊#3E', },
    w = { to = '大理王府花园', },
  },
},

['大理王府王府厨房'] = {
  id = '大理王府王府厨房',
  area = '大理王府',
  name = '王府厨房',
  desc =  [[这是王爷的用膳房。整个房间飘荡着香味，好多下人在不停的忙着，边上一角放着好多刚打回来的野味，你不由得舔舔嘴巴，好象听到你的肚子“咕咕咕”的叫了起来。]],
  exit = {
    w = { to = '大理王府长廊#2E', },
  },
},

['大理王府兵器房'] = {
  id = '大理王府兵器房',
  area = '大理王府',
  name = '兵器房',
  desc =  [[这是物品房，堆满了杂物，但是房子里并不杂乱，王府内的仆人收拾的井井有调。房子角放着几把长剑。]],
  exit = {
    w = { to = '大理王府长廊#3E', },
  },
},

['大理王府帐房'] = {
  id = '大理王府帐房',
  area = '大理王府',
  name = '帐房',
  desc =  [[这里是镇南王府的帐房，管家霍先生坐在椅子上认真的查看帐簿，不时的在思考什么.你悄悄的走进来，生怕了影响霍先生的思考。]],
  exit = {
    e = { to = '大理王府长廊#2E', },
  },
},

['大理王府长廊#1W'] = {
  id = '大理王府长廊#1W',
  area = '大理王府',
  name = '长廊',
  desc =  [[这是镇南王府内的一条长廊，长廊一直通向王府内，廊边雕满了花边，透过缕空的花纹，你可以看见廊外的树木花草。]],
  exit = {
    e = { to = '大理王府王府大厅', },
    s = { to = '大理王府长廊#2W', },
  },
},

['大理王府镇南王府大门'] = {
  id = '大理王府镇南王府大门',
  area = '大理王府',
  name = '镇南王府大门',
  desc =  [[这是一座金碧辉煌的府邸，府门前两面大旗，分别绣的是“镇南”,“保国”两字，府额上写的是“镇南王府”,站了不少亲兵卫士。门口虽站满了人，但人人屏息凝气，只声不出。你到了这里，不由得也恭谨起来。]],
  exit = {
    w = { to = '大理城东大街#1S', },
    s = { to = '大理王府王府大厅', },
  },
},

['大理王府长廊#3E'] = {
  id = '大理王府长廊#3E',
  area = '大理王府',
  name = '长廊',
  desc =  [[这是镇南王府内的一条长廊，长廊一直通向王府内，廊边雕满了花边，透过缕空的花纹，你可以看见廊外的树木花草。西面是镇南王之子段誉的卧室，东面是物品室。南面过去是一个小花园。]],
  exit = {
    e = { to = '大理王府兵器房', },
    sw = { to = '大理王府长廊#4E', },
    w = { to = '大理王府卧室#1E', },
    n = { to = '大理王府长廊#2E', },
  },
},

['大理王府花园'] = {
  id = '大理王府花园',
  area = '大理王府',
  name = '花园',
  desc =  [[这是镇南王府内后花园，园子不大，种了不少名贵的茶花，园子中央有个小亭子。平时镇南王和家臣经常来此赏月观花。]],
  exit = {
    w = { to = '大理王府长廊#4W', },
    e = { to = '大理王府长廊#4E', },
  },
},

['大理王府长廊#4W'] = {
  id = '大理王府长廊#4W',
  area = '大理王府',
  name = '长廊',
  desc =  [[这是镇南王府内的一条长廊，长廊一直通向王府内，廊边雕满了花边，透过缕空的花纹，你可以看见廊外的树木花草。东面是过去是一个小花园。]],
  exit = {
    nw = { to = '大理王府长廊#3W', },
    e = { to = '大理王府花园', },
  },
},

['大理王府长廊#2W'] = {
  id = '大理王府长廊#2W',
  area = '大理王府',
  name = '长廊',
  desc =  [[这是镇南王府内的一条长廊，长廊一直通向王府内，廊边雕满了花边，透过缕空的花纹，你可看见廊外的树木花草。西面是议政厅，东边是暖阁。]],
  exit = {
    e = { to = '大理王府暖阁', },
    s = { to = '大理王府长廊#3W', },
    w = { to = '大理王府议政厅', },
    n = { to = '大理王府长廊#1W', },
  },
},

['大理王府暖阁'] = {
  id = '大理王府暖阁',
  area = '大理王府',
  name = '暖阁',
  desc =  [[这里是镇南王平时歇息的地方，四周都有火炉，整个阁子里暖暖和和的，地上铺者地毯，整个房间都透着一种雍容华贵的氛围。]],
  exit = {
    w = { to = '大理王府长廊#2W', },
  },
},

['大理王府卧室#1E'] = {
  id = '大理王府卧室#1E',
  area = '大理王府',
  name = '卧室',
  desc =  [[这里是镇南王之子段誉的卧室，房子不大，床上被子叠的整整齐齐，段公子好久没在王府了，屋子里落了些灰尘，显得旧旧的。]],
  exit = {
    e = { to = '大理王府长廊#3E', },
  },
},

['大理王府卧室#1W'] = {
  id = '大理王府卧室#1W',
  area = '大理王府',
  name = '卧室',
  desc =  [[这里是镇南王的卧室，房子不大，床上被子叠的整整齐齐，窗边有张小桌， 桌上整齐地摆放着几本书。]],
  exit = {
    e = { to = '大理王府长廊#3W', },
  },
},

['黄河流域黄河岸边#4'] = {
  id = '黄河流域黄河岸边#4',
  area = '黄河流域',
  name = '黄河岸边',
  desc =  [[这里是黄河岸边。黄河流淌到这里，已经泥沙浑浊了。黄色的河水在河床里翻滚着，咆哮着，卷起一个个巨大的漩窝。黄河在这里由於受到东面泰山的阻挡，转而向北。]],
  exit = {
    ne = { to = '黄河流域黄河岸边#5', },
    w = { to = '黄河流域黄河岸边#3', },
  },
},

['黄河流域黄河岸边#6'] = {
  id = '黄河流域黄河岸边#6',
  area = '黄河流域',
  name = '黄河岸边',
  desc =  [[这里是黄河岸边。黄河流淌到这里，河床宽阔。黄色的河水在静静地向东流去，使人忘记它发洪水时的狂威。]],
  exit = {
    ne = { to = '黄河流域黄河岸边#7', },
    sw = { to = '黄河流域黄河岸边#5', },
  },
},

['黄河流域黄河'] = {
  id = '黄河流域黄河',
  area = '黄河流域',
  name = '黄河',
  desc =  [[黄河沿蒙古高原南边向东流淌，遇太行山脉的阻拦，便转头南下，形成晋陕的分界。东北方向是个大渡口。]],
  exit = {
    nw = { to = '黄河流域黄土高原', },
    se = { to = '黄河流域河套', },
  },
},

['黄河流域黄河岸边#7'] = {
  id = '黄河流域黄河岸边#7',
  area = '黄河流域',
  name = '黄河岸边',
  desc =  [[这里是黄河岸边。黄河流淌到这里，河床宽阔。黄色的河水在静静地向东流去，使人忘记它发洪水时的狂威。]],
  exit = {
    nu = { to = '黄河流域黄河大堤', },
    sw = { to = '黄河流域黄河岸边#6', },
    nw = { to = '萧府萧府大门', },
    ne = { to = '黄河流域黄河入海口', },
  },
},

['黄河流域黄河入海口'] = {
  id = '黄河流域黄河入海口',
  area = '黄河流域',
  name = '黄河入海口',
  desc =  [[黄河流经青藏高原、黄土高原、华北平原，总长一万零九百里，在这里汇入大海。黄河流淌到这里，河床宽阔。黄色的河水在静静地向东流去，使人忘记它发洪水时的狂威。]],
  exit = {
    sw = { to = '黄河流域黄河岸边#7', },
    n = { to = '黄河流域大渡口#S', },
  },
},

['黄河流域黄河岸边#2'] = {
  id = '黄河流域黄河岸边#2',
  area = '黄河流域',
  name = '黄河岸边',
  desc =  [[这里是黄河岸边。黄河流淌到这里，已经泥沙浑浊了。黄色的河水在河床里翻滚着，咆哮着，卷起一个个巨大的漩窝。]],
  exit = {
    w = { to = '黄河流域黄河岸边#1', },
    e = { to = '黄河流域黄河岸边#3', },
  },
},

['黄河流域田地#4'] = {
  id = '黄河流域田地#4',
  area = '黄河流域',
  name = '田地',
  desc =  [[这里林木渐渐稀疏，不远处有一些村庄，炊烟袅袅升起。村庄周围是一块块的田地，田里有一些正在耕作的农人。]],
  exit = {
    e = { to = '黄河流域田地#3', },
    sw = { to = '黄河流域树林#1NW', },
  },
},

['黄河流域树林#1W'] = {
  id = '黄河流域树林#1W',
  area = '黄河流域',
  name = '树林',
  desc =  [[树林里光线暗淡，只能听见头顶上传来一些鸟儿的啼鸣。偶而从茂密的叶间透过的一线光伴着落叶在飞舞。朽木腐烂的气味和身後传来野兽的啸声使人不觉犹豫了前进的脚步。]],
  exit = {
    e = { to = '黄河流域树林#1E', },
    nw = { to = '黄河流域树林#1NW', },
    s = { to = '黄河流域树林#2W', },
  },
},

['黄河流域草地#2'] = {
  id = '黄河流域草地#2',
  area = '黄河流域',
  name = '草地',
  desc =  [[这里是一遍绿茵茵的草地，像是一方绿色的毯子铺在地上。草丛中开着一些不知名的小花，有红的、黄的，还有紫的。花瓣上、草叶上的露珠闪着晶莹的光。]],
  exit = {
    w = { to = '黄河流域草地#1', },
    s = { to = '扬州城北门外', },
  },
},

['黄河流域树林#2W'] = {
  id = '黄河流域树林#2W',
  area = '黄河流域',
  name = '树林',
  desc =  [[树林里光线暗淡，只能听见头顶上传来一些鸟儿的啼鸣。偶而从茂密的叶间透过的一线光伴着落叶在飞舞。朽木腐烂的气味和身後传来野兽的啸声使人不觉犹豫了前进的脚步。]],
  exit = {
    e = { to = '黄河流域树林#2E', },
    sw = { to = '黄河流域采矿场入口', },
    n = { to = '黄河流域树林#1W', },
  },
},

['黄河流域大渡口#N'] = {
  id = '黄河流域大渡口#N',
  area = '黄河流域',
  name = '大渡口',
  desc =  [[这里是黄河大渡口，是通往中原的必经之路。宽阔的黄河江面上飘荡着几只轻帆。渡口处正停着一艘渡船，几个乘客正在和船家讨论价钱。你可以由此上(yell)船渡过黄河。]],
  exit = {
    enter = { to = '黄河流域渡船', cmd = 'duhe', unstable = true, handler = 'fly_across', no_wander = true, },
    n = { to = '沧州城官道#4', },
  },
},

['黄河流域黄河大堤'] = {
  id = '黄河流域黄河大堤',
  area = '黄河流域',
  name = '黄河大堤',
  desc =  [[这里就是黄河大堤了，汹涌的黄河水咆哮着向东流去，水里还不时夹杂着从上游冲下来的一些动物、木板、铁锅......。你四下里看了看，很多人在这里忙着加固堤坝。]],
  exit = {
    sd = { to = '黄河流域黄河岸边#7', },
  },
},

['黄河流域树林#1NW'] = {
  id = '黄河流域树林#1NW',
  area = '黄河流域',
  name = '树林',
  desc =  [[树林里光线暗淡，只能听见头顶上传来一些鸟儿的啼鸣。偶而从茂密的叶间透过的一线光伴着落叶在飞舞。朽木腐烂的气味和身後传来野兽的啸声使人不觉犹豫了前进的脚步。]],
  exit = {
    ne = { to = '黄河流域田地#4', },
    w = { to = '黄河流域树林#2NW', },
    se = { to = '黄河流域树林#1W', },
  },
},

['黄河流域黄河岸边#5'] = {
  id = '黄河流域黄河岸边#5',
  area = '黄河流域',
  name = '黄河岸边',
  desc =  [[这里是黄河岸边。黄河流淌到这里，河床宽阔。黄色的河水在静静地向东流去，使人忘记它发洪水时的狂威。]],
  exit = {
    e = { to = '泰山岱宗坊', },
    sw = { to = '黄河流域黄河岸边#4', },
    ne = { to = '黄河流域黄河岸边#6', },
  },
},

['黄河流域大渡口#S'] = {
  id = '黄河流域大渡口#S',
  area = '黄河流域',
  name = '大渡口',
  desc =  [[这里是黄河大渡口，是通往京城的必经之路。宽阔的黄河江面上飘荡着几只轻帆。渡口处正停着一艘渡船，几个乘客正在和船家讨论价钱。你可以由此上(yell)船渡过黄河。]],
  exit = {
    s = { to = '黄河流域黄河入海口', },
    enter = { to = '黄河流域渡船', cmd = 'duhe', unstable = true, handler = 'fly_across', no_wander = true, },
  },
},

['黄河流域黄河岸边#1'] = {
  id = '黄河流域黄河岸边#1',
  area = '黄河流域',
  name = '黄河岸边',
  desc =  [[这里是黄河岸边。黄河流淌到这里，已经泥沙浑浊了。黄色的河水在河床里翻滚着，咆哮着，卷起一个个巨大的漩窝。西边有个寨子。]],
  exit = {
    e = { to = '黄河流域黄河岸边#2', },
    s = { to = '黄河流域田地#1', },
    w = { to = '黄河流域黄河帮寨门', },
    n = { to = '黄河流域渭汾流域', },
  },
},

['黄河流域侠义厅'] = {
  id = '黄河流域侠义厅',
  area = '黄河流域',
  name = '侠义厅',
  desc =  [[这是黄河帮议事的大厅，厅上挂着「侠义厅」三字匾额。厅里靠北朝南放着一张虎皮交椅，两边摆设着几副红木桌椅，非常有气派。墙上附庸风雅地挂了几幅丹青书法。]],
  exit = {
    e = { to = '黄河流域广场', },
  },
},

['黄河流域墓地'] = {
  id = '黄河流域墓地',
  area = '黄河流域',
  name = '墓地',
  desc =  [[走到这里越发感到荒凉，黄叶随风乱舞，四处弥漫着朽木腐烂的气味。没膝的杂草中有一座土坟，墓碑(bei) 上落满了尘土，不仔细看，很难辩出上面写些什么。墓前并无纸灰，看起来好久没有人来祭拜了。]],
  exit = {
    s = { to = '黄河流域树林#2NW', },
  },
},

['黄河流域树林#2E'] = {
  id = '黄河流域树林#2E',
  area = '黄河流域',
  name = '树林',
  desc =  [[树林里光线暗淡，只能听见头顶上传来一些鸟儿的啼鸣。偶而从茂密的叶间透过的一线光伴着落叶在飞舞。朽木腐烂的气味和身後传来野兽的啸声使人不觉犹豫了前进的脚步。林中立着一块牌子(paizi)。]],
  exit = {
    e = { to = '黄河流域草地#1', },
    w = { to = '黄河流域树林#2W', },
    n = { to = '黄河流域树林#1E', },
  },
},

['黄河流域田地#3'] = {
  id = '黄河流域田地#3',
  area = '黄河流域',
  name = '田地',
  desc =  [[这里林木渐渐稀疏，不远处有一些村庄，炊烟袅袅升起。村庄周围是一块块的田地，田里有一些正在耕作的农人。]],
  exit = {
    e = { to = '黄河流域田地#2', },
    w = { to = '黄河流域田地#4', },
    s = { to = '黄河流域树林#1E', },
  },
},

['黄河流域杨树林'] = {
  id = '黄河流域杨树林',
  area = '黄河流域',
  name = '杨树林',
  desc =  [[这里是一片杨树林中开辟的一空地。大驿道上的一排杨树挡住了一路尘埃和噪杂, 显得格外平静。北面是“铁面判官”单正的大宅院, 他的五个儿子守在这儿。]],
  exit = {
    se = { to = '泰山大驿道#1', },
    n = { to = '黄河流域单家庄', },
  },
},

['黄河流域树林#2NW'] = {
  id = '黄河流域树林#2NW',
  area = '黄河流域',
  name = '树林',
  desc =  [[树林里光线暗淡，只能听见头顶上传来一些鸟儿的啼鸣。偶而从茂密的叶间透过的一线光伴着落叶在飞舞。朽木腐烂的气味和身後传来野兽的啸声使人不觉犹豫了前进的脚步。]],
  exit = {
    e = { to = '黄河流域树林#1NW', },
    n = { to = '黄河流域墓地', },
  },
},

['黄河流域渭汾流域'] = {
  id = '黄河流域渭汾流域',
  area = '黄河流域',
  name = '渭汾流域',
  desc =  [[汾河和渭河汇入黄河，增大了其水势，也带来了更多的泥沙。这里河东是山西，河西是陕西。西南方向是一处密林。隐约可以看见一片悬崖。]],
  exit = {
    sw = { to = '南阳城密林', },
    s = { to = '黄河流域黄河岸边#1', },
    n = { to = '黄河流域河套', },
  },
},

['黄河流域田地#1'] = {
  id = '黄河流域田地#1',
  area = '黄河流域',
  name = '田地',
  desc =  [[这里是一大片农田。不远处有一些村庄，炊烟袅袅升起。村庄周围是一块块的田地，田里有一些正在耕作的农人。村里不时传出一声声的犬吠。]],
  exit = {
    e = { to = '泰山青石大道', },
    sw = { to = '黄河流域田地#2', },
    n = { to = '黄河流域黄河岸边#1', },
  },
},

['黄河流域黄河岸边#3'] = {
  id = '黄河流域黄河岸边#3',
  area = '黄河流域',
  name = '黄河岸边',
  desc =  [[这里是黄河岸边。黄河流淌到这里，已经泥沙浑浊了。黄色的河水在河床里翻滚着，咆哮着，卷起一个个巨大的漩窝。]],
  exit = {
    w = { to = '黄河流域黄河岸边#2', },
    e = { to = '黄河流域黄河岸边#4', },
  },
},

['黄河流域渡船'] = {
  id = '黄河流域渡船',
  area = '黄河流域',
  name = '渡船',
  desc =  [[黄河上的小舟都是这种很简陋的小舟。一位中年艄公正站在船尾吃力地掌舵，一位膀子壮硕的小伙子也在船头用劲地划水撑船。黄河水流湍急，船下滑很快，横渡却很慢。]],
  exit = {
    out2 = { to = '黄河流域大渡口#S', unstable = true, handler = 'disembark', cost = 50, },
    out = { to = '黄河流域大渡口#N', unstable = true, handler = 'disembark', cost = 50, },
  },
},

['黄河流域采石场'] = {
  id = '黄河流域采石场',
  area = '黄河流域',
  name = '采石场',
  desc =  [[这里是一个采石场，最近由于官府在此大修水利，需要大量的石头这里的也越发兴隆起来。里面不时传来阵阵的爆炸声，只见一块块巨石不断地从山上滚落下来。]],
  exit = {
    nu = { to = '黄河流域黄河帮寨门', },
  },
},

['黄河流域广场'] = {
  id = '黄河流域广场',
  area = '黄河流域',
  name = '广场',
  desc =  [[广场占地甚大，部置严谨。往西过去可达黄河帮的「侠义厅」。周围则是些房舍，供帮众居住。]],
  exit = {
    w = { to = '黄河流域侠义厅', },
    e = { to = '黄河流域黄河帮寨门', },
  },
},

['黄河流域黄河帮寨门'] = {
  id = '黄河流域黄河帮寨门',
  area = '黄河流域',
  name = '黄河帮寨门',
  desc =  [[这是一所气势壮观的寨门，正中高挂着一面扁额—写着「黄河帮」三个大字。寨里旗帜高挂，规模不小。黄河帮是黄河沿岸的一个大帮会，平日飞扬跋扈，欺压百姓，做恶多端。帮主沙通天武功深湛，并与彭连虎、梁子翁和灵智上人等高手结交，因此声势浩大。据闻其与金人勾结，欲侵略中土。]],
  exit = {
    e = { to = '黄河流域黄河岸边#1', },
    w = { to = '黄河流域广场', },
    sd = { to = '黄河流域采石场', },
  },
},

['黄河流域树林#1E'] = {
  id = '黄河流域树林#1E',
  area = '黄河流域',
  name = '树林',
  desc =  [[树林里光线暗淡，只能听见头顶上传来一些鸟儿的啼鸣。偶而从茂密的叶间透过的一线光伴着落叶在飞舞。朽木腐烂的气味和身後传来野兽的啸声使人不觉犹豫了前进的脚步。]],
  exit = {
    s = { to = '黄河流域树林#2E', },
    w = { to = '黄河流域树林#1W', },
    n = { to = '黄河流域田地#3', },
  },
},

['黄河流域河套'] = {
  id = '黄河流域河套',
  area = '黄河流域',
  name = '河套',
  desc =  [[常言到“黄河九害，富了一套”。河套地区灌溉系统发达，土地肥沃，是种庄稼的好地方。]],
  exit = {
    nw = { to = '黄河流域黄河', },
    s = { to = '黄河流域渭汾流域', },
  },
},

['黄河流域单家庄'] = {
  id = '黄河流域单家庄',
  area = '黄河流域',
  name = '单家庄',
  desc =  [[你走到一座高宅大院的门口，大门开着，门前左右有两个石狮子，四五级青石台阶上是两扇钉满铜钉的大门。看得出这里是当地大豪的住所。门口正中央高悬着一块黑底金字的大匾“单家庄”。]],
  exit = {
    s = { to = '黄河流域杨树林', },
  },
},

['黄河流域黄土高原'] = {
  id = '黄河流域黄土高原',
  area = '黄河流域',
  name = '黄土高原',
  desc =  [[黄河像一把厉刃将黄土高原切开。无数条小溪流夹带着泥沙汇入黄河，形成千沟万壑。沟壑之间的一块块平地叫做台塬。黄河沿蒙古高原南边向东流淌，遇太行山脉的阻拦，便转头南下，形成晋陕的分界。]],
  exit = {
    nw = { to = '长安城陕晋渡口#S', },
    se = { to = '黄河流域黄河', },
  },
},

['黄河流域草地#1'] = {
  id = '黄河流域草地#1',
  area = '黄河流域',
  name = '草地',
  desc =  [[这里是一遍绿茵茵的草地，像是一方绿色的毯子铺在地上。草丛中开着一些不知名的小花，有红的、黄的，还有紫的。花瓣上、草叶上的露珠闪着晶莹的光。]],
  exit = {
    w = { to = '黄河流域树林#2E', },
    e = { to = '黄河流域草地#2', },
  },
},

['黄河流域田地#2'] = {
  id = '黄河流域田地#2',
  area = '黄河流域',
  name = '田地',
  desc =  [[这里是一大片农田。不远处有一些村庄，炊烟袅袅升起。村庄周围是一块块的田地，田里有一些正在耕作的农人。]],
  exit = {
    ne = { to = '黄河流域田地#1', },
    w = { to = '黄河流域田地#3', },
  },
},

['萧府萧府大门'] = {
  id = '萧府萧府大门',
  area = '萧府',
  name = '萧府大门',
  desc =  [[这里是晋阳大侠萧半和所住的萧府的大门，红漆包门的正上方有一块金字黑底的长匾，上书“萧府”两个大字，门口两侧分立两个大石狮，甚是威武。北面是萧府的大厅，南面是黄河区域了。]],
  exit = {
    se = { to = '黄河流域黄河岸边#7', },
    n = { to = '萧府萧府大厅', cond = 'player.flag["got 金钗"]', },
  },
},

['萧府萧府大厅'] = {
  id = '萧府萧府大厅',
  area = '萧府',
  name = '萧府大厅',
  desc =  [[这里便是萧府的大厅，气派非凡，装饰奢华，居中一张太师椅，大厅上红烛高烧，中堂正中的绵轴上，贴着一个五尺见方的金色大“寿”字，晋阳大侠萧半和正热情地招呼着来贺寿诞的各路英雄。]],
  exit = {
    e = { to = '萧府书房', },
    s = { to = '萧府萧府大门', },
    w = { to = '萧府厨房', },
    n = { to = '萧府后院', },
  },
},

['萧府书房'] = {
  id = '萧府书房',
  area = '萧府',
  name = '书房',
  desc =  [[这里是萧府的书房，房中书架上整整齐齐地堆放着很多书。书架上一尘不染，显然是主人经常翻阅书籍。书橱里摆着几件精巧的玉器，显得玲珑剔透，光彩照人。]],
  exit = {
    w = { to = '萧府萧府大厅', },
  },
},

['萧府厨房'] = {
  id = '萧府厨房',
  area = '萧府',
  name = '厨房',
  desc =  [[这里是萧府的厨房，刚一进门，一股香气扑鼻而来，熏得你直流口水。灶台上满是油烟，好象今天客人来的不少，厨师们正忙碌着。]],
  exit = {
    e = { to = '萧府萧府大厅', },
  },
},

['萧府后院'] = {
  id = '萧府后院',
  area = '萧府',
  name = '后院',
  desc =  [[你走进后院，迎面是一个假山水池（chi)，池中立着一块巨大无比的假山，假山那里好象有一块可以落脚的地方，水池的两旁种满了各种各样的花草。南面是萧府的大厅。北面好象有个小门(door)。]],
  exit = {
    s = { to = '萧府萧府大厅', },
    n = { to = '萧府树林', unstable = true, no_wander = true, door = 'unlock door', cond = 'player.flag["got 红钥匙"]', },
    hidden = { to = '萧府石头', cmd = 'tiao chi', cond = 'player.skill["基本轻功"] and player.skill["基本轻功"].level >= 120', },
  },
},

['萧府石头'] = {
  id = '萧府石头',
  area = '萧府',
  name = '石头',
  desc =  [[这是一块窄小的落脚处，仅容得几个人落脚。右上方好象有个小洞(dong)，看起来可以伸手进去。]],
  exit = {
    hidden = { to = '萧府后院', cmd = 'tiao chi', cond = 'player.skill["基本轻功"] and player.skill["基本轻功"].level >= 120', },
  },
},

['萧府树林'] = {
  id = '萧府树林',
  area = '萧府',
  name = '树林',
  desc =  [[这里是一片茂盛的树林，到处古木参天，你到了这里，怎么也看不清楚周围的景象了。]],
  exit = {
    ne = { to = '萧府树林', },
    se = { to = '萧府树林', },
    sw = { to = '萧府树林', },
    nw = { to = '萧府树林', },
    s = { to = '萧府后院', unstable = true, cost = 10, handler = 'xf_shulin', },
    hidden = { to = '萧府后山', cost = 10, handler = 'xf_shulin', },
  },
},

['萧府后山'] = {
  id = '萧府后山',
  area = '萧府',
  name = '后山',
  desc =  [[这里是后山的一个隐蔽的小山谷，长年人迹罕至。谷中古树参天，绿荫森森。不失为一个修炼功夫的好地方，偶尔从远处传来几声悠扬的鸟语，伴随着阵阵花香，简直让人疑心自己到了世外桃源。]],
  exit = {
    s = { to = '萧府后院', },
  },
},

['恒山玉羊游云'] = {
  id = '恒山玉羊游云',
  area = '恒山',
  name = '玉羊游云',
  desc =  [[东峰峭壁崖顶上，白石累累，散布有致，在云雾拂动下，似有动感，象正在吃草的羊只。这就是和“金鸡报晓”齐名的恒山胜景“玉羊游云”。]],
  exit = {
    wd = { to = '恒山北岳殿', },
  },
},

['恒山苦甜井'] = {
  id = '恒山苦甜井',
  area = '恒山',
  name = '苦甜井',
  desc =  [[北岳庙的右下角，有二井相距不过三尺，而水质一苦一甜，称为苦甜井。甜井中水味清洌甘甜，道家弟子奉为圣水，游人到此，每感口枯舌燥，饮此水确有消暑清热之益。]],
  exit = {
    w = { to = '恒山北岳庙', },
  },
},

['恒山金龙峡'] = {
  id = '恒山金龙峡',
  area = '恒山',
  name = '金龙峡',
  desc =  [[金龙峡又称唐峪，是进入恒山的入口。恒山一名太恒山，或称玄岳，是五岳中的北岳，道教以之为“第五小洞天”。它横亘三百余里，如一队行进中的队列，昔人以为“恒山如行”来相对“泰山如坐”，“华山如立”，“嵩山如卧”和“衡山如飞”。]],
  exit = {
    sd = { to = '长安城大道#2N', },
    sw = { to = '恒山翠屏谷#1', },
  },
},

['恒山北岳殿'] = {
  id = '恒山北岳殿',
  area = '恒山',
  name = '北岳殿',
  desc =  [[北岳殿上负绝壁，下临宫廨，下云级插天，庑门上下，穹碑森立。殿正中悬风字形匾，上书“贞元之殿”，殿内北岳恒山之神全身塑像，高可丈余。]],
  exit = {
    nu = { to = '恒山见性峰山道#1', },
    eu = { to = '恒山玉羊游云', },
    sd = { to = '恒山北岳庙', },
    wu = { to = '恒山会仙台', },
  },
},

['恒山翠屏谷#2'] = {
  id = '恒山翠屏谷#2',
  area = '恒山',
  name = '翠屏谷',
  desc =  [[这里峡谷幽深，石壁陡直，两崖壁立，一涧中流。就在这地势绝险的恒山山谷中，却有数十殿堂悬挂在翠屏山腰。它们上载危岩，下临深谷，错落有致，如玉宇琼楼自空中冉冉降落。那就是悬空寺了。]],
  exit = {
    nw = { to = '恒山翠屏谷#1', },
    u = { to = '恒山翠屏山道#1', },
  },
},

['恒山悬空栈桥'] = {
  id = '恒山悬空栈桥',
  area = '恒山',
  name = '悬空栈桥',
  desc =  [[栈道悬于南北危楼之间，由无数的掾铺成，每节掾宽尺许，九节并排在一起，每根掾绑在铁索上，上铺木板，长数十丈，下临深渊。山风呼啸，惊心动魄。]],
  exit = {
    s = { to = '恒山悬空寺南楼', },
    n = { to = '恒山悬空寺北楼', },
  },
},

['恒山悬根松'] = {
  id = '恒山悬根松',
  area = '恒山',
  name = '悬根松',
  desc =  [[就在虎风口这个风口险地，却有一株古松，虽被大风吹得树根裸露，千百年来仍迎风挺立，这就是恒山著名的“梵宫悬根”。]],
  exit = {
    e = { to = '恒山虎风口', },
  },
},

['恒山三教殿'] = {
  id = '恒山三教殿',
  area = '恒山',
  name = '三教殿',
  desc =  [[这里是全寺最高处的三教殿，也是悬空寺最大的殿宇。三层九脊，全部由每根插入崖石的木梁承受，真是“公输天巧”， 古今奇迹。]],
  exit = {
    d = { to = '恒山悬空寺北楼', },
  },
},

['恒山翠屏谷#1'] = {
  id = '恒山翠屏谷#1',
  area = '恒山',
  name = '翠屏谷',
  desc =  [[浑河在谷中冲刷而过，天峰岭和翠屏山分列峡谷两侧，绝壁千仞，犹如刀削斧劈，高耸入云，这里自古就是塞外通往内地的咽喉要道，真有一夫当关万夫莫开之势。]],
  exit = {
    ne = { to = '恒山金龙峡', },
    se = { to = '恒山翠屏谷#2', },
  },
},

['恒山悬空寺北楼'] = {
  id = '恒山悬空寺北楼',
  area = '恒山',
  name = '悬空寺北楼',
  desc =  [[这里是悬空寺的北门楼，也是北碑亭。登楼俯视，如临深渊，谷底仰望，如壁间丹凤。向南有悬空栈桥通往南楼。]],
  exit = {
    u = { to = '恒山三教殿', },
    wd = { to = '恒山翠屏山道#2', },
    s = { to = '恒山悬空栈桥', },
  },
},

['恒山悬空寺南楼'] = {
  id = '恒山悬空寺南楼',
  area = '恒山',
  name = '悬空寺南楼',
  desc =  [[这里是悬空寺的南门楼，也是南碑亭。悬空寺于陡崖上凿石穴插悬梁为基，楼宇间栈桥相连。全寺面东座西，南北危楼对望，断崖分断，很是艰险。]],
  exit = {
    su = { to = '恒山梯式栈道', },
    n = { to = '恒山悬空栈桥', },
  },
},

['恒山虎风口'] = {
  id = '恒山虎风口',
  area = '恒山',
  name = '虎风口',
  desc =  [[过 '步云桥' ， '望仙亭' ，就到了一个峰回路转的陡峭路口，这里是一处风口，大风来处，声如虎啸，比别处强劲多多，故有是名。]],
  exit = {
    ne = { to = '恒山果老岭', },
    sw = { to = '恒山大字岭', },
    w = { to = '恒山悬根松', },
  },
},

['恒山通元谷'] = {
  id = '恒山通元谷',
  area = '恒山',
  name = '通元谷',
  desc =  [[通元谷孤处见性峰下，相传为张果老成仙前修道之所，由于他道号“通元”，这里也就成了通元谷。]],
  exit = {
    eu = { to = '恒山果老岭', },
  },
},

['恒山见性峰广场'] = {
  id = '恒山见性峰广场',
  area = '恒山',
  name = '见性峰广场',
  desc =  [[这里是恒山主峰见性峰峰顶的广场。在这里俯瞰群山，才理会得何以恒山是华夏北方万山之宗，这里也是威震江湖的恒山派的根本重地。]],
  exit = {
    wd = { to = '恒山见性峰山道#2', },
    n = { to = '恒山白云庵', },
  },
},

['恒山果老岭'] = {
  id = '恒山果老岭',
  area = '恒山',
  name = '果老岭',
  desc =  [[光滑的岩面上断续分布着行行马蹄形凹坑，坑径三四寸，深寸许。传说这就是当年八仙中的张果老在恒山修道时，骑小毛驴由此登天。由于路陡坡滑，他不得不牵驴步行，留下这些脚印。后人诗云：“盘跚云路岭头那，凹石相传果老过，想是婆心来度世，故留遗迹使人摩。” ]],
  exit = {
    nu = { to = '恒山北岳庙', },
    sw = { to = '恒山虎风口', },
    wd = { to = '恒山通元谷', },
  },
},

['恒山见性峰山道#2'] = {
  id = '恒山见性峰山道#2',
  area = '恒山',
  name = '见性峰山道',
  desc =  [[你走在见性峰山脊小路上，听着山下庙宇的钟鼓，眼前白云漂荡，远远看到前面就是峰顶了。]],
  exit = {
    sd = { to = '恒山见性峰山道#1', },
    eu = { to = '恒山见性峰广场', },
  },
},

['恒山梯式栈道'] = {
  id = '恒山梯式栈道',
  area = '恒山',
  name = '梯式栈道',
  desc =  [[栈道悬于壁，由无数的掾铺成，每节掾宽尺许，九节并排在一起，每根掾插入岩壁，上铺木板，长约十丈，下临深渊。人必须踏上悬空的木板，紧攀铁索，屏息静气，缓步挪动，才能过去。]],
  exit = {
    su = { to = '恒山云阁虹桥', },
    nd = { to = '恒山悬空寺南楼', },
  },
},

['恒山会仙台'] = {
  id = '恒山会仙台',
  area = '恒山',
  name = '会仙台',
  desc =  [[走出北岳殿，就能看见一个石窟，紧靠在绝壁中凿出的一个小室，就是会仙台。台上排列群仙雕像，密密麻麻，不能胜数。]],
  exit = {
    ed = { to = '恒山北岳殿', },
  },
},

['恒山大字岭'] = {
  id = '恒山大字岭',
  area = '恒山',
  name = '大字岭',
  desc =  [[大字岭是入恒山必由之路。石壁上镌有 '恒宗' 二字，高可两丈，笔力遒劲，气势雄浑。]],
  exit = {
    ne = { to = '恒山虎风口', },
    w = { to = '恒山云阁虹桥', },
  },
},

['恒山翠屏山道#2'] = {
  id = '恒山翠屏山道#2',
  area = '恒山',
  name = '翠屏山道',
  desc =  [[你爬在翠屏山道上，树木遮天，难见天日。山林静谧，隐隐晨钟轻敲，一切尘俗尽皆洗尽，山深有静气，恒山本色。]],
  exit = {
    ed = { to = '恒山翠屏山道#1', },
    eu = { to = '恒山悬空寺北楼', },
  },
},

['恒山云阁虹桥'] = {
  id = '恒山云阁虹桥',
  area = '恒山',
  name = '云阁虹桥',
  desc =  [[过完栈道，就到云阁虹桥。前往恒山主峰见性峰，都要在这里跨过唐峪河。拱桥卧波，水天亮丽，倍觉胸襟舒畅。]],
  exit = {
    e = { to = '恒山大字岭', },
    nd = { to = '恒山梯式栈道', },
  },
},

['恒山白云庵'] = {
  id = '恒山白云庵',
  area = '恒山',
  name = '白云庵',
  desc =  [[这里就是恒山派掌门人的居所。庵内供奉白衣观世音，除地上一个蒲团，四壁萧然。恒山派威震江湖，没想到主庵居然简朴一至如斯。]],
  exit = {
    s = { to = '恒山见性峰广场', },
  },
},

['恒山鸡叫石'] = {
  id = '恒山鸡叫石',
  area = '恒山',
  name = '鸡叫石',
  desc =  [[北岳庙的西侧，有一尺许见方的石头，称鸡叫石。击之，“咯咯”作鸡鸣声，故名。清晨敲击，引起山谷回声，如群鸡争鸣，就称“金鸡报晓”。]],
  exit = {
    e = { to = '恒山北岳庙', },
  },
},

['恒山见性峰山道#1'] = {
  id = '恒山见性峰山道#1',
  area = '恒山',
  name = '见性峰山道',
  desc =  [[你走在见性峰山脊小路上，听着山下庙宇的钟鼓，眼前白云漂荡，感觉幽逸极了。]],
  exit = {
    nu = { to = '恒山见性峰山道#2', },
    sd = { to = '恒山北岳殿', },
  },
},

['恒山翠屏山道#1'] = {
  id = '恒山翠屏山道#1',
  area = '恒山',
  name = '翠屏山道',
  desc =  [[你爬在翠屏山道上，石阶陡峭，近在目前。回头外望，恒山重峦叠嶂，林木幽深，倍感静谧。]],
  exit = {
    d = { to = '恒山翠屏谷#2', },
    wu = { to = '恒山翠屏山道#2', },
  },
},

['恒山北岳庙'] = {
  id = '恒山北岳庙',
  area = '恒山',
  name = '北岳庙',
  desc =  [[北岳庙是个巍巍壮观的宫殿庙宇，山门三重，高列阜上，其下石阶数层。这里是北岳庙最大最高的朝殿 。]],
  exit = {
    nu = { to = '恒山北岳殿', },
    w = { to = '恒山鸡叫石', },
    sd = { to = '恒山果老岭', },
    e = { to = '恒山苦甜井', },
  },
},

['明教药房'] = {
  id = '明教药房',
  area = '明教',
  name = '药房',
  desc =  [[这里是明教的藏药室。各种灵丹秒药应有尽有，有各大门派感于张教主而相赠的，加之张教主精通医术，练丹治病更是易为。这里灵丹飘香，一进来就能令你精神一展。西面是一条通向聚义堂的走廊。]],
  exit = {
    w = { to = '明教练武场#N', },
  },
},

['明教宝塔一楼'] = {
  id = '明教宝塔一楼',
  area = '明教',
  name = '宝塔一楼',
  desc =  [[这里是光明宝塔的一楼，虽塔身颇大，但上到此处已不能再上，因为由此望上去二楼以上皆以巨木组成，似乎只是简单的搭在四周的青砖上，但塔身颇高，此简单的搭法隐隐的体现出当时的高超建筑技术，虽则站在一楼，但由于此塔地势高，在此你已可以看到整个光明顶的景色。]],
  exit = {
    out = { to = '明教光明宝塔', },
  },
},

['明教栈道#W'] = {
  id = '明教栈道#W',
  area = '明教',
  name = '栈道',
  desc =  [[这里是一条傍着峭壁的小路，一边是深不见底的悬崖，峭壁笔直，几不见天，更没有可以着手之处，偶尔会有一两处地方岩石突起，挡住你的去路，必须低头才能通过。一边是深不见底的深崖，云雾深锁其间，飞鸟难渡，只是偶尔传来几声鸟儿发出的凄厉的叫声，看起来你必须小必翼翼的走过去。]],
  exit = {
    nw = { to = '明教栈道#N', },
    se = { to = '明教栈道#S', },
  },
},

['明教山路#6'] = {
  id = '明教山路#6',
  area = '明教',
  name = '山路',
  desc =  [[这是一条一窄又陡的山路，这里已见白雪，白雪盖着山路两旁又高又杂的乱草杂树，极是美丽。你感到阵阵的寒恿上心头。南边是半山腰。]],
  exit = {
    ed = { to = '明教山亭', },
    su = { to = '明教半山腰', },
  },
},

['明教山路#3'] = {
  id = '明教山路#3',
  area = '明教',
  name = '山路',
  desc =  [[这是一条一窄又陡的山路，山路两旁长着又高又杂的乱草杂树，几没人头，偶尔会有几枝荆棘挡住你的去路，一不小心则会被其刺伤。]],
  exit = {
    nu = { to = '明教山路#4', },
    ed = { to = '明教山路#2', },
  },
},

['明教厢房'] = {
  id = '明教厢房',
  area = '明教',
  name = '厢房',
  desc =  [[这里是专门供外来的宾客休息的地方，里面有几张床和一些生活用品，十分干净舒适。]],
  exit = {
    w = { to = '明教厅堂', },
  },
},

['明教小沙丘#4'] = {
  id = '明教小沙丘#4',
  area = '明教',
  name = '小沙丘',
  desc =  [[这是一个堆满黄沙的小沙丘。你一踏上来就迷失了方向。看来要走出这块沙漠并非易事。但西北方向隐约可以见一个大沙丘。]],
  exit = {
    e = { to = '明教小沙丘#3', },
    s = { to = '明教小沙丘#4', },
    nw = { to = '明教黄土坪', },
    n = { to = '明教小沙丘#4', },
  },
},

['明教紫杉林#1'] = {
  id = '明教紫杉林#1',
  area = '明教',
  name = '紫杉林',
  desc =  [[这里是明教光明顶上的一片紫杉林。周围全是几十丈高的紫杉，密实的枝叶象一蓬蓬巨伞般伸向天空，把阳光遮得丝毫也无。你一走进这阴阴的森林，直觉便提醒你得赶快离开。]],
  exit = {
    s = { to = '明教紫杉林#1', },
    e = { to = '明教紫杉林#1', },
    w = { to = '明教紫杉林#1', },
    n = { to = '明教紫杉林#1', },
    hidden = { to = '明教紫杉林#5', cost = 5, handler = 'look_around', },
  },
},

['明教紫杉林#5'] = {
  id = '明教紫杉林#5',
  area = '明教',
  name = '紫杉林',
  desc =  [[这里是明教光明顶上的一片紫杉林。周围全是几十丈高的紫杉，密实的枝叶象一蓬蓬巨伞般伸向天空，把阳光遮得丝毫也无。你一走进这阴阴的森林，直觉便提醒你得赶快离开。]],
  exit = {
    s = { to = '明教紫杉林#1', },
    e = { to = '明教厚土旗', },
    w = { to = '明教紫杉林#1', },
    n = { to = '明教紫杉林#1', },
    hidden = { to = '明教紫杉林#9', cost = 10, cmd = 'e', handler = 'look_around', },
  },
},

['明教紫杉林#6'] = {
  id = '明教紫杉林#6',
  area = '明教',
  name = '紫杉林',
  desc =  [[这里是明教光明顶上的一片紫杉林。周围全是几十丈高的紫杉，密实的枝叶象一蓬蓬巨伞般伸向天空，把阳光遮得丝毫也无。你一走进这阴阴的森林，直觉便提醒你得赶快离开。]],
  exit = {
    s = { to = '明教紫杉林#1', },
    e = { to = '明教紫杉林#1', },
    w = { to = '明教锐金旗', },
    n = { to = '明教紫杉林#1', },
    hidden = { to = '明教紫杉林#9', cost = 10, cmd = 'w', handler = 'look_around', },
  },
},

['明教紫杉林#7'] = {
  id = '明教紫杉林#7',
  area = '明教',
  name = '紫杉林',
  desc =  [[这里是明教光明顶上的一片紫杉林。周围全是几十丈高的紫杉，密实的枝叶象一蓬蓬巨伞般伸向天空，把阳光遮得丝毫也无。你一走进这阴阴的森林，直觉便提醒你得赶快离开。]],
  exit = {
    s = { to = '明教紫杉林#1', },
    e = { to = '明教烈火旗', },
    w = { to = '明教紫杉林#1', },
    n = { to = '明教紫杉林#1', },
    hidden = { to = '明教紫杉林#9', cost = 10, cmd = 'e', handler = 'look_around', },
  },
},

['明教紫杉林#8'] = {
  id = '明教紫杉林#8',
  area = '明教',
  name = '紫杉林',
  desc =  [[这里是明教光明顶上的一片紫杉林。周围全是几十丈高的紫杉，密实的枝叶象一蓬蓬巨伞般伸向天空，把阳光遮得丝毫也无。你一走进这阴阴的森林，直觉便提醒你得赶快离开。]],
  exit = {
    s = { to = '明教紫杉林#1', },
    e = { to = '明教紫杉林#1', },
    w = { to = '明教洪水旗', },
    n = { to = '明教紫杉林#1', },
    hidden = { to = '明教紫杉林#9', cost = 10, cmd = 'w', handler = 'look_around', },
  },
},

['明教紫杉林#9'] = {
  id = '明教紫杉林#9',
  area = '明教',
  name = '紫杉林',
  desc =  [[这里是明教光明顶上的一片紫杉林。周围全是几十丈高的紫杉，密实的枝叶象一蓬蓬巨伞般伸向天空，把阳光遮得丝毫也无。你一走进这阴阴的森林，直觉便提醒你得赶快离开。]],
  exit = {
    s = { to = '明教天字门', ignore = true, },
    s2 = { to = '明教地字门', ignore = true, },
    s3 = { to = '明教风字门', ignore = true, },
    s4 = { to = '明教雷字门', ignore = true, },
    e = { to = '明教天字门', ignore = true, },
    e2 = { to = '明教地字门', ignore = true, },
    e3 = { to = '明教风字门', ignore = true, },
    e4 = { to = '明教雷字门', ignore = true, },
    w = { to = '明教天字门', ignore = true, },
    w2 = { to = '明教地字门', ignore = true, },
    w3 = { to = '明教风字门', ignore = true, },
    w4 = { to = '明教雷字门', ignore = true, },
    n = { to = '明教天字门', ignore = true, },
    n2 = { to = '明教地字门', ignore = true, },
    n3 = { to = '明教风字门', ignore = true, },
    n4 = { to = '明教雷字门', ignore = true, },
    hidden1 = { to = '明教天字门', handler = 'look_self_dir', },
    hidden2 = { to = '明教地字门', handler = 'look_self_dir', },
    hidden3 = { to = '明教风字门', handler = 'look_self_dir', },
    hidden4 = { to = '明教雷字门', handler = 'look_self_dir', },
  },
},

['明教光明宝塔'] = {
  id = '明教光明宝塔',
  area = '明教',
  name = '光明宝塔',
  desc =  [[这里是明教光明顶上的一座宝塔，在正中的扁额上有用楷书写着“光明宝塔”四字。此塔仿明教在唐朝时皇帝为明教所建的光明寺宝塔而建，是为纪念当年明教鼎盛时期而建。塔高五层，每层皆由青砖做成，虽然历时年代久远，但仍然艰固无比。沿塔而上就可以纵观光明顶上的建筑群了。]],
  exit = {
    sd = { to = '明教圣火堂', },
    enter = { to = '明教宝塔一楼', },
  },
},

['明教小厅'] = {
  id = '明教小厅',
  area = '明教',
  name = '小厅',
  desc =  [[这是聚义厅前的一个小厅，北面的院子是聚义厅，南边是练武场，东西两边分别通向厨房和休息室。]],
  exit = {
    e = { to = '明教休息室', },
    s = { to = '明教练武场#N', },
    w = { to = '明教厨房', },
    n = { to = '明教聚议厅', },
  },
},

['明教林间小路#E'] = {
  id = '明教林间小路#E',
  area = '明教',
  name = '林间小路',
  desc =  [[这里是一大片的森林，一条曲折的小路穿越其间。这里已没有上山的深崖峭壁的危险，地势已较为平坦。但林木高耸云间，又别有一番阴森可怕。两边的林木笔直的生长着，很有规律，是几百年前明教老祖们开辟光明顶时所植。虽是人为所植，但历时年代已久，有很多的飞鸟猛兽出入其间。树梢间积着十分厚的积雪，其景十分壮观。]],
  exit = {
    ne = { to = '明教林间小路#N', },
    sw = { to = '明教林间小路#S', },
  },
},

['明教狮王殿'] = {
  id = '明教狮王殿',
  area = '明教',
  name = '狮王殿',
  desc =  [[这里是专为“金毛狮王”谢逊建造的行殿，由于教主常思念义父，造此殿为准备迎回狮王，也是张无忌教主为召集明教首领宣示和中原诸门派尽释前愆、反元抗胡的教旨之处。这里摆有一张香按，长年都有香束燃着。]],
  exit = {
    w = { to = '明教聚议厅', },
    e = { to = '明教锐金旗', },
  },
},

['明教监狱入口'] = {
  id = '明教监狱入口',
  area = '明教',
  name = '监狱入口',
  desc =  [[这里是明教的地下监狱的入口处。明教的执法者站在那里，威严无比，令人不敢正视。入口处有一扇大铁门(men)，铁门处用一大锁锁住。]],
  exit = {
    nw = { to = '明教锐金旗', },
    sw = { to = '明教长廊#NE', },
  },
},

['明教监狱'] = {
  id = '明教监狱',
  area = '明教',
  name = '监狱',
  desc =  [[这里是明教的地下监狱。四面都是石壁，只有一扇铁门，只有外面的人打开铁门才能出去。想要自已逃出去是不可能的地上十分潮湿，看来在这时间一久必得重病。石壁上用刀子刻着一些忏悔的话语....“不应斗胆偷上光明顶来，以至受些活罪”等言语。]],
  exit = {
  },
},

['明教风字门'] = {
  id = '明教风字门',
  area = '明教',
  name = '风字门',
  desc =  [[这是紫杉林外的风字门，插在正中央巨大的土坪上的是一面“风”字大旗。几十名风字门释道家出家人正在埋头苦干，四周堆满了各式法器装备，风字门门主正在一旁指导着他们。]],
  exit = {
    ne = { to = '明教紫杉林#1', ignore = true, },
    sw = { to = '明教紫杉林#1', ignore = true, },
    nw = { to = '明教紫杉林#1', ignore = true, },
    se = { to = '明教紫杉林#1', ignore = true, },
    hidden = { to = '明教紫杉林#1', handler = 'look_around', },
  },
},

['明教雷字门'] = {
  id = '明教雷字门',
  area = '明教',
  name = '雷字门',
  desc =  [[这是紫杉林外的雷字门，插在正中央巨大的土坪上的是一面“雷”字大旗。几十名雷字门西域番邦教众正在埋头苦干，四周堆满了各式武器装备，雷字门门主正在一旁指导着他们。]],
  exit = {
    ne = { to = '明教紫杉林#1', ignore = true, },
    sw = { to = '明教紫杉林#1', ignore = true, },
    nw = { to = '明教紫杉林#1', ignore = true, },
    se = { to = '明教紫杉林#1', ignore = true, },
    hidden = { to = '明教紫杉林#1', handler = 'look_around', },
  },
},

['明教林间小路#N'] = {
  id = '明教林间小路#N',
  area = '明教',
  name = '林间小路',
  desc =  [[这里是一大片的森林，一条曲折的小路穿越其间。这里已没有上山的深崖峭壁的危险，地势已较为平坦。但林木高崇云间，又别有一番阴森可怕。两边的林木笔直的生长着，很有规律，是几百年前明教老祖们开辟光明顶时所植。虽是人为所植，但历时年代已久，有很多的飞鸟猛兽出入其间。树梢间积着十分厚的积雪，其景十分壮观。]],
  exit = {
    nu = { to = '明教总坛前厅', },
    sw = { to = '明教林间小路#E', },
    se = { to = '明教林间小路#W', },
  },
},

['明教休息室'] = {
  id = '明教休息室',
  area = '明教',
  name = '休息室',
  desc =  [[这是一间供明教弟子休息的房间，房间傍着竹林，窗外可以看见那悠悠君子的典雅平和，屋里诺大一张床，又干净又舒适，加上加之竹荫下轻柔的光线，你不由起了丝丝倦意。]],
  exit = {
    w = { to = '明教小厅', },
  },
},

['明教厨房'] = {
  id = '明教厨房',
  area = '明教',
  name = '厨房',
  desc =  [[满屋的果香和肉香，你一走进这里，闻得阵阵的香气，就立即产生饱餐一顿的念头。有几个厨子正在忙忙碌着，有几个小僮在旁侍侯着。]],
  exit = {
    e = { to = '明教小厅', },
  },
},

['明教书院'] = {
  id = '明教书院',
  area = '明教',
  name = '书院',
  desc =  [[这里是明教藏书之地，一排排的书架整齐的排列着，书架上放着各种各样的书籍，院内经常有人打扫，书架上一尘不染。许多明教弟子正在此专心的研读，彼此静悄悄的。东面是一条通向聚义堂的走廊。]],
  exit = {
    e = { to = '明教练武场#N', },
  },
},

['明教长廊#NW'] = {
  id = '明教长廊#NW',
  area = '明教',
  name = '长廊',
  desc =  [[这是一条走廊。一边是青砖墙壁，另一边是古木雕成的围栏虽是普通过道，却也隐射出江湖第一大教制端严。南边是练武场，北面通往厚土旗。]],
  exit = {
    s = { to = '明教练武场#W', },
    n = { to = '明教厚土旗', },
  },
},

['明教长廊#NE'] = {
  id = '明教长廊#NE',
  area = '明教',
  name = '长廊',
  desc =  [[这是一条走廊。一边是青砖墙壁，另一边是古木雕成的围栏虽是普通过道，却也隐射出江湖第一大教制端严。南边是练武场，北面通往锐金旗，东南边是教内监狱入口。]],
  exit = {
    ne = { to = '明教监狱入口', },
    s = { to = '明教练武场#E', },
    n = { to = '明教锐金旗', },
  },
},

['明教大沙丘'] = {
  id = '明教大沙丘',
  area = '明教',
  name = '大沙丘',
  desc =  [[这是一个很大的沙丘，沙丘上有几具人的骨头。]],
  exit = {
    w = { to = '明教沙漠绿洲', },
    e = { to = '明教黄土坪', },
  },
},

['明教圣火堂'] = {
  id = '明教圣火堂',
  area = '明教',
  name = '圣火堂',
  desc =  [[这里就是明教圣火堂所在。你一走到这里突然产生一股前所没有的庄严肃穆之意，在堂中央用大草书写着三个血红大字「圣火堂」，中间有一幅大横匾上写着：“焚我残躯，熊熊圣火，生亦何欢，死亦何苦？为善除恶，惟光明故，喜乐悲愁，皆归尘土。怜我世人，忧患实多！怜我世人，忧患实多”。这里点着长年不灭的圣火，经常有武林人士和官家人士来朝拜。中间放着一张大虎头椅，是明教历代教主之位。有几个丫环在旁边侍侯。]],
  exit = {
    nu = { to = '明教光明宝塔', },
    sd = { to = '明教聚议厅', },
  },
},

['明教聚议厅'] = {
  id = '明教聚议厅',
  area = '明教',
  name = '聚议厅',
  desc =  [[这里是教主召集左右使者，四大护法，五散人，五行旗主和众明教弟子商议反元抗胡，行善去恶，除暴安良的对策的地方。西面是龙王殿，东面是狮王殿。后面就是圣火堂。]],
  exit = {
    nu = { to = '明教圣火堂', },
    w = { to = '明教龙王殿', },
    s = { to = '明教小厅', },
    e = { to = '明教狮王殿', },
  },
},

['明教兵器库'] = {
  id = '明教兵器库',
  area = '明教',
  name = '兵器库',
  desc =  [[这里是明教的兵器库。有一个放置着各种兵器的兵器架（jia)摆放在房间的正中。上面摆满了各种兵器和防具，另人眩目。北方出去就是烈火旗了。]],
  exit = {
    n = { to = '明教烈火旗', },
  },
},

['明教锐金旗'] = {
  id = '明教锐金旗',
  area = '明教',
  name = '锐金旗',
  desc =  [[这里是锐金旗所在地，明教的机关武器，都出自锐金旗之手。旗下弟子不但武功卓越，更是一等一的暗器高手，屋内堆满各类兵器防具，正中央一只巨大火炉，奇热难当，几个大汉正自滴汗挥锤。东西各有一条长廊。]],
  exit = {
    e = { to = '明教紫杉林#6', },
    s = { to = '明教长廊#NE', },
    w = { to = '明教狮王殿', },
    se = { to = '明教监狱入口', },
  },
},

['明教洪水旗'] = {
  id = '明教洪水旗',
  area = '明教',
  name = '洪水旗',
  desc =  [[这里是洪水旗。此旗有十分厉害的水阵，旗中弟子个个深通水性。向东就是通往碧水寒潭的山间小路了。]],
  exit = {
    e = { to = '明教紫杉林#8', },
    w = { to = '明教长廊#E', },
    n = { to = '明教练武场#E', },
  },
},

['明教林间小路#W'] = {
  id = '明教林间小路#W',
  area = '明教',
  name = '林间小路',
  desc =  [[这里是一大片的森林，一条曲折的小路穿越其间。这里已没有上山的深崖峭壁的危险，地势已较为平坦。但林木高耸云间，又别有一番阴森可怕。两边的林木笔直的生长着，很有规律，是几百年前明教老祖们开辟光明顶时所植。虽是人为所植，但历时年代已久，有很多的飞鸟猛兽出入其间。树梢间积着十分厚的积雪，其景十分壮观。]],
  exit = {
    nw = { to = '明教林间小路#N', },
    se = { to = '明教林间小路#S', },
  },
},

['明教栈道#N'] = {
  id = '明教栈道#N',
  area = '明教',
  name = '栈道',
  desc =  [[这里是一条傍着峭壁的小路，一边是深不见底的悬崖，峭壁笔直，几不见天，更没有可以着手之处，偶尔会有一两处地方岩石突起，挡住你的去路，必须低头才能通过。一边是深不见底的深崖，云雾深锁其间，飞鸟难渡，只是偶尔传来几声鸟儿发出的凄厉的叫声，看起来你必须小心翼翼的走过去。]],
  exit = {
    eu = { to = '明教山路#5', },
    sw = { to = '明教栈道#E', },
    se = { to = '明教栈道#W', },
  },
},

['明教厅堂'] = {
  id = '明教厅堂',
  area = '明教',
  name = '厅堂',
  desc =  [[这是一个很大厅堂，是明教接待外来宾客之地。厅堂的周围放着几张古木所造的家具，正前方放着一张大师椅，是教主接待宾客的座位，四周站着几个小丫环，专为客人送茶水。]],
  exit = {
    e = { to = '明教厢房', },
    s = { to = '明教总坛前厅', },
    w = { to = '明教茶室', },
    n = { to = '明教巨木旗', },
  },
},

['明教栈道#E'] = {
  id = '明教栈道#E',
  area = '明教',
  name = '栈道',
  desc =  [[这里是一条傍着峭壁的小路，一边是深不见底的悬崖，峭壁笔直，几不见天，更没有可以着手之处，偶尔会有一两处地方岩石突起，挡住你的去路，必须低头才能通过。一边是深不见底的深崖，云雾深锁其间，飞鸟难渡，只是偶尔传来几声鸟儿发出的凄厉的叫声，看起来你必须小必翼翼的走过去。]],
  exit = {
    ne = { to = '明教栈道#N', },
    sw = { to = '明教栈道#S', },
  },
},

['明教小沙丘#2'] = {
  id = '明教小沙丘#2',
  area = '明教',
  name = '小沙丘',
  desc =  [[这是一个堆满黄沙的小沙丘。你一踏上来就迷失了方向。看来要走出这块沙漠并非易事。]],
  exit = {
    e = { to = '明教小沙丘#1', },
    s = { to = '明教小沙丘#2', },
    w = { to = '明教小沙丘#3', },
    n = { to = '明教小沙丘#2', },
  },
},

['明教练武场#W'] = {
  id = '明教练武场#W',
  area = '明教',
  name = '练武场',
  desc =  [[这里是明教的练武场。地面是坚硬结实的黄土，已有百多年的践踢使得地面光滑平整。练武场中间竖立着不少用来练暗器的木靶。很多明教教众正在练习武艺。东面是一条走廊。]],
  exit = {
    e = { to = '明教长廊#SW', },
    s = { to = '明教烈火旗', },
    n = { to = '明教长廊#NW', },
  },
},

['明教练武场#E'] = {
  id = '明教练武场#E',
  area = '明教',
  name = '练武场',
  desc =  [[这里是明教的练武场。地面是坚硬结实的黄土，已有百多年的践踢使得地面光滑平整。练武场中间竖立着不少用来练暗器的木靶。很多明教教众正在练习武艺。西面是一条走廊。]],
  exit = {
    s = { to = '明教洪水旗', },
    w = { to = '明教长廊#SE', },
    n = { to = '明教长廊#NE', },
  },
},

['明教沙漠绿洲'] = {
  id = '明教沙漠绿洲',
  area = '明教',
  name = '沙漠绿洲',
  desc =  [[这是一片周围长着青草的平地。这里有一口用石头堆起来的石井，井边有一个为人喝水用的石碗，这里是专门供来住的人们休息之地。]],
  exit = {
    e = { to = '明教大沙丘', },
    w = { to = '明教勒马斋', },
    n = { to = '明教山脚下', },
  },
},

['明教小沙丘#1'] = {
  id = '明教小沙丘#1',
  area = '明教',
  name = '小沙丘',
  desc =  [[这是一个堆满黄沙的小沙丘。你一踏上来就迷失了方向。看来要走出这块沙漠并非易事。]],
  exit = {
    e = { to = '星宿海大沙漠#MJ', },
    s = { to = '明教小沙丘#1', },
    w = { to = '明教小沙丘#2', },
    n = { to = '明教小沙丘#1', },
  },
},

['明教小沙丘#3'] = {
  id = '明教小沙丘#3',
  area = '明教',
  name = '小沙丘',
  desc =  [[这是一个堆满黄沙的小沙丘。你一踏上来就迷失了方向。看来要走出这块沙漠并非易事。]],
  exit = {
    e = { to = '明教小沙丘#2', },
    s = { to = '明教小沙丘#3', },
    w = { to = '明教小沙丘#4', },
    n = { to = '明教小沙丘#3', },
  },
},

['明教勒马斋'] = {
  id = '明教勒马斋',
  area = '明教',
  name = '勒马斋',
  desc =  [[绿洲边上的一家钱庄，室内收拾的很干净，仿佛都能感觉到外面绿洲新鲜的气息，钱庄的主人似乎来自中原，很有品位的将这里的每个角落都布置的井井有条。附近的人们都到这里来找他兑换钱庄通行全国的银票。有的还喜欢停下来，和老板聊聊天。]],
  exit = {
    e = { to = '明教沙漠绿洲', },
  },
},

['明教山脚下'] = {
  id = '明教山脚下',
  area = '明教',
  name = '山脚下',
  desc =  [[这里是昆仑山脚下，你从远处就可以看到绵绵无尽的昆仑山脉，厚雾绕山，不能见顶，山中终年积雪，所见之处白茫茫的一大片，别说人难至那，就连那飞鸟也恐怕难以飞越。光明顶的七巅十三崖，就座落在其中，但光凭肉眼所视，哪能分辨出那里是圣火所在？东边好象有一条小路是通向上山之路。西边是通往昆仑的山路。]],
  exit = {
    eu = { to = '明教山路#1', },
    s = { to = '明教沙漠绿洲', },
    wu = { to = '昆仑山镇远桥', },
  },
},

['明教山路#1'] = {
  id = '明教山路#1',
  area = '明教',
  name = '山路',
  desc =  [[这是一条一窄又陡的山路，山路两旁长着又高又杂的乱草杂树，几没人头，偶尔会有几枝荆棘挡住你的去路，一不小心则会被其刺伤。]],
  exit = {
    wd = { to = '明教山脚下', },
    su = { to = '明教山路#2', },
  },
},

['明教山路#2'] = {
  id = '明教山路#2',
  area = '明教',
  name = '山路',
  desc =  [[这是一条一窄又陡的山路，山路两旁长着又高又杂的乱草杂树，几没人头，偶尔会有几枝荆棘挡住你的去路，一不小心则会被其刺伤。]],
  exit = {
    wu = { to = '明教山路#3', },
    nd = { to = '明教山路#1', },
  },
},

['明教山路#4'] = {
  id = '明教山路#4',
  area = '明教',
  name = '山路',
  desc =  [[这是一条一窄又陡的山路，山路两旁长着又高又杂的乱草杂树，几没人头，偶尔会有几枝荆棘挡住你的去路，一不小心则会被其刺伤。]],
  exit = {
    sd = { to = '明教山路#3', },
    n = { to = '明教栈道#S', },
  },
},

['明教栈道#S'] = {
  id = '明教栈道#S',
  area = '明教',
  name = '栈道',
  desc =  [[这里是一条傍着峭壁的小路，一边是深不见底的悬崖，峭壁笔直，几不见天，更没有可以着手之处，偶尔会有一两处地方岩石突起，挡住你的去路，必须低头才能通过。一边是深不见底的深崖，云雾深锁其间，飞鸟难渡，只是偶尔传来几声鸟儿发出的凄厉的叫声，看起来你必须小心翼翼的走过去。]],
  exit = {
    ne = { to = '明教栈道#E', },
    nw = { to = '明教栈道#W', },
    s = { to = '明教山路#4', },
  },
},

['明教山亭'] = {
  id = '明教山亭',
  area = '明教',
  name = '山亭',
  desc =  [[这里是山上唯一的一个小亭，是上山的人们休息的好地方。这里人来人往小贩子在不停的忙碌着，因为人们都慕明都之名，更慕张教主之名，明教又在大举的招收教众，所以有各派的武林人士、达官贵人、还有一些满脑子的生意经的生意人，都想到光明顶走走，希望能见到张教主一面。但通往光明顶之路确实不好走，许多人到此只能望而却步，都在这里在休息，准备下山。你走到这里已不觉有阵阵的寒意了。]],
  exit = {
    wu = { to = '明教山路#6', },
    nd = { to = '明教山路#5', },
  },
},

['明教半山腰'] = {
  id = '明教半山腰',
  area = '明教',
  name = '半山腰',
  desc =  [[你已经来到这座山峰的半腰，由于此峰海拔极高，所以至此已遍地都是冰雪了，阳光照在冰雪上面，反射过来，极为光亮刺目。山腰前面不远之处是悬崖，阴森而深不见底。此处虽是终年积雪，但是有一处却好象经常有人用手拔开，而隐隐露出一个小洞(dong)，恰能容入一身。向东方向是一条小路，直伸入一片大森林之间。]],
  exit = {
    eu = { to = '明教林间小路#S', },
    nd = { to = '明教山路#6', },
    hidden = { to = '明教秘道#19', cmd = 'zuan dong', cond = 'player.party == "明教"', },
  },
},

['明教总坛前厅'] = {
  id = '明教总坛前厅',
  area = '明教',
  name = '总坛前厅',
  desc =  [[这里是明教总坛的前厅，虽谓之为前厅，但极似大殿。厅前有两条大石狮，大石狮之间是十余级的斜斜而上的石阶，石阶被一大岩石做成的石碑中间隔开，石碑平行于石阶镶于地上。石碑上雕着一飞腾而上的火焰，极是雄伟壮观，石碑中有一些用小楷雕刻而成的文字，记载着明教上千年的历史，还有历代明教教主的名字。整个大厅由几条巨木支撑而起，巨上雕刻着巨龙含着火焰飞腾之像。由此而上就是光明顶了。]],
  exit = {
    sd = { to = '明教林间小路#N', },
    n = { to = '明教厅堂', },
  },
},

['明教茶室'] = {
  id = '明教茶室',
  area = '明教',
  name = '茶室',
  desc =  [[这里是一间茶室，是专门招待宾客时沏茶的地方。]],
  exit = {
    e = { to = '明教厅堂', },
  },
},

['明教巨木旗'] = {
  id = '明教巨木旗',
  area = '明教',
  name = '巨木旗',
  desc =  [[这里是巨木旗的所在地。这里放着各种各样的砍伐工具和一根根的大树木，在南面有几条竖起的木大木桩，上面有许多被掌击过的痕迹，为旗中弟子平时练功之用。旗中不但有许多力大如牛的武林高手，更有许多能工巧匠。光明顶的宏大的建筑就是出自本旗之手。因为光明顶处在高出，所以这里是光明顶的第一道防线，当真有一夫当关万夫莫开之势。两面是一片阴森的大树林。]],
  exit = {
    nu = { to = '明教光明顶', },
    w = { to = '明教树林#W', },
    s = { to = '明教厅堂', },
    e = { to = '明教树林#E', },
  },
},

['明教树林#W'] = {
  id = '明教树林#W',
  area = '明教',
  name = '树林',
  desc =  [[这是一片乱树林。几十丈高的树木簇在一块，密实的枝叶象一蓬蓬巨伞般伸向天空，把阳光遮得丝毫也无。你一走进这这觉得阴阴森林的，你的感觉告诉你，要赶快离开，东面是明教的巨木旗。]],
  exit = {
    e = { to = '明教巨木旗', },
    s = { to = '明教树林#M1', },
    w = { to = '明教树林#M1', },
    n = { to = '明教树林#M1', },
  },
},

['明教树林#E'] = {
  id = '明教树林#E',
  area = '明教',
  name = '树林',
  desc =  [[这是一片乱树林。几十丈高的树木簇在一块，密实的枝叶象一蓬蓬巨伞般伸向天空，把阳光遮得丝毫也无。你一走进这这觉得阴阴森林的，你的感觉告诉你，得赶快离开。]],
  exit = {
    e = { to = '明教树林#M2', },
    s = { to = '明教树林深处#1', },
    w = { to = '明教巨木旗', },
    n = { to = '明教树林#M2', },
  },
},

['明教树林#M1'] = {
  id = '明教树林#M1',
  area = '明教',
  name = '树林',
  desc =  [[这是一片乱树林。几十丈高的树木簇在一块，密实的枝叶象一蓬蓬巨伞般伸向天空，把阳光遮得丝毫也无。你一走进这这觉得阴阴森林的，你的感觉告诉你，得赶快离开。]],
  exit = {
    s = { to = '明教树林#M1', },
    s2 = { to = '明教树林深处#4', ignore = true, },
    e = { to = '明教树林#M1', },
    e2 = { to = '明教树林深处#4', ignore = true, },
    w = { to = '明教树林#M1', },
    w2 = { to = '明教树林深处#4', ignore = true, },
    n = { to = '明教树林#M1', },
    n2 = { to = '明教树林深处#4', ignore = true, },
    hidden = { to = '明教树林深处#4', handler = 'look_self_dir', },
  },
},

['明教树林#M2'] = {
  id = '明教树林#M2',
  area = '明教',
  name = '树林',
  desc =  [[这是一片乱树林。几十丈高的树木簇在一块，密实的枝叶象一蓬蓬巨伞般伸向天空，把阳光遮得丝毫也无。你一走进这这觉得阴阴森林的，你的感觉告诉你，得赶快离开。]],
  exit = {
    w = { to = '明教树林#M2', },
    w2 = { to = '明教树林深处#5', ignore = true, },
    e = { to = '明教树林#M2', },
    e2 = { to = '明教树林深处#5', ignore = true, },
    s = { to = '明教树林#M2', },
    s2 = { to = '明教树林深处#5', ignore = true, },
    n = { to = '明教树林#M2', },
    n2 = { to = '明教树林深处#5', ignore = true, },
    hidden = { to = '明教树林深处#5', handler = 'look_self_dir', },
  },
},

['明教树林深处#1'] = {
  id = '明教树林深处#1',
  area = '明教',
  name = '树林深处',
  desc =  [[这是乱树林深处。几十丈高的树木簇在一块，密实的枝叶象一蓬蓬巨伞般伸向天空，把阳光遮得丝毫也无。你一走进这这觉得阴阴森林的，你的感觉告诉你，得赶快离开，不能再深入了。]],
  exit = {
    s = { to = '明教树林深处#2', },
    n = { to = '明教树林深处#3', },
  },
},

['明教树林深处#2'] = {
  id = '明教树林深处#2',
  area = '明教',
  name = '树林深处',
  desc =  [[这是乱树林深处。几十丈高的树木簇在一块，密实的枝叶象一蓬蓬巨伞般伸向天空，把阳光遮得丝毫也无。你一走进这这觉得阴阴森林的，你的感觉告诉你，得赶快离开，不能再深入了。]],
  exit = {
    ne = { to = '明教树林深处#3', },
    se = { to = '明教树林深处#5', },
    w = { to = '明教树林深处#4', },
    n = { to = '明教树林深处#1', },
  },
},

['明教树林深处#3'] = {
  id = '明教树林深处#3',
  area = '明教',
  name = '树林深处',
  desc =  [[这是乱树林深处。几十丈高的树木簇在一块，密实的枝叶象一蓬蓬巨伞般伸向天空，把阳光遮得丝毫也无。你一走进这这觉得阴阴森林的，你的感觉告诉你，得赶快离开，不能再深入了。]],
  exit = {
    e = { to = '明教树林深处#5', },
    sw = { to = '明教树林深处#2', },
    nw = { to = '明教树林深处#4', },
    s = { to = '明教树林深处#1', },
  },
},

['明教树林深处#4'] = {
  id = '明教树林深处#4',
  area = '明教',
  name = '树林深处',
  desc =  [[这是乱树林深处。几十丈高的树木簇在一块，密实的枝叶象一蓬蓬巨伞般伸向天空，把阳光遮得丝毫也无。你一走进这这觉得阴阴森林的，你的感觉告诉你，得赶快离开，不能再深入了。]],
  exit = {
    nw = { to = '明教树林深处#2', },
    n = { to = '明教树林#E', },
  },
},

['明教树林深处#5'] = {
  id = '明教树林深处#5',
  area = '明教',
  name = '树林深处',
  desc =  [[这是乱树林深处。几十丈高的树木簇在一块，密实的枝叶象一蓬蓬巨伞般伸向天空，把阳光遮得丝毫也无。你一走进这这觉得阴阴森林的，你的感觉告诉你，得赶快离开，不能再深入了。]],
  exit = {
    nw = { to = '明教树林#M2', },
    w = { to = '明教树林深处#3', },
  },
},

['明教长廊#E'] = {
  id = '明教长廊#E',
  area = '明教',
  name = '长廊',
  desc =  [[这是一条走廊。一边是青砖墙壁，另一边是古木雕成的围栏虽是普通过道，却也隐射出江湖第一大教制端严。东边是洪水旗，西边是练武场。]],
  exit = {
    w = { to = '明教练武场#S', },
    e = { to = '明教洪水旗', },
  },
},

['明教广场'] = {
  id = '明教广场',
  area = '明教',
  name = '广场',
  desc =  [[这是一个十分大的广场，它足于容下上千人，这里是当年张教主力拼六大门派的地方，使得明教和六大门派之间的仇恨得以排除。这里平时可看到很多的明教弟子在这练功。东西是通往练武场的走廊。]],
  exit = {
    e = { to = '明教长廊#SE', },
    s = { to = '明教练武场#S', },
    w = { to = '明教长廊#SW', },
    n = { to = '明教练武场#N', },
  },
},

['明教长廊#SE'] = {
  id = '明教长廊#SE',
  area = '明教',
  name = '长廊',
  desc =  [[这是一条走廊。一边是青砖墙壁，另一边是古木雕成的围栏虽是普通过道，却也隐射出江湖第一大教制端严。东面是练武场，西边是广场。]],
  exit = {
    w = { to = '明教广场', },
    e = { to = '明教练武场#E', },
  },
},

['明教练武场#N'] = {
  id = '明教练武场#N',
  area = '明教',
  name = '练武场',
  desc =  [[这里是明教的练武场。地面是坚硬结实的黄土，已有百多年的践踢使得地面光滑平整。练武场中间竖立着不少用来练暗器的木靶。很多明教教众正在练习武艺。东面是明教的药房，而西边就是书院了。]],
  exit = {
    e = { to = '明教药房', },
    s = { to = '明教广场', },
    w = { to = '明教书院', },
    n = { to = '明教小厅', },
  },
},

['明教龙王殿'] = {
  id = '明教龙王殿',
  area = '明教',
  name = '龙王殿',
  desc =  [[这里是专为“紫衫龙王”黛绮丝建造的行殿，也是张无忌教主为召集明教首领宣示行善去恶、除暴安良的教旨之处。这里摆有一张香案，长年都有香束燃着，幽香熏得你头脑晕晕的。]],
  exit = {
    e = { to = '明教聚议厅', },
    w = { to = '明教厚土旗', },
    nw = { to = '明教小院子', cond = 'player.flag["乾坤大挪移"]', },
  },
},

['明教小院子'] = {
  id = '明教小院子',
  area = '明教',
  name = '小院子',
  desc =  [[这是一所小院子。你一进来这里这闻到一股强烈的花香，只见院子培植长着许多名贵的花草。西面则是一座厢房。]],
  exit = {
    se = { to = '明教龙王殿', },
    w = { to = '明教西厢房', },
  },
},

['明教西厢房'] = {
  id = '明教西厢房',
  area = '明教',
  name = '西厢房',
  desc =  [[这里似一间大户人家小姐的闺房。靠窗边的是一张梳张台，台上点着两只高高的红蜡烛，照得房中花团锦簇，堂皇富丽，靠墙摆放着一张牙床，床头上罗帐(zhang)低垂，西边墙上是一块挂毯。]],
  exit = {
    e = { to = '明教小院子', },
    hidden = { to = '明教秘道入口', cmd = 'xian zhang;tang', },
  },
},

['明教厚土旗'] = {
  id = '明教厚土旗',
  area = '明教',
  name = '厚土旗',
  desc =  [[这里是厚土旗。这里有各种各样的窟土工具，旗中弟子一个个短小而精悍，练就一身窟土功夫，他们在教中累立奇功。四周是明教其它四行旗，五旗互成倚角之势。]],
  exit = {
    e = { to = '明教龙王殿', },
    w = { to = '明教紫杉林#5', },
    s = { to = '明教长廊#NW', },
  },
},

['明教天字门'] = {
  id = '明教天字门',
  area = '明教',
  name = '天字门',
  desc =  [[这是紫杉林外的天字门，插在正中央巨大的土坪上的是一面“天”字大旗。几十名天字门中原男子教众正在埋头苦干，四周堆满了各式武器装备，天字门门主正在一旁指导着他们。]],
  exit = {
    ne = { to = '明教紫杉林#1', ignore = true, },
    sw = { to = '明教紫杉林#1', ignore = true, },
    nw = { to = '明教紫杉林#1', ignore = true, },
    se = { to = '明教紫杉林#1', ignore = true, },
    hidden = { to = '明教紫杉林#1', handler = 'look_around', },
  },
},

['明教练武场#S'] = {
  id = '明教练武场#S',
  area = '明教',
  name = '练武场',
  desc =  [[这里是明教的练武场。地面是坚硬结实的黄土，已有百多年的践踢使得地面光滑平整。练武场中间竖立着不少用来练暗器的木靶。很多明教教众正在练习武艺。东西面是一条长长的长廊，北边是广场，南边是光明顶。]],
  exit = {
    e = { to = '明教长廊#E', },
    sd = { to = '明教光明顶', },
    w = { to = '明教长廊#W', },
    n = { to = '明教广场', },
  },
},

['明教山路#5'] = {
  id = '明教山路#5',
  area = '明教',
  name = '山路',
  desc =  [[这是一条一窄又陡的山路，山路两旁长着又高又杂的乱草杂树，几没人头，偶尔会有几枝荆棘挡住你的去路，一不小心则会被其刺伤。]],
  exit = {
    wd = { to = '明教栈道#N', },
    su = { to = '明教山亭', },
  },
},

['明教长廊#SW'] = {
  id = '明教长廊#SW',
  area = '明教',
  name = '长廊',
  desc =  [[这是一条走廊。一边是青砖墙壁，另一边是古木雕成的围栏虽是普通过道，却也隐射出江湖第一大教制端严。东面是广场，西面是练武场。]],
  exit = {
    w = { to = '明教练武场#W', },
    e = { to = '明教广场', },
  },
},

['明教黄土坪'] = {
  id = '明教黄土坪',
  area = '明教',
  name = '黄土坪',
  desc =  [[这是一片较大的黄土坪。周围只有几株已干枯的古树和黄沙。可以看出这里以前曾是绿洲，东边是一个个小沙丘。]],
  exit = {
    e = { to = '明教小沙丘#4', ignore = true, },
    s = { to = '明教小沙丘#4', ignore = true, },
    w = { to = '明教大沙丘', },
    se = { to = '明教小沙丘#4', },
  },
},

['明教长廊#W'] = {
  id = '明教长廊#W',
  area = '明教',
  name = '长廊',
  desc =  [[这是一条走廊。一边是青砖墙壁，另一边是古木雕成的围栏虽是普通过道，却也隐射出江湖第一大教制端严。西边是烈火旗，东边是练武场。]],
  exit = {
    w = { to = '明教烈火旗', },
    e = { to = '明教练武场#S', },
  },
},

['明教光明顶'] = {
  id = '明教光明顶',
  area = '明教',
  name = '光明顶',
  desc =  [[    这里就是明教光明顶。你走到这里就可看见三个鲜红色大字。明教，少林，丐帮中明教是最大的教，少林是最大的门派，而丐帮则是最大帮派。明教自由波斯总教传至中原已有百多年的历史了。明教始终都以反元抗胡，行善去恶及除暴安良为自已的宗旨。但由于明教太大，门下教众难免莨莠不齐，至使被名门正派称为魔教。正中央一面红色火焰的大旗。北边是练武场，南边是巨木旗的所在地。			光    明    顶]],
  exit = {
    nu = { to = '明教练武场#S', },
    sd = { to = '明教巨木旗', },
  },
},

['明教烈火旗'] = {
  id = '明教烈火旗',
  area = '明教',
  name = '烈火旗',
  desc =  [[你一到这里就闻到一股股强烈的硫簧气味。这里就是烈火旗。这里放置着各种各样的喷火枪，十多个旗下弟子正在小心翼翼制造硫簧弹，他们个个不但是暗器名家，而且是火器名家。由此可以看出明教是多么的强大。北边是练武场，东面是一条走廊，往南走就是兵器库了。]],
  exit = {
    e = { to = '明教长廊#W', },
    s = { to = '明教兵器库', },
    w = { to = '明教紫杉林#7', },
    n = { to = '明教练武场#W', },
  },
},

['明教地字门'] = {
  id = '明教地字门',
  area = '明教',
  name = '地字门',
  desc =  [[这是紫杉林外的地字门，插在正中央巨大的土坪上的是一面“地”字大旗。几十名地字门中原女子教众正在埋头苦干，四周堆满了各式衣物装备，地字门门主正在一旁指导着她们。]],
  exit = {
    ne = { to = '明教紫杉林#1', ignore = true, },
    sw = { to = '明教紫杉林#1', ignore = true, },
    nw = { to = '明教紫杉林#1', ignore = true, },
    se = { to = '明教紫杉林#1', ignore = true, },
    hidden = { to = '明教紫杉林#1', handler = 'look_around', },
  },
},

['明教林间小路#S'] = {
  id = '明教林间小路#S',
  area = '明教',
  name = '林间小路',
  desc =  [[这里是一大片的森林，一条曲折的小路穿越其间。这里已没有上山的深崖峭壁的危险，地势已较为平坦。但林木高耸云间，又别有一番阴森可怕。两边的林木笔直的生长着，很有规律，是几百年前明教老祖们开辟光明顶时所植。虽是人为所植，但历时年代已久，有很多的飞鸟猛兽出入其间。树梢间积着十分厚的积雪，其景十分壮观。]],
  exit = {
    ne = { to = '明教林间小路#E', },
    nw = { to = '明教林间小路#W', },
    wd = { to = '明教半山腰', },
  },
},

['明教秘道#19'] = {
  id = '明教秘道#19',
  area = '明教',
  name = '秘道',
  desc = [[这里是秘道的出口，直通半山腰。]],
  exit = {
    ed = { to = '明教秘道#18', },
    out = { to = '明教半山腰', },
  },
},

['明教秘道#18'] = {
  id = '明教秘道#18',
  area = '明教',
  name = '秘道',
  desc = [[这是一条弯曲而上的秘道。]],
  exit = {
    wu = { to = '明教秘道#19', },
    nd = { to = '明教秘道#17', },
  },
},

['明教秘道#17'] = {
  id = '明教秘道#17',
  area = '明教',
  name = '秘道',
  desc = [[这是一条弯曲而上的秘道。]],
  exit = {
    ed = { to = '明教秘道#4', ignore = true, },
    nd = { to = '明教秘道#16', },
    su = { to = '明教秘道#18', },
  },
},

['明教秘道#16'] = {
  id = '明教秘道#16',
  area = '明教',
  name = '秘道',
  desc = [[这是一条弯曲而上的秘道。]],
  exit = {
    wd = { to = '明教秘道#15', },
    su = { to = '明教秘道#17', },
  },
},

['明教秘道#15'] = {
  id = '明教秘道#15',
  area = '明教',
  name = '秘道',
  desc = [[这是一条弯曲而上的秘道。]],
  exit = {
    nu = { to = '明教秘道#20', },
    eu = { to = '明教秘道#16', },
    n = { to = '明教秘室#2', },
  },
},

['明教秘室#2'] = {
  id = '明教秘室#2',
  area = '明教',
  name = '秘室',
  desc = [[这里是明教秘道里的一间小小的秘室。]],
  exit = {
    s = { to = '明教秘道#15', },
  },
},

['明教秘道#20'] = {
  id = '明教秘道#20',
  area = '明教',
  name = '秘道',
  desc = [[这里是秘道的出口，直通半山腰。]],
  exit = {
    e = { to = '明教秘道#21', },
    sd = { to = '明教秘道#15', },
  },
},

['明教秘道#21'] = {
  id = '明教秘道#21',
  area = '明教',
  name = '秘道',
  desc = [[这里是秘道的出口，直通明教厚土旗。]],
  exit = {
    w = { to = '明教秘道#20', },
    out = { to = '明教厚土旗', },
  },
},

['明教秘室#1'] = {
  id = '明教秘室#1',
  area = '明教',
  name = '秘室',
  desc = [[这是一个较大的秘室。是明教历代教主练功的地方，秘室内用器样样具全，东边有一张大石床，床上躺着一具已干枯的的男性骸骨(haigu），只有毛发和衣服尚没腐烂，床延伏着一具较为瘦小的骸骨(haigu），衣着为女性衣服，骸骨上插着一把短剑，想是当年自尽而忙。秘室四周皆为石壁(wall)，没有任何的出路通何外面。]],
  exit = {
    e = { to = '明教秘道#15', door = 'gua wall;push men;#wb 2500', cond = 'player.skill["乾坤大挪移"] and player.skill["乾坤大挪移"].level >= 50', },
  },
},

['明教藏金室'] = {
  id = '明教藏金室',
  area = '明教',
  name = '藏金室',
  desc = [[这是一条明教秘道下的一个藏兵器的地方，由于少人至此，很多兵器皆已生锈，不能再用。]],
  exit = {
    n = { to = '明教秘道#12', },
  },
},

['明教秘道#12'] = {
  id = '明教秘道#12',
  area = '明教',
  name = '秘道',
  desc = [[这里是秘道的尽头。四周皆是石壁。石壁上有几处碎石脱落，露出的地方好象是几块石砖(zhuan)。南边是一间藏兵器的地方。]],
  exit = {
    s = { to = '明教藏金室', },
    wu = { to = '明教秘道#11', },
    enter = { to = '明教秘室#1', door = 'pull zhuan down;#wb 1500', cond = 'player.exp >= 350000 and player.skill["基本内功"] and player.skill["基本内功"].level >= 140', },
  },
},

['明教秘道#11'] = {
  id = '明教秘道#11',
  area = '明教',
  name = '秘道',
  desc = [[你走入了一条忽高忽低，崎岖不平，螺旋而下的秘道。秘道越来越窄，到了这里只能容下一个人了，便似一口深井。]],
  exit = {
    ed = { to = '明教秘道#12', },
    wu = { to = '明教秘道#10', },
  },
},

['明教秘道#10'] = {
  id = '明教秘道#10',
  area = '明教',
  name = '秘道',
  desc = [[你走入了一条忽高忽低，崎岖不平，螺旋而下的秘道。秘道越来越窄，到了这里只能容下一个人了，便似一口深井。]],
  exit = {
    ed = { to = '明教秘道#11', },
    wu = { to = '明教秘道#9', },
  },
},

['明教秘道#9'] = {
  id = '明教秘道#9',
  area = '明教',
  name = '秘道',
  desc = [[你走入了一条忽高忽低，崎岖不平，螺旋而下的秘道。]],
  exit = {
    ed = { to = '明教秘道#10', },
    wu = { to = '明教秘道#8', },
  },
},

['明教秘道#8'] = {
  id = '明教秘道#8',
  area = '明教',
  name = '秘道',
  desc = [[你走入了一条忽高忽低，崎岖不平，螺旋而下的秘道。]],
  exit = {
    ed = { to = '明教秘道#9', },
    out = { to = '明教秘道#7', },
  },
},

['明教秘道出口'] = {
  id = '明教秘道出口',
  area = '明教',
  name = '秘道出口',
  desc = [[这里是明教秘道出口。]],
  exit = {
    u = { to = '明教秘道#7', },
  },
},

['明教秘道#M'] = {
  id = '明教秘道#M',
  area = '明教',
  name = '秘道',
  desc = [[这里是明教秘道，你似乎迷失了方向，象没头苍蝇般到处乱闯。]],
  exit = {
    w = { to = '明教秘道#M', },
    e = { to = '明教秘道#M', },
    s = { to = '明教秘道#M', },
    n = { to = '明教秘道#M', },
    n2 = { to = '明教秘道出口', ignore = true, },
    hidden = { to = '明教秘道出口', cost = 5, handler = 'simple_path', },
  },
},

['明教秘道#7'] = {
  id = '明教秘道#7',
  area = '明教',
  name = '秘道',
  desc = [[你走到这里，前面出现了七个岔路口]],
  exit = {
    wu = { to = '明教秘道#6', },
    ['壹'] = { to = '明教秘道#M', handler = 'simple_path_set_pos', no_wander = true, },
    ['贰'] = { to = '明教秘道#M', ignore = true, },
    ['叁'] = { to = '明教秘道#M', ignore = true, },
    ['肆'] = { to = '明教秘道#M', ignore = true, },
    ['伍'] = { to = '明教秘道#8', },
    ['陆'] = { to = '明教秘道#M', ignore = true, },
    ['柒'] = { to = '明教秘道#M', ignore = true, },
  },
},

['明教秘道#6'] = {
  id = '明教秘道#6',
  area = '明教',
  name = '秘道',
  desc = [[这是一条弯曲而下的秘道。]],
  exit = {
    su = { to = '明教秘道#5', },
    ed = { to = '明教秘道#7', },
  },
},

['明教秘道#5'] = {
  id = '明教秘道#5',
  area = '明教',
  name = '秘道',
  desc = [[这是已经是秘道的另一边，窄窄的，只能容人一身，向上看如一口井，四周都是石壁(wall)，向北不知道可通向哪里。]],
  exit = {
    nd = { to = '明教秘道#6', },
    out = { to = '明教秘道#4', door = 'push wall left', cond = 'player.skill["基本内功"] and player.skill["基本内功"].level >= 120', },
  },
},

['明教秘道#4'] = {
  id = '明教秘道#4',
  area = '明教',
  name = '秘道',
  desc = [[这是已经是秘道的尽头，窄窄的，只能容人一身，向上看如一口井，四周都是石壁(wall)，向西则是向上的秘道，连接出口。]],
  exit = {
    s = { to = '明教秘道#3', },
    wu = { to = '明教秘道#17', },
    enter = { to = '明教秘道#5', door = 'push wall right', cond = 'player.skill["基本内功"] and player.skill["基本内功"].level >= 120', },
  },
},

['明教秘道#3'] = {
  id = '明教秘道#3',
  area = '明教',
  name = '秘道',
  desc = [[这是一条弯曲而下的秘道。]],
  exit = {
    w = { to = '明教秘道#2', },
    n = { to = '明教秘道#4', },
  },
},

['明教秘道#2'] = {
  id = '明教秘道#2',
  area = '明教',
  name = '秘道',
  desc = [[这是一条弯曲而下的秘道。]],
  exit = {
    e = { to = '明教秘道#3', },
    s = { to = '明教秘道入口', },
  },
},

['明教秘道入口'] = {
  id = '明教秘道入口',
  area = '明教',
  name = '秘道入口',
  desc = [[这是一条弯曲而下的秘道入口。地上铺满了极厚的软草。甬道里曲曲折折，伸手四下摸索，两边是凹凹凸凸的石壁。]],
  exit = {
    n = { to = '明教秘道#2', },
    out = { to = '明教西厢房', },
  },
},

['苗疆明月厅'] = {
  id = '苗疆明月厅',
  area = '苗疆',
  name = '明月厅',
  desc =  [[这里是五毒教商讨教中事物的地方，屋内宽敞明亮。屋内的陈设却是中原风格，两边摆放着许多红木椅子，正中有一张由檀香木精雕细啄的书桌，后面放着一张檀木坐椅。甚为华丽。西北角有一扇小门。]],
  exit = {
    nw = { to = '苗疆蛇房', },
    s = { to = '苗疆前厅', },
  },
},

['苗疆小路#1'] = {
  id = '苗疆小路#1',
  area = '苗疆',
  name = '小路',
  desc =  [[这是一条洁净的小路，不时有一些苗人肩担货物路过。路旁边是一个清澈见底的湖泊，这里的山清水秀常使来自中原的客商留恋忘返。]],
  exit = {
    e = { to = '苗疆小路#2', },
    nw = { to = '苗疆小路#3', },
    n = { to = '苗疆明月屏', },
  },
},

['苗疆山道#1'] = {
  id = '苗疆山道#1',
  area = '苗疆',
  name = '山道',
  desc =  [[这里已进入苗疆的地域，来往的行人大多为苗人。气候虽然炎热，但空气仍然很湿润。]],
  exit = {
    e = { to = '苗疆山道#2', },
    n = { to = '苗疆山路#1', },
  },
},

['苗疆后山'] = {
  id = '苗疆后山',
  area = '苗疆',
  name = '后山',
  desc =  [[古树参天，荆棘密布，一不小心就会被挂到了手脚。浓密宽厚的树叶遮蔽了日月星辰，地上零星散落着捕蛇人踩过的脚印，四周死一般的寂静，只有风吹过树梢的沙沙之声。遍地爬满了各种毒虫，你不禁产生了退缩之心。]],
  exit = {
    se = { to = '苗疆山路#2', },
  },
},

['苗疆苗屋'] = {
  id = '苗疆苗屋',
  area = '苗疆',
  name = '苗屋',
  desc =  [[这是一个简单的苗屋，屋顶由厚厚的树叶搭成。地上放着几个苗人用来乘饭的竹筒，一个老汉正在整理屋角的柴火。]],
  exit = {
    s = { to = '苗疆小镇#4', },
  },
},

['苗疆杂货店'] = {
  id = '苗疆杂货店',
  area = '苗疆',
  name = '杂货店',
  desc =  [[这是一个简陋的杂货店，但是东西却很齐全。老板常亲自去中原采购一些物品回来贩卖。    门前立了个牌子(sign)。]],
  exit = {
    w = { to = '苗疆小镇#1', },
  },
},

['苗疆山道#2'] = {
  id = '苗疆山道#2',
  area = '苗疆',
  name = '山道',
  desc =  [[这里是通向苗疆的山道，苗疆地处热带，你走着走着，一会就满头大汗。]],
  exit = {
    w = { to = '苗疆山道#1', },
    sw = { to = '苗疆明月屏', },
  },
},

['苗疆小路#2'] = {
  id = '苗疆小路#2',
  area = '苗疆',
  name = '小路',
  desc =  [[这里的路略现狭窄，两旁的参天的大树。再往前就是一个苗族的小镇。]],
  exit = {
    w = { to = '苗疆小路#1', },
    s = { to = '苗疆小镇#1', },
  },
},

['苗疆果园'] = {
  id = '苗疆果园',
  area = '苗疆',
  name = '果园',
  desc =  [[这里是苗人的果园，里面种满了水各种果。有几位苗家女子正在树下干活。]],
  exit = {
    w = { to = '苗疆小镇#5', },
  },
},

['苗疆山路#1'] = {
  id = '苗疆山路#1',
  area = '苗疆',
  name = '山路',
  desc =  [[你正在一条崎岖不平的山路上，偶尔听到一阵阵的野兽嚎叫声，头顶有一些不知名的小鸟在跳来跳去，四周丛林密布，鲜花绿草若隐若现，随着山谷里吹来的阵阵清风，传来哗哗的松涛声和一些淡淡的花香，身临其境，古朴、幽静之感油然而生。]],
  exit = {
    ne = { to = '襄阳城泸溪北', },
    s = { to = '苗疆山道#1', },
  },
},

['苗疆卧室'] = {
  id = '苗疆卧室',
  area = '苗疆',
  name = '卧室',
  desc =  [[这里是五毒教教主何铁手的卧室，屋内陈设典雅,芳香扑鼻.窗旁摆放着几盆鲜花，墙上挂着一把宝剑。]],
  exit = {
    n = { to = '苗疆蛇房', },
  },
},

['苗疆小镇#4'] = {
  id = '苗疆小镇#4',
  area = '苗疆',
  name = '小镇',
  desc =  [[这里是小镇的西面，镇外是一座深山。那里是五毒教的禁地，没有五毒教的许可，当地的人没人敢去。据说那里有许多毒虫，因此人们就更不敢越雷池半步。]],
  exit = {
    e = { to = '苗疆小镇#3', },
    w = { to = '苗疆山脚', },
    n = { to = '苗疆苗屋', },
  },
},

['苗疆小路#3'] = {
  id = '苗疆小路#3',
  area = '苗疆',
  name = '小路',
  desc =  [[这里全是一片树林，树木高耸，林间传来百鸟齐鸣。好象这里已经没有路了。]],
  exit = {
    se = { to = '苗疆小路#1', },
  },
},

['苗疆小镇#1'] = {
  id = '苗疆小镇#1',
  area = '苗疆',
  name = '小镇',
  desc =  [[这里是一个不大的苗疆小镇，但是苗人生性彪悍好斗，你最好不要在这里惹是生非。]],
  exit = {
    e = { to = '苗疆杂货店', },
    s = { to = '苗疆小镇#2', },
    n = { to = '苗疆小路#2', },
  },
},

['苗疆大门'] = {
  id = '苗疆大门',
  area = '苗疆',
  name = '大门',
  desc =  [[这里是一座红色的大门,上面高悬一块大匾(bian)。五毒教虽然位处于苗疆，但是其名声早令中原武林谈虎色变。门口的青石台阶上有几名五毒教众把守。]],
  exit = {
    e = { to = '苗疆山坡', },
    sd = { to = '苗疆山路#4', },
    n = { to = '苗疆前厅', },
  },
},

['苗疆山路#6'] = {
  id = '苗疆山路#6',
  area = '苗疆',
  name = '山路',
  desc =  [[这里是一个小山崖，下面是深深的灌木丛。旁边有一棵大树，两名五毒教众正在树下巡视。]],
  exit = {
    sd = { to = '苗疆山路#5', },
  },
},

['苗疆明月屏'] = {
  id = '苗疆明月屏',
  area = '苗疆',
  name = '明月屏',
  desc =  [[这里就是明月屏集市，来来往往的人们大部分身着苗族服饰。一些苗兵在巡视着周围的人群。集市上摆满的各式各样的日用品，有些小贩在向行人兜售苗刀，据说异常锋利。]],
  exit = {
    ne = { to = '苗疆山道#2', },
    s = { to = '苗疆小路#1', },
  },
},

['苗疆练武场'] = {
  id = '苗疆练武场',
  area = '苗疆',
  name = '练武场',
  desc =  [[这里是镇上的练武场，苗族男子成年后都常常到这里比武。苗人崇尚英勇的人，因此常在这里获胜的人，往往能得到镇上女子的爱慕。]],
  exit = {
    nw = { to = '苗疆小镇#5', },
  },
},

['苗疆小镇#2'] = {
  id = '苗疆小镇#2',
  area = '苗疆',
  name = '小镇',
  desc =  [[这里快到镇中心了，路旁有一个小吃摊，一个苗族少女正在那里卖一些苗疆特有的水果和小吃。]],
  exit = {
    e = { to = '苗疆小摊', },
    se = { to = '苗疆药王居', },
    s = { to = '苗疆小镇#3', },
    n = { to = '苗疆小镇#1', },
  },
},

['苗疆山洞'] = {
  id = '苗疆山洞',
  area = '苗疆',
  name = '山洞',
  desc =  [[这个山洞里黑漆漆的，四下里伸手不见五指。仔细看去，隐隐约约可以看到四壁上爬满了树藤（shuteng）。 树藤间仿佛有什么东西发出声音，你不由心生惧意。]],
  exit = {
    out = { to = '苗疆山路#10', },
  },
},

['苗疆小摊'] = {
  id = '苗疆小摊',
  area = '苗疆',
  name = '小摊',
  desc =  [[这里摆满了各种水果和苗族的小吃。一个苗族少女坐在后面，脸上泛着甜甜的笑容。]],
  exit = {
    w = { to = '苗疆小镇#2', },
  },
},

['苗疆小镇#5'] = {
  id = '苗疆小镇#5',
  area = '苗疆',
  name = '小镇',
  desc =  [[这里是小镇的东面，几名苗族男子在路旁说笑。路旁有一些不知名的野花散发着阵阵的幽香。]],
  exit = {
    e = { to = '苗疆果园', },
    w = { to = '苗疆小镇#3', },
    se = { to = '苗疆练武场', },
  },
},

['苗疆山脚'] = {
  id = '苗疆山脚',
  area = '苗疆',
  name = '山脚',
  desc =  [[这里是山脚下的一块空地，旁边竖立着一块牌子(paizi)。有两名五毒教的教众在这里看守。北面的高坡就是五毒教的禁地，任何人都不敢进去。]],
  exit = {
    nu = { to = '苗疆山路#3', },
    nw = { to = '苗疆山路#2', },
    e = { to = '苗疆小镇#4', },
  },
},

['苗疆山路#2'] = {
  id = '苗疆山路#2',
  area = '苗疆',
  name = '山路',
  desc =  [[一条被捕蛇人踏出的小道，弯弯曲曲的向西北方向的山幽伸展。道旁的杂草(grass) 高达五尺，遮住了天光。山幽中的一切都显的阴森幽暗。几乎使你分不清前方的道路。]],
  exit = {
    nw = { to = '苗疆后山', door = 'push grass', },
    se = { to = '苗疆山脚', },
  },
},

['苗疆山路#3'] = {
  id = '苗疆山路#3',
  area = '苗疆',
  name = '山路',
  desc =  [[这一段山路异常陡峭，两旁是茂盛的丛林。路旁有五毒教种植的花木，散发着冲鼻的香气。]],
  exit = {
    nu = { to = '苗疆山路#4', },
    eu = { to = '苗疆山路#5', },
    sd = { to = '苗疆山脚', },
  },
},

['苗疆山路#10'] = {
  id = '苗疆山路#10',
  area = '苗疆',
  name = '山路',
  desc =  [[这里灌木丛生，前面好象已经没有路了。旁边是一座山崖，下面好象有一座山洞(shandong)，洞口处有几具野兽的骨骸。]],
  exit = {
    w = { to = '苗疆山路#9', },
    enter = { to = '苗疆山洞', },
  },
},

['苗疆山坡'] = {
  id = '苗疆山坡',
  area = '苗疆',
  name = '山坡',
  desc =  [[这里是五毒教旁边的一块小空地，一面是围墙，一面是陡峭的石壁。石壁非常光华，看样子很难爬上去。]],
  exit = {
    w = { to = '苗疆大门', },
  },
},

['苗疆厨房'] = {
  id = '苗疆厨房',
  area = '苗疆',
  name = '厨房',
  desc =  [[这里是五毒教弟子用餐的地方，屋内摆放着几张竹椅和株桌，上面摆满了苗家风味的菜肴。]],
  exit = {
    e = { to = '苗疆前厅', },
  },
},

['苗疆蛇房'] = {
  id = '苗疆蛇房',
  area = '苗疆',
  name = '蛇房',
  desc =  [[这里是五毒教饲养和训练毒蛇的地方，地上爬满了各种毒蛇。]],
  exit = {
    s = { to = '苗疆卧室', },
    se = { to = '苗疆明月厅', },
  },
},

['苗疆兵器房'] = {
  id = '苗疆兵器房',
  area = '苗疆',
  name = '兵器房',
  desc =  [[这里是五毒教存放兵器的地方，兵器架上摆放着各式各样的武器。五毒教虽然惯于用毒，但是其武功方面也有独到之处。]],
  exit = {
    w = { to = '苗疆前厅', },
  },
},

['苗疆山路#5'] = {
  id = '苗疆山路#5',
  area = '苗疆',
  name = '山路',
  desc =  [[这里是一个小山坡，路势稍缓。两旁虽是奇花异草，香气阵阵，但也让你感到心惊胆战。]],
  exit = {
    nu = { to = '苗疆山路#6', },
    wd = { to = '苗疆山路#3', },
    ed = { to = '苗疆山路#7', },
  },
},

['苗疆药王居'] = {
  id = '苗疆药王居',
  area = '苗疆',
  name = '药王居',
  desc =  [[这里是一间简朴的竹斋，四周全是一排排药柜。靠里的桌子上面放着几本医典。一位少女坐在后面观看着书籍，旁边站着一个小丫鬟。屋里有一股淡淡的草药芬芳。]],
  exit = {
    nw = { to = '苗疆小镇#2', },
    n = { to = '苗疆药王局', },
  },
},

['苗疆药王局'] = {
  id = '苗疆药王局',
  area = '苗疆',
  name = '药王局',
  desc =  [[这里是一间比较小的房间，屋内堆积了许多药材。门口放着一些捣药的工具，西面有一扇小窗户。]],
  exit = {
    s = { to = '苗疆药王居', },
  },
},

['苗疆前厅'] = {
  id = '苗疆前厅',
  area = '苗疆',
  name = '前厅',
  desc =  [[这里是五毒教的前厅，四周全是苗疆风格的房屋。一名教众正在这里巡视着，你抬眼望去，发现四周的屋顶上竟有许多毒蛇。]],
  exit = {
    e = { to = '苗疆兵器房', },
    s = { to = '苗疆大门', },
    w = { to = '苗疆厨房', },
    n = { to = '苗疆明月厅', },
  },
},

['苗疆小镇#3'] = {
  id = '苗疆小镇#3',
  area = '苗疆',
  name = '小镇',
  desc =  [[这里就是镇中心了，旁边有一座华丽的宅院。来往的人群也比较拥挤，不时你也能看到一些江湖中人过往匆匆。]],
  exit = {
    e = { to = '苗疆小镇#5', },
    s = { to = '苗疆苗居', },
    w = { to = '苗疆小镇#4', },
    n = { to = '苗疆小镇#2', },
  },
},

['苗疆山路#4'] = {
  id = '苗疆山路#4',
  area = '苗疆',
  name = '山路',
  desc =  [[这里的路面休整的比较整齐。再往上就是五毒教的大门，两边茂盛的灌木里，似乎潜伏着无限杀机。]],
  exit = {
    nu = { to = '苗疆大门', },
    sd = { to = '苗疆山路#3', },
  },
},

['苗疆山路#8'] = {
  id = '苗疆山路#8',
  area = '苗疆',
  name = '山路',
  desc =  [[四周空气中的香气越发浓郁，你感到昏昏沉沉。灌木越来越高，逐渐挡住了光线。昏暗之中，你必须小心翼翼前行。]],
  exit = {
    nw = { to = '苗疆山路#9', },
    sd = { to = '苗疆山路#7', },
  },
},

['苗疆苗居'] = {
  id = '苗疆苗居',
  area = '苗疆',
  name = '苗居',
  desc =  [[这里是一个华丽的苗家宅院，屋内摆设却是中原风格。墙上挂着几幅古画，画下的书桌上放着文房四宝。]],
  exit = {
    n = { to = '苗疆小镇#3', },
  },
},

['苗疆山路#7'] = {
  id = '苗疆山路#7',
  area = '苗疆',
  name = '山路',
  desc =  [[这里四周的灌木越来越高，地上窄窄的小路仅能一人容身。灌木丛中常有毒蛇窜出，惊的你一身冷汗。]],
  exit = {
    nu = { to = '苗疆山路#8', },
    wu = { to = '苗疆山路#5', },
  },
},

['苗疆山路#9'] = {
  id = '苗疆山路#9',
  area = '苗疆',
  name = '山路',
  desc =  [[路势逐渐平坦，香气依旧浓郁，四周一片寂静。远处偶尔传来一两声鸟鸣，显得异常清脆。]],
  exit = {
    e = { to = '苗疆山路#10', },
    se = { to = '苗疆山路#8', },
  },
},

['襄阳郊外山路#4'] = {
  id = '襄阳郊外山路#4',
  area = '襄阳郊外',
  name = '山路',
  desc =  [[这里是瀑布西面的一条崎岖的山路，路面上夹杂着一些泥沙。齐膝的野草几乎把路给掩盖了，开出来的野花飘着阵阵花香。四周不时传来一阵阵的野兽叫声, 头顶有一些不知名的小鸟在跳来跳去。]],
  exit = {
    e = { to = '襄阳郊外瀑布', },
    nw = { to = '襄阳郊外洞口', },
    sd = { to = '襄阳郊外山路#3', },
  },
},

['襄阳郊外瀑布'] = {
  id = '襄阳郊外瀑布',
  area = '襄阳郊外',
  name = '瀑布',
  desc =  [[转过一个山峡，水声震耳欲聋，只见山峰间一条大白龙似的瀑布(pubu)奔泻而下，冲入一条溪流，奔胜雷鸣，湍急异常，水中挟著树枝石块，转眼便流得不知去向。四顾水气蒙蒙，蔚为奇观。]],
  exit = {
    w = { to = '襄阳郊外山路#4', },
  },
},

['襄阳郊外洞口'] = {
  id = '襄阳郊外洞口',
  area = '襄阳郊外',
  name = '洞口',
  desc =  [[这是一条崎岖的山路，路面上夹杂着一些泥沙，两边长着一些野草，开出来的野花飘着阵阵花香。四下长草齐膝，一片寂静。你在山石草丛之中行走良久，来到一个大山洞前。]],
  exit = {
    enter = { to = '襄阳郊外大山洞', },
    se = { to = '襄阳郊外山路#4', },
  },
},

['襄阳郊外大山洞'] = {
  id = '襄阳郊外大山洞',
  area = '襄阳郊外',
  name = '大山洞',
  desc =  [[这洞其实甚浅，行不到三丈，已抵尽头，洞中除了一张石桌、一张石凳之外更无别物。洞角有一堆乱石高起，极似一个坟墓，洞壁上似乎写得有字，只是尘封苔蔽，黑暗中瞧不清楚。]],
  exit = {
    out = { to = '襄阳郊外洞口', },
    hidden = { to = '襄阳郊外深谷#1', no_wander = true, handler = 'xyjw_cave', },
  },
},

['襄阳郊外深谷#1'] = {
  id = '襄阳郊外深谷#1',
  area = '襄阳郊外',
  name = '深谷',
  desc = [[此处是一条崎岖山路，你睁大了眼四下眺望，惟见云生谷底，雾迷峰巅，空山寂寂，微闻鸟语，天地茫茫，就只你一人而已。渐行渐低，走进了一个山谷，周围都是树丛。西北方向远远地好象有一座高陡的峭壁。]],
  exit = {
    nw = { to = '襄阳郊外深谷#2', },
    s = { to = '襄阳郊外大山洞', },
  },
},

['襄阳郊外深谷#2'] = {
  id = '襄阳郊外深谷#2',
  area = '襄阳郊外',
  name = '深谷',
  desc = [[此处是一条崎岖山路，你睁大了眼四下眺望，惟见云生谷底，雾迷峰巅，空山寂寂，微闻鸟语，天地茫茫，就只你一人而已。渐行渐低，走进了一个山谷，周围都是树丛。正北方向远远地好象有一座高陡的峭壁。]],
  exit = {
    nu = { to = '襄阳郊外峭壁', },
    se = { to = '襄阳郊外深谷#1', },
  },
},

['襄阳郊外峭壁'] = {
  id = '襄阳郊外峭壁',
  area = '襄阳郊外',
  name = '峭壁',
  desc = [[那峭壁便如一座极大的屏风，冲天而起，峭壁中部离地约二十馀丈处，生著一块三四丈见方的大石，便似一个平台，石上隐隐刻得有字。极目上望，瞧清楚是「剑冢」两个大字。]],
  exit = {
    sd = { to = '襄阳郊外深谷#2', },
    hidden = { to = '襄阳郊外平台', handler = 'xyjw_cliff', cond = 'player.skill["基本轻功"] and player.skill["基本轻功"].level >= 120 or player.neili >= 1500', },
  },
},

['襄阳郊外平台'] = {
  id = '襄阳郊外平台',
  area = '襄阳郊外',
  name = '平台',
  desc = [[你置身平台上面，四周树木苍翠，山气清佳。环顾左右，只见许多石块堆著一个大坟。这坟背向山谷，俯仰空阔，单是这座剑冢便已占尽形势。仔细一看大石上「剑冢」两个大字之旁，尚有两行字体较小的石刻（zi）。 ]],
  exit = {
    hidden = { to = '襄阳郊外峭壁', cmd = 'tiao down', },
    enter = { to = '襄阳郊外剑冢', unstable = true, cmd = 'move stone;enter', handler = 'unwield_weapon', cond = 'player.str >= 30 or player.neili_max >= 1500', },
  },
},

['襄阳郊外剑冢'] = {
  id = '襄阳郊外剑冢',
  area = '襄阳郊外',
  name = '剑冢',
  desc = [[搬开冢上石块，露出并列着的三柄长剑。在第一、第二两把剑之间，另有一块长条石片(shipian)。三柄剑和石片并列于一块大青石之上。]],
  exit = {
    out = { to = '襄阳郊外平台', unstable = true, door = 'tui shi', },
  },
},

['襄阳郊外山路#2'] = {
  id = '襄阳郊外山路#2',
  area = '襄阳郊外',
  name = '山路',
  desc =  [[这是一条崎岖的山路，路面上夹杂着一些泥沙。齐膝的野草几乎把路给掩盖了，开出来的野花飘着阵阵花香。南面是一片树林，不时传来一阵阵的野兽叫声, 头顶有一些不知名的小鸟在跳来跳去。]],
  exit = {
    nu = { to = '襄阳郊外山路#3', },
    s = { to = '襄阳郊外山路#1', cond = 'player.master == "杨过" or player.master == "小龙女"', },
    hidden = { to = '襄阳郊外树林', cmd = 's', handler = 'reset_data', },
  },
},

['襄阳郊外树林'] = {
  id = '襄阳郊外树林',
  area = '襄阳郊外',
  name = '树林',
  desc =  [[这里是一片一望无垠林海，每棵树木都有十来丈高，周围阡陌交错，几十丈高的大树簇在一块，密实的枝叶象一蓬蓬巨伞般伸向天空，把阳光遮得丝毫也无。你似乎迷失了方向，象没头苍蝇般到处乱闯。]],
  exit = {
    e = { to = '襄阳郊外树林', },
    w = { to = '襄阳郊外树林', },
    s = { to = '襄阳郊外树林', },
    n = { to = '襄阳郊外树林', },
    s2 = { to = '襄阳郊外山路#1', cost = 10, handler = 'xyjw_shulin', },
    n2 = { to = '襄阳郊外山路#2', cost = 10, handler = 'xyjw_shulin', },
  },
},

['襄阳郊外山路#3'] = {
  id = '襄阳郊外山路#3',
  area = '襄阳郊外',
  name = '山路',
  desc =  [[这是一条崎岖的山路，路面上夹杂着一些泥沙。齐膝的野草几乎把路给掩盖了，开出来的野花飘着阵阵花香。四周不时传来一阵阵的野兽叫声, 头顶有一些不知名的小鸟在跳来跳去。]],
  exit = {
    nu = { to = '襄阳郊外山路#4', },
    sd = { to = '襄阳郊外山路#2', },
  },
},

['襄阳郊外山路#1'] = {
  id = '襄阳郊外山路#1',
  area = '襄阳郊外',
  name = '山路',
  desc =  [[这是一条崎岖的山路，路面上夹杂着一些泥沙。齐膝的野草几乎把路给掩盖了，开出来的野花飘着阵阵花香。北面是一片树林，不时传来一阵阵的野兽叫声, 头顶有一些不知名的小鸟在跳来跳去。]],
  exit = {
    se = { to = '襄阳城山间空地', },
    n = { to = '襄阳郊外山路#2', cond = 'player.master == "杨过" or player.master == "小龙女"', },
    hidden = { to = '襄阳郊外树林', cmd = 'n', handler = 'reset_data', },
  },
},

['伊犁城商铺'] = {
  id = '伊犁城商铺',
  area = '伊犁城',
  name = '商铺',
  desc =  [[这是伊犁城最大的商铺, 本地维吾尔族称商铺为巴扎。巴扎上往往不经意间可以发现奇珍异宝，这里的牲畜果品等货物，多不胜数。巴扎的主人坐在铺在地上的毯子上，旁边堆着他的货。墙上有个牌子，是个价目表(sign)。]],
  exit = {
    e = { to = '伊犁城城中心', },
  },
},

['伊犁城客栈二楼'] = {
  id = '伊犁城客栈二楼',
  area = '伊犁城',
  name = '客栈二楼',
  desc =  [[这里是伊犁城最大客栈的二楼，楼下人声沸腾，不时飘上来一阵阵香喷喷的烤羊肉味。你如果累了可以在床上舒舒服服地睡一觉。]],
  exit = {
    d = { to = '伊犁城客栈', },
  },
},

['伊犁城南城门'] = {
  id = '伊犁城南城门',
  area = '伊犁城',
  name = '南城门',
  desc = { [[伊犁又名惠远，西通波斯，南到天竺，东与阳关、玉门相连，扼中西交通的要冲，是横贯东西的丝绸之路上十分重要的地区，汉代这里就属于安西都护府的辖区。伊犁城在平坦的伊犁河北岸度地而筑，城高一丈四，地势险要。城墙上满布着炮台、枪眼，戒备森严。]], [[伊犁又名惠远，西通波斯，南到天竺，东与阳关、玉门相连，扼中西交通的要冲，是横贯东西的丝绸之路上十分重要的地区，汉代这里就属于安西都护府的辖区。伊犁城在平坦的伊犁河北岸度地而筑，城高一丈四，地势险要。城墙上满布着炮台、枪眼，戒备森严。现在是夜间，城门已关，只有几个回族士兵在城门口守夜。]]},
  exit = {
    s = { to = '伊犁城伊犁河', },
    n = { to = '伊犁城城中心', unstable = true, cond = 'time.get_current_hour() >= 0 and time.get_current_hour() < 18', },
  },
},

['伊犁城铁铺'] = {
  id = '伊犁城铁铺',
  area = '伊犁城',
  name = '铁铺',
  desc =  [[这是一间灯火通明的打铁铺，一个中年男子正坐在墙边发呆。他身后的炉火烧得正旺，几名游牧民族汉子正和伙计商讨价钱，铺里的墙上有一个已经掉漆的大招牌(sign)。]],
  exit = {
    s = { to = '伊犁城城中心', },
  },
},

['伊犁城客栈'] = {
  id = '伊犁城客栈',
  area = '伊犁城',
  name = '客栈',
  desc =  [[这里是伊犁城的客栈，客栈的门口放有一个大茶桶(tong)，有免费的茶水供应，一个维吾尔族小姑娘正在买烤熟的羊肉。你如果累了可以到楼上睡一觉。]],
  exit = {
    u = { to = '伊犁城客栈二楼', },
    se = { to = '伊犁城城中心', },
  },
},

['伊犁城惠远'] = {
  id = '伊犁城惠远',
  area = '伊犁城',
  name = '惠远',
  desc =  [[伊犁，又名惠远，西通波斯，南到天竺，东与阳关、玉门相连，扼中西交通的要冲，是丝绸之路上重要的旅站之一。伊犁城位于北面天山雪水汇集而成的伊犁河以北。]],
  exit = {
    nw = { to = '星宿海星宿海#1', },
    s = { to = '星宿海丝绸之路#5', },
    w = { to = '星宿海天山脚下', },
    n = { to = '伊犁城伊犁河', },
  },
},

['伊犁城城中心'] = {
  id = '伊犁城城中心',
  area = '伊犁城',
  name = '城中心',
  desc = { [[这里是伊犁城中心，人来人往，十分热闹。只是都是维吾尔族人，他们很少说汉语，所以你听不懂。大街小巷上商铺林立百货云屯市肆繁华。街西边是一家大商铺，东面住的则是一个大财主，往北边是城内最大的客栈，南面便是伊犁城门了。]], [[这里是伊犁城中心，人来人往，十分热闹。只是都是维吾尔族人，他们很少说汉语，所以你听不懂。大街小巷上商铺林立百货云屯市肆繁华。街西边是一家大商铺，东面住的则是一个大财主，往北边是城内最大的客栈，南面的伊犁城门已经掩上了。]] },
  exit = {
    s = { to = '伊犁城南城门', unstable = true, cond = 'time.get_current_hour() >= 0 and time.get_current_hour() < 18', },
    e = { to = '伊犁城巴依家院', },
    w = { to = '伊犁城商铺', },
    nw = { to = '伊犁城客栈', },
    n = { to = '伊犁城铁铺', },
  },
},

['伊犁城伊犁河'] = {
  id = '伊犁城伊犁河',
  area = '伊犁城',
  name = '伊犁河',
  desc =  [[伊犁河位于伊犁城以南，由天山上溶化流下的雪水汇集而成。不少来往的商旅都将牲口牵至河边饮水，为下一次的旅途做好准备。河水清凉透彻，深不及膝。]],
  exit = {
    s = { to = '伊犁城惠远', },
    n = { to = '伊犁城南城门', },
  },
},

['伊犁城巴依家院'] = {
  id = '伊犁城巴依家院',
  area = '伊犁城',
  name = '巴依家院',
  desc =  [[这是伊犁城大财主的庭院。当地维吾尔族人称财主为巴依。门口大树的树荫投到院子里，让人觉得很凉快。西边就是伊犁城中心。]],
  exit = {
    w = { to = '伊犁城城中心', },
  },
},

['绝情谷东厢长廊#2'] = {
  id = '绝情谷东厢长廊#2',
  area = '绝情谷',
  name = '东厢长廊',
  desc =  [[这是东厢走廊尽头，东面通向书房，一般外派弟子到这里就止步，没有公孙谷主的命令，外派弟子不能进书房。]],
  exit = {
    w = { to = '绝情谷东厢长廊#1', },
    e = { to = '绝情谷书房', },
  },
},

['绝情谷芝房'] = {
  id = '绝情谷芝房',
  area = '绝情谷',
  name = '芝房',
  desc =  [[鼻中闻到一股浓浓的泥土清香，这便是芝房，只见房内到处种植着奇花异草，房间中央种着一枝灵芝，看上去与普通的灵芝有些不一样，一名绿衫少女正守护着它。]],
  exit = {
    n = { to = '绝情谷西厢长廊#2', },
  },
},

['绝情谷小舟'] = {
  id = '绝情谷小舟',
  area = '绝情谷',
  name = '小舟',
  desc =  [[你正身处一叶扁舟之内，舟内狭小异常，最多也就能载二、三个人。你双手扳桨，慢慢地溯溪上行。]],
  exit = {
    out2 = { to = '绝情谷小溪边', unstable = true, handler = 'disembark', cost = 50, },
    out = { to = '绝情谷独峰岭', unstable = true, handler = 'disembark', cost = 50, },
  },
},

['绝情谷山径#2'] = {
  id = '绝情谷山径#2',
  area = '绝情谷',
  name = '山径',
  desc =  [[山径只有一条，倒不会走错，只见山径越走越高，也是越是崎岖。旁边长着各种荆棘，在山石参差的环境之下，越发显得阴森可怖。而且，海拔越高，山风越是凌厉，吹得人双颊生疼。]],
  exit = {
    nu = { to = '绝情谷山顶平地', },
    sd = { to = '绝情谷山径#1', },
  },
},

['绝情谷水塘'] = {
  id = '绝情谷水塘',
  area = '绝情谷',
  name = '水塘',
  desc =  [[穿过竹林，突然一阵清香涌至，眼前无边无际的全是水仙花，原来地下是浅浅的一片水塘，深不逾尺，种满了水仙，这花是原是南方之物，不知何以竟会在关洛之间的山顶出现。]],
  exit = {
    wd = { to = '绝情谷青石板路', },
    eu = { to = '绝情谷竹林', handler = 'reset_data', },
  },
},

['绝情谷东厢长廊#1'] = {
  id = '绝情谷东厢长廊#1',
  area = '绝情谷',
  name = '东厢长廊',
  desc =  [[步入东厢长廊，扑面而来的就是一股药草的气味，原来是从北面的丹房散发出来的，那是主人最喜爱的地方，平时很少有人敢擅入。南面传来阵阵的吆喝声，这便是绝情谷弟子练功房了。]],
  exit = {
    e = { to = '绝情谷东厢长廊#2', },
    s = { to = '绝情谷练功房', },
    w = { to = '绝情谷长廊', },
    n = { to = '绝情谷丹房', },
  },
},

['绝情谷练功房'] = {
  id = '绝情谷练功房',
  area = '绝情谷',
  name = '练功房',
  desc =  [[这里是练功房，地上放着几张蒲团，几名绝情谷弟子在这里吐纳练功，练功房的四个角上各放着一只香炉，房内弥漫着一股淡淡的香气。]],
  exit = {
    n = { to = '绝情谷东厢长廊#1', },
  },
},

['绝情谷响琴榭'] = {
  id = '绝情谷响琴榭',
  area = '绝情谷',
  name = '响琴榭',
  desc =  [[榭为三间，东南北三面为敞选，中为明间，顶部平直，结构灵巧。榭下是就是引泉入池的渠道，上有响琴桥，当流水击石时，声若琴瑟。气爽风清，到是个读书做画的好去处。]],
  exit = {
    nu = { to = '绝情谷飞云岩', },
    w = { to = '绝情谷观澜亭', },
  },
},

['绝情谷山路#3'] = {
  id = '绝情谷山路#3',
  area = '绝情谷',
  name = '山路',
  desc =  [[你不觉已到了谷东自来极少人行之处，抬头见一座山峰冲天而起，正是绝险之地的绝情峰。这山峰峰腰处有一处山崖，不知若干年代之前有人在崖上刻了“断肠崖”三字。山崖下临深渊，自渊口下望，黑黝黝的深不见底。]],
  exit = {
    wd = { to = '绝情谷山路#2', },
    eu = { to = '绝情谷断肠崖', },
  },
},

['绝情谷谷中小路'] = {
  id = '绝情谷谷中小路',
  area = '绝情谷',
  name = '谷中小路',
  desc =  [[你脚踏柔软的青草，走在一条小路上面。四下里树影婆娑，花香扑鼻。迎面有一座小茅屋，门口地面上长满了青苔，侧耳倾听，四周静悄悄的，决无人声鸟语，唯有玉蜂的嗡嗡微响。]],
  exit = {
    e = { to = '绝情谷花丛', },
    s = { to = '绝情谷水潭岸边', },
    enter = { to = '绝情谷中堂', },
  },
},

['绝情谷水潭岸边'] = {
  id = '绝情谷水潭岸边',
  area = '绝情谷',
  name = '水潭岸边',
  desc =  [[你站在一片山谷中的一处水潭(tan）岸边。游目四顾，只见繁花青草，便如一个极大的花园。然而花影不动，幽谷无人，四下里十分安静。草地上一条蜿蜒的小路铺满了鹅卵石(shi)，前方不远处一所茅屋。]],
  exit = {
    hidden2 = { to = '绝情谷峭壁', cmd = 'xiao', cond = 'player.master == "杨过" or player.master ==  "小龙女"', },
    hidden1 = { to = '绝情谷水潭表面', cmd = '#8 jian shi;tiao tan', cond = 'player.qi > 550 and player.jingli > 550', },
    n = { to = '绝情谷谷中小路', },
  },
},

['绝情谷山间小路#2'] = {
  id = '绝情谷山间小路#2',
  area = '绝情谷',
  name = '山间小路',
  desc =  [[你走在一条蜿蜒而上的山间小路上，这里十分荒凉，前面不远处就是一些小树林，北面有条小路不知通向哪里。]],
  exit = {
    nw = { to = '绝情谷山间小路#3', },
    se = { to = '绝情谷山间小路#1', },
  },
},

['绝情谷山路#1'] = {
  id = '绝情谷山路#1',
  area = '绝情谷',
  name = '山路',
  desc =  [[此处是一条崎岖山路，你睁大了眼四下眺望，惟见云生谷底，雾迷峰巅，空山寂寂，微闻鸟语，天地茫茫，就只你一人而已。]],
  exit = {
    w = { to = '绝情谷山顶平地', },
    e = { to = '绝情谷山路#2', },
  },
},

['绝情谷小溪边'] = {
  id = '绝情谷小溪边',
  area = '绝情谷',
  name = '小溪边',
  desc = { [[你沿着山路前行数里，来到一条溪边。朝阳初升，照得碧玉般的水面上犹如镶了一层黄金一般，壮丽无比，你站在这里，心中什么也不愿意想，只希望就这样天长地久，时间永恒。]], [[你沿着山路前行数里，来到一条溪边。朝阳初升，照得碧玉般的水面上犹如镶了一层黄金一般，壮丽无比，你站在这里，心中什么也不愿意想，只希望就这样天长地久，时间永恒。你沿岸迂回数次，发现溪中好象有艘小舟。]], },
  exit = {
    s = { to = '绝情谷山间小路#3', },
    hidden = { to = '绝情谷小舟', cmd = 'look boat;jump boat', handler = 'jqg_river', cond = 'player.skill["基本轻功"] and player.skill["基本轻功"].level >= 100', },
  },
},

['绝情谷大厅'] = {
  id = '绝情谷大厅',
  area = '绝情谷',
  name = '大厅',
  desc =  [[这里是绝情谷的大厅，是公孙谷主会客的地方，大厅正前大梁上挂着一块大匾(bian)，上面刻着四个龙飞凤舞的金字，异常气派。主人又特地在大匾之下挂了一幅「白鹤鸣天」之图(hua)，画技精深，看得出其主特立独行的性格。]],
  exit = {
    hidden = { to = '绝情谷后堂', cmd = 'ask gongsun zhi about 绝情谷;xian hua;zuan dao', handler = 'jqg_enter', cond = 'player.exp >= 200000', },
    out = { to = '绝情谷大石屋', },
  },
},

['绝情谷竹林'] = {
  id = '绝情谷竹林',
  area = '绝情谷',
  name = '竹林',
  desc =  [[行出数里路，忽见对面绿油油的好大一片竹林，北方很少见长得这般茂密的竹林，更别提数量之大，确实罕见，林中栖息着各种鸟儿，啼声婉转，多少添了点喜气，林子中有一条小路通往后山。]],
  exit = {
    s = { to = '绝情谷竹林', },
    n = { to = '绝情谷竹林', },
    e = { to = '绝情谷竹林', },
    w = { to = '绝情谷竹林', },
    wd = { to = '绝情谷水塘', unstable = true, handler = 'jqg_zhulin', },
    su = { to = '绝情谷山顶平地', unstable = true, handler = 'jqg_zhulin', },
  },
},

['绝情谷峭壁'] = {
  id = '绝情谷峭壁',
  area = '绝情谷',
  name = '峭壁',
  desc =  [[你来到山峰腰部的一处峭壁，岩壁上不知是谁刻得有几行大字（dazi），自此向上，数十丈光溜溜的寸草不生，终年云雾环绕，天风猛烈，便飞鸟也甚难在峰顶停足。山崖旁边就是一道深渊（shenyuan）。悬崖边上长着一棵老松树（song）斜斜的探出崖边。]],
  exit = {
    hidden1 = { to = '绝情谷断肠崖', cmd = 'jump back', },
    hidden2 = { to = '绝情谷崖壁', cmd = '#8 cuo shupi;bang song;pa down', },
    hidden3 = { to = '绝情谷水潭岸边', cmd = 'xiao', cond = 'player.master == "杨过" or player.master ==  "小龙女"', },
  },
},

['绝情谷崖壁'] = {
  id = '绝情谷崖壁',
  area = '绝情谷',
  name = '崖壁',
  desc =  [[你手握藤条，身体紧紧贴附在悬崖峭壁之上。向四周望去，只见到云雾缭绕的一片迷茫。阵阵切骨山风吹得你遍体冰凉。山壁光滑平境，要是没有支撑点，就连飞鸟也难以立足。]],
  exit = {
    hidden1 = { to = '绝情谷谷底', cmd = 'pa down;#wb 1500', handler = 'go_straight', },
    hidden2 = { to = '绝情谷峭壁', cmd = 'pa up;#wb 1500', handler = 'go_straight', },
  },
},

['绝情谷花园'] = {
  id = '绝情谷花园',
  area = '绝情谷',
  name = '花园',
  desc =  [[这里是花园，种满了情花树(hua），西北方是一个小池塘，眼下正值六月，池塘内荷花都绽开了花朵，几只青蛙趴在荷叶上“呱呱”地叫个不停。西南方一座假山，南面是一条长廊。]],
  exit = {
    s = { to = '绝情谷长廊', },
  },
},

['绝情谷山径#1'] = {
  id = '绝情谷山径#1',
  area = '绝情谷',
  name = '山径',
  desc =  [[山径只有一条，倒不会走错，只见山径越走越高，也是越是崎岖。旁边长着各种荆棘，在山石参差的环境之下，越发显得阴森可怖。而且，海拔越高，山风越是凌厉，吹得人双颊生疼。]],
  exit = {
    nu = { to = '绝情谷山径#2', },
    sd = { to = '绝情谷飞云岩', },
  },
},

['绝情谷厉鬼峰'] = {
  id = '绝情谷厉鬼峰',
  area = '绝情谷',
  name = '厉鬼峰',
  desc =  [[你游目四顾，原来处身于一个绝峰之顶，四下里林木茂密，远望石庄，相距已有数里之遥。你睁大了眼四下眺望，惟见云生谷底，雾迷峰巅，空山寂寂，微闻鸟语，天地茫茫，就只你一人而已。]],
  exit = {
    sd = { to = '绝情谷山路#2', },
  },
},

['绝情谷青石板路'] = {
  id = '绝情谷青石板路',
  area = '绝情谷',
  name = '青石板路',
  desc =  [[对于走惯了泥土路的人来说，眼前这条青石板倒是很有意思，又湿又滑。在每块石板的间隙之中，长满了绿色的青苔。一只白鹤施施然地独足立于青石板上，不时地用嘴梳理着自己的毛羽，神情煞是可爱。北面隐约看出是一座大石屋。]],
  exit = {
    eu = { to = '绝情谷水塘', },
    n = { to = '绝情谷大石屋', },
  },
},

['绝情谷大石屋'] = {
  id = '绝情谷大石屋',
  area = '绝情谷',
  name = '大石屋',
  desc =  [[一座极大的石屋出现在眼前，只见两名绿衫僮儿手执拂尘，站在石屋门前。石屋二边是绝壁峭崖，几株长在绝壁上松树长得很茂盛，把石屋遮得严严实实的，远远看来，几乎看不出在这深谷中还有座石屋。]],
  exit = {
    s = { to = '绝情谷青石板路', },
    enter = { to = '绝情谷大厅', },
  },
},

['绝情谷西厢长廊#1'] = {
  id = '绝情谷西厢长廊#1',
  area = '绝情谷',
  name = '西厢长廊',
  desc =  [[西厢长廊短而精致，其右是景色秀丽的花圃，所种植的奇花异草更是惹人喜爱，引得蜂蜂蝶蝶都围着花儿忙个不停。其左是供休息的小巧座椅，配有精致的雕花扶手，整条廊子充满了勃勃生机。它的南北二侧是休息室。]],
  exit = {
    e = { to = '绝情谷长廊', },
    s = { to = '绝情谷休息室#S', cond = 'player.gender == "female"', },
    w = { to = '绝情谷西厢长廊#2', },
    n = { to = '绝情谷休息室#N', cond = 'player.gender == "male"', },
  },
},

['绝情谷休息室#S'] = {
  id = '绝情谷休息室#S',
  area = '绝情谷',
  name = '休息室',
  desc =  [[这是间整洁的厢房，因门窗常闭着，光线很昏暗。这是女弟子休息室，房里别无他物，只有中间放着几张收拾得舒舒服服的大床，床上还有一些棉被，看着就让人想睡觉。]],
  exit = {
    n = { to = '绝情谷西厢长廊#1', },
  },
},

['绝情谷丹房'] = {
  id = '绝情谷丹房',
  area = '绝情谷',
  name = '丹房',
  desc =  [[你打量室中，只见桌上，柜中满列药瓶，壁上一丛丛的挂著无数乾草药，西首并列三座丹炉(lu)，这间石室自便是所谓丹房了。]],
  exit = {
    s = { to = '绝情谷东厢长廊#1', },
    hidden = { to = '绝情谷鳄鱼潭', no_wander = true, cmd = 'tui middlelu;tui eastlu middle;tui westlu east;tui middlelu west', cond = 'player.str >= 30 and player.skill["基本内功"] and player.skill["基本内功"].level >= 120 and player.skill["基本轻功"] and player.skill["基本轻功"].level >= 120', },
  },
},

['绝情谷鳄鱼潭'] = {
  id = '绝情谷鳄鱼潭',
  area = '绝情谷',
  name = '鳄鱼潭',
  desc =  [[这里黑漆漆的，你只觉得身子在水中不断往下潜沉，待沉势稍缓，拨水上升，刚钻出水面吸了几口气，突然鼻中闻到一股腥臭，同时左首水波激荡，似有甚麽巨大水族来袭。]],
  exit = {
    hidden = { to = '绝情谷洞口', cost = 20, cmd = 'ta corpse', },
  },
},

['绝情谷洞口'] = {
  id = '绝情谷洞口',
  area = '绝情谷',
  name = '洞口',
  desc = [[越过鳄鱼潭，见到一个洞口（dong），里面漆黑一片，鼻中只隐约闻到一股刺鼻的气味。洞口极窄，看样子只得屈膝爬行了。]],
  exit = {
    hidden = { to = '绝情谷山洞', cmd = 'zuan dong', },
  },
},

['绝情谷山洞'] = {
  id = '绝情谷山洞',
  area = '绝情谷',
  name = '山洞',
  desc = [[山洞里蜿蜒崎岖，绵延向下，由于鳄潭水气蒸浸，洞中潮湿滑溜，腥臭难闻。令人不寒而立。遑论是在毫无亮光的情况下，平添几份阴森的感觉。洞中极窄，根本站不起身来。]],
  exit = {
    hidden = { to = '绝情谷隧洞', cost = 20, cmd = 'climb down', },
  },
},

['绝情谷隧洞'] = {
  id = '绝情谷隧洞',
  area = '绝情谷',
  name = '隧洞',
  desc = [[你爬行了一阵，隧洞渐宽，已可直立行走，行了良久，始终不到尽头，地下却越来越平。突然猛听得左首传来一阵大笑之声，这几下明明是笑声，听来却竟与号哭一般，语调异常的凄凉悲切。]],
  exit = {
    w = { to = '绝情谷石窟', },
  },
},

['绝情谷石窟'] = {
  id = '绝情谷石窟',
  area = '绝情谷',
  name = '石窟',
  desc = [[你转过二个弯后，眼前突然亮光耀目。这是一个天然生成的石窟，深不见尽头，顶上有个圆径丈许的大孔，日光从孔中透射进来，只是那大孔离地一百馀丈，这石窟深处地底，纵在窟中大声呼叫，上面有人经过也未必听见。抬头可以看见高处石壁上凹凹凸凸，不似底下的滑溜。石窟中日光所及处生长了不少大枣树(tree)。]],
  exit = {
    e = { to = '绝情谷隧洞', },
    hidden = { to = '绝情谷石壁', cost = 10, cmd = '#8 bo shupi;cuo shupi;#wb 1500;zhe shugan;#wb 2000;pa shibi', },
  },
},

['绝情谷石壁'] = {
  id = '绝情谷石壁',
  area = '绝情谷',
  name = '石壁',
  desc = [[你约莫爬了六七十丈，仗着轻功卓绝，一路化险为夷，但爬到离洞穴七八丈时，石壁不但光滑异常，再无可容手足之处，而且向内倾斜，除非是壁虎、苍蝇，方能附壁不落。]],
  exit = {
    hidden1 = { to = '绝情谷石窟', cmd = 'climb down', },
    hidden2 = { to = '绝情谷厉鬼峰', cost = 5, cmd = 'fu shugan;shuai shugan;#wb 3000;climb up', },
  },
},

['绝情谷谷底'] = {
  id = '绝情谷谷底',
  area = '绝情谷',
  name = '谷底',
  desc =  [[你来到谷底，却发现这里原来是一处碧水清潭(tan）。周围岸边有几棵大树。树上排列着数十个蜂巢(fengchao)。而在巢畔飞来飞去的都是一些体形硕大，颜色灰白的异种玉蜂，地上铺满了鹅卵石(shi)。]],
  exit = {
    hidden1 = { to = '绝情谷崖壁', cmd = 'pa yabi', },
    hidden2 = { to = '绝情谷谷底水潭#1', no_wander = true, cmd = '#8 jian shi;tiao tan', cond = 'player.qi > 550 and player.jingli > 550', },
  },
},

['绝情谷谷底水潭#1'] = {
  id = '绝情谷谷底水潭#1',
  area = '绝情谷',
  name = '谷底水潭',
  desc =  [[你双手划水，漂浮在水潭的水面上面。水潭位处谷底，地势低寒，一股股的寒气从水潭下面直逼上来。四周水中不要说鱼虾，就连水草也没有一根。你只觉得寒气刺骨，不禁机伶伶打了几个冷颤。]],
  exit = {
    hidden1 = { to = '绝情谷谷底水潭#2', cmd = 'qian down;#wb 1500', },
    hidden2 = { to = '绝情谷谷底', cmd = 'pa up', },
  },
},

['绝情谷谷底水潭#2'] = {
  id = '绝情谷谷底水潭#2',
  area = '绝情谷',
  name = '谷底水潭',
  desc =  [[你屏气凝神，潜伏在水潭的中间。水潭位处谷底，地势低寒，一股股的寒气从水潭下面直逼上来。四周水中不要说鱼虾，就连水草也没有一根。你只觉得寒气刺骨，不禁机伶伶打了几个冷颤。]],
  exit = {
    hidden1 = { to = '绝情谷谷底水潭#3', cmd = 'qian down;#wb 1500', },
    hidden2 = { to = '绝情谷谷底水潭#1', cmd = 'qian up;#wb 1500', },
  },
},

['绝情谷谷底水潭#3'] = {
  id = '绝情谷谷底水潭#3',
  area = '绝情谷',
  name = '谷底水潭',
  desc =  [[你屏气凝神，潜伏在水潭的中间。水潭位处谷底，地势低寒，你向四周望去，四面蓝森森，青郁郁，寒气逼人，似乎结满玄冰。你只觉得寒气刺骨，冷不可耐。]],
  exit = {
    hidden1 = { to = '绝情谷谷底水潭#4', cmd = 'qian down;#wb 1500', },
    hidden2 = { to = '绝情谷谷底水潭#2', cmd = 'qian up;#wb 2500', },
  },
},

['绝情谷谷底水潭#4'] = {
  id = '绝情谷谷底水潭#4',
  area = '绝情谷',
  name = '谷底水潭',
  desc =  [[你历尽坚辛，终于到达了水潭底部，水潭四周层层叠叠的都是万年玄冰。你头顶左上方(zuoshang)隐约透着光亮。水中寒气逼人，阵阵刺骨冰气使你感觉就象刀刮一样的疼痛，此处看来不可多呆，还是赶快离开吧。]],
  exit = {
    hidden1 = { to = '绝情谷谷底水潭#3', cmd = '#8 drop stone;qian up;#wb 1500', },
    hidden2 = { to = '绝情谷水底通道', cmd = '#8 drop stone;qian zuoshang;#wb 1500', },
  },
},

['绝情谷水底通道'] = {
  id = '绝情谷水底通道',
  area = '绝情谷',
  name = '水底通道',
  desc =  [[你屏气凝神，潜伏在水底中的一条斜向上的通道之中。阳光从头顶水面上直照下来，水中温度和旭温暖，四下里水草丛生，周围数条不知名的白鱼缓缓游动。身体下面的水中却有阵阵寒气传上来。]],
  exit = {
    hidden1 = { to = '绝情谷谷底水潭#4', cmd = 'qian down;#wb 1500', },
    hidden2 = { to = '绝情谷水潭表面', cmd = 'qian up', },
  },
},

['绝情谷水潭表面'] = {
  id = '绝情谷水潭表面',
  area = '绝情谷',
  name = '水潭表面',
  desc =  [[你双手划水，漂浮在一片水面上面。你只觉阳光耀眼，水面上花香扑鼻，竟是别有天地。]],
  exit = {
    hidden1 = { to = '绝情谷水底通道', cmd = 'qian down;#wb 1500', },
    hidden2 = { to = '绝情谷水潭岸边', cmd = 'pa up', },
  },
},

['绝情谷花丛'] = {
  id = '绝情谷花丛',
  area = '绝情谷',
  name = '花丛',
  desc =  [[你脚踏柔软的青草，走在一条小路上面。四下里树影婆娑，花香扑鼻。这里几株小树郁郁葱葱，树下一片青草，几簇龙女花开得格外娇艳。空谷幽静，潭水清澈，这是实在是个演练武功的好地方。]],
  exit = {
    w = { to = '绝情谷谷中小路', },
  },
},

['绝情谷中堂'] = {
  id = '绝情谷中堂',
  area = '绝情谷',
  name = '中堂',
  desc =  [[你举步走入一间茅屋的中堂，只见屋中陈设简陋，但洁净异常，堂上只有一桌一几，此外便无别物。]],
  exit = {
    e = { to = '绝情谷小室', },
    out = { to = '绝情谷谷中小路', },
    n = { to = '绝情谷卧室', },
  },
},

['绝情谷小室'] = {
  id = '绝情谷小室',
  area = '绝情谷',
  name = '小室',
  desc =  [[你举步走入一间小室，只见屋中两侧堆满了杂物，左面是一堆柴草引火之物，右面则有几个陶制的碗罐和一个粗木搭制的凳子。]],
  exit = {
    w = { to = '绝情谷中堂', },
    e = { to = '绝情谷大室', },
  },
},

['绝情谷断肠崖'] = {
  id = '绝情谷断肠崖',
  area = '绝情谷',
  name = '断肠崖',
  desc =  [[那悬崖下临深谷，上面山峰笔立，峰顶深入云雾之中，不知尽头。“断肠崖”前后风景清幽，只因地势实在太险，山石滑溜溜，极易掉入深渊，人们轻易不敢来此。]],
  exit = {
    wd = { to = '绝情谷山路#3', },
    hidden = { to = '绝情谷峭壁', cmd = 'look ya;jump qiaobi', },
  },
},

['绝情谷休息室#N'] = {
  id = '绝情谷休息室#N',
  area = '绝情谷',
  name = '休息室',
  desc =  [[这是间整洁的厢房，因门窗常闭着，光线很昏暗。这是男弟子休息室，房里别无他物，只有中间放着几张收拾得舒舒服服的大床，床上还有一些棉被，看着就让人想睡觉。]],
  exit = {
    s = { to = '绝情谷西厢长廊#1', },
  },
},

['绝情谷观澜亭'] = {
  id = '绝情谷观澜亭',
  area = '绝情谷',
  name = '观澜亭',
  desc =  [[这座亭子四角攥尖顶，檐角飞翘，四柱拱托，古拙而又精巧。山下弧形水渠环绕，水声潺潺，亭四周山石林立，千资百态。坐立亭中可望碧波滚滚，令人有临海观澜之感。]],
  exit = {
    e = { to = '绝情谷响琴榭', },
    sd = { to = '绝情谷独峰岭', },
  },
},

['绝情谷山路#2'] = {
  id = '绝情谷山路#2',
  area = '绝情谷',
  name = '山路',
  desc =  [[此处是一条崎岖山路，你睁大了眼四下眺望，惟见云生谷底，雾迷峰巅，空山寂寂，微闻鸟语，天地茫茫，就只你一人而已。眼前出现两条岔路，你一时竟不知向那一条走才是。]],
  exit = {
    nu = { to = '绝情谷厉鬼峰', },
    eu = { to = '绝情谷山路#3', },
    w = { to = '绝情谷山路#1', },
  },
},

['绝情谷山顶平地'] = {
  id = '绝情谷山顶平地',
  area = '绝情谷',
  name = '山顶平地',
  desc =  [[山顶四周草木青翠欲滴，繁花似锦，一路上已是风物佳胜，此处更是个罕见的美景之地，信步而行，只见路旁仙鹤三二、白鹿成群，松鼠小兔，尽是见人不惊。东面一条山路不知通往何处，北面是一大片竹林。]],
  exit = {
    e = { to = '绝情谷山路#1', },
    nd = { to = '绝情谷竹林', handler = 'reset_data', },
    w = { to = '绝情谷小石屋', },
    sd = { to = '绝情谷山径#2', },
  },
},

['绝情谷书房'] = {
  id = '绝情谷书房',
  area = '绝情谷',
  name = '书房',
  desc =  [[房内整齐地排着几排书架，这里是公孙止的书房，左边的书架上排列着一些基本武功的书籍。右边的书架上排列着一些诗词。东首放着一张桌子，走近一看，桌上放着一些公孙谷主写的诗词。书房出去是东厢长廊。]],
  exit = {
    w = { to = '绝情谷东厢长廊#2', },
  },
},

['绝情谷西厢长廊#2'] = {
  id = '绝情谷西厢长廊#2',
  area = '绝情谷',
  name = '西厢长廊',
  desc =  [[转过几个弯后，已到西厢长廊的尽头。相对廊子的细窄而言，尽头的大水池令人顿觉豁然开朗，池子极大，周围圈以古色古香的砖瓦，再配以飘逸的柳条，有种仙境的意味。池中豢养的鱼儿浑身金灿灿的，活跃非常。池子的北面是剑室，南面是芝房，散发出一股泥土的清香。]],
  exit = {
    e = { to = '绝情谷西厢长廊#1', },
    s = { to = '绝情谷芝房', },
    n = { to = '绝情谷剑室', cond = 'player.skill["基本轻功"] and player.skill["基本轻功"].level >= 120', },
  },
},

['绝情谷卧室'] = {
  id = '绝情谷卧室',
  area = '绝情谷',
  name = '卧室',
  desc =  [[举步入内，一瞥眼间，只见屋中陈设简陋，但洁净异常，堂上只一桌一几，此外便无别物，桌几放置竟与古墓石室中的桌椅一模一样。只是古墓中用具大都石制，此处的却由粗木搭成。但见室右有榻。]],
  exit = {
    s = { to = '绝情谷中堂', },
  },
},

['绝情谷大室'] = {
  id = '绝情谷大室',
  area = '绝情谷',
  name = '大室',
  desc =  [[你举步走入一间大室，只见屋右有塌，室中凌空拉着一条长绳。窗前小小一几，室左立着一个粗糙木橱。室内桌椅用具都用粗木搭成。]],
  exit = {
    w = { to = '绝情谷小室', },
  },
},

['绝情谷剑室'] = {
  id = '绝情谷剑室',
  area = '绝情谷',
  name = '剑室',
  desc =  [[这里是剑室，只见室中壁上、桌上、架上、柜中。几间，尽皆列满兵刃，式样繁多，十之八九都是古剑，或长逾七尺，或短仅数寸，有的铁口斑驳，有的寒光逼人。却见屋角西壁间一大片火烧的焦痕，几张桌椅也均烧得残破。]],
  exit = {
    s = { to = '绝情谷西厢长廊#2', },
  },
},

['绝情谷小石屋'] = {
  id = '绝情谷小石屋',
  area = '绝情谷',
  name = '小石屋',
  desc =  [[这是一座小石屋，四围是用大石块砌起来的。地上胡乱铺着几张草席，墙角放着一张桌子，看上去破烂不堪，桌上放着几只破碗。]],
  exit = {
    e = { to = '绝情谷山顶平地', },
  },
},

['绝情谷飞云岩'] = {
  id = '绝情谷飞云岩',
  area = '绝情谷',
  name = '飞云岩',
  desc =  [[这里似洞非洞，顶上崖檐覆出，石乳倒垂。浮者若飞霞，亘者若虹霓，豁然楼殿门阙，悬若铜鼓编磬，并有狮象蛟龙、莲荷阡陌、蜂房水涡之属。其下澄潭邃谷，幽深无底，四面茂盛古树参天，流水潆洄。]],
  exit = {
    nu = { to = '绝情谷山径#1', },
    sd = { to = '绝情谷响琴榭', },
  },
},

['绝情谷山间小路#3'] = {
  id = '绝情谷山间小路#3',
  area = '绝情谷',
  name = '山间小路',
  desc =  [[你走在一条蜿蜒而上的山间小路上，这里十分荒凉，前面不远处就是一些小树林，北面有条小路好象通向一条小溪流。]],
  exit = {
    se = { to = '绝情谷山间小路#2', },
    n = { to = '绝情谷小溪边', },
  },
},

['绝情谷长廊'] = {
  id = '绝情谷长廊',
  area = '绝情谷',
  name = '长廊',
  desc =  [[这是条幽静的长廊，两边均设着红色雕花扶栏，再配以白色的粉墙，显得十分素雅。尤其是挂在长廊檐下的水晶风玲，在微风的轻抚之下，洒出一阵阵细碎悦耳的玲声，令人遐思纷飞。此廊北通向花园，南通向后堂。]],
  exit = {
    e = { to = '绝情谷东厢长廊#1', },
    s = { to = '绝情谷后堂', },
    w = { to = '绝情谷西厢长廊#1', },
    n = { to = '绝情谷花园', },
  },
},

['绝情谷后堂'] = {
  id = '绝情谷后堂',
  area = '绝情谷',
  name = '后堂',
  desc =  [[这是后堂，借客人在这里歇息，南方一排屏风遮住了视线，绕过屏风就是一条密道直通大厅了。北面是一条长廊，直通往后花园。]],
  exit = {
    s = { to = '绝情谷大厅', },
    n = { to = '绝情谷长廊', },
  },
},

['绝情谷独峰岭'] = {
  id = '绝情谷独峰岭',
  area = '绝情谷',
  name = '独峰岭',
  desc =  [[溪流一路而下，将舟送至一个极其险恶的境地，这里两边山峰壁立，抬头望天，只余一线。山青水碧，景色极尽清幽，只是四下寂无声息，隐隐透著凶险，溪心有九块大石迎面耸立，犹如屏风一般，挡住了去路。溪边停着一叶小舟(boat)，正是你来时所乘之舟。]],
  exit = {
    nu = { to = '绝情谷观澜亭', },
    hidden = { to = '绝情谷小舟', cmd = 'tui boat;jump boat', handler = 'jqg_river', },
  },
},

['绝情谷山间小路#1'] = {
  id = '绝情谷山间小路#1',
  area = '绝情谷',
  name = '山间小路',
  desc =  [[你走在一条蜿蜒而上的山间小路上，这里十分荒凉，前面不远处就是一些小树林，南面就是通往襄阳城的青石大道，北面有条小路不知通向哪里。]],
  exit = {
    nw = { to = '绝情谷山间小路#2', },
    s = { to = '襄阳城西门外', },
  },
},

['武当山石阶#3'] = {
  id = '武当山石阶#3',
  area = '武当山',
  name = '石阶',
  desc =  [[你走在一条古朴的石阶上，不时地有道士和你擦肩而过。远处的撞钟声清晰可闻。抬头隐约可见笼罩在云雾中的天柱峰，你知道快到山顶了，一兴奋顿时忘了浑身的疲倦。]],
  exit = {
    su = { to = '武当山紫霄宫大门', },
    nd = { to = '武当山展旗峰', },
  },
},

['武当山金殿'] = {
  id = '武当山金殿',
  area = '武当山',
  name = '金殿',
  desc =  [[金殿建在天柱峰顶端，是武当山的象征，也是武当道教在皇室扶持下走向鼎盛的结果。铜铸鎏金的金殿为重檐庑殿式仿木结构，仅面饰鎏金就耗黄金千两，是武当山等级最高的古建筑。金殿的面阔进深均为三间，立柱上叠架着额、枋及斗拱，正脊两端龙吻对峙，殿顶翼角飞举，上饰龙凤、天马、等灵禽瑞兽栩栩如生。 ]],
  exit = {
    e = { to = '武当山大岳太和宫', },
  },
},

['武当山山脚下'] = {
  id = '武当山山脚下',
  area = '武当山',
  name = '山脚下',
  desc =  [[这里是武当山脚下，两旁是阴森森的树林。西边是一座高山, 东南方是一茶亭。所谓偷得浮生半日闲! 没有比这更好的歇脚方法了。]],
  exit = {
    e = { to = '武当山黄土路#2', },
    w = { to = '武当山玄岳门', },
    se = { to = '武当山茶亭', },
  },
},

['武当山雨后彩虹'] = {
  id = '武当山雨后彩虹',
  area = '武当山',
  name = '雨后彩虹',
  desc =  [[你走入山坞中，这里是九渡涧的下流，各岭之水均在此交汇，然后突然倾泻而下注入山涧形成壮观的瀑布。一条天然石梁横跨两岸，远处观看在是一条雨后彩虹。再往上就是陡峭的十八盘了。]],
  exit = {
    nu = { to = '武当山望背坡', },
    su = { to = '武当山十八盘', },
  },
},

['武当山琼台观'] = {
  id = '武当山琼台观',
  area = '武当山',
  name = '琼台观',
  desc =  [[琼台观位于武当山天柱峰东南八公里处，分为琼台上观、中观和下观三个建筑单元，是武当山三十六观中最大的道观之一。琼台三观各有非常好听的名字，上观叫“白玉龟台”，中观叫“紫岳琼台”，下观叫“玉乐霄台”。观之间借山势起伏修建有多座道院，之间由亭桥相联，故有在三观之间走动“出门不见天，下雨不湿鞋”的说法，可见琼台是宏大而奇妙的。]],
  exit = {
    ed = { to = '武当山榔梅祠', },
    eu = { to = '武当山古神道#6', },
  },
},

['武当山厨房'] = {
  id = '武当山厨房',
  area = '武当山',
  name = '厨房',
  desc =  [[这里是武当派弟子用餐的地方。屋里布置很简单, 只摆着几张桌椅, 几位武当弟子一声不响地吃着。大凡入道之人生活简朴, 只见碗中仅是粗茶淡饭。]],
  exit = {
    w = { to = '武当山东厢走廊#S', },
  },
},

['武当山石阶#4'] = {
  id = '武当山石阶#4',
  area = '武当山',
  name = '石阶',
  desc =  [[你走在一条古朴的石阶上，不时地有进香客从你的身边走过。远处的撞钟声清晰可闻。抬头隐约可见笼罩在云雾中的天柱峰，你知道快到山顶了，一兴奋顿时忘了浑身的疲倦。]],
  exit = {
    su = { to = '武当山古神道#5', },
    nd = { to = '武当山古神道#4', },
  },
},

['武当山大岳太和宫'] = {
  id = '武当山大岳太和宫',
  area = '武当山',
  name = '大岳太和宫',
  desc =  [[大岳太和宫建在众峰拱托、直插云霄的武当最高峰——天柱峰的绝顶上。武当山特殊的地貌形成的众峰拱托、八方朝拜的景观也神奇地渲染出皇权的至高无上。大岳太和宫是武当山的最高胜境，无论是道人信士，还是香客游人，只有登上顶峰，走进太和宫，才是真正意义上的到了武当山。]],
  exit = {
    w = { to = '武当山金殿', },
    nd = { to = '武当山黄龙洞', },
  },
},

['武当山黄土路#1'] = {
  id = '武当山黄土路#1',
  area = '武当山',
  name = '黄土路',
  desc =  [[你走在一条尘土飞扬的黄土路上，两旁是阴森森的树林。这里是鄂西，据说经常有土匪出没，不可久留。]],
  exit = {
    w = { to = '武当山黄土路#2', },
    e = { to = '襄阳城汉水西岸', },
  },
},

['武当山十八盘'] = {
  id = '武当山十八盘',
  area = '武当山',
  name = '十八盘',
  desc =  [[你正在爬一个很大的斜坡，俗称十八盘，大石阶一级一级笔直而上，颇费脚力。坡上有几家山民开的小店，游客到此略坐小息再往上爬。向前十里之后即是武当重地三清殿了。]],
  exit = {
    su = { to = '武当山复真观', },
    nd = { to = '武当山雨后彩虹', },
  },
},

['武当山炼丹房'] = {
  id = '武当山炼丹房',
  area = '武当山',
  name = '炼丹房',
  desc =  [[这里是间药香弥漫的大屋，屋四周堆满了各式各样的药材，房子中间摆放着一只炼丹用的特制铜鼎(tongding)。墙边还有各种工具，切药，研药....一应具全。道童们正全神灌注的协助炼丹者，扇风担水，一切都井然有序，显然是训练有素。因为长期炼丹的缘故，这屋子四季如春！]],
  exit = {
    w = { to = '武当山东厢走廊#N', },
  },
},

['武当山古神道#1'] = {
  id = '武当山古神道#1',
  area = '武当山',
  name = '古神道',
  desc =  [[古神道其实就是通往武当山上的小道，相传远古时有神从次经过，形成人可以走的道路从而得名。实际上古神道是在条峡谷之中，这里剑河水长年不断地涓涓流淌，山上古树参天，峡谷中林荫浓密，是武当山一风景绝佳之处。]],
  exit = {
    su = { to = '武当山元和观', },
    nd = { to = '武当山石阶#1', },
  },
},

['武当山紫霄宫大门'] = {
  id = '武当山紫霄宫大门',
  area = '武当山',
  name = '紫霄宫大门',
  desc =  [[你已到了展旗峰下，前面就是武当山最为宏大的宫宇紫霄宫了。殿宇依山而筑，高低错落有致。周围古木参天，翠竹成林，鸟语花香，景色清幽，好一个修道成仙处。这里是武当师徒的主要活动场所。]],
  exit = {
    enter = { to = '武当山紫霄宫', },
    nd = { to = '武当山石阶#3', },
  },
},

['武当山飞升崖'] = {
  id = '武当山飞升崖',
  area = '武当山',
  name = '飞升崖',
  desc =  [[飞升崖一峰突起，三面绝壁，山脊上有一条小路直达峰巅，跃顶眺望，武当七十二峰朝大顶的胜景尽收眼帘。相传，玄武大帝年轻时就在此修练，他面壁数十年，心如古井，坐如盘松，甚至鸟儿在头上筑巢都纹丝不动。后人依据玄武大帝在此修练和飞升的传说，在这建起了“梳妆台”。]],
  exit = {
    ne = { to = '武当山天乙真庆宫', },
  },
},

['武当山古神道#2'] = {
  id = '武当山古神道#2',
  area = '武当山',
  name = '古神道',
  desc =  [[古神道其实就是通往武当山上的小道，相传远古时有神从次经过，形成人可以走的道路从而得名。实际上古神道是在条峡谷之中，这里剑河水长年不断地涓涓流淌，山上古树参天，峡谷中林荫浓密，是武当山一风景绝佳之处。]],
  exit = {
    su = { to = '武当山遇真宫', },
    nd = { to = '武当山元和观', },
  },
},

['武当山五龙宫'] = {
  id = '武当山五龙宫',
  area = '武当山',
  name = '五龙宫',
  desc =  [[五龙宫背靠五龙顶，是武当山古建筑群中最早的建筑单元。修练之士到这里隐居最早亦可追朔到汉代，是武当道教的发祥圣地，历史上被誉为灵应之地。道教认为这块地域是群仙神龙居住的地方。所以，这儿立有一块碑，上面刻着“洞天在近，过往低声”。以此告诫人们，这儿一面接着天庭，一面连着神府，在此过往要静肃低声，以免惊扰神灵。 ]],
  exit = {
    ed = { to = '武当山隐仙岩', },
  },
},

['武当山武当广场'] = {
  id = '武当山武当广场',
  area = '武当山',
  name = '武当广场',
  desc =  [[这是一个由大白石板铺成的广场，两边有两个兵器架，十八武器样样俱全，墙角还散放着几个练力的石锤和一些杂物。是武当弟子学习武功和互相切磋的地点。周围种满了梧桐树，一到秋天就是满地的落叶。一个年纪轻轻的道童正在打扫。南边是灵霄宫三清殿。]],
  exit = {
    s = { to = '武当山天乙真庆宫', },
    n = { to = '武当山大圣南岩宫', },
  },
},

['武当山男休息室'] = {
  id = '武当山男休息室',
  area = '武当山',
  name = '男休息室',
  desc =  [[这是间整洁的厢房，因门窗常闭着，光线很昏暗。靠墙点着一炉檀香，房里别无他物，只有中间放着一张收拾得舒舒服服的大床，床上还有一些毛毯，看着就让人想睡觉。]],
  exit = {
    n = { to = '武当山东厢走廊#S', },
  },
},

['武当山古神道#3'] = {
  id = '武当山古神道#3',
  area = '武当山',
  name = '古神道',
  desc =  [[古神道其实就是通往武当山上的小道，相传远古时有神从次经过，形成人可以走的道路从而得名。实际上古神道是在条峡谷之中，这里剑河水长年不断地涓涓流淌，山上古树参天，峡谷中林荫浓密，是武当山一风景绝佳之处。]],
  exit = {
    e = { to = '武当山展旗峰', },
    sw = { to = '武当山雷神洞', },
  },
},

['武当山女休息室'] = {
  id = '武当山女休息室',
  area = '武当山',
  name = '女休息室',
  desc =  [[这是间整洁的厢房，因门窗常闭着，光线很昏暗。靠墙点着一炉檀香，房里别无他物，只有中间放着一张收拾得舒舒服服的大床，床上还有一些毛毯，看着就让人想睡觉。唯一特别之处是在床边还有一梳妆小柜，那是给女孩们睡醒后梳妆打扮用的。]],
  exit = {
    n = { to = '武当山西厢走廊#S', },
  },
},

['武当山黄龙洞'] = {
  id = '武当山黄龙洞',
  area = '武当山',
  name = '黄龙洞',
  desc =  [[黄龙洞在武当古神道通往金顶的路上，位于紫盖峰悬崖之中。洞内空气干而不燥，润而不湿，四季清幽凉爽，是历代修练之士向往之地。黄龙实际上是一个天然的岩屋，经历代修练之士的修建增补，这里有了黄龙殿、真武阁、药王殿、神泉亭等建筑，使之更具有神秘和深幽的色彩。]],
  exit = {
    wd = { to = '武当山古神道#6', },
    su = { to = '武当山大岳太和宫', },
  },
},

['武当山后山小院'] = {
  id = '武当山后山小院',
  area = '武当山',
  name = '后山小院',
  desc =  [[这是后山的一座小院，布置简简单单，除了一床、一桌、一椅、一蒲团，再也没有别的什物。比较引人注目的是墙上挂着一把剑。这里就是武当开山祖师张三丰的练功所在。]],
  exit = {
    n = { to = '武当山院门', door = 'open door', },
  },
},

['武当山紫霄宫'] = {
  id = '武当山紫霄宫',
  area = '武当山',
  name = '紫霄宫',
  desc =  [[规模宏大，气势磅礴的紫霄宫，座落在武当山展旗峰下。这里群峰山岭环绕，松林翠柏幽深，环境优雅，气候宜人，历来被视为“紫霄福地”。紫霄宫初建于宋宣和年间。宋徽宗赵佶一次做梦，梦见了“火神”，有一方士为他圆梦，说要派水神到南方压镇，才能无忧。于是选中了七十二福地之一的武当山，在展旗峰下为水神玄武建造了这座宫殿，并赐额“紫霄元圣宫”。 ]],
  exit = {
    out = { to = '武当山紫霄宫大门', },
    su = { to = '武当山大圣南岩宫', },
  },
},

['武当山古神道#4'] = {
  id = '武当山古神道#4',
  area = '武当山',
  name = '古神道',
  desc =  [[古神道其实就是通往武当山上的小道，相传远古时有神从次经过，形成人可以走的道路从而得名。实际上古神道是在条峡谷之中，这里剑河水长年不断地涓涓流淌，山上古树参天，峡谷中林荫浓密，是武当山一风景绝佳之处。]],
  exit = {
    su = { to = '武当山石阶#4', },
    nd = { to = '武当山天乙真庆宫', },
  },
},

['武当山黄土路#2'] = {
  id = '武当山黄土路#2',
  area = '武当山',
  name = '黄土路',
  desc =  [[你走在一条尘土飞扬的黄土路上，两旁是阴森森的树林。这里是鄂西，据说经常有土匪出没，不可久留。]],
  exit = {
    w = { to = '武当山山脚下', },
    e = { to = '武当山黄土路#1', },
  },
},

['武当山望背坡'] = {
  id = '武当山望背坡',
  area = '武当山',
  name = '望背坡',
  desc =  [[山势到这突然陡峭，两边都是万丈深渊。上山的人都紧抓左右两边的大铁链，一步一顿，因只能看见前行人的背脊而得此名。你大胆伸头下探，隐约看见涧水流动，仿如蛇行。]],
  exit = {
    sd = { to = '武当山雨后彩虹', },
    nd = { to = '武当山磨针井', },
  },
},

['武当山山路#1'] = {
  id = '武当山山路#1',
  area = '武当山',
  name = '山路',
  desc =  [[你走在登山的路径上，路的左破边是山壁，右边钉有大铁链，外边是一大山谷，谷里长满了山竹。山风一过，翠波起伏，美不胜收!]],
  exit = {
    wu = { to = '武当山玉虚宫', },
    nd = { to = '武当山武当柏林', },
  },
},

['武当山东厢走廊#N'] = {
  id = '武当山东厢走廊#N',
  area = '武当山',
  name = '东厢走廊',
  desc =  [[你走在一条走廊上，廊顶描绘着江南秀美的风景。每两根翠绿色的柱子间相隔也就两三尺的距离，朱红色的琉璃瓦，嫩黄色的地砖。再往东是一间炼丹房。这儿是武当禁地, 非常安静。]],
  exit = {
    w = { to = '武当山走廊', },
    e = { to = '武当山炼丹房', },
  },
},

['武当山院门'] = {
  id = '武当山院门',
  area = '武当山',
  name = '院门',
  desc =  [[你走在一条小径上，两旁种满了竹子，修篁森森，绿荫满地，除了竹叶声和鸟鸣声，听不到别的动静。南面似乎有一座简陋的小院。]],
  exit = {
    s = { to = '武当山后山小院', door = 'open door', },
    hidden = { to = '武当山小径#M', cmd = 'n', },
    n = { to = '武当山小径#2', cond = 'player.master == "张三丰"', },
  },
},

['武当山小径#1'] = {
  id = '武当山小径#1',
  area = '武当山',
  name = '小径',
  desc =  [[你走在一条小径上，两旁种满了竹子，修篁森森，绿荫满地，除了竹叶声和鸟鸣声，听不到别的动静。东西两侧是走廊。]],
  exit = {
    e = { to = '武当山东厢走廊#S', },
    w = { to = '武当山西厢走廊#S', },
    s = { to = '武当山小径#2', },
    n = { to = '武当山三清殿', },
  },
},

['武当山西厢走廊#S'] = {
  id = '武当山西厢走廊#S',
  area = '武当山',
  name = '西厢走廊',
  desc =  [[你走在一条木制结构的走廊上，南面是一间大屋，门口挂有一标记，门牌(pai)是白的。再往西是一座楼阁。]],
  exit = {
    e = { to = '武当山小径#1', },
    w = { to = '武当山藏经阁', },
    s = { to = '武当山女休息室', cond = 'player.gender ~= "male"', },
  },
},

['武当山元和观'] = {
  id = '武当山元和观',
  area = '武当山',
  name = '元和观',
  desc =  [[元和观是武当山进玄岳门古神道上的第一座道观。据道藏记载，玄天上帝修练得道后，曾掌管“元和迁校府”，故这座道观取名“元和观”。这里，迁，是放逐的意思；校，是指枷锁等刑具。事实上，元和观是武当派处罚违犯清规戒律的武当弟子的机构。]],
  exit = {
    e = { to = '武当山元和观大殿', },
    nd = { to = '武当山古神道#1', },
    su = { to = '武当山古神道#2', },
  },
},

['武当山玉虚宫'] = {
  id = '武当山玉虚宫',
  area = '武当山',
  name = '玉虚宫',
  desc =  [[武当山建造的规模宏大的皇家庙观，而玉虚宫则是整个建筑群中最大的庙宇。玉虚宫是城内套城，共有三城，即外乐城，里乐城和紫金城。三城都各有宫墙间隔连围，形成等级鲜明，规模宏大的宫城。后来，玉虚宫又得到了大规模的扩建。放眼望去，飞金流碧，富丽辉煌，了无边际。]],
  exit = {
    ed = { to = '武当山山路#1', },
    su = { to = '武当山磨针井', },
  },
},

['武当山复真观'] = {
  id = '武当山复真观',
  area = '武当山',
  name = '复真观',
  desc =  [[复真观又名“太子坡”，相传是净乐国王太子，也就是后来的玄武大帝十五岁入武当山修炼时最初居住的地方，又因其意志不坚在返回家的途中，被紫气元君用“铁杵磨针”点化，复又上山修炼，因而得名复真观的。]],
  exit = {
    nd = { to = '武当山十八盘', },
    w = { to = '武当山老君岩', },
    wu = { to = '武当山石阶#2', },
  },
},

['武当山古神道#5'] = {
  id = '武当山古神道#5',
  area = '武当山',
  name = '古神道',
  desc =  [[古神道其实就是通往武当山上的小道，相传远古时有神从次经过，形成人可以走的道路从而得名。实际上古神道是在条峡谷之中，这里剑河水长年不断地涓涓流淌，山上古树参天，峡谷中林荫浓密，是武当山一风景绝佳之处。]],
  exit = {
    su = { to = '武当山榔梅祠', },
    nd = { to = '武当山石阶#4', },
  },
},

['武当山榔梅祠'] = {
  id = '武当山榔梅祠',
  area = '武当山',
  name = '榔梅祠',
  desc =  [[榔梅祠位于通往金顶的路上，武当榔梅开花结果，道士往往将榔梅果贡献朝庭，得到了皇帝赏赐。皇帝认为，榔梅结果是个“瑞兆”，是玄武大帝对他登基即位的赞美。玄武大帝修练时，曾折下一段梅枝插在榔树上，说：“吾若道成，开花结果”。后来，他果然得道成功，梅枝在榔树上也插栽成活。]],
  exit = {
    e = { to = '武当山山路#2', },
    nd = { to = '武当山古神道#5', },
    nw = { to = '武当山隐仙岩', },
    wu = { to = '武当山琼台观', },
  },
},

['武当山山路#2'] = {
  id = '武当山山路#2',
  area = '武当山',
  name = '山路',
  desc =  [[你走在一条偏僻的山路上，四周灌木丛丛，遍地奇花异草，人迹罕至，路径几不可寻，只有采药的人才敢进入深山。你到处乱窜寻找出路，猛的一痛，荆棘把你给划伤了!]],
  exit = {
    w = { to = '武当山榔梅祠', },
    se = { to = '武当后山小路#1', },
    hidden1 = { to = '武当山灌木丛', cmd = 'zuan guanmu', },
    hidden2 = { to = '武当后山古道#1', handler = 'wdhs_gudao', cond = 'player.party == "武当派" and player.skill["基本内功"] and player.skill["基本内功"].level >= 20 and player.jingli >= 200 and player.neili >= 200', },
  },
},

['武当山灌木丛'] = {
  id = '武当山灌木丛',
  area = '武当山',
  name = '灌木丛',
  desc = [[你走在一条偏僻的山路上，四周灌木丛丛，遍地奇花异草，其中一株长生果树(guoshu)就为珍贵。这里人迹罕至，路径几不可寻，只有采药的人才敢进入深山。]],
  exit = {
    w = { to = '武当山山路#2', },
  },
},

['武当山三清殿'] = {
  id = '武当山三清殿',
  area = '武当山',
  name = '三清殿',
  desc =  [[这里是紫霄宫的三清殿，是武当派会客的地点。供着道德天尊、元始天尊和灵宝天尊的神像。正中间是个敬香的大香案，靠墙放着几张太师椅，地上放着几个蒲团。北边是练武的地方，南边是武当禁地。]],
  exit = {
    out = { to = '武当山天乙真庆宫', },
    s = { to = '武当山小径#1', },
    n = { to = '武当山走廊', },
  },
},

['武当山东厢走廊#S'] = {
  id = '武当山东厢走廊#S',
  area = '武当山',
  name = '东厢走廊',
  desc =  [[你走在一条木制结构的走廊上，南面是一间大屋，门口挂有一标记，门牌(pai)是蓝的，东边是武当派弟子平时用膳的场所。]],
  exit = {
    e = { to = '武当山厨房', },
    w = { to = '武当山小径#1', },
    s = { to = '武当山男休息室', cond = 'player.gender ~= "female"', },
  },
},

['武当山藏经阁'] = {
  id = '武当山藏经阁',
  area = '武当山',
  name = '藏经阁',
  desc =  [[这里是藏经阁，靠墙是一排书架，摆满了道教的典籍。中央有一个长方形的大桌子，上面也堆满了书。一个道童正在整理书籍。]],
  exit = {
    e = { to = '武当山西厢走廊#S', },
  },
},

['武当山小径#M'] = {
  id = '武当山小径#M',
  area = '武当山',
  name = '小径',
  desc =  [[你走在一条小径上，两旁种满了竹子，修篁森森，绿荫满地，除了竹叶声和鸟鸣声，听不到别的动静。]],
  exit = {
    s = { to = '武当山小径#M', },
    e = { to = '武当山小径#M', },
    w = { to = '武当山小径#M', },
    n = { to = '武当山小径#M', },
    hidden1 = { to = '武当山院门', handler = 'wd_xiaojing', },
    hidden2 = { to = '武当山小径#2', handler = 'wd_xiaojing', },
  },
},

['武当山走廊'] = {
  id = '武当山走廊',
  area = '武当山',
  name = '走廊',
  desc =  [[你走在一条走廊上，西边有一间药房，再往东是一间炼丹房, 北面是练功房。这儿是武当禁地, 非常安静, 有一武当弟子看守着。]],
  exit = {
    e = { to = '武当山东厢走廊#N', },
    s = { to = '武当山三清殿', },
    w = { to = '武当山西厢走廊#N', },
    n = { to = '武当山练功房', },
  },
},

['武当山药房'] = {
  id = '武当山药房',
  area = '武当山',
  name = '药房',
  desc =  [[这是武当山脚下的一间小药房，一名武当道童正在不停拉着风箱。房屋的墙上贴着一张纸（paper)，中间有一个丹炉(lu)，里面散发出浓浓的药味，似乎刚有人熬过什么丹药。]],
  exit = {
    e = { to = '武当山西厢走廊#N', },
  },
},

['武当山玄岳门'] = {
  id = '武当山玄岳门',
  area = '武当山',
  name = '玄岳门',
  desc =  [[你的面前就是天下闻名的武当山，它是一座林木繁茂的高山，几座山峰被云雾笼罩，难见全貌。一条石阶盘延向上，隐约可见几个进香客。一座古牌石坊(fang)面山而立。武当山又名太和山，为七十二福地之一，有二十七峰、三十六岩、二十四涧、五台、五井、三潭、三天门、三洞天和一福地，百里内密树森罗，蔽日参天，景物幽绝。而这玄岳门是武当派迎接来客的第一站。			  武  当  山]],
  exit = {
    e = { to = '武当山山脚下', },
    su = { to = '武当山石阶#1', },
  },
},

['武当山玉虚岩'] = {
  id = '武当山玉虚岩',
  area = '武当山',
  name = '玉虚岩',
  desc =  [[玉虚岩穴洞分上下两层，进入岩洞，随处可见当年庙房的遗址、摩崖石刻和泥塑彩绘的神像。北宋著名文学家李方叔在《武当山赋并序》中记载，唐玄装七世佛子之徒“越蓊岭，逾崆峒，来驻于兹……”意思是说，曾上西天取经的唐僧的七世弟子们带着佛经，翻山越岭，来到玉虚岩，并住在这里收徒弟传授佛经。]],
  exit = {
    wd = { to = '武当山磨针井', },
  },
},

['武当山展旗峰'] = {
  id = '武当山展旗峰',
  area = '武当山',
  name = '展旗峰',
  desc =  [[展旗峰为武当的中心山峰，峰奇峦秀，涧险岩危，自古就被誉为“天下第一仙峰”。其形威峻极，上接青天，下临深谷，犹如展开的大旗一般，故得此名。展旗峰前接下山古神道，山下坐落着紫霄宫，半山腰还有著名的雷神洞，大部分武当弟子的活动在此峰之上。]],
  exit = {
    nd = { to = '武当山石阶#2', },
    w = { to = '武当山古神道#3', },
    su = { to = '武当山石阶#3', },
  },
},

['武当山练功房'] = {
  id = '武当山练功房',
  area = '武当山',
  name = '练功房',
  desc =  [[这里是练功房，地下凌乱地放着几个蒲团，几位武当弟子正盘膝坐在上面打坐。]],
  exit = {
    s = { to = '武当山走廊', },
  },
},

['武当山老君岩'] = {
  id = '武当山老君岩',
  area = '武当山',
  name = '老君岩',
  desc =  [[老君岩石窟正中凿刻老君像一尊。老君像座姿端庄，呈天盘修炼状，为唐代风格。 在老君岩石窟的左边还有一摩崖石刻群，上面有“太子入武当”、“蓬莱九仙”等石刻。它当年所营造的是道教最高尊神居住的环境，即元始天尊、灵宝天尊、道德天尊的寓所，也被称为“三清境”。 ]],
  exit = {
    e = { to = '武当山复真观', },
  },
},

['武当山遇真宫'] = {
  id = '武当山遇真宫',
  area = '武当山',
  name = '遇真宫',
  desc =  [[这里是进香客进香还愿的遇真宫，乃武当山的第一道宫宇。宽敞无比，香火鼎盛。宫中供着张三丰真人像。由于张真人闭关已久，外人不知其是否尚在人间，民间传说他已得道仙逝，因此立像膜拜。]],
  exit = {
    wu = { to = '武当山武当柏林', },
    nd = { to = '武当山古神道#2', },
  },
},

['武当山茶亭'] = {
  id = '武当山茶亭',
  area = '武当山',
  name = '茶亭',
  desc =  [[这是三叉路口旁边而建的茶亭，喝着香茶，还能欣赏远处的风景，这真所谓偷得浮生半日闲！没有比这更好的歇脚方法了。亭里三五成群的游人围着桌子(table)，坐在椅子(chair)上，有的闲聊，有的乘凉，好不逍遥自在。]],
  exit = {
    nw = { to = '武当山山脚下', },
  },
},

['武当山大圣南岩宫'] = {
  id = '武当山大圣南岩宫',
  area = '武当山',
  name = '大圣南岩宫',
  desc =  [[南岩，又名“紫霄岩”，因它朝向南方，故称做南岩。它的全称是大圣南岩宫。据记载，在唐朝，八仙之一的吕洞宾就曾在南岩修道，这里还留有他作的一首诗。史书盛赞南岩是“分列殿庭，晨钟夕灯，山鸣谷震”。到了晚上，这里的灯火成了别具特色的景观。	]],
  exit = {
    s = { to = '武当山武当广场', },
    nd = { to = '武当山紫霄宫', },
  },
},

['武当山石阶#1'] = {
  id = '武当山石阶#1',
  area = '武当山',
  name = '石阶',
  desc =  [[你走在一条坚实的石阶上，不时地有游人或进香客从你的身边走过。一边是悬崖，一边是峭壁，抬头隐约可见山雾环绕的天柱峰，山风拂面，鸟鸣声声，令人心旷神怡。]],
  exit = {
    su = { to = '武当山古神道#1', },
    nd = { to = '武当山玄岳门', },
  },
},

['武当山雷神洞'] = {
  id = '武当山雷神洞',
  area = '武当山',
  name = '雷神洞',
  desc =  [[雷神洞位于紫宵宫展旗峰南端的半山腰，它的全称是“南岩焱火雷君沧水圣洞”。这里是武当山道人修练清微雷法和祈雨的场所。据说，这儿祈雨是非常灵验的。雷神洞的石殿里供奉的是背生双翅，鹰嘴鹞眼的雷神，他身边立着的两个侍从，一个叫司查，一个叫击恶。也就是说，一个是管调查人间善恶，而另一个则专门对行恶之人进行惩罚。]],
  exit = {
    ne = { to = '武当山古神道#3', },
  },
},

['武当山元和观大殿'] = {
  id = '武当山元和观大殿',
  area = '武当山',
  name = '元和观大殿',
  desc =  [[元和观的大殿建在高台之上，显得庄严肃穆。大殿内，两侧端立着六甲神像，他们都是玄天上帝的护法灵官。正面坐着的是身着铠甲，手执金鞭的王灵官。王灵官赤面三目，相貌峥狞，大有不顺天意敢作恶者，雷厉风行立即正法之势。明、清以来，他被人们视为天上、人间的纠察之神。]],
  exit = {
    w = { to = '武当山元和观', },
  },
},

['武当山磨针井'] = {
  id = '武当山磨针井',
  area = '武当山',
  name = '磨针井',
  desc =  [[建筑居高临下，每天太阳初升，这里首先接纳到纯一的阳气，故又称“纯阳宫”。相传玄武是净乐国太子，十五岁入武当山修道。在深山老林中修了几十年大道未成，心灰意冷，决意弃道还俗，走到这里，遇到女神紫气元君化做老太婆用铁杵磨针点化他。使他悟出“铁杵磨成针，功到自然成”的道理，遂又返回深山修炼。]],
  exit = {
    nd = { to = '武当山玉虚宫', },
    eu = { to = '武当山玉虚岩', },
    su = { to = '武当山望背坡', },
  },
},

['武当山古神道#6'] = {
  id = '武当山古神道#6',
  area = '武当山',
  name = '古神道',
  desc =  [[古神道其实就是通往武当山上的小道，相传远古时有神从次经过，形成人可以走的道路从而得名。实际上古神道是在条峡谷之中，这里剑河水长年不断地涓涓流淌，山上古树参天，峡谷中林荫浓密，是武当山一风景绝佳之处。]],
  exit = {
    wd = { to = '武当山琼台观', },
    eu = { to = '武当山黄龙洞', },
  },
},

['武当山石阶#2'] = {
  id = '武当山石阶#2',
  area = '武当山',
  name = '石阶',
  desc =  [[你走在一条坚实的石阶上，不时地有游人或进香客从你的身边走过。一边是悬崖，一边是峭壁，抬头隐约可见山雾环绕的天柱峰，山风拂面，鸟鸣声声，令人心旷神怡。再往前就是展旗峰了。]],
  exit = {
    ed = { to = '武当山复真观', },
    su = { to = '武当山展旗峰', },
  },
},

['武当山西厢走廊#N'] = {
  id = '武当山西厢走廊#N',
  area = '武当山',
  name = '西厢走廊',
  desc =  [[你走在一条走廊上，廊顶描绘着江南秀美的风景。每两根翠绿色的柱子间相隔也就两三尺的距离，朱红色的琉璃瓦，嫩黄色的地砖。再往西是一间药房。这儿是武当禁地, 非常安静。]],
  exit = {
    w = { to = '武当山药房', },
    e = { to = '武当山走廊', },
  },
},

['武当山小径#2'] = {
  id = '武当山小径#2',
  area = '武当山',
  name = '小径',
  desc =  [[你走在一条小径上，两旁种满了竹子，修篁森森，绿荫满地，除了竹叶声和鸟鸣声，听不到别的动静。]],
  exit = {
    s = { to = '武当山院门', cond = 'player.master == "张三丰"', },
    hidden = { to = '武当山小径#M', cmd = 's', },
    n = { to = '武当山小径#1', },
  },
},

['武当山武当柏林'] = {
  id = '武当山武当柏林',
  area = '武当山',
  name = '武当柏林',
  desc =  [[你穿行在一片茂密的柏林中，阴森郁翠，不见阳光。柏林深处时常传出野兽的嚎叫声，你心跳加速，急忙加快步伐。]],
  exit = {
    ed = { to = '武当山遇真宫', },
    su = { to = '武当山山路#1', },
  },
},

['武当山天乙真庆宫'] = {
  id = '武当山天乙真庆宫',
  area = '武当山',
  name = '天乙真庆宫',
  desc =  [[在南岩，最负盛名的建筑是一座石殿，叫“天乙真庆宫”。传说，玄武大帝修练升天后，在天上的住所就叫“天乙真庆宫”。显然，这座石殿就是信徒们在人间为玄武大帝而建造的。真庆宫的石壁上还有一排排的铁铸饰金人像，人称五百灵官。  ]],
  exit = {
    enter = { to = '武当山三清殿', },
    sw = { to = '武当山飞升崖', },
    su = { to = '武当山古神道#4', },
    n = { to = '武当山武当广场', },
  },
},

['武当山隐仙岩'] = {
  id = '武当山隐仙岩',
  area = '武当山',
  name = '隐仙岩',
  desc =  [[隐仙岩是武当山三十六岩中的一座大型岩洞，在中国道教历史上久负盛名。据史料记载，汉代著名方士尹轨就在此修行。尹轨在道教史上有着很高的地位，传说老子曾授他《道德五千言》。史书上说尹轨“既明天文星气，又精河图洛书，既能用丹药为人治病，又擅长烧炼金银”。]],
  exit = {
    se = { to = '武当山榔梅祠', },
    wu = { to = '武当山五龙宫', },
  },
},

['武当后山古道#1'] = {
  id = '武当后山古道#1',
  area = '武当后山',
  name = '古道',
  desc = [[你走在一条人迹不至的古道上，四周野草过顶，路径时隐时现，你正低头辨认时，忽感到脖子一凉，啊! 从树上掉下条毒蛇，正好落在你身上，一条腥红的舌头正对着你一深一吐，好不吓人。]],
  exit = {
    eu = { to = '武当后山古道#2', },
    wd = { to = '武当山山路#2', },
  },
},

['武当后山古道#2'] = {
  id = '武当后山古道#2',
  area = '武当后山',
  name = '古道',
  desc = [[你沿着古道往上爬，灌木丛生，乔木遮云，正是野兽的理想天堂，不想成为老虎的晚餐的话还是赶快离开的好。]],
  exit = {
    nd = { to = '武当后山古道#3', },
    wd = { to = '武当后山古道#1', },
    su = { to = '武当后山猢狲愁', },
  },
},

['武当后山古道#3'] = {
  id = '武当后山古道#3',
  area = '武当后山',
  name = '古道',
  desc = [[你走走停停，发现已到了路的尽头。这里凌空突出，长满青草，几只野兔在你身边跳来跳去毫不怕生，下面十多丈深有一水潭，潭水清澈。你正满身臭汗饥渴难当，恨不得马上跳下去凉快一番。]],
  exit = {
    su = { to = '武当后山古道#2', },
    hidden = { to = '武当后山水潭', cmd = 'tiao down', no_wander = true, },
  },
},

['武当后山水潭'] = {
  id = '武当后山水潭',
  area = '武当后山',
  name = '水潭',
  desc = [[这是一碧绿水潭，潭水清澈，水寒刺骨，好象还有什么东西在咬你的脚趾，还是赶快爬上岸吧。]],
  exit = {
    hidden1 = { to = '武当后山古道#3', cmd = 'drop lianxin shi;pa up', },
    hidden2 = { to = '武当后山水潭底#1', handler = 'wdhs_shuitan', },
  },
},

['武当后山水潭底#1'] = {
  id = '武当后山水潭底#1',
  area = '武当后山',
  name = '水潭底',
  desc = [[你身处碧绿潭水中，潭水清澈，水寒刺骨，周围鱼虾罕见，如进了死城一般。]],
  exit = {
    hidden1 = { to = '武当后山水潭', cmd = 'dive up', },
    hidden2 = { to = '武当后山水潭底#2', handler = 'wdhs_shuitan', },
  },
},

['武当后山水潭底#2'] = {
  id = '武当后山水潭底#2',
  area = '武当后山',
  name = '水潭底',
  desc = [[你身处水潭潭底，潭底细沙如雪，潭水墨蓝，水寒刺骨，寂静一片，阴深恐怖。]],
  exit = {
    hidden = { to = '武当后山水潭底#1', cmd = 'dive up', },
  },
},

['武当后山猢狲愁'] = {
  id = '武当后山猢狲愁',
  area = '武当后山',
  name = '猢狲愁',
  desc = [[你好不辛苦才爬到了山顶，这里怪石参差，山风刺骨，三面都是万丈悬崖，崖壁平滑，连猴子也难以攀登。四周寸草不生，有一棵迎客松(song)孤单地立于崖边。]],
  exit = {
    nd = { to = '武当后山古道#2', },
    hidden = { to = '武当后山山崖#1', handler = 'wdhs_husun', },
  },
},

['武当后山山崖#1'] = {
  id = '武当后山山崖#1',
  area = '武当后山',
  name = '山崖',
  desc = [[这是一面陡峭的山崖，石壁平滑如镜，光可照人，山风刮得脸如刀割，崖下深不见底，令人胆寒。]],
  exit = {
    hidden1 = { to = '武当后山山崖#2', handler = 'wdhs_shanya', },
    hidden2 = { to = '武当后山猢狲愁', cmd = 'pa up', handler = 'go_straight', },
  },
},

['武当后山山崖#2'] = {
  id = '武当后山山崖#2',
  area = '武当后山',
  name = '山崖',
  desc = [[这是一面陡峭的山崖，石壁平滑如镜，光可照人，山风刮得脸如刀割，崖下深不见底，令人胆寒。你的绳子已放尽了，四周仍无可以落脚的地方，离脚下几十丈处有棵万年松，枝叶茂密，型如圆桌。冒险下跳，借物滑翔，也许能落在树上。]],
  exit = {
    hidden1 = { to = '武当后山万年松', handler = 'wdhs_jump' },
    hidden2 = { to = '武当后山山崖#1', cmd = 'climb up', },
  },
},

['武当后山万年松'] = {
  id = '武当后山万年松',
  area = '武当后山',
  name = '万年松',
  desc = [[这是一棵万年老松，树枝交错，松针茂密。老树盘根，深抓石壁。树上结满了大大小小的松果。脚下雾气弥漫，不知深浅。拨开松枝，你看见石壁上有一天然石洞。]],
  exit = {
    enter = { to = '武当后山石壁岩洞', },
    hidden = { to = '武当山飞升崖', handler = 'wdhs_jump' },
  },
},

['武当后山石壁岩洞'] = {
  id = '武当后山石壁岩洞',
  area = '武当后山',
  name = '石壁岩洞',
  desc = [[这是一天然石洞，不是很深，当太阳升起时能直射全洞。象是有人在此住过，正面有一石床，左边放有一些石碗，右面的石壁(wall)上似乎刻有小字，你可以尝试阅读(read)一下。]],
  exit = {
    out = { to = '武当后山万年松', },
  },
},

['成都城土路#1'] = {
  id = '成都城土路#1',
  area = '成都城',
  name = '土路',
  desc =  [[这是一条尘土飞扬的小路，因为四川自古就是富庶之地，所以放眼望去，四周的田垅里郁郁青青。这里是川中，东北十几里处就是著名的蜀都成都了。]],
  exit = {
    ne = { to = '成都城南门外', },
    sw = { to = '成都城土路#2', },
  },
},

['成都城关帝庙'] = {
  id = '成都城关帝庙',
  area = '成都城',
  name = '关帝庙',
  desc =  [[这是一座破败的关帝庙，以前曾经香火很盛，后来因为天灾人祸渐渐地破败了，再没有什么人来上香。后来不知道从那里来了一群叫化子，把这里做为夜晚休息的安身之所。最近这里成了丐帮的大智分舵。门外是一条宽阔的青石大道，通往城外。]],
  exit = {
    s = { to = '成都城西大街#2', },
    n = { to = '成都城后院', },
  },
},

['成都城后院'] = {
  id = '成都城后院',
  area = '成都城',
  name = '后院',
  desc =  [[这里是关帝庙的后院，院子很大，以前在院墙北面的方向有一个后门可以通到别处，现在已经给人堵死了。诺大的院子里长满了杂草，西角有一小块菜地，地边放着一个水桶(tong)。]],
  exit = {
    s = { to = '成都城关帝庙', },
  },
},

['成都城大道#1E'] = {
  id = '成都城大道#1E',
  area = '成都城',
  name = '大道',
  desc =  [[这是一条由青石铺成的大道，西边通向著名的蜀都成都了，向东北走可以去到湖北。]],
  exit = {
    ne = { to = '成都城大道#2E', },
    w = { to = '成都城大东门', },
  },
},

['成都城制药作坊'] = {
  id = '成都城制药作坊',
  area = '成都城',
  name = '制药作坊',
  desc =  [[这是间简陋的小屋子，屋子里面最引人注目的是那口终日不息的熬药锅。这个作坊一般不生产成药，而只是收购采药人采回来的药材原料，加工成可以用来配药的药材原料。]],
  exit = {
    w = { to = '成都城北大街#2', },
  },
},

['成都城大道#4E'] = {
  id = '成都城大道#4E',
  area = '成都城',
  name = '大道',
  desc =  [[你来到了川鄂交界的小路上，偶尔会有人骑着马匆匆而过，卷起飞扬的尘土。西边是通向故蜀成都的大道，往东北则进入湖北。]],
  exit = {
    w = { to = '成都城大道#3E', },
    e = { to = '襄阳城小路#2', },
  },
},

['成都城城跟路#4'] = {
  id = '成都城城跟路#4',
  area = '成都城',
  name = '城跟路',
  desc =  [[这是靠近成都北门城墙跟的一条小路。西边不远处就是北大街。]],
  exit = {
    w = { to = '成都城城跟路#5', },
    se = { to = '成都城城跟路#3', },
  },
},

['成都城大东门'] = {
  id = '成都城大东门',
  area = '成都城',
  name = '大东门',
  desc =  [[这是就是成都的东城门了。成都地处川中，一向少有战事困扰。但是朝廷还是驻扎了重兵。城门的墙上张贴着一纸告示(gaoshi)。]],
  exit = {
    w = { to = '成都城东大街#4', },
    e = { to = '成都城大道#1E', },
  },
},

['成都城城跟路#1'] = {
  id = '成都城城跟路#1',
  area = '成都城',
  name = '城跟路',
  desc =  [[这是靠近成都东门城墙跟的一条小路。北边折向西北，南边是东大街。]],
  exit = {
    s = { to = '成都城东大街#4', },
    n = { to = '成都城城跟路#2', },
  },
},

['成都城大道#2N'] = {
  id = '成都城大道#2N',
  area = '成都城',
  name = '大道',
  desc =  [[这是一条由青石铺成的大道，不时地有人骑着马匆匆而过。南边通向著名的蜀都成都了，向北走不远就是青城了。大道的东边是一座巍峨的高山。]],
  exit = {
    e = { to = '成都城高山脚下', },
    sw = { to = '成都城大道#1N', },
    n = { to = '兰州城青城', },
  },
},

['成都城城跟路#2'] = {
  id = '成都城城跟路#2',
  area = '成都城',
  name = '城跟路',
  desc =  [[这是靠近成都东门城墙跟的一条小路。南边不远处就是东大街。]],
  exit = {
    nw = { to = '成都城城跟路#3', },
    s = { to = '成都城城跟路#1', },
  },
},

['成都城土路#2'] = {
  id = '成都城土路#2',
  area = '成都城',
  name = '土路',
  desc =  [[这是一条尘土飞扬的小路，因为四川自古就是富庶之地，所以放眼望去，四周的田垅里郁郁青青。]],
  exit = {
    ne = { to = '成都城土路#1', },
    sw = { to = '峨嵋山峨嵋山脚下', },
  },
},

['成都城大道#3E'] = {
  id = '成都城大道#3E',
  area = '成都城',
  name = '大道',
  desc =  [[这是一条由青石铺成的大道，西南边通向四川的中部，东面不远处就是川鄂交界的地方了。]],
  exit = {
    e = { to = '成都城大道#4E', },
    sw = { to = '成都城大道#2E', },
  },
},

['成都城东大街#4'] = {
  id = '成都城东大街#4',
  area = '成都城',
  name = '东大街',
  desc =  [[这是一条宽阔的青石街道，向东西两头延伸。东边是东城门通向城外。西边显得很繁忙。北边沿着城墙跟有条路。]],
  exit = {
    e = { to = '成都城大东门', },
    w = { to = '成都城东大街#3', },
    n = { to = '成都城城跟路#1', },
  },
},

['成都城东大街#3'] = {
  id = '成都城东大街#3',
  area = '成都城',
  name = '东大街',
  desc =  [[这是成都的东大街。东边通向东城门，西边显得很繁忙。南边是条青石板路，通向南侧门。]],
  exit = {
    e = { to = '成都城东大街#4', },
    w = { to = '成都城东大街#2', },
    s = { to = '成都城南侧街#1', },
  },
},

['成都城西大街#1'] = {
  id = '成都城西大街#1',
  area = '成都城',
  name = '西大街',
  desc =  [[这是成都的西大街。西边通向西城门，东边是城中心。]],
  exit = {
    w = { to = '成都城西大街#2', },
    e = { to = '成都城城中心', },
  },
},

['成都城北大街#2'] = {
  id = '成都城北大街#2',
  area = '成都城',
  name = '北大街',
  desc =  [[这是成都的北大街。北边通向北城门，南边显得很繁忙。]],
  exit = {
    e = { to = '成都城制药作坊', },
    s = { to = '成都城北大街#1', },
    w = { to = '成都城药店', },
    n = { to = '成都城北大街#3', },
  },
},

['成都城北大街#4'] = {
  id = '成都城北大街#4',
  area = '成都城',
  name = '北大街',
  desc =  [[这是一条宽阔的青石街道，向南北两头延伸。北边是北城门通向城外。南边显得很繁忙。东边沿着城墙跟有条路。]],
  exit = {
    e = { to = '成都城城跟路#5', },
    s = { to = '成都城北大街#3', },
    n = { to = '成都城大北门', },
  },
},

['成都城药店'] = {
  id = '成都城药店',
  area = '成都城',
  name = '药店',
  desc =  [[这是家古色古香的药店，是附近百里有名的老字号。前来买药的人终日络绎不绝，应接不暇，还有不少游方郎中就在大厅中问诊、开药，好不热闹。在屋角还放这一座炼丹铜炉，终日炉火不息，这是给大夫炼制丹药而准备的。]],
  exit = {
    e = { to = '成都城北大街#2', },
  },
},

['成都城南大街#2'] = {
  id = '成都城南大街#2',
  area = '成都城',
  name = '南大街',
  desc =  [[这是一条宽阔的青石街道，向南北两头延伸。南边是南城门通向城外。北边显得很繁忙。]],
  exit = {
    s = { to = '成都城大南门', },
    w = { to = '成都城墨玉斋', },
    n = { to = '成都城南大街#1', },
  },
},

['成都城大南门'] = {
  id = '成都城大南门',
  area = '成都城',
  name = '大南门',
  desc =  [[这是就是成都的南城门了。成都地处川中，一向少有战事困扰，所以很少见到有士兵。城门的墙上张贴着一纸告示(gaoshi)。]],
  exit = {
    s = { to = '成都城南门外', },
    n = { to = '成都城南大街#2', },
  },
},

['成都城子爵府门'] = {
  id = '成都城子爵府门',
  area = '成都城',
  name = '子爵府门',
  desc =  [[你来到一座大宅邸的门前，门上一块金字大匾写着“世袭子爵府”，金漆稍有脱落，看来年代也很久远了。大门敞开着，门口有几个家丁在懒洋洋地坐着，不知这是哪个世家贵族的府第，但是看来主人比较好客。]],
  exit = {
    s = { to = '成都城大厅', },
    n = { to = '成都城东大街#2', },
  },
},

['成都城大道#1N'] = {
  id = '成都城大道#1N',
  area = '成都城',
  name = '大道',
  desc =  [[这是一条由青石铺成的大道，不时地有人骑着马匆匆而过。南边通向著名的蜀都成都了，向北走不远就是青城了。]],
  exit = {
    ne = { to = '成都城大道#2N', },
    s = { to = '成都城大北门', },
  },
},

['成都城大道#2W'] = {
  id = '成都城大道#2W',
  area = '成都城',
  name = '大道',
  desc =  [[这是一条由青石铺成的大道，东边几里处就是著名的蜀都成都了。]],
  exit = {
    w = { to = '大雪山川西土路', },
    e = { to = '成都城大道#1W', },
  },
},

['成都城书房'] = {
  id = '成都城书房',
  area = '成都城',
  name = '书房',
  desc =  [[这是子爵府的书房，并排列着七个架子(shelf)，上面全是棋谱。]],
  exit = {
    e = { to = '成都城大厅', },
  },
},

['成都城高山脚下'] = {
  id = '成都城高山脚下',
  area = '成都城',
  name = '高山脚下',
  desc =  [[这是做极高的山峰，从半山腰起就云雾缭绕，在山顶的悬崖上生长着不少奇珍异草，还有不少罕见的动物出没。此山是有名的药材产地，常年都有无数的采药人忙碌其间。]],
  exit = {
    nu = { to = '成都城山崖', },
    eu = { to = '成都城山崖', },
    w = { to = '成都城大道#2N', },
    su = { to = '成都城山崖', },
  },
},

['成都城城跟路#5'] = {
  id = '成都城城跟路#5',
  area = '成都城',
  name = '城跟路',
  desc =  [[这是靠近成都北门城墙跟的一条小路。东边折向东南，西边是北大街。]],
  exit = {
    w = { to = '成都城北大街#4', },
    e = { to = '成都城城跟路#4', },
  },
},

['成都城大道#2E'] = {
  id = '成都城大道#2E',
  area = '成都城',
  name = '大道',
  desc =  [[这是一条由青石铺成的大道，西南边通向四川的中部，向东北走可以去到湖北。]],
  exit = {
    ne = { to = '成都城大道#3E', },
    sw = { to = '成都城大道#1E', },
  },
},

['成都城城中心'] = {
  id = '成都城城中心',
  area = '成都城',
  name = '城中心',
  desc =  [[这里是成都的城中心，是一个热闹的小广场，铺着青石地面。]],
  exit = {
    e = { to = '成都城东大街#1', },
    s = { to = '成都城南大街#1', },
    w = { to = '成都城西大街#1', },
    n = { to = '成都城北大街#1', },
  },
},

['成都城南门外'] = {
  id = '成都城南门外',
  area = '成都城',
  name = '南门外',
  desc =  [[这是一条由青石铺成的大道，北边就是著名的蜀都成都的大南门了。西南有条土路，直通峨嵋山方向。]],
  exit = {
    sw = { to = '成都城土路#1', },
    n = { to = '成都城大南门', },
  },
},

['成都城墨玉斋'] = {
  id = '成都城墨玉斋',
  area = '成都城',
  name = '墨玉斋',
  desc =  [[这里是热闹的成都城里的一家大钱庄，生意看起来很不错，人来人往，看来住在附近的人都比较富裕。这个钱庄可以兑换通行全国的银票。]],
  exit = {
    e = { to = '成都城南大街#2', },
  },
},

['成都城小南门'] = {
  id = '成都城小南门',
  area = '成都城',
  name = '小南门',
  desc =  [[这是是成都的南侧门，是专门开给城郊的百姓运送货物进出城的。如果想要入滇，可以从这里南下。城门的墙上张贴着一纸告示(gaoshi)。]],
  exit = {
    s = { to = '大理城山路#3N', },
    n = { to = '成都城南侧街#2', },
  },
},

['成都城南大街#1'] = {
  id = '成都城南大街#1',
  area = '成都城',
  name = '南大街',
  desc =  [[这是成都的南大街。南边通向南城门，北边是城中心。]],
  exit = {
    s = { to = '成都城南大街#2', },
    n = { to = '成都城城中心', },
  },
},

['成都城北大街#3'] = {
  id = '成都城北大街#3',
  area = '成都城',
  name = '北大街',
  desc =  [[这是成都的北大街。北边通向北城门，南边显得很繁忙。]],
  exit = {
    s = { to = '成都城北大街#2', },
    n = { to = '成都城北大街#4', },
  },
},

['成都城大厅'] = {
  id = '成都城大厅',
  area = '成都城',
  name = '大厅',
  desc =  [[这是子爵府的大厅，装饰的十分豪华，比较奇怪的是四周的墙上挂着的不是名家字画，却是许多张棋谱，看来主人是很喜欢围棋的。一位衣着华贵的中年人坐在太师椅上，几个家丁在一旁陪侍。]],
  exit = {
    w = { to = '成都城书房', ignore = true, },
    n = { to = '成都城子爵府门', },
  },
},

['成都城东大街#2'] = {
  id = '成都城东大街#2',
  area = '成都城',
  name = '东大街',
  desc =  [[这是成都的东大街。东边通向东城门，西边显得很繁忙。南边有一座大宅邸，不知是哪个世家贵族所居。]],
  exit = {
    e = { to = '成都城东大街#3', },
    w = { to = '成都城东大街#1', },
    s = { to = '成都城子爵府门', },
  },
},

['成都城城跟路#3'] = {
  id = '成都城城跟路#3',
  area = '成都城',
  name = '城跟路',
  desc =  [[这是成都东北城墙跟的一条小路。小路在西北边不远处折而向西，在东南边不远处折而向南。]],
  exit = {
    nw = { to = '成都城城跟路#4', },
    se = { to = '成都城城跟路#2', },
  },
},

['成都城大北门'] = {
  id = '成都城大北门',
  area = '成都城',
  name = '大北门',
  desc =  [[这是就是成都的北城门了。成都地处川中，一向少有战事困扰，所以很少见到有士兵。城门的墙上张贴着一纸告示(gaoshi)。]],
  exit = {
    s = { to = '成都城北大街#4', },
    n = { to = '成都城大道#1N', },
  },
},

['成都城大西门'] = {
  id = '成都城大西门',
  area = '成都城',
  name = '大西门',
  desc =  [[这是就是成都的西城门了。成都地处川中，一向少有战事困扰，所以很少见到有士兵。城门的墙上张贴着一纸告示(gaoshi)。]],
  exit = {
    w = { to = '成都城大道#1W', },
    e = { to = '成都城西大街#2', },
  },
},

['成都城南侧街#1'] = {
  id = '成都城南侧街#1',
  area = '成都城',
  name = '南侧街',
  desc =  [[这是一条普通的青石板路，南边通向南侧门，北边就是东大街。]],
  exit = {
    s = { to = '成都城南侧街#2', },
    n = { to = '成都城东大街#3', },
  },
},

['成都城西大街#2'] = {
  id = '成都城西大街#2',
  area = '成都城',
  name = '西大街',
  desc =  [[这是一条宽阔的青石街道，向东西两头延伸。西边是西城门通向城外。东边显得很繁忙。]],
  exit = {
    e = { to = '成都城西大街#1', },
    w = { to = '成都城大西门', },
    n = { to = '成都城关帝庙', },
  },
},

['成都城北大街#1'] = {
  id = '成都城北大街#1',
  area = '成都城',
  name = '北大街',
  desc =  [[这是成都的北大街。北边通向北城门，南边是城中心。]],
  exit = {
    s = { to = '成都城城中心', },
    n = { to = '成都城北大街#2', },
  },
},

['成都城大道#1W'] = {
  id = '成都城大道#1W',
  area = '成都城',
  name = '大道',
  desc =  [[这是一条由青石铺成的大道，东边不远就是著名的蜀都成都了。]],
  exit = {
    w = { to = '成都城大道#2W', },
    e = { to = '成都城大西门', },
  },
},

['成都城东大街#1'] = {
  id = '成都城东大街#1',
  area = '成都城',
  name = '东大街',
  desc =  [[这是成都的东大街。东边通向东城门，西边是城中心。]],
  exit = {
    e = { to = '成都城东大街#2', },
    w = { to = '成都城城中心', },
    n = { to = '中原材料行', },
  },
},

['成都城南侧街#2'] = {
  id = '成都城南侧街#2',
  area = '成都城',
  name = '南侧街',
  desc =  [[这是一条普通的青石板路，南边是入滇必经的南侧门，北边不远是东大街。]],
  exit = {
    s = { to = '成都城小南门', },
    n = { to = '成都城南侧街#1', },
  },
},

['黑木崖小石屋'] = {
  id = '黑木崖小石屋',
  area = '黑木崖',
  name = '小石屋',
  desc =  [[一间并不起眼的小石屋，里面收拾的干干净净，看来一直还是经常有人来打扫的，你仔细一看，发现左首的墙壁有些与众不同。]],
  exit = {
    e = { to = '黑木崖后花园', },
  },
},

['黑木崖入胜亭'] = {
  id = '黑木崖入胜亭',
  area = '黑木崖',
  name = '入胜亭',
  desc =  [[五老峰边壁上，有一座八角亭台，从此可上观奇云，下览秀石，当真是身入胜境欲不归。好一派景色风光。]],
  exit = {
    n = { to = '黑木崖五老峰', },
  },
},

['黑木崖成德殿'] = {
  id = '黑木崖成德殿',
  area = '黑木崖',
  name = '成德殿',
  desc =  [[殿中摆放着一张大桌，桌上放满了文房四宝，墙上挂满了字画，布置得十分清雅，旁边一道木梯通往上面。]],
  exit = {
    s = { to = '黑木崖大殿', },
    w = { to = '黑木崖朱雀堂', },
    n = { to = '黑木崖长廊#NW', },
  },
},

['黑木崖长廊#S'] = {
  id = '黑木崖长廊#S',
  area = '黑木崖',
  name = '长廊',
  desc =  [[一条长长的过道，左右两旁都是墙，每隔四五丈，墙上都点着一支明晃晃的巨烛。]],
  exit = {
    e = { to = '黑木崖后殿', },
    s = { to = '黑木崖后花园', },
    w = { to = '黑木崖风雷堂', },
    n = { to = '黑木崖大殿', },
  },
},

['黑木崖大殿'] = {
  id = '黑木崖大殿',
  area = '黑木崖',
  name = '大殿',
  desc =  [[进得大殿，只见殿堂阔不过三十来尺，纵深却有三百来尺，长端彼端高设一座椅，那座椅套以淡黄锦缎制成，金黄色丝线绣了九条金龙，捧着中间一个刚从大海之中升起的太阳。那九条金龙张牙舞爪，神采如生，周围缀了不少明珠、钻石，和诸般翡翠宝石，满堂尽是珠光宝气。]],
  exit = {
    e = { to = '黑木崖长廊#E', },
    s = { to = '黑木崖长廊#S', },
    w = { to = '黑木崖长廊#W', },
    n = { to = '黑木崖成德殿', },
  },
},

['黑木崖山道#2'] = {
  id = '黑木崖山道#2',
  area = '黑木崖',
  name = '山道',
  desc =  [[这一路上山，地势极险，脚下是万丈深谷，而山道极之陡峭窄小，倘若一不留神，必将命丧于此。]],
  exit = {
    ed = { to = '黑木崖山道#1', },
    wu = { to = '黑木崖三岔口', },
  },
},

['黑木崖长廊#NW'] = {
  id = '黑木崖长廊#NW',
  area = '黑木崖',
  name = '长廊',
  desc =  [[一条长长的过道，左右两旁都是墙，每隔四五丈，墙上都点着一支明晃晃的巨烛。]],
  exit = {
    e = { to = '黑木崖千秋殿', },
    w = { to = '黑木崖青龙堂', },
    s = { to = '黑木崖成德殿', },
  },
},

['黑木崖眉毛崖'] = {
  id = '黑木崖眉毛崖',
  area = '黑木崖',
  name = '眉毛崖',
  desc =  [[看这眉毛崖两侧弯弯，长满整齐的林木，就象两道浓眉，中间有一条采药人踏出的几乎看不见的小道。]],
  exit = {
    sd = { to = '黑木崖桃花川', },
    n = { to = '黑木崖三岔口', },
  },
},

['黑木崖石阶#1'] = {
  id = '黑木崖石阶#1',
  area = '黑木崖',
  name = '石阶',
  desc =  [[山路突然陡峭，两旁山峰笔立，中间留出一条窄窄的石阶，仅能两人并肩而行。]],
  exit = {
    ed = { to = '黑木崖三岔口', },
    wu = { to = '黑木崖石阶#2', },
  },
},

['黑木崖风雷堂'] = {
  id = '黑木崖风雷堂',
  area = '黑木崖',
  name = '风雷堂',
  desc =  [[此处是日月教风雷堂主处理日常事务之地，室内并没有特别的摆设，只在大堂摆放着一张太师椅。]],
  exit = {
    e = { to = '黑木崖长廊#S', },
    n = { to = '黑木崖长廊#W', },
  },
},

['黑木崖练功房'] = {
  id = '黑木崖练功房',
  area = '黑木崖',
  name = '练功房',
  desc =  [[一间宽敞的房间，空荡荡的没有任何摆设，地下铺着坚实的青石板。]],
  exit = {
    s = { to = '黑木崖长廊#N', },
  },
},

['黑木崖日月坪'] = {
  id = '黑木崖日月坪',
  area = '黑木崖',
  name = '日月坪',
  desc =  [[这里是半山的一片小土坪，离崖顶还有一断路途，可到这已经没有路上去，面前是如镜般的峭壁，仰头而望，但见崖顶依稀耸立着楼阁，宛如仙境。崖顶吊着一只大竹篓(lou)，看来要上崖顶要靠这样东西了。]],
  exit = {
    ed = { to = '黑木崖石门', },
    enter = { to = '黑木崖竹篓', cmd = 'zong', unstable = true, handler = 'fly_across', no_wander = true, },
  },
},

['黑木崖百丈泉'] = {
  id = '黑木崖百丈泉',
  area = '黑木崖',
  name = '百丈泉',
  desc =  [[崖瀑下有一道百余丈长的清泉，说来也怪，东面玉屏瀑上水色流动，弹花飞溅，而这百丈泉却又是平滑如镜，丝毫没有半点涟漪。]],
  exit = {
    s = { to = '黑木崖千古石', },
    eu = { to = '黑木崖玉屏瀑', },
  },
},

['黑木崖卧云崖'] = {
  id = '黑木崖卧云崖',
  area = '黑木崖',
  name = '卧云崖',
  desc =  [[这是黑木崖的最西端卧云崖，山崖正巧高于云层一截，真有人在云上走，云自脚下飘的雅致。]],
  exit = {
    sd = { to = '黑木崖观瀑亭', },
  },
},

['黑木崖长廊#N'] = {
  id = '黑木崖长廊#N',
  area = '黑木崖',
  name = '长廊',
  desc =  [[一条长长的过道，左右两旁都是墙，每隔四五丈，墙上都点着一支明晃晃的巨烛。]],
  exit = {
    e = { to = '黑木崖长廊#NE', },
    s = { to = '黑木崖书房', },
    w = { to = '黑木崖千秋殿', },
    n = { to = '黑木崖练功房', },
  },
},

['黑木崖长滩'] = {
  id = '黑木崖长滩',
  area = '黑木崖',
  name = '长滩',
  desc =  [[这片长滩不时有日月教教众乘船(boat)往来，滩头插着一面日月教的旗帜，表明这里是日月教的所控制的，所以尽管滩面上往来的船只很多，但是并没有船敢在这里停留，要过对岸只有靠日月教自己的船只了。]],
  exit = {
    e = { to = '黑木崖山道#1', },
    enter = { to = '黑木崖渡船', unstable = true, handler = 'embark', no_wander = true, },
    hidden = { to = '黑木崖猩猩滩', cmd = 'dutan', cond = 'player.enable.dodge and player.enable.dodge.level >= 100', },
  },
},

['黑木崖一品崖'] = {
  id = '黑木崖一品崖',
  area = '黑木崖',
  name = '一品崖',
  desc =  [[走过五老峰，前面是一道要命的峭壁“一品崖”，呼呼的山风阵阵吹来，生怕鞋一滑被吹落下去，那就不大好赏景了。]],
  exit = {
    s = { to = '黑木崖五老峰', },
  },
},

['黑木崖观瀑亭'] = {
  id = '黑木崖观瀑亭',
  area = '黑木崖',
  name = '观瀑亭',
  desc =  [[玉屏瀑侧的这座观瀑亭，真是绝好的览秀圣地，站在此处，飞溅的玉屏瀑，如镜的百丈泉，无不尽收眼底。]],
  exit = {
    nu = { to = '黑木崖卧云崖', },
    s = { to = '黑木崖玉屏瀑', },
  },
},

['黑木崖索道'] = {
  id = '黑木崖索道',
  area = '黑木崖',
  name = '索道',
  desc =  [[来到这条索道，两边是深不见底的崖谷，岩壁两侧设有铁索以作扶拦。]],
  exit = {
    wd = { to = '黑木崖三岔口', },
  },
},

['黑木崖牌楼'] = {
  id = '黑木崖牌楼',
  area = '黑木崖',
  name = '牌楼',
  desc =  [[面前一座汉白玉的巨大牌楼，牌楼上四个大金色字“泽被苍生”，发出闪闪金光，不由得令人肃然起敬。]],
  exit = {
    e = { to = '黑木崖厢房', },
    w = { to = '黑木崖崖顶', },
    n = { to = '黑木崖石板路', },
  },
},

['黑木崖休息室'] = {
  id = '黑木崖休息室',
  area = '黑木崖',
  name = '休息室',
  desc =  [[这是日月神教女弟子休息室，是间整洁的厢房，光线很足。是读书的好地方，房里有几张收拾得舒舒服服的大床，看着就让人想睡觉。]],
  exit = {
    s = { to = '黑木崖长廊#NE', },
  },
},

['黑木崖山道#1'] = {
  id = '黑木崖山道#1',
  area = '黑木崖',
  name = '山道',
  desc =  [[西面是一座高山，地势极之险峻，一条窄小陡峭的山道通往山上，东边山脚是一片长滩。]],
  exit = {
    w = { to = '黑木崖长滩', },
    wu = { to = '黑木崖山道#2', },
  },
},

['黑木崖仙人洞'] = {
  id = '黑木崖仙人洞',
  area = '黑木崖',
  name = '仙人洞',
  desc =  [[走过三岔口，首先就看到一座石洞，衣带飘摇，仙风道骨，直似仙家下界，博览无遗。]],
  exit = {
    wd = { to = '黑木崖仙人指路', },
  },
},

['黑木崖膳食房'] = {
  id = '黑木崖膳食房',
  area = '黑木崖',
  name = '膳食房',
  desc =  [[只见以经有十数名教徒分别围着几张八仙桌在进食，墙角有一张桌子是空着的，周围摆着几张椅子，要填饱肚皮可以在那坐下。]],
  exit = {
    w = { to = '黑木崖长廊#NE', },
  },
},

['黑木崖长廊#W'] = {
  id = '黑木崖长廊#W',
  area = '黑木崖',
  name = '长廊',
  desc =  [[一路走过，只见走廊上数百武士排列两旁，手中各挺一把明晃晃的长刀，交叉平举，往来之人都要弓腰低头而过，数百柄长刀中只要有一柄突然砍落，便不免身首异处。]],
  exit = {
    e = { to = '黑木崖大殿', },
    s = { to = '黑木崖风雷堂', },
    w = { to = '黑木崖前殿', },
    n = { to = '黑木崖白虎堂', },
  },
},

['黑木崖玉屏瀑'] = {
  id = '黑木崖玉屏瀑',
  area = '黑木崖',
  name = '玉屏瀑',
  desc =  [[来到玉屏瀑，这里的景观真是无以比拟，一面宽宽大大晶莹如玉的瀑布自天上泻下来，传说这是天上仙娥们在清洗天宫的玉屏风所流下地界的天池中的圣水。]],
  exit = {
    e = { to = '黑木崖碧血崖', },
    wd = { to = '黑木崖百丈泉', },
    n = { to = '黑木崖观瀑亭', },
  },
},

['黑木崖凉亭'] = {
  id = '黑木崖凉亭',
  area = '黑木崖',
  name = '凉亭',
  desc =  [[你行到近处，只见一座小小凉亭，那是旷野中供行旅休息之用，也许年久失修，构筑颇为简陋。]],
  exit = {
    w = { to = '黑木崖石道#2', },
  },
},

['黑木崖猩猩滩'] = {
  id = '黑木崖猩猩滩',
  area = '黑木崖',
  name = '猩猩滩',
  desc =  [[只见一片长滩，山石殷红如血，水流湍急，这便是有名的猩猩滩，对面岸边停泊着几艘小船(boat) ，要过对面就要靠这几艘小船了。]],
  exit = {
    enter = { to = '黑木崖渡船', unstable = true, handler = 'embark', no_wander = true, },
    eu = { to = '黑木崖石道#2', },
    hidden = { to = '黑木崖长滩', cmd = 'dutan', cond = 'player.enable.dodge and player.enable.dodge.level >= 100', },
  },
},

['黑木崖千古石'] = {
  id = '黑木崖千古石',
  area = '黑木崖',
  name = '千古石',
  desc =  [[百丈泉边有这一方草坪，草坪中耸立着一块翠绿翠绿的巨石，传言已有千年之久，石上边缘处不知何人有书红字“千古石”。]],
  exit = {
    n = { to = '黑木崖百丈泉', },
  },
},

['黑木崖白虎堂'] = {
  id = '黑木崖白虎堂',
  area = '黑木崖',
  name = '白虎堂',
  desc =  [[大堂内摆放着各种各样的武器，还有不同大小的沙袋、石锁、石盘等器具，中央还竖立着几十根高低不等的木桩，教中弟子都在此练习武艺。 ]],
  exit = {
    e = { to = '黑木崖朱雀堂', },
    s = { to = '黑木崖长廊#W', },
  },
},

['黑木崖石道#2'] = {
  id = '黑木崖石道#2',
  area = '黑木崖',
  name = '石道',
  desc =  [[一路上日月教教众把守严密，经过两处山道，来到一处水滩之前，西面有一道石阶通往水滩。]],
  exit = {
    e = { to = '黑木崖凉亭', },
    wd = { to = '黑木崖猩猩滩', },
    s = { to = '黑木崖石道#1', },
  },
},

['黑木崖前殿'] = {
  id = '黑木崖前殿',
  area = '黑木崖',
  name = '前殿',
  desc =  [[来到一座雄伟的殿堂，大殿两旁分别立着八尊威武的塑像，高约八尺，手中持着不同的武器，神态动作各异，而大殿当中设有一座祭坛，坛上燃烧着蓝色的火焰，异常诡秘。]],
  exit = {
    w = { to = '黑木崖石板路', },
    e = { to = '黑木崖长廊#W', },
  },
},

['黑木崖书房'] = {
  id = '黑木崖书房',
  area = '黑木崖',
  name = '书房',
  desc =  [[这里是杨莲亭的书房，书案上面摆着几摞书。墙边立着一个书架，里面层层叠叠的摆放着一摞一摞的书。]],
  exit = {
    n = { to = '黑木崖长廊#N', },
  },
},

['黑木崖紫云崖'] = {
  id = '黑木崖紫云崖',
  area = '黑木崖',
  name = '紫云崖',
  desc =  [[此处奇景又是一绝，崖岭弯曲回转，东方红日露出云层半截一映，满天云雾霎时紫色一片，外深内淡，仿佛这崖边的云彩原本就是紫色。]],
  exit = {
    w = { to = '黑木崖五老峰', },
    e = { to = '黑木崖桃花川', },
  },
},

['黑木崖千秋殿'] = {
  id = '黑木崖千秋殿',
  area = '黑木崖',
  name = '千秋殿',
  desc =  [[殿内摆放着许多大大小小的铁箱，每个箱子都用铁锁紧紧地锁着，箱子之间又用铁链相互连着，看来箱子里面装着的物件非常重要。]],
  exit = {
    w = { to = '黑木崖长廊#NW', },
    e = { to = '黑木崖长廊#N', },
  },
},

['黑木崖碧血崖'] = {
  id = '黑木崖碧血崖',
  area = '黑木崖',
  name = '碧血崖',
  desc =  [[这是碧血崖，往东可观黑木崖上秀水玉屏瀑，往西可至黑木崖总舵。]],
  exit = {
    e = { to = '黑木崖五老峰', },
    w = { to = '黑木崖玉屏瀑', },
    ed = { to = '黑木崖仙人指路', },
  },
},

['黑木崖竹篓'] = {
  id = '黑木崖竹篓',
  area = '黑木崖',
  name = '竹篓',
  desc =  [[坐在竹篓当中，眼见轻烟薄雾从身旁飘过，仰头向黑木崖上望去，但见那座汉玉牌楼发出耀眼的光芒。]],
  exit = {
    out2 = { to = '黑木崖日月坪', cost = 50, unstable = true, handler = 'disembark', },
    out = { to = '黑木崖崖顶', cost = 50, unstable = true, handler = 'disembark', },
  },
},

['黑木崖后花园'] = {
  id = '黑木崖后花园',
  area = '黑木崖',
  name = '后花园',
  desc =  [[此处种满了许多不知名的奇花异草，在绝顶之上有这样的景色，真恍如飘渺仙景，令人疑幻疑真，西首是一间小石屋，但似乎没有人居住。]],
  exit = {
    w = { to = '黑木崖小石屋', },
    n = { to = '黑木崖长廊#S', },
  },
},

['黑木崖石门'] = {
  id = '黑木崖石门',
  area = '黑木崖',
  name = '石门',
  desc =  [[    走到一道大石门前，只见两旁刻着两行大字，右首是“文成武德”，左首是“仁义英明”，横额上刻着                     日   月   光   明四个大红字。]],
  exit = {
    ed = { to = '黑木崖石阶#2', },
    wu = { to = '黑木崖日月坪', unstable = true, handler = 'hmy_shimen', },
  },
},

['黑木崖石板路'] = {
  id = '黑木崖石板路',
  area = '黑木崖',
  name = '石板路',
  desc =  [[脚下是一块块大青石板铺设而成的石板路，每块石板都有十尺见方，巨大无比，沿路都插满了日月教的旗号，由此一直伸延到一座雄伟的楼阁之前。]],
  exit = {
    e = { to = '黑木崖前殿', },
    s = { to = '黑木崖牌楼', },
  },
},

['黑木崖五老峰'] = {
  id = '黑木崖五老峰',
  area = '黑木崖',
  name = '五老峰',
  desc =  [[此处有五坐石峰紧紧相靠，石峰自上而下有数百年的草藤随风飘洒，就象年逾古稀的五位老朋友在叙旧一般。这里远离人烟，动物渐多，眼前就有一对猴群(houqun)跳上跳下。]],
  exit = {
    e = { to = '黑木崖紫云崖', },
    s = { to = '黑木崖入胜亭', },
    w = { to = '黑木崖碧血崖', },
    n = { to = '黑木崖一品崖', },
  },
},

['黑木崖后殿'] = {
  id = '黑木崖后殿',
  area = '黑木崖',
  name = '后殿',
  desc =  [[殿中无窗，殿口点着明晃晃的蜡烛，当中摆放一张大长桌，两旁摆满了各式椅子，一看就知道这里是教中重要人物议事谋策的地方。]],
  exit = {
    w = { to = '黑木崖长廊#S', },
    n = { to = '黑木崖长廊#E', },
  },
},

['黑木崖长廊#E'] = {
  id = '黑木崖长廊#E',
  area = '黑木崖',
  name = '长廊',
  desc =  [[一路走过，只见走廊上数百武士排列两旁，手中各挺一把明晃晃的长刀，交叉平举，往来之人都要弓腰低头而过，数百柄长刀中只要有一柄突然砍落，便不免身首异处。]],
  exit = {
    e = { to = '黑木崖议事厅', },
    s = { to = '黑木崖后殿', },
    w = { to = '黑木崖大殿', },
    n = { to = '黑木崖长廊#NE', },
  },
},

['黑木崖桃花川'] = {
  id = '黑木崖桃花川',
  area = '黑木崖',
  name = '桃花川',
  desc =  [[走到桃花川，前面一派秀色奇石，一琢琢淡红的圆石自峰顶铺将下去，宛若片片桃花，连成桃林一绝。]],
  exit = {
    nu = { to = '黑木崖眉毛崖', },
    w = { to = '黑木崖紫云崖', },
    wu = { to = '黑木崖紫石崖', },
  },
},

['黑木崖仙人指路'] = {
  id = '黑木崖仙人指路',
  area = '黑木崖',
  name = '仙人指路',
  desc =  [[这仙人指路其实是东面仙人洞处垂下的一道石梁，远远搭上西边的莲花崖。]],
  exit = {
    eu = { to = '黑木崖仙人洞', },
    wu = { to = '黑木崖碧血崖', },
  },
},

['黑木崖石阶#2'] = {
  id = '黑木崖石阶#2',
  area = '黑木崖',
  name = '石阶',
  desc =  [[越往上，山势越陡峭，中间的石阶越窄，仅能一人行走，从这里往上望，隐约望见一座石门。]],
  exit = {
    ed = { to = '黑木崖石阶#1', },
    wu = { to = '黑木崖石门', },
  },
},

['黑木崖青龙堂'] = {
  id = '黑木崖青龙堂',
  area = '黑木崖',
  name = '青龙堂',
  desc =  [[大堂设许多各式的刑具，在微弱的烛光之下，散发着冰冷的寒光，令人越看越是心中发毛，想像受刑之人那种惨状及那凄惨的叫声，心中更感到一阵惊怖。]],
  exit = {
    e = { to = '黑木崖长廊#NW', },
  },
},

['黑木崖崖顶'] = {
  id = '黑木崖崖顶',
  area = '黑木崖',
  name = '崖顶',
  desc =  [[崖顶当中安放着一巨大的绞索绞盘，绞盘吊着一只大竹篓（lou)，看来是上下黑木崖的主要工具。日光从东射来，照上面前一座汉白玉的巨大牌楼，金壁辉煌，刹是壮观。]],
  exit = {
    e = { to = '黑木崖牌楼', },
    enter = { to = '黑木崖竹篓', cmd = 'zong', unstable = true, handler = 'fly_across', no_wander = true, },
  },
},

['黑木崖紫石崖'] = {
  id = '黑木崖紫石崖',
  area = '黑木崖',
  name = '紫石崖',
  desc =  [[片片粉石中忽起出一处冲天石崖，通体却是紫色，阳光映照下，石体闪闪欲动，非常陡峭。]],
  exit = {
    ed = { to = '黑木崖桃花川', },
  },
},

['黑木崖三岔口'] = {
  id = '黑木崖三岔口',
  area = '黑木崖',
  name = '三岔口',
  desc =  [[来到三岔口，往西南和西北方向就是日月神教石阶，山道十分陡峭。]],
  exit = {
    ed = { to = '黑木崖山道#2', },
    eu = { to = '黑木崖索道', },
    s = { to = '黑木崖眉毛崖', },
    wu = { to = '黑木崖石阶#1', },
  },
},

['黑木崖厢房'] = {
  id = '黑木崖厢房',
  area = '黑木崖',
  name = '厢房',
  desc =  [[房内布置得十分舒适，分别摆放着几张大床，供日月教徒们休息之用。]],
  exit = {
    w = { to = '黑木崖牌楼', },
  },
},

['黑木崖石道#1'] = {
  id = '黑木崖石道#1',
  area = '黑木崖',
  name = '石道',
  desc =  [[一路往北行，中间仅有一道宽约五尺的石道，两边石壁如墙，一路上都有日月教徒模样的人物在走动，对往来的路人都严密监视。]],
  exit = {
    se = { to = '平定州土路#2N', },
    n = { to = '黑木崖石道#2', },
  },
},

['黑木崖长廊#NE'] = {
  id = '黑木崖长廊#NE',
  area = '黑木崖',
  name = '长廊',
  desc =  [[一条长长的过道，左右两旁都是墙，每隔四五丈，墙上都点着一支明晃晃的巨烛。]],
  exit = {
    e = { to = '黑木崖膳食房', },
    s = { to = '黑木崖长廊#E', },
    w = { to = '黑木崖长廊#N', },
    n = { to = '黑木崖休息室', cond = 'player.gender == "female"', },
  },
},

['黑木崖议事厅'] = {
  id = '黑木崖议事厅',
  area = '黑木崖',
  name = '议事厅',
  desc =  [[这里是日月神教的聚议厅，是教中议事的地方。时时可以见到教主同教中各位堂主长老在此共商大计，教中各堂下属都皆尽叹服。]],
  exit = {
    w = { to = '黑木崖长廊#E', },
  },
},

['黑木崖渡船'] = {
  id = '黑木崖渡船',
  area = '黑木崖',
  name = '渡船',
  desc =  [[一叶小舟，一次就能载七、八个人。一名三十多岁日月教徒装扮的艄公手持长竹篙，正在船尾撑着船，这艄公臂力惊人，小舟在他的操控之下，一支箭般飞快地射向对岸。]],
  exit = {
    out2 = { to = '黑木崖长滩', cost = 50, unstable = true, handler = 'disembark', },
    out = { to = '黑木崖猩猩滩', cost = 50, unstable = true, handler = 'disembark', },
  },
},

['黑木崖朱雀堂'] = {
  id = '黑木崖朱雀堂',
  area = '黑木崖',
  name = '朱雀堂',
  desc =  [[堂内只点着两盏油灯，两朵火焰忽明忽暗，相距既远，火光又暗，依稀有几个人在打座练功，但相貌如何便瞧不清楚了。]],
  exit = {
    w = { to = '黑木崖白虎堂', },
    e = { to = '黑木崖成德殿', },
  },
},

['曼佗罗山庄花丛中#2W'] = {
  id = '曼佗罗山庄花丛中#2W',
  area = '曼佗罗山庄',
  name = '花丛中',
  desc =  [[你信步观赏, 只见花林中除山茶花外更无别样花卉, 连最常见的牵牛花，月月红, 蔷薇之类也是一朵都无。走出数十丈后, 只见山茶品种渐多, 偶而也有一两本还算不错, 却也栽种不得其法。]],
  exit = {
    e = { to = '曼佗罗山庄花丛中#1S', },
    n = { to = '曼佗罗山庄花丛中#1W', },
  },
},

['曼佗罗山庄长廊#4E'] = {
  id = '曼佗罗山庄长廊#4E',
  area = '曼佗罗山庄',
  name = '长廊',
  desc =  [[这是一条长廊，上面画着江南秀美的工笔画。绿色的柱子朱红色的琉璃瓦，使得你不由得对江南艺术工匠的创造惊叹不已。在长廊里面，丫鬟、家丁们走来走去，都忙着自己的事情，南面是长廊的延伸。]],
  exit = {
    e = { to = '曼佗罗山庄厨房', },
    w = { to = '曼佗罗山庄长廊#3E', },
    s = { to = '曼佗罗山庄长廊#5E', },
  },
},

['曼佗罗山庄长廊#4W'] = {
  id = '曼佗罗山庄长廊#4W',
  area = '曼佗罗山庄',
  name = '长廊',
  desc =  [[这是一条长廊，上面画着江南秀美的工笔画。绿色的柱子朱红色的琉璃瓦，使得你不由得对江南艺术工匠的创造惊叹不已。在长廊里面，丫鬟、家丁们走来走去，都忙着自己的事情，不敢有一点怠慢。北西两面面是长廊的延伸，东面是后院，南面是一间厢房。 ]],
  exit = {
    e = { to = '曼佗罗山庄后院', },
    s = { to = '曼佗罗山庄厢房', },
    w = { to = '曼佗罗山庄长廊#5W', },
    n = { to = '曼佗罗山庄长廊#3W', },
  },
},

['曼佗罗山庄樱桃园#2'] = {
  id = '曼佗罗山庄樱桃园#2',
  area = '曼佗罗山庄',
  name = '樱桃园',
  desc =  [[这里是一个樱桃园，园子里种了大片大片的樱桃树，每到春天，这里的树上都开满了粉红的樱桃花，非常漂亮。从这里向西望去，那边也是一个樱桃园。]],
  exit = {
    s = { to = '曼佗罗山庄娘缳玉洞', },
    w = { to = '曼佗罗山庄樱桃园#1', },
    n = { to = '曼佗罗山庄秘道', },
  },
},

['曼佗罗山庄树藤'] = {
  id = '曼佗罗山庄树藤',
  area = '曼佗罗山庄',
  name = '树藤',
  desc =  [[这里长满了树藤，一枝一枝的树藤(teng)遮住了阳光，树藤盘根错节，你只能在树藤上爬上爬下。]],
  exit = {
    hidden = { to = '曼佗罗山庄后花园', cmd = 'pa down', },
  },
},

['曼佗罗山庄小径#1W'] = {
  id = '曼佗罗山庄小径#1W',
  area = '曼佗罗山庄',
  name = '小径',
  desc =  [[一条曲曲折折用鹅卵石铺成的小径, 路两旁绿柳成阴, 一处处山石花木点缀在其中。你走在石地上，啪嗒啪嗒的发出清脆的响声，往北面看去是一片柳树林，南面是一条长廊。东面是小径的延伸。]],
  exit = {
    e = { to = '曼佗罗山庄小径#2N', },
    s = { to = '曼佗罗山庄长廊#3W', },
    w = { to = '曼佗罗山庄小石桥', },
    n = { to = '曼佗罗山庄柳树林#W', },
  },
},

['曼佗罗山庄长廊#5E'] = {
  id = '曼佗罗山庄长廊#5E',
  area = '曼佗罗山庄',
  name = '长廊',
  desc =  [[这是一条长廊，上面画着江南秀美的工笔画。绿色的柱子朱红色的琉璃瓦，使得你不由得对江南艺术工匠的创造惊叹不已。在长廊里面，丫鬟、家丁们走来走去，都忙着自己的事情，西面是一间客厅，南面是长廊的延伸。]],
  exit = {
    e = { to = '曼佗罗山庄闺房', },
    s = { to = '曼佗罗山庄长廊#6E', },
    w = { to = '曼佗罗山庄客厅', },
    n = { to = '曼佗罗山庄长廊#4E', },
  },
},

['曼佗罗山庄娘缳玉洞'] = {
  id = '曼佗罗山庄娘缳玉洞',
  area = '曼佗罗山庄',
  name = '娘缳玉洞',
  desc =  [[这是曼佗罗山庄存放武功秘籍的地方，一排排书架上整齐的摆放着各种书籍。一位美丽的姑娘手里拿着本书，坐在书桌前，低头研读着。]],
  exit = {
    n = { to = '曼佗罗山庄樱桃园#2', },
  },
},

['曼佗罗山庄柳树林#N'] = {
  id = '曼佗罗山庄柳树林#N',
  area = '曼佗罗山庄',
  name = '柳树林',
  desc =  [[这是一片碧绿的柳树林，草地中间有两棵大树(tree)，看上去枝叶茂盛，树上几只小鸟唧唧喳喳的叫个不停。]],
  exit = {
    s = { to = '曼佗罗山庄柳树林#S', },
    hidden = { to = '曼佗罗山庄树上', cmd = 'yue tree', },
  },
},

['曼佗罗山庄树上'] = {
  id = '曼佗罗山庄树上',
  area = '曼佗罗山庄',
  name = '树上',
  desc =  [[你跳上枝头，一片碧绿的草地映入眼帘，树的那边有一枝更大的树枝，不知能不能越过去。]],
  exit = {
    hidden = { to = '曼佗罗山庄柳树林#N', cmd = 'jump down', },
  },
},

['曼佗罗山庄小径#2N'] = {
  id = '曼佗罗山庄小径#2N',
  area = '曼佗罗山庄',
  name = '小径',
  desc =  [[一条曲曲折折用鹅卵石铺成的小径, 路两旁绿柳成阴, 一处处山石花木点缀在其中。你走在石地上，啪嗒啪嗒的发出清脆的响声，往北面看去是一片柳树林，南面和东面是小径的延伸。]],
  exit = {
    e = { to = '曼佗罗山庄小径#1E', },
    s = { to = '曼佗罗山庄小径#1N', },
    w = { to = '曼佗罗山庄小径#1W', },
    n = { to = '曼佗罗山庄柳树林#S', },
  },
},

['曼佗罗山庄樱桃园#1'] = {
  id = '曼佗罗山庄樱桃园#1',
  area = '曼佗罗山庄',
  name = '樱桃园',
  desc =  [[这是一片樱桃园，树上开满了樱桃花。]],
  exit = {
    e = { to = '曼佗罗山庄樱桃园#2', },
    s = { to = '曼佗罗山庄娘缳玉洞', },
    w = { to = '曼佗罗山庄樱桃园#1', },
    n = { to = '曼佗罗山庄樱桃园#1', },
  },
},

['曼佗罗山庄秘道'] = {
  id = '曼佗罗山庄秘道',
  area = '曼佗罗山庄',
  name = '秘道',
  desc =  [[这里土地潮湿，墙上有一束火把。]],
  exit = {
    s = { to = '曼佗罗山庄樱桃园#2', },
    n = { to = '曼佗罗山庄后花园', },
  },
},

['曼佗罗山庄长廊#2E'] = {
  id = '曼佗罗山庄长廊#2E',
  area = '曼佗罗山庄',
  name = '长廊',
  desc =  [[这是一条长廊，上面画着江南秀美的工笔画。绿色的柱子朱红色的琉璃瓦，使得你不由得对江南艺术工匠的创造惊叹不已。在长廊里面，丫鬟、家丁们走来走去，都忙着自己的事情，不敢有一点怠慢。东面是一座小亭子。]],
  exit = {
    w = { to = '曼佗罗山庄长廊#1E', },
    eu = { to = '曼佗罗山庄亭子', },
  },
},

['曼佗罗山庄花丛中#2E'] = {
  id = '曼佗罗山庄花丛中#2E',
  area = '曼佗罗山庄',
  name = '花丛中',
  desc =  [[你信步观赏, 只见花林中除山茶花外更无别样花卉, 连最常见的牵牛花，月月红, 蔷薇之类也是一朵都无。走出数十丈后, 只见山茶品种渐多, 偶而也有一两本还算不错, 却也栽种不得其法。南面就是前院。]],
  exit = {
    w = { to = '曼佗罗山庄花丛中#1E', },
    s = { to = '曼佗罗山庄前院', },
  },
},

['曼佗罗山庄花丛中#1S'] = {
  id = '曼佗罗山庄花丛中#1S',
  area = '曼佗罗山庄',
  name = '花丛中',
  desc =  [[你信步观赏, 只见花林中除山茶花外更无别样花卉, 连最常见的牵牛花，月月红, 蔷薇之类也是一朵都无。走出数十丈后, 只见山茶品种渐多, 偶而也有一两本还算不错, 却也栽种不得其法。东面就是庄门了。]],
  exit = {
    e = { to = '曼佗罗山庄庄门', },
    w = { to = '曼佗罗山庄花丛中#2W', },
    n = { to = '曼佗罗山庄岸边#1', },
  },
},

['曼佗罗山庄厨房'] = {
  id = '曼佗罗山庄厨房',
  area = '曼佗罗山庄',
  name = '厨房',
  desc =  [[这是一间小厨房, 虽然不大, 但是锅碗瓢盆, 油盐酱醋, 到很奇全。灶台上堆满了新鲜瓜果蔬菜, 活鱼活虾, 不仅不脏不乱, 还十分干净整齐。]],
  exit = {
    w = { to = '曼佗罗山庄长廊#4E', },
  },
},

['曼佗罗山庄后院'] = {
  id = '曼佗罗山庄后院',
  area = '曼佗罗山庄',
  name = '后院',
  desc =  [[穿过一个半月形的拱门, 你来到一座小楼之前。小楼檐下一块匾额, 写着“云锦楼”三个墨绿毫字, 楼下前后左右种的都是茶花。但这些茶花都不过是三四流货色, 和这精致的楼阁亭榭相比, 未免不衬。左右面是一条长廊，南面是云锦楼。]],
  exit = {
    e = { to = '曼佗罗山庄长廊#3E', },
    s = { to = '曼佗罗山庄云锦楼', },
    w = { to = '曼佗罗山庄长廊#4W', },
    n = { to = '曼佗罗山庄小径#1N', },
  },
},

['曼佗罗山庄前院'] = {
  id = '曼佗罗山庄前院',
  area = '曼佗罗山庄',
  name = '前院',
  desc =  [[这里是曼陀罗山庄的前院, 只见丫鬟, 婢女人来人往穿梭不息, 且个个步法轻灵, 显然武功不弱！院子的东面是一座小石桥，南面是一条长廊，往西走就到了庄门。]],
  exit = {
    e = { to = '曼佗罗山庄小石桥', },
    s = { to = '曼佗罗山庄长廊#1W', },
    w = { to = '曼佗罗山庄庄门', },
    n = { to = '曼佗罗山庄花丛中#2E', },
  },
},

['曼佗罗山庄长廊#3E'] = {
  id = '曼佗罗山庄长廊#3E',
  area = '曼佗罗山庄',
  name = '长廊',
  desc =  [[这是一条长廊，上面画着江南秀美的工笔画。绿色的柱子朱红色的琉璃瓦，使得你不由得对江南艺术工匠的创造惊叹不已。在长廊里面，丫鬟、家丁们走来走去，都忙着自己的事情，东面是长廊的延伸，南面是客厅，西面就是后院。]],
  exit = {
    e = { to = '曼佗罗山庄长廊#4E', },
    s = { to = '曼佗罗山庄客厅', },
    w = { to = '曼佗罗山庄后院', },
    n = { to = '曼佗罗山庄长廊#1E', },
  },
},

['曼佗罗山庄小径#1S'] = {
  id = '曼佗罗山庄小径#1S',
  area = '曼佗罗山庄',
  name = '小径',
  desc =  [[一条曲曲折折用鹅卵石铺成的小径, 路两旁绿柳成阴, 一处处山石花木点缀在其中。你走在石地上，啪嗒啪嗒的发出清脆的响声，南面是小径的延伸。]],
  exit = {
    s = { to = '曼佗罗山庄小径#2S', },
    n = { to = '曼佗罗山庄庄门', },
  },
},

['曼佗罗山庄亭子'] = {
  id = '曼佗罗山庄亭子',
  area = '曼佗罗山庄',
  name = '亭子',
  desc =  [[这是个很小的亭子，但是能够看到几乎全部的景色，远处有一片樱桃园。湖中几条小舟在碧绿的湖面上往来穿梭，湖中有一座木桥通向湖中的亭子。在水池的假山上有一个黑乎乎的洞穴。 ]],
  exit = {
    wd = { to = '曼佗罗山庄长廊#2E', },
  },
},

['曼佗罗山庄厢房'] = {
  id = '曼佗罗山庄厢房',
  area = '曼佗罗山庄',
  name = '厢房',
  desc =  [[这是一间厢房, 里面摆设简单, 只有一张床, 一张书桌和一把椅子。]],
  exit = {
    e = { to = '曼佗罗山庄云锦楼', },
    w = { to = '曼佗罗山庄长廊#6W', },
    n = { to = '曼佗罗山庄长廊#4W', },
  },
},

['曼佗罗山庄花肥房'] = {
  id = '曼佗罗山庄花肥房',
  area = '曼佗罗山庄',
  name = '花肥房',
  desc =  [[石屋黑恫恫的, 只见一个人被绑在一根铁柱子上, 口里塞满了东西, 眼泪汪汪的, 却说不出话来。再看两旁时, 只见一个弓腰曲背的老婆子手里拿着一柄雪亮的长刀, 身旁一锅沸水, 煮得直冒热气。]],
  exit = {
    w = { to = '曼佗罗山庄长廊#7W', },
    e = { to = '曼佗罗山庄后花园', },
  },
},

['曼佗罗山庄闺房'] = {
  id = '曼佗罗山庄闺房',
  area = '曼佗罗山庄',
  name = '闺房',
  desc =  [[这里是山庄庄主女儿的闺房，里面透着一股醉人的少女芳香，令你陶醉。在闺房的一角摆放着一张梳妆台，台上摆着一些女人用的胭脂粉和用来涂抹嘴唇的香粉，以及一瓶玉露。房屋的另一角摆放着一张闺床，一缕青纱低垂下来。墙上有一个窗户，一扇窗子(window)大敞着。]],
  exit = {
    w = { to = '曼佗罗山庄长廊#5E', },
    hidden = { to = '曼佗罗山庄樱桃园#1', cmd = ' jump window', },
  },
},

['曼佗罗山庄小径#2S'] = {
  id = '曼佗罗山庄小径#2S',
  area = '曼佗罗山庄',
  name = '小径',
  desc =  [[一条曲曲折折用鹅卵石铺成的小径, 路两旁绿柳成阴, 一处处山石花木点缀在其中。你走在石地上，啪嗒啪嗒的发出清脆的响声，北面是小径的延伸，南面就到了岸边。]],
  exit = {
    s = { to = '曼佗罗山庄岸边#2', },
    n = { to = '曼佗罗山庄小径#1S', },
  },
},

['曼佗罗山庄长廊#6E'] = {
  id = '曼佗罗山庄长廊#6E',
  area = '曼佗罗山庄',
  name = '长廊',
  desc =  [[这是一条长廊，上面画着江南秀美的工笔画。绿色的柱子朱红色的琉璃瓦，使得你不由得对江南艺术工匠的创造惊叹不已。在长廊里面，丫鬟、家丁们走来走去，都忙着自己的事情，西面是杂货室，北面是长廊的延伸。]],
  exit = {
    w = { to = '曼佗罗山庄杂货室', },
    n = { to = '曼佗罗山庄长廊#5E', },
  },
},

['曼佗罗山庄柳树林#S'] = {
  id = '曼佗罗山庄柳树林#S',
  area = '曼佗罗山庄',
  name = '柳树林',
  desc =  [[这是一片碧绿的柳树林，一片碧绿的颜色，柳树看上去枝叶茂盛，树上几只小鸟唧唧喳喳的叫个不停，柳条随着微风轻轻摆动。]],
  exit = {
    e = { to = '曼佗罗山庄柳树林#E', },
    s = { to = '曼佗罗山庄小径#2N', },
    w = { to = '曼佗罗山庄柳树林#W', },
    n = { to = '曼佗罗山庄柳树林#N', },
  },
},

['曼佗罗山庄水池'] = {
  id = '曼佗罗山庄水池',
  area = '曼佗罗山庄',
  name = '水池',
  desc =  [[这是一大水池。一阵微风吹过，水中菏叶随风在水面上漂浮, 水面(mian)碧波涌起，妙不可言。水池中央有一座假山，其中的石洞是很多的，使人忍不住想探个究竟。]],
  exit = {
    w = { to = '曼佗罗山庄小径#1E', },
    hidden = { to = '曼佗罗山庄假山', cmd = 'jump shuichi', cond = 'player.dex >= 17', },
  },
},

['曼佗罗山庄假山'] = {
  id = '曼佗罗山庄假山',
  area = '曼佗罗山庄',
  name = '假山',
  desc =  [[这是一假山。假山上洞穴很多，一阵微风吹过，洞穴发出“飕飕”的响声，令人有些毛骨悚然。旁边有一块岩石(shi)。]],
  exit = {
    hidden = { to = '曼佗罗山庄水池', cmd = 'jump shuichi', },
    d = { to = '曼佗罗山庄小山洞', unstable = true, door = 'break shi', cond = 'player.neili >= 200', },
  },
},

['曼佗罗山庄小山洞'] = {
  id = '曼佗罗山庄小山洞',
  area = '曼佗罗山庄',
  name = '小山洞',
  desc =  [[这里是假山里的地下密室。密室虽小，却也五脏俱全，石桌石椅，石几石床，连室内放的几件器皿，也都是石制的。看来似乎很久以前有人在这里住过。墙壁(wall)上好象刻着些什么。]],
  exit = {
    u = { to = '曼佗罗山庄假山', unstable = true, door = 'break wall', cond = 'player.neili >= 200', },
  },
},

['曼佗罗山庄长廊#2W'] = {
  id = '曼佗罗山庄长廊#2W',
  area = '曼佗罗山庄',
  name = '长廊',
  desc =  [[这是一条长廊，上面画着江南秀美的工笔画。绿色的柱子朱红色的琉璃瓦，使得你不由得对江南艺术工匠的创造惊叹不已。在长廊里面，丫鬟、家丁们走来走去，都忙着自己的事情，不敢有一点怠慢。东面是长廊的延伸。搁着长廊你可以看到北面的小石桥。]],
  exit = {
    w = { to = '曼佗罗山庄长廊#1W', },
    e = { to = '曼佗罗山庄长廊#3W', },
  },
},

['曼佗罗山庄长廊#1E'] = {
  id = '曼佗罗山庄长廊#1E',
  area = '曼佗罗山庄',
  name = '长廊',
  desc =  [[这是一条长廊，上面画着江南秀美的工笔画。绿色的柱子朱红色的琉璃瓦，使得你不由得对江南艺术工匠的创造惊叹不已。在长廊里面，丫鬟、家丁们走来走去，都忙着自己的事情，不敢有一点怠慢。北面是一条小径，南面和东面是长廊的延伸。]],
  exit = {
    e = { to = '曼佗罗山庄长廊#2E', },
    s = { to = '曼佗罗山庄长廊#3E', },
    n = { to = '曼佗罗山庄小径#1E', },
  },
},

['曼佗罗山庄长廊#7W'] = {
  id = '曼佗罗山庄长廊#7W',
  area = '曼佗罗山庄',
  name = '长廊',
  desc =  [[这是一条长廊，上面画着江南秀美的工笔画。绿色的柱子朱红色的琉璃瓦，使得你不由得对江南艺术工匠的创造惊叹不已。在长廊里面，丫鬟、家丁们走来走去，都忙着自己的事情，东面是花肥房，北面是长廊的延伸。]],
  exit = {
    e = { to = '曼佗罗山庄花肥房', },
    n = { to = '曼佗罗山庄长廊#6W', },
  },
},

['曼佗罗山庄藏书阁'] = {
  id = '曼佗罗山庄藏书阁',
  area = '曼佗罗山庄',
  name = '藏书阁',
  desc =  [[这里是曼陀罗山庄的藏书阁, 天下武功皆荟粹与此, 包罗万象，可与“燕子坞”的藏书相辟敌。 屋子四周全是一排排高大的书架。]],
  exit = {
    d = { to = '曼佗罗山庄云锦楼', },
  },
},

['曼佗罗山庄小径#1N'] = {
  id = '曼佗罗山庄小径#1N',
  area = '曼佗罗山庄',
  name = '小径',
  desc =  [[一条曲曲折折用鹅卵石铺成的小径, 路两旁绿柳成阴, 一处处山石花木点缀在其中。你走在石地上，啪嗒啪嗒的发出清脆的响声，往北面看去是一片柳树林，南面是后院，北面是一条小径。]],
  exit = {
    s = { to = '曼佗罗山庄后院', },
    n = { to = '曼佗罗山庄小径#2N', },
  },
},

['曼佗罗山庄小径#1E'] = {
  id = '曼佗罗山庄小径#1E',
  area = '曼佗罗山庄',
  name = '小径',
  desc =  [[一条曲曲折折用鹅卵石铺成的小径, 路两旁绿柳成阴, 一处处山石花木点缀在其中。你走在石地上，啪嗒啪嗒的发出清脆的响声，往北面看去是一片柳树林，东面是一座小水池，南面是一条长廊。]],
  exit = {
    e = { to = '曼佗罗山庄水池', },
    s = { to = '曼佗罗山庄长廊#1E', },
    w = { to = '曼佗罗山庄小径#2N', },
    n = { to = '曼佗罗山庄柳树林#E', },
  },
},

['曼佗罗山庄长廊#5W'] = {
  id = '曼佗罗山庄长廊#5W',
  area = '曼佗罗山庄',
  name = '长廊',
  desc =  [[这是一条长廊，上面画着江南秀美的工笔画。绿色的柱子朱红色的琉璃瓦，使得你不由得对江南艺术工匠的创造惊叹不已。在长廊里面，丫鬟、家丁们走来走去，都忙着自己的事情，南面是长廊的延伸。]],
  exit = {
    e = { to = '曼佗罗山庄长廊#4W', },
    s = { to = '曼佗罗山庄长廊#6W', },
  },
},

['曼佗罗山庄柳树林#W'] = {
  id = '曼佗罗山庄柳树林#W',
  area = '曼佗罗山庄',
  name = '柳树林',
  desc =  [[这是一片碧绿的柳树林，一片碧绿的颜色，柳树看上去枝叶茂盛，树上几只小鸟唧唧喳喳的叫个不停，柳条随着微风轻轻摆动。]],
  exit = {
    e = { to = '曼佗罗山庄柳树林#S', },
    s = { to = '曼佗罗山庄小径#1W', },
  },
},

['曼佗罗山庄柳树林#E'] = {
  id = '曼佗罗山庄柳树林#E',
  area = '曼佗罗山庄',
  name = '柳树林',
  desc =  [[这是一片碧绿的柳树林，一片碧绿的颜色，柳树看上去枝叶茂盛，树上几只小鸟唧唧喳喳的叫个不停，柳条随着微风轻轻摆动。]],
  exit = {
    w = { to = '曼佗罗山庄柳树林#S', },
    s = { to = '曼佗罗山庄小径#1E', },
  },
},

['曼佗罗山庄长廊#3W'] = {
  id = '曼佗罗山庄长廊#3W',
  area = '曼佗罗山庄',
  name = '长廊',
  desc =  [[这是一条长廊，上面画着江南秀美的工笔画。绿色的柱子朱红色的琉璃瓦，使得你不由得对江南艺术工匠的创造惊叹不已。在长廊里面，丫鬟、家丁们走来走去，都忙着自己的事情，不敢有一点怠慢。北面是一条小径，南面是长廊的延伸。]],
  exit = {
    s = { to = '曼佗罗山庄长廊#4W', },
    w = { to = '曼佗罗山庄长廊#2W', },
    n = { to = '曼佗罗山庄小径#1W', },
  },
},

['曼佗罗山庄长廊#6W'] = {
  id = '曼佗罗山庄长廊#6W',
  area = '曼佗罗山庄',
  name = '长廊',
  desc =  [[这是一条长廊，上面画着江南秀美的工笔画。绿色的柱子朱红色的琉璃瓦，使得你不由得对江南艺术工匠的创造惊叹不已。在长廊里面，丫鬟、家丁们走来走去，都忙着自己的事情，东面是一间厢房，南面是长廊的延伸。]],
  exit = {
    e = { to = '曼佗罗山庄厢房', },
    s = { to = '曼佗罗山庄长廊#7W', },
    n = { to = '曼佗罗山庄长廊#5W', },
  },
},

['曼佗罗山庄客厅'] = {
  id = '曼佗罗山庄客厅',
  area = '曼佗罗山庄',
  name = '客厅',
  desc =  [[你走进这间小小的厅室, 看到里面放着一张紫檀木茶几和几张湘妃竹椅子，紫檀木的茶几上摆放着茶壶和几只白玉杯，专供客人饮用。你忍不住想坐在竹椅上，让疲惫的身心得到充分的休息。]],
  exit = {
    e = { to = '曼佗罗山庄长廊#5E', },
    w = { to = '曼佗罗山庄云锦楼', },
    n = { to = '曼佗罗山庄长廊#3E', },
  },
},

['曼佗罗山庄庄门'] = {
  id = '曼佗罗山庄庄门',
  area = '曼佗罗山庄',
  name = '庄门',
  desc =  [[你转过一丛茂密的花丛, 猛然间, 只见一座红檐绿瓦, 小巧玲珑的庄院矗利在灿澜的花丛中。庄门大匾上赫然写着「曼陀罗山庄」五个金光闪闪的大字。]],
  exit = {
    e = { to = '曼佗罗山庄前院', },
    s = { to = '曼佗罗山庄小径#1S', },
    w = { to = '曼佗罗山庄花丛中#1S', },
    n = { to = '曼佗罗山庄花丛中#1E', },
  },
},

['曼佗罗山庄长廊#1W'] = {
  id = '曼佗罗山庄长廊#1W',
  area = '曼佗罗山庄',
  name = '长廊',
  desc =  [[这是一条长廊，上面画着江南秀美的工笔画。绿色的柱子朱红色的琉璃瓦，使得你不由得对江南艺术工匠的创造惊叹不已。在长廊里面，丫鬟、家丁们走来走去，都忙着自己的事情，不敢有一点怠慢。东面是长廊的延伸。]],
  exit = {
    e = { to = '曼佗罗山庄长廊#2W', },
    n = { to = '曼佗罗山庄前院', },
  },
},

['曼佗罗山庄花丛中#1E'] = {
  id = '曼佗罗山庄花丛中#1E',
  area = '曼佗罗山庄',
  name = '花丛中',
  desc =  [[你信步观赏, 只见花林中除山茶花外更无别样花卉, 连最常见的牵牛花，月月红, 蔷薇之类也是一朵都无。走出数十丈后, 只见山茶品种渐多, 偶而也有一两本还算不错, 却也栽种不得其法。南面就是庄门了。]],
  exit = {
    e = { to = '曼佗罗山庄花丛中#2E', },
    w = { to = '曼佗罗山庄岸边#1', },
    s = { to = '曼佗罗山庄庄门', },
  },
},

['曼佗罗山庄杂货室'] = {
  id = '曼佗罗山庄杂货室',
  area = '曼佗罗山庄',
  name = '杂货室',
  desc =  [[这里是曼佗罗山庄的杂货室，里面摆满了各种不用的旧物品，在杂货室的一角摆放着一个兵器架。]],
  exit = {
    w = { to = '曼佗罗山庄后花园', },
    e = { to = '曼佗罗山庄长廊#6E', },
  },
},

['曼佗罗山庄云锦楼'] = {
  id = '曼佗罗山庄云锦楼',
  area = '曼佗罗山庄',
  name = '云锦楼',
  desc =  [[云锦楼陈设富丽，一副中堂绘的是孔雀开屏图，两边柱子上写了一幅对联(duilian)。东面是一间客厅，西面是厢房，往北面走是后院，南面是后花园。]],
  exit = {
    s = { to = '曼佗罗山庄后花园', },
    e = { to = '曼佗罗山庄客厅', },
    u = { to = '曼佗罗山庄藏书阁', },
    w = { to = '曼佗罗山庄厢房', },
    n = { to = '曼佗罗山庄后院', },
  },
},

['曼佗罗山庄岸边#1'] = {
  id = '曼佗罗山庄岸边#1',
  area = '曼佗罗山庄',
  name = '岸边',
  desc =  [[从小舟下来，你踏上了小岛的岸边，只见三面全是花的世界。落第秀才，十八学士，十三太保，八仙过海，风尘三侠等数种名贵的茶花萦绕在你的周围，你已经身陷花丛中，如果不仔细的辨别方向，很难能够走出去。]],
  exit = {
    e = { to = '曼佗罗山庄花丛中#1E', },
    w = { to = '曼佗罗山庄花丛中#1W', },
    s = { to = '曼佗罗山庄花丛中#1S', },
  },
},

['曼佗罗山庄小石桥'] = {
  id = '曼佗罗山庄小石桥',
  area = '曼佗罗山庄',
  name = '小石桥',
  desc =  [[这是一座小小的白石拱桥。桥下碧绿的湖水正荡着微波。石桥的东面是一条鹅卵石铺成的小径，西面是曼佗罗山庄的前院。]],
  exit = {
    hidden = { to = '姑苏慕容地道#1', cmd = 'zuan didao', cond = 'player.party == "姑苏慕容"', },
    w = { to = '曼佗罗山庄前院', },
    e = { to = '曼佗罗山庄小径#1W', },
  },
},

['曼佗罗山庄后花园'] = {
  id = '曼佗罗山庄后花园',
  area = '曼佗罗山庄',
  name = '后花园',
  desc =  [[后花园和庄中其它地方一样种满了山茶花, 参杂在假山巨石, 绿竹小溪中,此所谓：“千呼万唤始出来，犹报琵琶半遮面”更增姿媚。抬头望去，只见藏书阁的窗户半开着，一根古藤蜒伸在墙上。一股清泉从假山上涌出，尝一口沁人心脾。]],
  exit = {
    e = { to = '曼佗罗山庄杂货室', },
    w = { to = '曼佗罗山庄花肥房', },
    n = { to = '曼佗罗山庄云锦楼', },
    hidden1 = { to = '曼佗罗山庄树藤', cmd = 'pa teng', },
    hidden2 = { to = '曼佗罗山庄秘道', cmd = 'say 漆叶云差密, 茶花雪忌艳', cond = 'player.party == "姑苏慕容"', },
  },
},

['曼佗罗山庄岸边#2'] = {
  id = '曼佗罗山庄岸边#2',
  area = '曼佗罗山庄',
  name = '岸边',
  desc =  [[这是曼佗罗山庄的一个小码头，从这里上船可以到达慕容世家的领地，武林中的英雄豪杰们都十分仰慕闻名天下的燕子坞，因为那里是无人不知无人不晓的“以彼之道，还施彼身”的发源地，而慕容世家一代就是住在那里。岸边有一位老船夫，专门载着去燕子坞的武林人士，他一见你走过来，不敢怠慢，带着笑脸连忙迎上前去。在岸边有一块牌子(paizi)。]],
  exit = {
    n = { to = '曼佗罗山庄小径#2S', },
    hidden1 = { to = '姑苏慕容小舟#MTL-XZ', cmd = 'qu xiaozhu', no_wander = true, handler = 'mr_embark', },
    hidden2 = { to = '姑苏慕容小舟#MTL-YZW', cmd = 'qu yanziwu', no_wander = true, handler = 'mr_embark', },
  },
},

['曼佗罗山庄花丛中#1W'] = {
  id = '曼佗罗山庄花丛中#1W',
  area = '曼佗罗山庄',
  name = '花丛中',
  desc =  [[你信步观赏, 只见花林中除山茶花外更无别样花卉, 连最常见的牵牛花，月月红, 蔷薇之类也是一朵都无。走出数十丈后, 只见山茶品种渐多, 偶而也有一两本还算不错, 却也栽种不得其法。]],
  exit = {
    e = { to = '曼佗罗山庄岸边#1', },
    s = { to = '曼佗罗山庄花丛中#2W', },
  },
},

['灵蛇岛岸边'] = {
  id = '灵蛇岛岸边',
  area = '灵蛇岛',
  name = '岸边',
  desc = [[只见岸边数里之外树木葱翠，奇峰挺拔，耸立着好几座高山。岛东端山石直降人入海，并无浅滩，帆船吃水较深，却可以泊在岸边。这时你看见不远的有一块颇为平整的岩石，上面被人用利器刻着“灵蛇岛”三个大字，其侧还有几个看不太清的小字(zi)。往东而上是一个很高的山岗，再上面是一座山峰。海滩上有几只海船，看来可以推(tui)下海去。]],
  exit = {
    eu = { to = '灵蛇岛山岗', },
  },
},

['灵蛇岛山岗'] = {
  id = '灵蛇岛山岗',
  area = '灵蛇岛',
  name = '山岗',
  desc = [[只见山岗上稀稀落落长着一些花草和风棵不知名的树木，树木不高，但却长得葱翠，山岗的另一侧是一座小石山。往西而下是岸边，往东而下是山峰脚下。往北而下是灵蛇谷。]],
  exit = {
    wd = { to = '灵蛇岛岸边', },
    nd = { to = '灵蛇岛灵蛇谷', },
  },
},

['灵蛇岛灵蛇谷'] = {
  id = '灵蛇岛灵蛇谷',
  area = '灵蛇岛',
  name = '灵蛇谷',
  desc = [[这里是岛里的一个山谷。山谷长着许多奇花异草，到处花香鸟语，分外美丽，这里远离凡尘，你到了此处不禁疑为仙境。此岛虽然到处有毒蛇出没但唯有此处不见毒物之踪影，也许此间主人长在此间修行之果。]],
  exit = {
    su = { to = '灵蛇岛山岗', },
    n = { to = '灵蛇岛山峰脚下', },
  },
},

['灵蛇岛山峰脚下'] = {
  id = '灵蛇岛山峰脚下',
  area = '灵蛇岛',
  name = '山峰脚下',
  desc = [[这里四周长着许多长草，此岛名为“灵蛇岛”，岛上定然长虫特多，不时会有毒虫窜出。在这里你只能尽往光秃的山石处落脚。往南而上是山峰顶部，依稀可见一座茅屋座落其中。]],
  exit = {
    nu = { to = '灵蛇岛山峰', },
    s = { to = '灵蛇岛灵蛇谷', },
  },
},

['灵蛇岛山峰'] = {
  id = '灵蛇岛山峰',
  area = '灵蛇岛',
  name = '山峰',
  desc = [[沿着山坡而行，向北而上是一座山峰，山峰座落在灵蛇岛的北部，在山峰之东，可以看见一间孤零零的茅屋。]],
  exit = {
    sd = { to = '灵蛇岛山峰脚下', },
  },
},

['大海船'] = {
  id = '大海船',
  area = '',
  name = '大海船',
  desc =  [[这是一条大帆船，白帆挂在十余丈高的双桅上，行驶速度颇快。但帆船虽大，在惊涛骇浪中也会成了无主游魂，只是随风飘荡，所以你必须有一身高深的武功和高明的航海本领，才可在大海中行驶。从大海船的窗口向外张望(lookout)，可以观赏到海面上的风景。船舱中有本航海须知(sign)。]],
  exit = {
    hidden = { to = '灵蛇岛岸边', cost = 200, handler = 'sail', },
 },
},

['海船'] = {
  id = '海船',
  area = '',
  name = '海船',
  desc = [[这是一条海船，行驶速度颇快。从海船的窗口向外张望(lookout)，可以观赏到海面上的风景。船舱中有本航海须知(sign)。]],
  exit = {
  },
},

['中原材料行'] = {
  id = '中原材料行',
  area = '中原',
  name = '材料行',
  desc =  [[这是家生意兴隆的材料行，附近的人都到这里来买建造房屋的材料。这儿还经常有帮会人物出没，进进出出的不停的搬货。听说这儿的掌柜很很多帮会的老大关系都不错，帮会在这里买东西都不需要付现钱，记帐就可以了。]],
  exit = {
    s = { to = '成都城东大街#1', },
  },
},

['中原神州鬼门关'] = {
  id = '中原神州鬼门关',
  area = '中原神州',
  name = '鬼门关',
  desc =  [[这里就是著名的阴间入口【鬼门关】，在你面前矗立著一座高大的黑色城楼，城楼的门口有许多亡魂正哭哭啼啼地列队前进，一进鬼门关就无法再回阳间了。]],
  exit = {
    enter = { to = '中原神州阎罗大殿', },
  },
},

['中原神州阎罗大殿'] = {
  id = '中原神州阎罗大殿',
  area = '中原神州',
  name = '阎罗大殿',
  desc =  [[你现在来到一座阴森的大殿前，新来的鬼魂们都必须在此接受阎王的审判，为自己身前的所作所为赎罪。浓浓的雾环绕在你的四周，好像永远都不会散去似的。殿上点有几盏鬼灯，隐约能照见十殿冥王的身影。]],
  exit = {
    out = { to = '中原神州鬼门关', },
  },
},

['中原神州孟婆亭'] = {
  id = '中原神州孟婆亭',
  area = '中原神州',
  name = '孟婆亭',
  desc =  [[传说，在黄泉路上，过了奈何桥，有座凉亭，唤作“孟婆亭”。由一个面貌阴森的老妇“孟婆”掌管，凡是赶往投胎、在此过路的地狱阴魂都要喝她的“孟婆汤”。喝完以后，将忘却所有的恩怨。。。]],
  exit = {
    out = { to = '中原神州鬼门关', },
  },
},

['中原神州地藏王菩萨殿'] = {
  id = '中原神州地藏王菩萨殿',
  area = '中原神州',
  name = '地藏王菩萨殿',
  desc =  [[你现在来到一座阴森的大殿前，新来的鬼魂们都必须在此接受阎王恍惚间，你来到一座雄伟的大殿前，此处光线缓和，将那些鬼哭狼嚎之声都挡拒在外。殿内正中坐有一尊菩萨，面带宝象，头顶紫冠，是地藏王菩萨。]],
  exit = {
    out = { to = '中原神州鬼门关', },
  },
},

['中原神州大驿道#2'] = {
  id = '中原神州大驿道#2',
  area = '中原神州',
  name = '大驿道',
  desc =  [[你走在一条尘土飞扬的大驿道上。四周人来人往。挑担子的行商，赶着大车的马夫，上京赶考的书生，熙熙攘攘，非常热闹。不时还有两三骑快马从身边飞驰而过，扬起一路尘埃。道路两旁是整整齐齐的杨树林。]],
  exit = {
    w = { to = '泰山大驿道#1', },
    n = { to = '泰山岱宗坊', },
  },
},

}

return map
